{"date": "2021-11-29 16:27:04+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds detail</p><p class=\"tr-by\">By Iain Withers and Huw Jones</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, Nov 29 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Britain is open to legislating to stop an explosion in scam adverts online being a significant source of fraud, financial services minister John Glen has told lawmakers.</p><p>Victims' groups and campaigners have called for fraudulent adverts to be incorporated in the government's planned Online Safety Bill, which currently only covers user-generated content.</p><p>\"We are very sympathetic to that,\" Glen told the Treasury Select Committee. \"This is a massive problem. This is a significant opportunity in the absence of a better solution.\"</p><p>A British record of 754 million pounds ($1 billion) was stolen in the first six months of this year, up 30% from the same period in 2020, according to data from banking industry body UK Finance, and up more than 60% from 2017, when it began compiling the figures.</p><p>Several government departments are involved in trying to stop online scams, raising concerns among committee members that solutions are too slow to emerge.</p><p>\"You're being very good at describing how difficult it all is, but what are you actually going to be doing about it?\" said lawmaker Angela Eagle.</p><p>Glen said the finance ministry was liaising with the digital, culture, media and sport ministry (DCMS) - which is also looking at the problem of online scams - to try and find the best solution.</p><p>The Treasury committee has previously told representatives from Facebook <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a>, Google <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a>, Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and eBay <a href=\"reuters://REALTIME/Verb=FullQuote/ric=EBAY.O\" data-type=\"ric\" data-ric=\"EBAY.O\" translate=\"no\" dir=\"ltr\">EBAY.O</a> they needed to do more to combat fraud. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2QU29V\" data-type=\"storyId\" data-story-id=\"nL8N2QU29V\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Cybersecurity experts and banks have said Britain has become a global target for fraud attacks due to relatively light policing of fraud-related crime, a super-fast payments infrastructure and use of the world's most widely used language English. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2QU29V\" data-type=\"storyId\" data-story-id=\"nL8N2QU29V\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>\"This is an absolute priority. I am not satisfied where we are on this,\" Glen said, adding that prevention needs to be a big part of the response.</p><p>\"The challenge is how can we make effective intervention that is really going to bear down on this,\" Glen said.   </p><p><br/></p><p>($1 = 0.7513 pounds)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Iain Withers and Huw Jones, editing by David Evans)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Iain.Withers@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Iain.Withers@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: BRITAIN-FINANCE/FRAUD (UPDATE 1, PIX)</p></div>"}