{"date": "2022-02-01 15:47:06.331000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>RUMBLEON INC (\"RMBL-Q\")\n- Appoints Senior Finance Executive, Narinder Sahai, as Chief\n- Financial Officer\n\n   RumbleOn Inc., the nation's largest retailer of powersports vehicles and\nfirst omnichannel customer experience in powersports, today announced that\nNarinder Sahai has been appointed as the company's Chief Financial Officer.\nMr. Sahai will serve as a member of the executive leadership team and\nreport directly to RumbleOn's Chief Executive Officer, Marshall Chesrown,\nbeginning February 1, 2022.\n\n   Mr. Sahai is an accomplished finance and strategy executive bringing\nleadership experience from innovative hyper-growth and multi-billion-dollar\ncompanies. He has an impressive track record of success building and\nleading the finance teams at some of the largest organizations in the US.\nIn his role as CFO at RumbleOn, Mr. Sahai will be responsible for leading\nRumbleOn's financial strategy, accounting, tax, treasury, planning &amp;\nanalysis, investor relations, and finance operations.\n\n   \"We are excited to welcome Narinder to RumbleOn. His background leading\nstrong finance functions for some of the country's most prominent,\ndisruptive and industry leading companies makes him the right choice to\nlead our finance operations. Narinder has a track record of operational\nrigor and we believe he will add tremendous value as we continue to execute\non our ambitious growth strategy. I further want to thank Beverley Rath for\nstepping up in a time of need after the unfortunate loss of Steve Berrard,\"\ncommented Mr. Chesrown.\n\n   Mr. Sahai comes to RumbleOn with more than 18 years of financial\nleadership experience at companies such as Amazon Web Services (AWS),\nTarget Hospitality, and TechnipFMC. Most recently, Mr. Sahai headed\nWorldwide Go-To-Market Finance for Compute and AI/ML at AWS. Previously,\nMr. Sahai was Senior Vice President, Treasurer and Investor Relations at\nTarget Hospitality Corporation. Before joining Target Hospitality, Mr.\nSahai held key global and regional financial leadership positions based in\nthe Americas and Asia Pacific at TechnipFMC plc, FMC Technologies, Inc.,\nand Delphi Corporation. Mr. Sahai holds an MBA from the Ross School of\nBusiness at the University of Michigan in Ann Arbor, Michigan, and a\nBachelor's degree in Engineering from Thapar University in Patiala, India.\nMr. Sahai is also a CFA charterholder.\n\n   Mr. Sahai commented, \"Through its technology-led omnichannel strategy,\nRumbleOn continues to build an exceptional powersports experience on behalf\nof our customers. The opportunity to work alongside Marshall and the team,\nemploying their unparalleled experience and history of excellence, is\nincredibly exciting. I look forward to contributing towards RumbleOn's\nfuture growth and delivering long-term value for all of our stakeholders.\"\n\n   RumbleOn's Interim CFO, Beverley Rath, will continue serving as\nCorporate Controller and will continue in her role as certifying officer\nthrough the filing of RumbleOn's Form 10-K for the year ended Dec. 31,\n2021.\n\n   About RumbleOn\n\n   RumbleOn (NASDAQ: RMBL) is the nation's largest retailer of powersports\nvehicles and first omnichannel customer experience in powersports. Whether\nbuying, selling, trading or financing a new or used vehicle, RumbleOn\nenables dealers and consumers to transact without geographic boundaries in\na transparent, fast and friction free experience. The Company uses\ninnovative technology to aggregate and distribute pre-owned vehicles and is\ndisrupting the pre-owned vehicle supply chain by providing dealers with\ntechnology solutions such as virtual inventory, and a 24/7 distribution\nplatform. RumbleOn offers customers a truly unique experience, wherever\nthey want to shop, online or in-store. For more information, please visit\n<a href=\"http://www.rumbleon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.rumbleon.com</a>.\n   Cautionary Note on Forward-Looking Statements\n\n   This press release may contain \"forward-looking statements\" as that term\nis defined under the Private Securities Litigation Reform Act of 1995\n(PSLRA), which statements may be identified by words such as \"expects,\"\n\"projects,\" \"will,\" \"may,\" \"anticipates,\" \"believes,\" \"should,\" \"intends,\"\n\"estimates,\" and other words of similar meaning. Readers are cautioned not\nto place undue reliance on these forward-looking statements, which are\nbased on our expectations as of the date of this press release and speak\nonly as of the date of this press release and are advised to consider the\nfactors listed under the heading \"Forward-Looking Statements\" and \"Risk\nFactors\" in the Company's SEC filings, as may be updated and amended from\ntime to time. We undertake no obligation to publicly update or revise any\nforward-looking statements, whether as a result of new information, future\nevents or otherwise, except as required by law.\n\nWill Newell\ninvestors@rumbleon.com\n\nTel   : 214-771-9952    RUMBLEON INC\nEmail : investors@rumbleon.com\nWWW   : <a href=\"https://www.rumbleon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.rumbleon.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203100255.MNPRE2203102015-07071720220201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}