{"date": "2021-02-26 11:36:00.095000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3506.0, "close": 3395.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ENPNEWSWIRE-(C)2021 ENPUBLISHING</p><p>Release date- 25022021 - ESG is Highlighted as Important Focus Area for Industrial Software Leader.</p></div><div class=\"tr-npp-body\"><p>AVEVA, a global leader in engineering and industrial software, has announced three key senior hires to lead employee experience, Corporate Social Responsibility (CSR), Diversity, Inclusion and Wellbeing (DI&amp;W) and Sustainability. These roles will help accelerate AVEVA's heightened focus to further its values of integrity, collaboration, innovation, and sustainable business outcomes throughout the organization.</p><p>New Chief People Officer's Remit is Extended Beyond Human Resources</p><p>Tasked with leading AVEVA's group-wide CSR initiative, Action for Good, along with driving its people strategy and improving the global employee experience, Caoimhe Keogan joined AVEVA in January 2021 as Chief People Officer (CPO). Prior to AVEVA, Caoimhe held senior roles at Moneysupermarket Group PLC, SoundCloud and Google. She will report directly to AVEVA's CEO, Craig Hayman, and joins AVEVA's Executive Leadership Team (ELT).</p><p>'I am delighted to be joining a leading UK technology organization with ambitious growth plans and a strong focus on social responsibility. These key hires demonstrate that AVEVA is investing in both sustainability and inclusion, in addition to our established Action for Good program, where we aim to have a positive impact on the communities, we operate in. Like many organizations we still have much work to do and so I am delighted to be part of the team driving change for the better,' commented Caoimhe Keogan.</p><p>Fostering a Culture of Inclusivity</p><p>With a determined focus to develop an inclusive culture for all its employees, AVEVA recently hired Lena Milosevic MBE, as Global Director Diversity, Inclusion and Wellbeing. Lena has led diversity and inclusion throughout her career - for local government in the UK, through activism, to her career with the British Council. She was awarded the MBE in 2017 for services to cultural relations.</p><p>'This is a really exciting time to be heading up DI&amp;W at AVEVA because the support, from all levels of the company for accelerating positive change, is so strong. I am thrilled to be working with hugely committed and talented colleagues across the globe to drive forward a coherent and constant program of interventions that are already beginning to make a difference,' commented Lena Milosevic MBE.</p><p>Stepping Up to Build a Sustainable Future</p><p>Following the appointment of Lisa Johnston as Chief Sustainability Officer last year, Lisa Wee, joined AVEVA in August 2020 as Director of Sustainability, leading the development and coordination of the company's ESG strategy. Lisa has been working to advance corporate impact on sustainable development for her entire professional career, including through multiple roles at Chevron and more recently having built up a sustainability program at Under Armour. She has a successful track record across all major areas of sustainability, including strategy, program design, partnership development, employee engagement and ESG reporting. She is passionate about building relationships across cultures and with a wide range of stakeholders to help solve sustainability challenges.</p><p>'I am very impressed that AVEVA's software already does a great deal to support sustainability, reducing emissions, boosting circularity, and supporting increased transparency and traceability across supply chains. The foundations are in place to accelerate AVEVA's sustainability journey and leadership in this important area,' commented Lisa Wee.</p><p>Delivering AVEVA's Environmental, Social and Governance (ESG) Goals</p><p>Research proves that companies are more likely to succeed and deliver strong returns if they create value for all their stakeholders - employees, customers, suppliers, and the wider society including the environment -not just the leadership teams. Consequently, ESG focuses on how companies serve society and how this impacts on current and future performance. Consideration of future trends is also critically important and should inherently include disruptive change that can have significant implications for a company's future profitability or its very existence.</p><p>'From addressing climate change to ensuring strong labor practices, talent management, product safety and data security, AVEVA fully recognizes the significance of the ESG aspects of business performance, including their impact on long-term, sustainable value creation,' commented Craig Hayman, CEO AVEVA. 'We continue to aspire to a world where economic growth supports environmental sustainability, with better living standards for the communities in which we and our customers operate. This mindset is shared by our team, and these key hires demonstrate that AVEVA is committed to supporting industrial transformation, through a culture that promotes diversity and inclusion in the workplace,' Hayman, concluded.</p><p>About AVEVA</p><p>AVEVA is a global leader in engineering and industrial software driving digital transformation across the entire asset and operations life cycle of capital-intensive industries. The company's engineering, planning and operations, asset performance, and monitoring and control solutions deliver proven results to over 16,000 customers across the globe. Its customers are supported by the largest industrial software ecosystem, including 4,200 partners and 5,700 certified developers. AVEVA is headquartered in Cambridge, UK, with over 4,400 employees at 80 locations in over 40 countries. For more details visit: www.aveva.com</p><p>Copyright 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and products names are the trademarks of their respective companies.</p><p>Enquiries:</p><p>AVEVA Media Contacts</p><p>Rose Bambi</p><p>Senior Director Global PR and External Communications</p><p>Tel: +44 (0) 208 323 2789</p><p>rose.bambi@aveva.com</p><p>Caroline Stephens</p><p>Senior Global PR Manager</p><p>caroline.stephens@aveva.com</p><p>Catherine Singh</p><p>Global PR Executive</p><p>catherine.singh@aveva.com</p><p>PR and External</p><p>Communications Team</p><p>external.communications@aveva.com</p><p>[Editorial queries for this story should be sent to newswire@enpublishing.co.uk]</p><p>((Comments on this story may be sent to info@enpublishing.co.uk))</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 M2 Communications Ltd.</p></div>"}