{"date": "2022-01-27 17:52:57.193000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Below, you'll find our top Amazon deals right now, including our favorite robot vacuum, a compact device tracker and some portable jump starter packs, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. If you're looking for N95 and KN95 masks this winter, Amazon also has plenty of choices on sale right now.</p><p>► <span>Awara mattress sale:</span> Save as much as $699 on one of our favorite mattresses right now.</p><p>► <span>Crowd Cow meat delivery:</span> Sign up now and get $100 off your first 10 boxes.</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p class=\"tr-npp-section-title\">The best Amazon deals of the day</p><p><big>1. 48% off: These KN95 face masks</big> </p><p>Stay protected this year with the SupplyAID KN95 disposable face masks on sale at Amazon today. Typically listed for $10.97, you can get a 5-pack of these triple-layer masks for $5.75, or 48% off. SupplyAID says the masks are best suited for daily travel protection, and provide a 95% filter efficiency to keep you safe from airborne particles.</p><p><span>Get the SupplyAid KN95 Disposable 3-Layer Face Masks for $5.75 (Save $5.22)</span> </p><p><big>2. Save $902: One of our favorite TVs</big> </p><p>If you watch your favorite shows and movies in a well-lit room, you need a TV with a screen that won't get outshone—like the Samsung QN90A. Right now, you can get a 75-inch model of the 4K Smart TV normally priced for $3,499.99 for $2,597.99, or 26% off. The QN90A is one of the best TVs we've ever tried for its quantum dot technology that makes for brighter, more color-rich pictures combined with mini-LED backlights for tight contrast control. Gamers will also appreciate the TV's 120Hz refresh rate and HDMI 2.1 support for the latest consoles.</p><p><span>Get the Samsung 75-Inch Class Neo QLED QN90A 4K UHD Quantum HDR Smart TV for $2,597.99 (Save $902)</span> </p><p><big>3. 20% off: This compact device tracker</big> </p><p>Keep an eye on your tiniest essentials with the help of the new Tile Sticker locator device. Typically listed for $29.99, this pocket-sized Bluetooth tracker is now $23.99 thanks to a 20% discount. While we haven't tested the Tile Sticker yet (we've tested and appreciated the original Tile!), Tile says the Sticker has a tracking range of up to 250 feet, letting you find your device on your Android, iOS and smart home device through the Tile app. If your device is out of the Sticker's tracking range, the Tile app will even show you the tracker's most recent location on a map.</p><p><span>Get the Tile Sticker for $23.99 (Save $6)</span> </p><p><big>4. Up to 36% off: These portable jump starters</big> </p><p>Keep extra power in your glove box with select Nexpow battery jump starter packs on sale at Amazon. The brand's 2000A Peak 18000mAh car jump starter, normally priced at $99.99, is only $63.98. Not only do you get the compact battery pack, which Nexpow says can jump start cars, trucks and snowmobiles, but it also comes with a storage case and a built-in LED torchlight. The sale includes the Nexpow 2500A 22000mAh car jump starter, typically listed for $109.99 but now on sale for $102.99. The brand says this battery pack is powerful enough to jump start most 12-volt vehicles, and has USB and USB-C ports to charge smartphones and tablets. </p><p><span>Save up to 36% on select Nexpow jump starters</span> </p><p><big>5. 30% off: Our favorite robot vacuum cleaner</big> </p><p>With a robot vacuum, you can keep your home in tip-top shape with minimal effort. The iRobot Roomba j7+ is the best robot vacuum we've ever tested, and right now, you can take home the self-emptying Roomba for just $599—$250.99 off the full $849.99 list price and the lowest price we've ever seen. We think this robot vacuum is iRobot's best Roomba yet, and found it to have excellent navigation and cleaning capabilities. In testing, the j7+ easily maneuvered around furniture and (yes) dog poop and picked up just as much dirt as a full-sized vacuum. </p><p><span>Get the iRobot Roomba j7+ for $599 (Save $250.99)</span> </p><p class=\"tr-npp-section-title\">The best Amazon deals from this week </p><p><big>1. HotHands Hand Warmer Value Pack</big> </p><p>Keep your palms toasty in the most frigid temperatures with these HotHand hand warmers, on sale today. Typically listed for $12.95, this 10-pack of warmers is more than half off for $5.79. HotHand says the warmers heat up within 30 minutes after shaking them out of their packaging, and are odorless and disposable. Whether you're outside shoveling snow or on a brisk morning run, these can keep heat flowing.</p><p><span>Get the HotHand Hand Warmers Value Pack for $5.79 (Save $7.16)</span> </p><p><big>2. Apple AirPods (2nd Generation)</big> </p><p>Apple's AirPods are one of the most popular headphones on the market, and if you want to give them a try for yourself, now's a great time. The second-generation AirPods are now available for $99.99—37% off their list price of $159. Apple says the buds get up to five hours of listening time on one charge, and the included charging case can add an additional 24 hours of battery life. Apple product users can also get quick access to the Siri smart assistant through the AirPods just by saying, \"Hey Siri.\"</p><p><span>Get the Apple AirPods (Second Generation) for $99.99 (Save $59.01)</span> </p><p><big>3. TurboTax Deluxe 2021 Tax Software PC Download</big> </p><p>Get a head start on tax season by grabbing a TurboTax Deluxe download card for PC. Normally priced at $59.99, the software kit is now selling for 33% off, or $39.99. TurboTax says the card lets you make five electronic filings of federal tax returns and one filing for state tax returns, and suggests that this particular package is best for homeowners who have made charitable donations and have high medical expenses. You can also import W-2s as well as investment and mortgage information from companies you're including in your filings.</p><p><span>Get the TurboTax Deluxe 2021 Tax Software Federal and State Tax Return PC Download for $39.99 (Save $20)</span> </p><p><big>4. Airthings Corentium Home Radon Detector</big> </p><p>It can be difficult to know when and how to check for radon in your home, but this Airthings Corentium home detector can help you stay safe. Typically listed for $199.95, this handheld gas monitor is on sale for $135.18, or 32% off. (Radon is a naturally-occurring and common radioactive gas that is can cause problems when its present in homes: According to the EPA, it's the second leading cause of lung cancer.) and Airthings says the detector can easily generate a radon self-inspection report whenever you need to check levels in your home. The display screen shows both long and short-term readings to give you even more information. </p><p><span>Get the Airthings Corentium Home Radon Detector for $135.18 (Save $64.77)</span> </p><p><big>5. LG OLED C1 Series Alexa Built-in 4K Smart TV</big> </p><p>We love the LG C1 OLED TV, and it's now available for its lowest price of the year. We loved the incredible contrast and picture quality this OLED panel delivers, the sheer number of features it offers (including Dolby Vision and a 120Hz refresh rate) and its eye-catching design. If you're looking to invest in the best possible home theater experience, the LG C1 starts for as low as $1,296 in its 55-inch size, a $203 discount from its usual price of $1,499.99. (It's slightly cheaper in its 43-inch size, though not on sale, at $1,096.99.)</p><p><span>Get the LG OLED C1 Series Alexa Built-in 4K Smart TV from $1,096.99 (Save $203 to $903)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 30% on Amazon Fire TV Omni Series</li><li>Etekcity Digital Body Weight Bathroom Scale from $16.88 (Save $3)</li><li>Colonel Popper Microwave Popcorn Maker for $17.49 (Save $7.51)</li><li>Hertzko Self-Cleaning Slicker Brush for Dogs and Cats from $17.99 (Save $12)</li><li>Amazon Fire TV Stick Lite for $18.99 (Save $11)</li><li>7am2m Sonic Electric Toothbrush from $20.99 (Save $1.35 to $9)</li><li>totes Women's Chelsea Ankle Rain Boots from $21.48 (Save $20.92 to $33.52)</li><li>Hotodeal KN95 Face Mask 20-Pack for $21.59 (Save $5.40)</li><li>Bodum Melior Gooseneck Electric Water Kettle from $26.99 (Save $8)</li><li>WWDOLL KN95 Face Mask, 25 Pack for $28.74 (Save $18.68)</li><li>Addtam USB Surge Protector Wall Charger Two-Pack for $31.49 with coupon (Save $3.50)</li><li>Olay Regenerist Retinol 24 Max Moisturizer for $32.94 (Save $20.05)</li><li>KopBeau Space Heater for $64.99 with coupon (Save $15)</li><li>Philips Norelco Shaver 9100 for $109.95 (Save $40)</li><li>Apple AirPods Pro for $179.99 (Save $69.01)</li><li>Beats Studio3 Wireless Noise Cancelling Over-Ear Headphones from $199.99 (Save $141.11 to $149.96)</li><li>eufy by Anker RoboVac G30 Robot Vacuum for $229.99 with coupon (Save $90)</li><li>Tempur-Pedic Queen Tempur Supreme Medium-Firm Mattress Topper for $239.40 (Save $159.60)</li><li>iRobot Roomba i3+ for $399 (Save $200.99)</li><li>Apple 2020 MacBook Air from $849.99 with coupon (Save $100 to $149.01)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}