{"date": "2022-01-27 20:01:34.447000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>Tom Clancy's Rainbow Six Extraction</span> </p><p><span>Available on:</span> PC, Xbox Series X and Series S, Xbox One, PlayStation 5, PlayStation 4, Google Stadia, Amazon Luna</p></div><div class=\"tr-npp-body\"><p><span>Developer:</span> Ubisoft Montreal | <span>Publisher:</span> Ubisoft</p><p><span>Release:</span> Jan. 20, 2022</p><p>When \"Rainbow Six Extraction\" was first revealed in 2021, the reaction of the Launcher team was skepticism and boredom — if even that. Mostly, it didn't register at all. A Tom Clancy player-versus-everything game in which teams fight black goo? Yawn. In that moment, watching the premiere E3 2021 trailer, I could not have possibly imagined that I would ever write the sentence that I am writing right now, telling you, the reader, that \"Extraction\" was not only undeserving of our scorn but is actually quite excellent.</p><p>\"Extraction\" suffers from the opposite issue of a game like \"Call of Duty: Vanguard.\" The latter title is gorgeous, but as with the idyllic setting of a postmodern horror film, the closer you look, the more apparent it is how dead, dull and evil everything is. \"Extraction,\" on the other hand, is visibly <span>ugly</span> . A vicious art critic could really sink their teeth into Ubisoft's house style, which, among other crimes, condemns virtually every interior space to the aesthetic sensibilities of an airport fast food outpost. And the alien threat you're set against ranges in design from normal goo man, tall goo man, big goo man, hunched over goo man, goo man on all fours, and a slew of similar configurations.</p><p>But — wipe away the goo — and there's an impressive, thoughtful game underneath.</p><p>In \"Extraction,\" teams ranging in size from one player to three are loosed upon one of four locations, each of which features three zones that are broken into even more sub zones. These sub zones, which are played three at a time, host a rotation of unique missions. In one sub zone, for example, a team may be tasked with taking a stealthy approach to obtain specimens from unwitting alien opponents. In others, players will escort VIPs to safety or defend zones around the map.</p><p>As players complete missions, they are rewarded with experience that goes toward a global leveling system, as well as points that are awarded to specific playable characters, called operators. These operators have unique abilities, and balancing their use can make or break a mission. (My recommendation, early on at least, is to always run a team with a healer.)</p><p>One mission type, in particular, helps explain how \"Extraction\" got its hooks in me. In every sub zone, players can make the choice to either risk continuing on to the next sub zone or cut their losses and get airlifted out of the mission. Sometimes, this gamble won't go your way: If you die on a run and your body isn't retrieved by your teammates, the character you're playing as goes Missing In Action, which sets up a unique rescue mission for your team you can opt to play on a subsequent run.</p><p>The extraction mechanic lends the game a layer of drama and, at times, humor. Back-seat sessions in which one player is tasked with rescuing his downed teammates — as the downed player watches from their savior's POV — become nail-biter spectacles. And, by contrast, those multiplayer sessions where one person gets a hefty bonus for successfully extracting — and the two other players don't — tell a story of cowardice and calculation. To be fair, once things really spiral out in \"Extraction,\" the game is punishing. Your options are either to play with exceptional caution or extract.</p><p>If all goes well, the character you played as last will return to your roster with however much health they had at the end of your previous mission, which encourages leveling multiple operators at once. And if your rescue mission is a success, the missing operator goes back to the stable for a brief rehabilitative period. Completing more missions will slowly return your operators' health — and succeeding in grander fashion on more difficult missions will boost their HP commensurately.</p><p>This cycle will make you want to play \"just one more!\" run — but it doesn't feel clumsy or exploitative because the underlying mechanics are fun and inventive, and the unexpected but simple synergies between different playable characters are a treat to witness. The team at Ubisoft Montreal has packed \"Extraction\" with fun quirks that give it remarkable depth and an identity that is wholly its own. A not insignificant segment of each round, for example, will feature players shooting the ground to clear away the black goo, or sprawl, that slows players down. That exercise is unique to \"Extraction,\" I would venture. It also lends the game a hint of tactical depth, and does so without drawing attention to itself.</p><p>There's no need for hyperbole. \"Extraction\" isn't an early game of the year contender. There's virtually no story, and the bare-bones cutscenes that <span>are</span> present aren't really worth taking seriously. I doubt I'll be playing it in a month. But I don't need \"Extraction\" to go on forever, and so, I'll be rooting for it. Like other recent titles in Ubisoft's catalogue, it sets up one core gameplay loop and executes compellingly on that vision. When the time comes, I'll call in the helicopter to airlift me out, and I'll be more than satisfied with my time spent in \"Extraction's\" ugly world.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 The Washington Post</p></div>"}