{"date": "2021-12-09 09:17:56+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>DUBAI, UAE/PRNewswire/ -- Beinex Consulting has won an Amazon Web Services 2021 Rising Star Consulting Partner of the Year – in the Middle East and North Africa. AWS Partner Awards recognise leaders playing a key role in helping customers drive innovation and build solutions on the AWS Cloud.</p>\n<p>The AWS Partner Awards recognise a wide range of Partners, whose business models have embraced specialisation and collaboration over the past year. The AWS Partner Awards also recognise AWS Partners whose business models continue to evolve and thrive on the AWS Cloud as they work with customers to conceive, build and migrate cloud-native solutions on AWS.</p>\n<p>Receiving the Award, Indumon Das, the Founder and Managing Director of Beinex, remarked, \"We leverage the capabilities of AWS and combine that with the Analytics Consulting power of Beinex to bring unmatched success to our customers. We look forward to the launch of the AWS data centers in the UAE in the first half of 2022. The launch will have a big impact on the growth and acceleration of cloud adoption in the Middle East and we are excited to support organizations to take advantage of what it has to offer.\"</p>\n<p>The AWS Partner Network (APN) is the global community of businesses using AWS to build solutions and services for customers. AWS helps partners build, market, and sell their offerings by providing valuable business, marketing, and technical support on top of our proven, global, and secure infrastructure. AWS partners are uniquely positioned to help customers take full advantage of all that AWS has to offer and accelerate their journey to the cloud. AWS has millions of active customers and a dynamic community of over 100,000 partners globally.  </p>\n<p>\"AWS Partners add value to customers across a wide range of industries around the world and are critical to their success. We are pleased to recognise a variety of partners through the APN Partner Awards EMEA 2021. I look forward to working together to a great 2022,\" said Antonio Alonzo Lopez, EMEA Director Partner Success at AWS. </p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}