{"date": "2022-01-19 13:50:03.574000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Jan. 19 -- With Republic Day around the corner, there are discounts all over the place. While stepping out of home to avail offline discounts may be a tall order during a pandemic, online platforms more than make up for the loss.</p><p>E-commerce platforms such as Amazon have discounts on a plethora of products ranging from electronic items, laptops, smartphones, FMCG products like household items to clothes and footwear. If you are in luck you can get discounts up to 70% percent on certain products.</p></div><div class=\"tr-npp-body\"><p>Footwear is an item that sees a lot of wear and tear. It is true that many of us who have opted for work from home, do not need to step out often and hence the need for footwear is relatively low. But that, by no means, implies that one doesn't need them at all.</p><p>Hence, picking footwear of one's choice when there are mega discounts on them is a good idea. If we have convinced you to give the idea a chance, then take a look at the discounts on sneakers for men on Amazon.</p><p>1) Neeman's Classic Sneakers for Men, Boys</p><p>This all-day and all-season flat sneakers is a great choice of a footwear. Made from organic cotton and recycled fabrics, it is lined with Merino wool. It comes with a rubber sole. The insole is made from recycled rubber, Castor bean seed oil and has fine quality Merino wool lining. It is available in six different colours. This has a lace-up style for closure.</p><p>2) Sparx Men's Sd0323g Sneakers</p><p>This show is made from synthetic fibre and has a medium show width. It has a flat heal, which makes it a convenient choice for everyday use. It comes with a rubber sole and is best suited as a casual wear. It is available in six different colours. This too has a lace-up style for closure.</p><p>3) Puma Men's Pace Slip on IDP Sneaker</p><p>This product from Puma is designed for sports but it can be a casual wear as well. This has a slip-on/pull-on style for closure. Its sole is made of rubber. This product comes with a warranty - product warranty against manufacturing defects: 90 days. This shoe is available in three different colours.</p><p>4) Kraasa Men's Running Shoe</p><p>This shoe is ideal for running. Made from Mesh material, it comes with a foam sole. It h a medium width shoe and its closure style is pull-on. The good bit about this show is that it is washable; wash it in lukewarm water.</p><p>At Hindustan Times, we help you stay up-to-date with latest trends and products. Hindustan Times has affiliate partnership, so we may get a part of the revenue when you make a purchase. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}