{"date": "2021-12-12 15:13:41.915000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3444.24, "close": 3381.83}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>As you can see from this drone video, the damage is truly immense.</p><p>This building was only about two years old, and it was a distribution hub</p></div><div class=\"tr-npp-body\"><p>for Amazon. The majority of the warehouse appears to be completely</p><p>destroyed. There`s a mountain of debris to sift through and investigators</p><p>are still sectioning off the area for their part.</p><p>ED O`KEEFE: We move next to Illinois where at least two people were killed after winds blew the roof off an Amazon warehouse in the town of Edwardsville about 25 miles east of St. Louis. Jenna Rae of our St. Louis station KMOV is there for us tonight. Jenna, good evening.</p><p>JENNA RAE: Ed, it is truly a devastation out here in the Amazon warehouse in Edwardsville, Illinois. Today, as you mentioned, a tornado came through here last night. You can see causing catastrophic damage to this warehouse behind me.</p><p>Six people are now confirmed dead following the devastating tornado.</p><p>Police are saying that they responded around 8:30 and they believe there were several dozens of employees inside the warehouse at the time the tornado came through.</p><p>Now, there were several of those workers who made it out in time, and they made it out safely and they were transported by bus to a nearby town. Officials say others may have left on their own. At least one person was airlifted and taken to a local hospital.</p><p>As you can see from this drone video, the damage is truly immense. This building was only about two years old, and it was a distribution hub for Amazon. The majority of the warehouse appears to be completely destroyed. There`s a mountain of debris to sift through and investigators are still sectioning off the area for their part.</p><p>Amazon has said they are monitoring the situation here in Edwardsville and are heartbroken over the loss of their team members.</p><p>Now, here`s some video about an hour away from Defiance, Missouri. There`s another reported death in that city from another tornado that touched down sometime after 7:30 p.m. local time.</p><p>Now, at the devastation was just catastrophic across the entire Midwest. Tonight, we do know that in the St. Louis area at least two people were taken to the hospital with injuries. We`ve also had several power outages here in the area. Here in Illinois, it hasn`t been that bad.</p><p>There are only still about 6,000 in the dark. But that`s really nothing compared to the rest of the Midwest at this time. I`m Jenna Rae reporting for CBS here in Edwardsville, Illinois.</p><p>ED O`KEEFE: Jenna, thank you.</p><p>END</p><p>(Copy: Content and programming Copyright MMXXI CBS Broadcasting Inc. ALL RIGHTS RESERVED. Copyright 2021 ASC Services II Media, LLC. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of ASC Services II Media, LLC. You may not alter or remove any trademark, copyright or other notice from copies of the content.)</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021</p></div>"}