{"date": "2021-12-20 12:16:17+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds details, quotes</p><p class=\"tr-by\">By Conor Humphries</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">DUBLIN, Dec 20 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Ireland said on Monday that the number of people employed by multinational companies in the country had hit an all-time high of 275,000 in 2021, up 10% on its pre-pandemic level.</p><p>Just over 10% of Ireland's workforce is now employed by the multinational sector, particularly big technology and drugs companies attracted in part by a low corporate tax rate.</p><p>The net increase in employment from the sector almost doubled to 16,800 in 2021 from 2020, with 249 new investments, the country's foreign direct investment agency IDA Ireland said.</p><p>During the year, payments processor Stripe Inc created 1,000 jobs, chipmaker Intel <a href=\"reuters://REALTIME/Verb=FullQuote/ric=INTC.O\" data-type=\"ric\" data-ric=\"INTC.O\" translate=\"no\" dir=\"ltr\">INTC.O</a> 1,600 , Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> 500 jobs and Bausch + Lomb <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BHC.TO\" data-type=\"ric\" data-ric=\"BHC.TO\" translate=\"no\" dir=\"ltr\">BHC.TO</a> 130, IDA added. </p><p>\"FDI in Ireland has come through the pandemic relatively unscathed,\" IDA Chief Executive Martin Shanahan said.</p><p>Shanahan told a press briefing he did not expect the flow of jobs to slow in the wake of Ireland's decision in October to end its opposition to an overhaul of global corporate tax rules. </p><p>Dublin agreed to give up its prized 12.5% tax for large multinationals for a common minimum rate of 15%, although its implementation could be years away. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2R30TT\" data-type=\"storyId\" data-story-id=\"nL1N2R30TT\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Shanahan said the stability resulting from the move meant it would not have a significant impact on FDI flows, adding that it was an \"open question\" whether the deal would be implemented.</p><p>Leo Varadkar, Ireland's Deputy Prime Minister, said the multinational sector had helped to sustain the economy while others, most notably hospitality, struggled during the pandemic.</p><p>Ireland's gross domestic product grew by 11% in the three months to the end of September compared to the previous year, one of the highest rates of growth in the European Union. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Conor Humphries; Editing by Toby Chopra and Alexander Smith)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:conor.humphries@thomsonreuters.com\" data-type=\"email\" translate=\"no\">conor.humphries@thomsonreuters.com</a> ; +353 1 236 1915; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: IRELAND-INVESTMENT/ (UPDATE 1, PIX)</p></div>"}