{"date": "2021-08-05 13:30:27.152000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3945.0, "close": 3983.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>OSIsoft offerings combined with AVEVA solutions allow us to empower our customers to leverage performance intelligence. The collaboration brings in incremental value to customers' operations and asset life cycles: Kerry Grimes</p><p>Read Article In an interaction with CRN India, Kerry Grimes, Head of Global Partners, AVEVA, divulges details of the OSIsoft acquisition, discusses new go-to-market partner strategies and how the global industrial software leader is empowering organisa...</p></div><div class=\"tr-npp-body\"><p>In an interaction with CRN India, Kerry Grimes, Head of Global Partners, AVEVA, divulges details of the OSIsoft acquisition, discusses new go-to-market partner strategies and how the global industrial software leader is empowering organisations to transition to the digital era and thrive in the new normal. Excerpts:</p><p>1. Please give us an overview of AVEVA's channel strategy. What is new in your company with the acquisition of OSIsoft recently, and what this means for your partners?</p><p>We are excited about our OSIsoft acquisition that not only boosts our strengths and solutions offering but also adds 50 per cent to our number game. This puts us towards US$1.6 billion in terms of our company size exceeding US$ 10 billion. OSIsoft offerings combined with AVEVA solutions allow us to empower our customers to leverage performance intelligence. The collaboration brings in incremental value to customers' operations and asset life cycles. Performance Intelligence enables the collection and application of plant information for deeper intelligence and better understanding of asset performance, lifecycle and related operations.</p><p>In terms of our partner ecosystem, AVEVA has legacy distribution partners, a global network of over 5000 systems integrators and strategic technology alliances. This includes close collaborations with companies such as AWS and Microsoft. Heading AVEVA's comprehensive partner network, I am excited for the ecosystem to begin capitalising on the unparalleled advantages of the PI System. We are in the process of introducing the PI System to our channel partners, beginning with our AVEVA Select partners.</p><p>Our recently revamped Partner Network for System Integrators program offers systems integrators access to the broader AVEVA portfolio for training and certification. This allows them to offer enhanced value to their customers.</p><p>Through AVEVA Flex Subscriptions, systems integrators can provide a recurring expense for software licensing on a periodic basis versus the one-time perpetual licensing purchase model. Increasingly, we are observing that subscription-based models will lead the future. I am also excited to talk about AVEVA Operations Control Centre – our edge to enterprise solution.</p><p>Even before the OSIsoft acquisition, AVEVA has been a top exchange company at the UK Stock Exchange and we continue to keep up the momentum with organic growth. In the second half of last fiscal year, we grew by 10 per cent with a profit margin of 20 per cent. It is all about the value that our customers hold with the data and building products for them, ultimately being more efficient in data management.</p><p>2. What is your assessment of the pandemic in terms of business impact and new opportunities?</p><p>It is about sustainability. We have to make sure that workplaces are all connected. This allows us to bring better connectivity with users and partners. Connecting with workers through tablets is providing businesses improved visibility and control of data. Today we can predict the number of customers using our software for enhancing plant asset performances and leveraging their equipment. We have got software that measures performance and design. Better usage of data will help us to determine the efficiency of plants.</p><p>3.What have been the major trends among your customers during these disruptive times?</p><p>The move to recurring revenue with cloud was predominant. Our OCS offering is bundling together the AVEVA and OSI cloud operations. We are working more closely with Microsoft, as getting into cloud messaging is a big step for us. Sustainability has also become a top priority for organisations across sectors and efforts towards achieving this is helping customers reduce their carbon footprint.</p><p>4. Industrial supply chains were among the most affected in lockdown. How can we learn from this and leverage technologies?</p><p>We are bringing together IT and OT environments. Supply chain data forms the pyramid of IT and OT. Let's look at the pieces that we manage regarding the supply chain. First comes the manufacturing execution layer management. Now, we manage the efficiency of buying the raw material for the purchase. We can narrow down the issues with the actual data and AVEVA Manufacturing Execution System (MES) software helps us to provide deeper analytics. The major part of managing the supply chain is how the main product is produced and what kind of raw materials have been used for it. And, this is exactly what we do.</p><p>5. With business operations getting redefined by the 'new normal', what should be the top focus areas for your partner ecosystem? </p><p>The 'new normal' is definitely out there. Although, I am a believer that in order to sell to your customers, it is all about going back to personal interactions. In the case of our own company, we will travel less for internal meetings. However, we would have to return because our customers would want to see us again. Less people at the forefront and more people running operations from home could be the plan for companies in the future. 'Connected Worker' is a huge piece helping us to navigate the future and shape the new normal.</p><p>6. Going forward, do you have any major plans, in terms of GTM and the channel community?</p><p>We have a network of 5,000 systems integrators. They work with our distributors to sell to our customers. Our distributors manage our systems integrators. Now, we are building our systems integrators programme to be managed by us directly. I believe that a piece of our growth includes the operations that we are introducing through these SIs. Our distributors are still the main support system of our company. Customers will continue to buy from our distributors. Our partner platform gives distributors access to our 5000 SIs. This is not exactly a change in selling but a small change for the go-to-market approach.  <br/> </p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}