{"date": "2022-01-13 12:40:42.057000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>KOMO PLANT BASED FOODS INC (\"YUM-Z\")\nWHOLE FOODS MARKET INC (\"WFMI-Q\")\n- To Launch in Whole Foods Market Retail Locations in Western Canada\n\n     Whole Foods has expanded to 6 stores within key neighbourhoods in the\ngreater Vancouver area and most recently opened a flagship store in the\ncapital city of Victoria on southern Vancouver Island.\n\n     Whole Foods Market, Inc. is an American multinational supermarketchain\nheadquartered in Austin, Texas, which sells organic foods and products free\nfrom hydrogenated fats and artificial colors, flavors, and preservatives.\nWhole Foods seeks out the finest natural and organic foods available,\nmaintains the strictest quality standards in the industry, and has an\nunshakeable commitment to sustainable agriculture. Whole Foods has more\nthan 500 retail and non-retail locations in the US, Canada and the United\nKingdom. It has 14 retail locations in Canada, of which 7 are in British\nColumbia, and 7 are in Ontario. In 2017, Amazon purchased Whole Foods\nMarket for USD$13.7 Billion.\n\n     \"Adding Whole Foods to our distribution network is a huge\naccomplishment for Komo and testament to the high quality of our products,\"\nsays Komo CEO William White. \"We are so pleased with the growth in the\nnumber of retail stores that are selling Komo products. We have to thank\nour sales broker, Cornerstone Sales, our distributors, and our dedicated\nteam for this rapid growth. We are very excited about continuing to share\nthe love of plant-based foods through our aggressive growth plans.\"\n\n     Komo has a distribution network of 5 distributors covering all\nprovinces in Canada, including BRR Logistics, TransCold Distribution and\nNationwide Natural Foods. Komo significantly scaled up its production\ncapacity through a co-manufacturing arrangement last quarter, setting up\nKomo for rapid expansion. Komo is now available in select IGA, Fresh Market\nand Safeway locations, as well as all Choices Markets, all Nesters Market\nlocations, all Fairway Markets and all Nature's Fare locations. Komo is now\nfocused on expansion to the United States.\n\n     About Komo\n\n     Komo Plant Based Foods Inc. is a premium plant-based food company that\ndevelops, manufactures and sells a variety of plant-based frozen meals that\nare always hearty, satisfying, and made with wholesome ingredients. At\nKomo, our mission is to help make plant-based meals a staple on every\ndinner table by sharing our love for feel-good food that connects the\npeople to the planet. We believe plant-based eating is the future and -\nChange can start with a single biteTM. Our experienced plant-based\ninnovation and development team recreates vegan versions of traditionally\ncheesy and meaty classics, with 100% plants. Komo's products are sold\ndirect-to-consumer through our eCommerce website and a distribution network\nof online and brick and mortar grocery, convenience and natural retailer\nchannels. Our operating subsidiary Komo Comfort Foods launched in 2021 with\nour flagship products: plant-based Lasagna, Shepherd's Pie and Chickenless\nPot Pie and has recently launched a new line - Komo Plant-Based Meal\nHelpersTM - versatile meal starters to allow the creation of many dishes at\nhome. All of our products are 100% plant-based, made with wholesome\ningredients, free from preservatives, and frozen for freshness. Freezing\nproducts is a natural and effective way of keeping food products for longer\nwithout having to use any preservatives. Komo's meals have a 1-year frozen\nshelf life. Komo also sells hot ready-to-eat meals in Metro Vancouver\nthrough Uber Eats and Skip the Dishes.\n\n     Learn more at: www.komocomfortfoods.com and follow on Instagram:\n@komocomfortfoods\n\n     For further information, please contact:\n\n     William White, President &amp; CEO, Komo Plant Based Foods Inc.\nwill@komoeats.com\n1-866-969-0882\n\n     The Canadian Securities Exchange has not reviewed, approved or\ndisapproved the contents of this news release.\n\n     Cautionary Statement Regarding Forward-Looking Statements\n\n     Certain statements contained in this press release constitute\nforward-looking information. These statements relate to future events or\nKomo's future performance. The use of any of the words \"could\", \"expect\",\n\"believe\", \"will\", \"projected\", \"estimated\" and similar expressions and\nstatements relating to matters that are not historical facts are intended\nto identify forward-looking information and are based on Komo's current\nbelief or assumptions as to the outcome and timing of such future events.\nActual future results may differ materially. In particular, Komo's product\ndevelopment plans, its ability to launch its products on food delivery\napps, its ability to retain key personnel, its revenues, and its\nexpectation as to the acceptance of its products by retailer stores and\nconsumers constitute forward-looking information. Actual results and\ndevelopments may differ materially from those contemplated by\nforward-looking information. Readers are cautioned not to place undue\nreliance on forward-looking information. The statements made in this press\nrelease are made as of the date hereof. Komo disclaims any intention or\nobligation to publicly update or revise any forward-looking information,\nwhether as a result of new information, future events or otherwise, except\nas may be expressly required by applicable securities laws.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201200397.MNPRE2201200765-04204420220113</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}