{"date": "2021-12-12 02:05:00.328000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3444.24, "close": 3381.83}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>In California's Inland Empire, Black and Latino communities already faced some of the worst pollution. Then, more warehouses and trucks started appearing</p><p>Three generations of Arah Parker's family have lived in her pleasant, yellow-hued home, where there used to be a clear view of the San Gabriel mountains from the kitchen window.</p></div><div class=\"tr-npp-body\"><p>There used to be – until the country's hunger for online shopping swallowed the neighborhood.</p><p>Four massive Amazon warehouses – ranging from 500,000 to nearly 900,000 sq ft – now surround this historically Black community, as do distribution centers for Target, Under Armour, Monster Energy and Keeco textiles. Her home is now boxed in on three sides by concrete block buildings and the quiet road out front has been paved into a four-lane expressway rumbling with delivery trucks.</p><p>The ancient mountains are obscured by a \"big, block wall\" and more often than not, they are further shrouded by a noxious layer of haze belched up by the trucks.</p><p>\"To watch the transformation, it really has been disheartening,\" said Parker, 39.</p><p>The Inland Empire region, where Parker lives, is now one of the biggest national hubs for the e-commerce industry. The changes it has undergone are being replicated in cities and towns across the country.</p><p>To feed the one-click, one-day delivery demands of the nation, new warehouses are opening quickly, often in Black and brown neighborhoods. They sometimes chew up entire suburban blocks and communities in the process, crowding roadways with delivery trucks and vans and air space with cargo planes, clouding the air with more pollution.</p><p>Located about 60 miles east of Los Angeles, the Inland Empire has the third-largest concentration of Amazon warehouses in the US, according to a database of Amazon facilities Consumer Reports (CR) purchased from MWPVL, a logistics consulting firm.</p><p>The people living within a mile of most Amazon warehouses are more likely to be poor and people of color than those living in the typical neighborhood in the surrounding urban area, <a href=\"http://cr.org/amazonwarehouses\" data-type=\"url\" class=\"tr-link\" translate=\"no\">a new analysis by CR</a> , published this week in collaboration with the Guardian, found.</p><p>About 67% of residents in the Inland Empire are people of color. Within a mile of the average Amazon warehouses in the area, 81% of residents are people of color, according to the CR analysis.</p><p>Amazon, which is the largest private employer in the region, has continued to rapidly expand its facilities and warehouses here. The company opened eight new facilities in the Inland Empire in 2020 and at least five this year – altogether operating 34 facilities in the area.</p><p>In an area that already faces some of the worst traffic and <a href=\"https://www.lung.org/research/sota\" data-type=\"url\" class=\"tr-link\" translate=\"no\">air pollution</a> in the US, the explosive growth of the warehouse industry threatens to exacerbate already high rates of asthma and other respiratory issues. Placed close to the LA and Long Beach ports – the two busiest in the US – and encompassing four major freeway routes, the region is strategically situated, not just for Amazon, but about every major e-commerce and logistics company.</p><p>Overall, there are <a href=\"https://earthjustice.org/sites/default/files/files/warehouse_research_report_4.15.2021.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">hundreds</a> of warehouses in the Inland Empire.</p><p>\"Our communities of color have become the sacrifice for one of the biggest, wealthiest companies in the world,\" said Anthony Victoria, an environmental justice organizer based in the region. \"This is the cost of online shopping.\"</p><p class=\"tr-npp-section-title\"> 'Billionaires' dumping ground' </p><p>Parker's neighborhood in Rialto, where her grandfather and great uncle settled during the 1940s, is now reduced to just her family, and one other one down the street. All the other neighbors sold their plots to warehouse developers.</p><p>\"You should see how they try to race the semis down the street,\" said Marcus Gutierrez, who lives near Parker with his sister Maria. \"They've taken out our mailbox twice,\" Maria chuckled. \"We have to be careful when we go get the mail because the trucks will take the mail right out of your hands.\" <br/><br/> The trucks are everywhere – idling outside sports arenas and high schools. Six out of eight <a href=\"https://earthjustice.org/sites/default/files/files/warehouse_research_report_4.15.2021.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">schools</a> in the Inland town of Bloomington are located or will be located right next to a warehouse. Eighteen-wheelers are parked along small residential streets. Semis rattle through the streets, the vibrations over time causing cracks into the homes they drive by.</p><p>At the mall in Moreno Valley, shoppers sometimes see a fleet of Amazon delivery vans parked in the lot by the JCPenny.</p><p>Our communities of color have become the sacrifice for one of the biggest, wealthiest companies in the world</p><p>Anthony Victoria</p><p>\"It's everywhere – warehouses everywhere and pollution everywhere,\" said Mitzi Archer, the board president of the non-profit Center for Community Action and Environmental Justice (CCAEJ). \"You don't see that in Beverly Hills. You don't see that in the wealthy parts of Los Angeles. They're coming into communities populated with Hispanic and Black people.\"</p><p>Archer and her family have been living in Moreno Valley, about 500 feet from the 60 highway and a continuous procession of semis, for nearly three decades. Her son Thomas Winbush Jr, 27, struggled with asthma growing up. And her late husband, Winbush's namesake, died at age 57, of multiple myeloma – a blood cancer in the bone marrow.</p><p>In Archer's husband's last days, the doctor told her something that still makes her angry. \"She said the type of cancer could be caused by a lot of things, but based on where we lived, it was likely from the environment.\"</p><p>Her family had been exposed for decades, even before Amazon had arrived. CCAEJ, which Archer joined shortly after her husband's death, was <a href=\"https://www.ccaej.org/our-roots\" data-type=\"url\" class=\"tr-link\" translate=\"no\">started</a> in the 1970s to fight for those living near the Stringfellow Acid Pits, a notorious toxic waste site. Elsewhere in the Inland Empire, pollution from the BNSF rail yard in San Bernardino <a href=\"https://ww2.arb.ca.gov/sites/default/files/classic//railyard/hra/bnsf_sb_final.pdf?_ga=2.174025057.372649907.1608164457-298611843.1582062291\" data-type=\"url\" class=\"tr-link\" translate=\"no\">emits</a> a stream of pollution <a href=\"https://envhealthcenters.usc.edu/wp-content/uploads/2016/11/Tracking-Harm.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">linked</a> with elevated cancer risk.</p><p>Billionaires have long treated the region as a dumping ground, said Tom Dolan, the executive director of the faith-based advocacy organization, Inland Congregations United for Change. In fighting against rail yard pollution, local activists had to take on BNSF, a company owned by <a href=\"https://www.businessinsider.com/berkshire-hathaway-buying-burlington-northern-for-100-per-share-2009-11\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Warren</a> Buffett's Berkshire Hathaway. \"Now it's no longer just Warren Buffett, it's Jeff Bezos and Amazon,\" said Dolan. \"And we're paying their cost of doing business.\"</p><p>Dolan himself developed chronic bronchitis – a condition that is common among smokers – but in his case was likely triggered by pollution. When tailpipe emissions cook under the sunlight and heat to create a thick layer of smog over the region, Dolan has been in and out of the hospital. His wife Cecilia Miranda Dolan, who used to work as a physical education teacher at the Norton Science Academy, an elementary school located near the Amazon Air Regional Air Hub in San Bernardino, said a third of her students had some respiratory issue. \"They could run for just 100 meters before it was too much.\"</p><p class=\"tr-npp-section-title\"> 'Local leaders sold off people's lungs' </p><p>A recent <a href=\"http://www.aqmd.gov/docs/default-source/planning/fbmsm-docs/pr-2305_sia_2nd-draft_4-7-21.pdf?sfvrsn=8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">report</a> from the local air quality monitoring management office found that people living within half a mile of warehouses have higher rates of asthma and heart attacks than residents in the area overall. Across Riverside and San Bernardino counties, which encompass the Inland Empire, 71% of children 10 and under have asthma, according to public health <a href=\"https://healthpolicy.ucla.edu/chis/data/pages/GetCHISData.aspx\" data-type=\"url\" class=\"tr-link\" translate=\"no\">data</a> compiled by the University of California, LA.</p><p>\"It feels like we're disposable humans,\" said Amparo Miramontes, who moved from LA to the Inland city of Fontana about a decade ago, in search of an affordable home to raise her family during the Great Recession. Around the same time, warehousing began to take hold in the region.</p><p>And Miramontes and her whole family believe they have felt the effects. It started when she and her husband began getting frequent nosebleeds. Her then-infant daughter kept falling ill with respiratory infections.</p><p>My son had these big, huge black rings under his eyes all the time</p><p>Amparo Miramontes</p><p>Soon, Miramontes developed asthma so severe that when she became pregnant with her son, she couldn't breathe in enough oxygen for the both of them. \"At one point, my oxygenation wouldn't go over 60%, no matter how hard I tried,\" she said. Her baby was born with respiratory issues. At four months, he needed a nebulizer four times a day. At 10 months, his lungs remained weak. \"He had these big, huge black rings under his eyes all the time,\" she said, a sign that his oxygenation levels were low and he was anemic.</p><p>Her son, now eight, still uses a nebulizer often and an inhaler regularly – but he's been doing much better since she invested in air purifiers at home and enrolled him in a magnet school about 15 miles away, where the air quality is better. She doesn't let either of her kids play outdoor sports and constantly worries about the long-term effects on their health. With each new proposed warehouse development in her neighborhood, she grows angrier. Local leaders, she said, \"have basically sold off people's lungs\".</p><p>She thinks often about whether she should move, but for now, she wants to stay and fight – in part because she feels it's the right thing to do. She's seen the warehousing industry spread, across southern California and the US. \"It's a hard decision,\" she said. \"Sometimes I'm like, 'Damn, I'm a horrible mom. I need to leave.'\"</p><p>To track precisely how much the warehouse boom has impacted air pollution, non-profit organizations in the area as well as researchers from UC Riverside, have been fitting residents with wearable air quality trackers.</p><p>Facing pressure from local activists, Riverside, Colton and Jurupa Valley have issued moratoriums on opening new warehouses, while officials assess their environmental impact.</p><p>In May this year, the local air quality regulator adopted a rule that will require operators of warehouses 100,000 sq ft or larger to cut or offset emissions or pay a mitigation fee to fund air quality improvements nearby. Over the next few years, to avoid paying fees, warehouse operators will have to show that they have taken steps such as transitioning to electric or natural gas-fueled trucks, installing rooftop solar panels or providing air filters to neighboring schools and child-care centers – changes that <a href=\"https://www.aqmd.gov/docs/default-source/planning/fbmsm-docs/pr-2305_sia_2nd-draft_4-7-21.pdf?sfvrsn=8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">regulators say</a> could result in up to 300 fewer deaths and 5,800 fewer asthma attacks from 2022 through 2031.</p><p>Amid mounting criticisms over pollution, Amazon has said it is planning to transition to electric transport and delivery vehicles. \"We're deploying 100,000 electric delivery vehicles by 2030 that will save millions of metric tons of carbon and reduce local air pollution, installing solar rooftops at our facilities, including 11 solar rooftop systems in the Inland Empire,\" said Amazon spokesperson Maria Boschetti, in an emailed statement.</p><p>However, Ivette Torres, a researcher with the local non-profit environmental justice group <a href=\"https://pc4ej.org/about/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">People's Collective for Environmental Justice</a> (PC4EJ), said even if Amazon transitions to electric vehicles, they worry that the onus of acquiring new, electric trucks will likely still fall on local drivers and fleets, they said.</p><p>And even if environmental protections are put in place, Amazon and other e-commerce companies have created a community that has become so deeply dependent on the industry, that extricating the Inland Empire from its grasp will be complicated, Torres noted.</p><p>At San Bernardino's Cajon High School, the company has funded an Amazon Logistics &amp; Business Management Pathway Program of Study, which helps to train students to work in the logistics industry. Another high school in town, Pacific High, prepares students to work on commercial diesel trucks. Young people are receiving the message \"that if they want to work another type of job, they have to leave the area\", Torres said.</p><p class=\"tr-npp-section-title\"> ' Worn down by labor, torn down by pollution'</p><p>The promise of jobs and tax revenue is what local leaders and elected officials have used to justify the approval of more warehouse constructions. The region had been hit hard by the Great Recession and in 2012, when Amazon opened its first warehouse in the region, the unemployment rate for the Riverside-San Bernardino-Ontario area was 11.7%, the <a href=\"https://www.bls.gov/opub/ted/2012/ted_20121130.htm\" data-type=\"url\" class=\"tr-link\" translate=\"no\">highest</a> among US metro areas with populations greater than 1m.</p><p>In July, the California attorney general filed a <a href=\"https://oag.ca.gov/system/files/attachments/press-docs/Final%20Slover%20and%20Oleander%20CEQA%20Petition%20%28signed%29.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">lawsuit</a> against Fontana, challenging its approval of a 205,000 sq ft project that would border a public high school. But Acquanetta Warren, the Fontana mayor who has helped usher in about 60 warehouses and logistics facilities over the past five years – and who critics have dubbed \"Warehouse Warren\" – has remained steadfast.</p><p>??\"We have the cheaper land,\" Warren said, and the region is surrounded by freeways – the 10, the 15, the 210, 215 and 60. The warehouses' presence in Fontana and surrounding towns made strategic sense. And \"they're the key to our economic vitality\", she said.</p><p>Warehouse workers told the Guardian that jobs can be grueling. \"It's a lot of wear and tear on the body,\" said one former Amazon worker, who badly injured her arm during a shift at a fulfillment facility, quitting shortly afterward.</p><p>But she returned to Amazon, because it was the only place she knew she could quickly and easily find work during the Covid-19 lockdowns. <span><span> \"</span> It pretty much was the only option,\" she said. Other current and former Amazon workers said they had been discouraged from taking restroom breaks and were pushed by management to lift and load heavy boxes at near-impossible speeds.</span></p><p>Some current and former employees surveyed by researchers at UC Riverside said they permanently lost hearing because they weren't offered proper ear protection while working in loud sorting and loading centers.</p><p>\"This is the slow violence of the supply chain,\" said Victoria, the environmental activist. \"You get worn down by the hard labor. Or you get torn down by the pollution.\"</p><p>Local residents said they are often left feeling like they are no match against the powerful e-commerce industry and local governments eager to build more warehouses. In a region where Latino residents make up the majority and where many residents are monolingual Spanish speakers, council meetings to discuss new warehouse constructions often lacked Spanish translation.</p><p>Ma Carmen González, a community organizer with PC4EJ, said city officials have repeatedly told her she needs to bring her own translators. Earlier this year, even after local activists pushed the San Bernardino city council to assess the costs of providing Spanish-language interpretation at meetings, one local councilman, Fred Shorett, <a href=\"https://www.sbsun.com/2021/04/22/we-need-to-speak-english-councilman-says-as-san-bernardino-weighs-interpretation-services/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">scoffed, \"this is an English-speaking country\".</a> </p><p>González said she's grown increasingly angry and disheartened with each new warehouse that's constructed in San Bernardino. As the industry takes over, \"we are the forgotten ones\", she said.</p><ul class=\"bulleted-list arrowlist\"><li></li><li> </li></ul><p><span>This story is co-produced with Consumer Reports</span> </p><p><span>Consumer Reports has no relationship with any of the advertisers on this site.</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 theguardian.com-NonSyndicated</p></div>"}