{"date": "2022-01-12 20:58:08.611000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SOLUTION CUISINE LTD (\"VEG-V\")\n- Obtains Final Order\n\n     Sol Cuisine Ltd. (\"Sol Cuisine\" or the \"Company\") is pleased to\nannounce that it obtained a final order of the Ontario Superior Court of\nJustice (Commercial List) (\"Final Order\") approving the previously\nannounced proposed acquisition by PlantPlus Foods Canada Inc. by way of a\nplan of arrangement (the \"Arrangement\").\n\n     Receipt of the Final Order follows the Company's special meeting of\nshareholders held on January 7, 2022, where a special resolution approving\nthe Arrangement was voted for by 100% of the votes cast by Sol Cuisine\nshareholders present in person or represented by proxy at the meeting.\n\n     Completion of the Arrangement remains subject to the satisfaction or\nwaiver of certain conditions, including obtaining certain third-party\nconsents and approvals. It is anticipated completion will occur later in\nJanuary 2022.\n\n     Further details regarding the Arrangement are set out in the Company's\nnotice of special meeting of shareholders and management information\ncircular dated December 7, 2021, which is available on SEDAR at\nwww.sedar.com.\n\n     For more details on Sol Cuisine's consumer brands:\n\n     Website:     www.solcuisine.com\n     Instagram:   @solcuisine\n     Facebook:   @solcuisine\n     Twitter:      @solcuisine\n     LinkedIn:    @solcuisine\n\n     About Sol Cuisine Ltd.\n\n     Sol Cuisine is the publicly traded parent company of Sol Cuisine Inc.,\nfollowing the completion of its \"qualifying transaction\" on May 19, 2021.\nSol Cuisine is a fast-growing producer of branded and private label,\nconsumer-preferred plant-based protein offerings across key center-of-plate\nand appetizer categories. The Company's products are offered through an\nestablished omni-channel distribution platform in Canada, the U.S. and\nMexico, and are available in over 11,000 stores and more than 41,000 unique\npoints of distribution across four primary channels: Canada Retail Sales &amp;\nClub; U.S. Retail Sales &amp; Club; Food Service &amp; Industrial; and Private\nLabel. Over a history of 20+ years, Sol Cuisine has consistently\ndemonstrated an ability to innovate and delight consumers in Canada and the\nU.S., while remaining true to its commitment to producing great tasting,\nnutritionally superior products. This commitment has resulted in several\nCanadian product wins, including the #1 frozen plant-based burger in\nCanada, the #1 consumer-preferred chicken alternative and the #1 quality\nroast product as determined by Whole Foods Market. The Company's taste and\nnutritional superiority has also resulted in private label contracts with\nsome of the most recognized natural brands in North America. These products\nare all produced at Sol Cuisine's two state of the art facilities, totaling\n35,000 square foot facility in Mississauga, Ontario, capable of supporting\nup to 10 million kilograms of volume per annum.\n\n     Forward-Looking Statements.\n\n     This press release contains forward-looking statements within the\nmeaning of Canadian securities laws regarding the Company and its business.\nThese forward-looking statements contain statements of intent, belief or\ncurrent expectations of Sol Cuisine. Forward-looking information is often,\nbut not always identified by the use of words such as \"anticipate\",\n\"believe\", \"expect\", \"plan\", \"intend\", \"forecast\", \"target\", \"project\",\n\"may\", \"will\", \"should\", \"could\", \"estimate\", \"predict\" or similar words\nsuggesting future outcomes or language suggesting an outlook.\n\n     The forward-looking statements included in this press release are not\nguarantees of future results and involve risks and uncertainties that may\ncause actual results to differ materially from the potential results\ndiscussed in the forward-looking statements.\n\n     Risks and uncertainties that may cause such differences include but\nare not limited to: the possibility that legal proceedings may be\ninstituted against the Company and/or others relating to the Arrangement\nand the outcome of such proceedings; risks relating to the failure to\nobtain necessary regulatory and stock exchange approval; other risks\ninherent in the plant-based food industry. When relying on forward-looking\nstatements to make decisions, investors and others should carefully\nconsider the foregoing factors and other uncertainties and potential\nevents. Readers are cautioned that the foregoing list of factors is not\nexhaustive. Additional information on these and other factors that could\naffect the Company's operations or financial results are included in\nreports on file with applicable securities regulatory authorities and may\nbe accessed through the SEDAR website (www.sedar.com).\n\n     The forward-looking statements in this press release are made as of\nthe date it was issued and the Company does not undertake any obligation to\nupdate publicly or to revise any of the included forward-looking\nstatements, whether as a result of new information, future events or\notherwise, except as required by applicable law. By their very nature,\nforward-looking statements involve inherent risks and uncertainties, both\ngeneral and specific, and risks that outcomes implied by forward-looking\nstatements will not be achieved. The Company cautions readers not to place\nundue reliance on these statements.\n\n     Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this press release.\n\n     John Flanagan Chief Executive Officer 905-502-8500\n\n     For further information: Jonathan Ross, Sol Cuisine Investor Relations\njon.ross@loderockadvisors.com 416-283-0178\n\n     Kieran Lawler, Sol Cuisine Public Relations\nkieran.lawler@loderockadvisors.com 416-303-0799\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201100495.MNPRE2201102358-12570620220112</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}