{"date": "2021-12-04 18:35:29.033000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3389.79, "close": 3523.29}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>New Delhi [India], December 4 (ANI): Amazon Original 'Mirzapur' Season 2 has won the 'Best Original Programme by a Streamer/OTT' award at the Asian Academy Creative Awards (AAA), held on December 2 and 3 in Singapore.</p><p>New Delhi [India], December 4 (ANI): Amazon Original 'Mirzapur' Season 2 has won the 'Best Original Programme by a Streamer/OTT' award at the Asian Academy Creative Awards (AAA), held on December 2 and 3 in Singapore.</p></div><div class=\"tr-npp-body\"><p>The awards showcase excellence in the film and television industry across the Asia Pacific region.</p><p>With an ensemble cast featuring Pankaj Tripathi, Ali Fazal, Divyenndu, Shweta Tripathi Sharma, Rasika Dugal, Harshita Shekhar Gaur in the lead roles, the show continues to receive massive appreciation and viewership from across the world.</p><p>The second season also featured Vijay Varma, Priyanshu Painyuli and Isha Talwar who have left an indelible impression on audiences with their passionate and layered performances.</p><p>Puneet Krishna, Creator, on receiving the award for Mirzapur Season 2 said, \"It is a huge moment for every technician and talent from Mirzapur, a series that has become a household name. The show's authenticity and relatability make it a rather unique and interesting series, one that engages the audience at a deeper level.\"</p><p>Puneet dedicated the award to actor Brahma Mishra, who recently passed away.</p><p>\"A heartfelt thanks to every actor and every person working extremely hard behind the camera to make Mirzapur a memorable viewing experience for the audiences. Thank you, Asian Academy Creative Awards, for recognizing our efforts. We would like to dedicate this award to Brahma Mishra, one of the most talented actors that we have worked with, and only wish that he was here to share this moment with us,\" he said.</p><p>Aparna Purohit, Head of India Originals, Amazon Prime Video India, added, \"At Prime Video, we are constantly working towards offering our viewers compelling content across genres, categories, languages and formats, that entertains, inspires and provokes. As we complete 5 years in India, our win at the prestigious Asian Academy Creative Awards is validation that our relentless efforts to find and give a platform to the best stories, storytellers and talent, is working.\"</p><p>'Mirzapur', created and produced by Excel Media and Entertainment, has been greenlit for a third season. (ANI)</p><p>Copyright © 2021 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}