{"date": "2021-11-24 15:53:38.379000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">ELECTRIC ROYALTIES FILES TECHNICAL REPORT</p>\n<p>VANCOUVER, BC, Feb. 23, 2022</p>\n<p>VANCOUVER, BC, <span>Feb. 23, 2022</span> /CNW/ - <span>Electric Royalties Ltd.</span> (TSXV: ELEC) (OTCQB: ELECF) <span>(\"Electric Royalties\" or the \"Company\")</span> announces that today it will file the report entitled \"Amended NI 43-101 Technical Report, Middle Tennessee Mines, <span>Tennessee, USA</span> \" by Martin Raffield, Ph.D., P.Eng., and <span>David Gaunt</span> , P.Geo., effective date <span>December 31, 2021</span> (the \"Technical Report\") under its profile on <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453798-1&amp;h=2391746920&amp;u=http%3A%2F%2Fwww.sedar.com%2F&amp;a=www.sedar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sedar.com</a> . The report was amended to reflect comments from the regulator.</p>\n<p>\n\n</p>\n<p>Electric Royalties acquired a royalty interest on zinc production at the Middle Tennessee Mines (\"the MTM Royalty\"), located in <span>Smith County, Tennessee</span> , <span>United States</span> , in 2021. The MTM royalty is a sliding scale gross metals royalty, with no royalty payable if the zinc price is below <span>US$0.90</span> per pound, a 1.0% royalty payable at zinc prices between <span>US$0.90</span> and <span>US$1.10</span> per pound, and a 1.4% at royalty payable at zinc prices above <span>US$1.10</span> per pound. Electric holds a 25% interest in the MTM Royalty with the remaining 75% interest held by Sprott Streaming and Royalties Corp. (see Electric Royalties news release dated <span>August 11, 2021</span> ).</p>\n<p>\n<span>About Electric Royalties Ltd</span> .</p>\n<p>Electric Royalties is a royalty company established to take advantage of the demand for a wide range of commodities (lithium, vanadium, manganese, tin, graphite, cobalt, nickel, zinc &amp; copper) that will benefit from the drive toward electrification of a variety of consumer products: cars, rechargeable batteries, large scale energy storage, renewable energy generation and other applications.</p>\n<p>Electric vehicle sales, battery production capacity and renewable energy generation are slated to increase significantly over the next several years and with it, the demand for these targeted commodities. This creates a unique opportunity to invest in and acquire royalties over the mines and projects that will supply the materials needed to feed the electric revolution.</p>\n<p>Electric Royalties has a growing portfolio of 18 royalties, including one royalty that currently generates revenue. The Company is focused predominantly on acquiring royalties on advanced stage and operating projects to build a diversified portfolio located in jurisdictions with low geopolitical risk, which offers investors exposure to the clean energy transition via the underlying commodities required to rebuild the global infrastructure over the next several decades towards a decarbonized global economy.</p>\n<p>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange), nor any other regulatory body or securities exchange platform, accepts responsibility for the adequacy or accuracy of this release.</p>\n<p>\n<span>Cautionary Statements Regarding Forward-Looking Information and Other Company Information</span>\n</p>\n<p>\n<span>This news release includes forward-looking information and forward-looking statements (collectively, \"forward-looking information\") with respect to the Company within the meaning of Canadian securities laws. Forward looking information is typically identified by words such as: believe, expect, anticipate, intend, estimate, postulate and similar expressions, or are those, which, by their nature, refer to future events. This information represents predictions and actual events or results may differ materially. Forward-looking information may relate to the Company's future outlook and anticipated events and may include statements regarding the financial results, future financial position, expected growth of cash flows, business strategy, budgets, projected costs, projected capital expenditures, taxes, plans, objectives, industry trends and growth opportunities of the Company and the projects in which it holds royalty interests.</span>\n</p>\n<p>\n<span>While management considers these assumptions to be reasonable, based on information available, they may prove to be incorrect. Forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company or these projects to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. These risks, uncertainties and other factors include, but are not limited to risks associated with general economic conditions; adverse industry events; marketing costs; loss of markets; future legislative and regulatory developments involving the renewable energy industry; inability to access sufficient capital from internal and external sources, and/or inability to access sufficient capital on favourable terms; the mining industry generally, the Covid-19 pandemic, recent market volatility, income tax and regulatory matters; the ability of the Company or the owners of these projects to implement their business strategies including expansion plans; competition; currency and interest rate fluctuations, and the other risks.</span>\n</p>\n<p>\n<span>The reader is referred to the Company's most recent filings on SEDAR as well as other information filed with the OTC Markets for a more complete discussion of all applicable risk factors and their potential effects, copies of which may be accessed through the Company's profile page at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453798-1&amp;h=2391746920&amp;u=http%3A%2F%2Fwww.sedar.com%2F&amp;a=www.sedar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sedar.com</a> and at otcmarkets.com.</span>\n</p>\n<p>SOURCE Electric Royalties Ltd.</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/23/c9665.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/23/c9665.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}