{"date": "2021-11-15 11:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Richa Naidu and Aishwarya Venugopal</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">CHICAGO, Nov 15 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Pent-up demand is expected to have boosted early holiday sales this year, but big discounters Walmart <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> and Target <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TGT.N\" data-type=\"ric\" data-ric=\"TGT.N\" translate=\"no\" dir=\"ltr\">TGT.N</a> may still see margins fall as surging costs for labor, warehousing and ocean and land freight threaten to play Grinch.</p><p>Retailers have been under tremendous pressure from investors to control costs amid uncertainty driven by the pandemic. Shipping logjams, shuttered factories in China and Vietnam, and a scarcity of raw materials have ripped through supply chains in the United States in recent months, and left companies scrambling to make sure they have enough product for the crucial holiday shopping season.</p><p>For the third quarter, both costs of goods sold and selling, general and advertising expenses for Target are expected to rise about 10%, while Walmart's operating expenses are expected to rise nearly 4% to $28.57 billion, according to Refinitiv data.</p><p>Walmart, the world’s biggest retailer, will report earnings on Tuesday, while Target is scheduled to post results on Wednesday.</p><p>Late last month, ecommerce giant Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> said it expects costs during the holiday period to reach about $4 billion as higher wages and other operational disruptions diminish the company's windfall from online shopping. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2RO5CD\" data-type=\"storyId\" data-story-id=\"nL4N2RO5CD\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>\"It is one competitive market for labor, freight, and customers. We believe most will be prudent in guiding to fourth-quarter profitability even with healthy sales,\" Evercore analyst Greg Melich said.</p><p><br/></p><p>RISING RENTS, WAGES</p><p>Industry warehouse rents are expected to rise 18-19% this year, according to real estate investment trust Prologis <a href=\"reuters://REALTIME/Verb=FullQuote/ric=PLD.N\" data-type=\"ric\" data-ric=\"PLD.N\" translate=\"no\" dir=\"ltr\">PLD.N</a>, whose customers include Walmart, Amazon and Target. For the full year, analysts expect Walmart’s rent expenses to rise 7% to $3.28 billion, according to Refinitiv.</p><p>“Importers of clothing and footwear are paying essentially double what they were paying for transportation before the pandemic,” according to Jason Miller, associate professor of supply chain management at Michigan State University’s Eli Broad College of Business. </p><p>Insurance and freight costs crept up to 6.4% of the value of the imported products in September 2021, versus 3.7% in September 2019, according to Miller, who analyzed data from USA Trade Online, which is maintained by the Census Bureau.</p><p>Logistics expenses are also on the rise as retailers need to get more products around the country to satiate growing consumer demand, Mark Manduca, chief investment officer at logistics firm GXO, whose clients include Apple, Nike and Abercrombie &amp; Fitch.</p><p>Meanwhile, a competitive labor environment has pushed wages up across the country.</p><p>Still, experts and analysts have said that retailers with bigger scale are better placed to tide over these supply chain issues and pass on higher prices to the buyers.</p><p>\"Everybody's facing higher expenses but Walmart also has a much more efficient supply chain - they should have a very good holiday season, even with all the cost pressure,\" Telsey Group analyst Joe Feldman said.</p><p>U.S. holiday sales could rise as much as 10.5% to $859 billion, according to one forecast.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Richa Naidu in Chicago and Aishwarya Venugopal, Editing by Nick Zieminski)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:richa.naidu@tr.com\" data-type=\"email\" translate=\"no\">richa.naidu@tr.com</a> ; Follow me on Twitter <a href=\"https://twitter.com/Richa_Writes;\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/Richa_Writes;</a> +1 312 636 8874; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WALMART-RESULTS/ (PREVIEW, PIX)</p></div>"}