{"date": "2022-01-19 07:10:26.974000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 8724YBoku Inc19 January 2022</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>THIS ANNOUNCEMENT (THE \"ANNOUNCEMENT\"), AND THE INFORMATION CONTAINED IN IT IS RESTRICTED AND IS NOT FOR RELEASE, PUBLICATION, DISTRIBUTION, OR FORWARDING, IN WHOLE OR IN PART, DIRECTLY OR INDIRECTLY, IN OR INTO THE UNITED STATES OF AMERICA, CANADA, AUSTRALIA, JAPAN, NEW ZEALAND OR THE REPUBLIC OF SOUTH AFRICA OR IN OR INTO ANY OTHER JURISDICTION WHERE TO DO SO MIGHT CONSTITUTE A VIOLATION OR BREACH OF ANY APPLICABLE LAW OR REGULATION.</span>\n</p>\n<p>\n<span>THIS ANNOUNCEMENT IS FOR INFORMATION PURPOSES ONLY AND DOES NOT CONSTITUTE OR CONTAIN ANY INVITATION, SOLICITATION, RECOMMENDATION, OFFER, OR ADVICE TO ANY PERSON TO SUBSCRIBE FOR, OTHERWISE ACQUIRE OR DISPOSE OF ANY SECURITIES IN BOKU, INC. OR ANY OTHER ENTITY IN ANY SUCH JURISDICTION.</span>\n</p>\n<p>\n<span>THIS ANNOUNCEMENT CONTAINS INSIDE INFORMATION.</span>\n</p>\n<p>\n<span>19 January 2022</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Boku, Inc.</span>\n</p>\n<p>\n<span>(\"Boku\" or the \"Company\" or the \"Group\")</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Divestment of Boku Identity to Twilio</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Boku (AIM: BOKU), a leading provider of mobile payment solutions, announces that it has reached agreement for the divestment of its wholly-owned subsidiary Boku Identity, Inc. (\"Boku Identity\") to Twilio, Inc. (\"Twilio\"), the leading cloud communications platform, for a maximum transaction value of $32.3 million, payable in cash (the \"Disposal\").</span>\n</p>\n<p>\n<span>Boku Identity</span>\n<span>provides mobile identity and authentication solutions driven by real-time connections to Mobile Network Operators (\"MNOs\").</span>\n</p>\n<p>\n<span>Highlights</span>\n</p>\n<p>\n<span>·</span>\n<span>Disposal of Boku Identity to Twilio for a maximum transaction value of $32.3 million (subject to customary adjustments), payable in cash.</span>\n</p>\n<p>\n<span>·</span>\n<span>The Disposal allows Boku to become a pure-play payments business focusing its resources on exploiting the mobile payments opportunity, particularly to continue to expand its mobile first (\"M1ST\") Payments Network, a network of local payment methods, including Direct Carrier Billing, eWallets and Real Time Payments.</span>\n</p>\n<p>\n<span>·</span>\n<span>Boku will invest part of the proceeds in its M1ST Payments Network to take advantage of the substantial opportunity, repay outstanding bank debt and retain the remainder for working capital purposes.</span>\n</p>\n<p>\n<span>·</span>\n<span>The Disposal is expected to be immediately earnings enhancing for Boku.</span>\n</p>\n<p>\n<span>Terms of the Disposal</span>\n</p>\n<p>\n<span>Twilio has conditionally agreed to acquire the entire issued and to be issued share capital of Boku Identity for a maximum transaction value of $32.3 million, payable in cash, in accordance with the terms of a stock purchase agreement dated 18 January 2022 (the \"SPA\") entered into between (1) Boku (as seller); (2) Twilio (as buyer); and (3) Boku Identity. Completion of the transaction is expected within 60 days upon satisfaction or waiver of certain customary conditions referred to in the SPA.</span>\n</p>\n<p>\n<span>Under the terms of the SPA</span>\n<span>, $26.1 million is payable on completion (subject to customary adjustments and a final determination up to 120 days post completion). The balance of $6.2 million comprises amounts held back to cover indemnities and is payable in two tranches within a maximum of 18 months, subject to the terms and conditions of the SPA.</span>\n</p>\n<p>\n<span>Background to and reasons for the Disposal</span>\n</p>\n<p>\n<span>Boku Identity was acquired in 2019 as Danal Inc. for a total consideration of $</span>\n<span>25.1 million <span>. The Disposal will allow the Identity business to continue to develop and grow under new ownership.</span>\n</span>\n</p>\n<p>\n<span>For the financial year ended 31 December 2020 Boku Identity produced audited results of Revenue of $5.2 million, an Adjusted EBITDA loss of $3.9 million and a loss before tax and exceptional items of $5.8 million*. The audited net assets of Boku Identity on 31 December 2020 were $5.4 million. Full year results (unaudited) for the financial year ended 31 December 2021 are expected to show revenues of approximately $7.1 million (up 37%) and an expected, reduced, Adjusted EBITDA loss of $2.9 million.</span>\n</p>\n<p>\n<span>Commenting on the Disposal, Jon Prideaux, CEO of Boku, said:</span>\n</p>\n<p>\n<span>\"Boku has decided to divest its Identity business so that we may focus our resources on our Payments business. In 2021, Boku has grown its payments network to reach 7 billion consumer payment accounts, increased its mobile wallet payments transaction value more than five-fold, as well as launching mobile-first payments for world leading digital advertising, music and video streaming, video and console game companies. By becoming a pure-play payments business, we seek to capitalise on our momentum and maximise our market opportunity in 2022 and beyond.</span>\n</p>\n<p>\n<span>\"We believe Boku Identity will be able to continue to develop under Twilio's ownership and we wish the business and its staff well for the future.\"</span>\n</p>\n<p>\n<span>* audited loss before tax for 2020 was $26.6 million after exceptional items</span>\n</p>\n<p>\n<span>This Announcement contains inside information for the purposes of article 7 of the Market Abuse Regulation (EU) 596/2014 which is part of UK law by virtue of the European Union (withdrawal) Act 2018. The person responsible for arranging for the release of this Announcement on behalf of the Company is Keith Butcher, Chief Financial Officer.</span>\n</p>\n<p>\n<span>Enquiries:</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Boku, Inc.</span>\n</p>\n<p>\n<span>Jon Prideaux, Chief Executive Officer</span>\n</p>\n<p>\n<span>Keith Butcher, Chief Financial Officer</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 (0)20 3934 6630</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n<p>\n<span>Peel Hunt LLP (Nominated Adviser and Broker)</span>\n</p>\n<p>\n<span>Edward Knight / Paul Gillam/ James Smith</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n<p>\n<span>+44 (0)20 7418 8900</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n<p>\n<span>IFC Advisory Limited (Financial PR &amp; IR)</span>\n</p>\n<p>\n<span>Tim Metcalfe / Graham Herring / Florence Chandler</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n<p>\n<span>+44 (0)20 3934 6630</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>Notes to Editors</span>\n</p>\n<p>\n<span>Boku Inc. (AIM: BOKU) is a leading global provider of mobile payment solutions. Its Mobile First Payments Network 'M1ST' features 330+ mobile payment methods, including mobile wallets, direct carrier billing, and real-time payments schemes, reaching over 7 billion mobile payment accounts in 91 countries - all through a single integration.</span>\n</p>\n<p>\n<span>Customers that trust Boku to simplify sign-up, acquire new paying users and prevent fraud include global leaders such as Amazon, Apple, Facebook, Google, Microsoft, Netflix, PayPal, Sony, Spotify and Tencent.</span>\n</p>\n<p>\n<span>Boku Inc. was incorporated in 2008 and is headquartered in London, UK, with offices in the US, India, Brazil, China, Estonia, France, Germany, Indonesia, Japan, Singapore, Spain, Taiwan and Vietnam.</span>\n</p>\n<p>\n<span>To learn more about Boku Inc., please visit:</span>\n<span>\n<a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.boku.com%2F&amp;data=04%7C01%7Cjon.prideaux%40boku.com%7Cc79d56ae84b94434ae1608d9d45e634e%7C2e3d9b0d22f94082b38a0d320d3a7ffc%7C0%7C0%7C637774324154565725%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000&amp;sdata=cHsWZt00TLLFesZHdDspc1UvlKRpv2fkD4vrBDpxCfs%3D&amp;reserved=0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.boku.com</a>\n</span>\n<span>.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>DISDVLFFLFLXBBQ</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}