{"date": "2022-02-24 14:27:40.410000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to upgrade your smart home collection, the online shopping giant offers some of the best prices on a very wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Below, you'll find our top Amazon deals today, including our favorite electric scooter, some comfortable mattresses and one of our favorite bidets, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. If you're looking for N95 and KN95 masks right now, Amazon also has plenty of choices on sale today, too.</p><p>► <span>Is your Kohl's getting a Sephora in 2022?:</span>  The retailers are adding 400 beauty shops this year</p><p>► <span>Patagonia Winter Sale:</span>  Nab epic deals on the outdoor gear you need while supplies last</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $14.99 a month ($7.49 for students and $6.99 for those receiving qualifying government assistance).</p><p>Better still, right now, shoppers can receive a $5 discount on their first $10-or-more Amazon app purchase. </p><p class=\"tr-npp-section-title\">The best Amazon deals of the day</p><p><big>1. Half off: One of our favorite bidets</big> </p><p>Make your visits to the bathroom more refreshing with the Tushy Classic 2.0 bidet. Normally priced at $99, this toilet attachment is now available for 50% off at $49.99. When we tested the older model of the Classic, our tester claimed he wasn't going back to \"just toilet paper.\" Not only did he find the installation of the bidet fairly easy, but he was also impressed by how using the bidet lessened his need for toilet paper.</p><p><span>Get the Tushy Classic 2.0 Bidet Toilet Seat Attachment for $49.99 (Save $49.01)</span> </p><p><big>2. Up to 20% off: These comfortable mattresses</big> </p><p>Tuft &amp; Needle makes the best mattress-in-a-box we've ever tried and right now, Amazon has some of the brand's cozy mattresses on sale. One of them is the Tuft &amp; Needle Mint, which you can get in the queen size for 20% off at $956. The brand says the Mint has two comfort layers of its adaptive foam and a super luxe knit cover for a more cozy feel. There's also the Nod by Tuft &amp; Needle 8-inch foam mattress, typically listed for $499 in its queen size but now on sale for 10% off at $449.10. The brand says the Nod's foam has a balanced feel of soft and firm that also keeps you from overheating at night.</p><p><span>Save up to 20% on select Tuft &amp; Needle mattresses</span> </p><p><big>3. 20% off: This compact tool accessory</big> </p><p>Upgrade your home hardware with the RAK Universal Socket tool. Currently listed for $14.99, you can use the 20% coupon on the product page to bring the price down to $11.99 at checkout. RAK says the socket tool contains 54 individual hardened steel spring pins that conform to the shape of hex nuts, hooks, bolt heads and more. It also comes with a power drill adapter to easily turn any drill or power screwdriver into a power socket driver.</p><p><span>Get the RAK Universal Socket Tool 2-Piece Set for $11.99 with coupon (Save $3)</span> </p><p><big>4. Up to 40% off: These powerful vacuums </big> </p><p>Eufy is the maker of one of the best vacuums we've ever tried and right now, Amazon has some of its cleaning essentials on sale today. The Eufy RoboVac G20 Hybrid robot vacuum, normally priced at $319.99, is now available at $229.99, or 28% off. The brand says the G20 Hybrid can both capture dirt in carpets and mop up messes on hard floors with Smart Dynamic Navigation to maneuver through your home. If you want a more hands-on approach, there's the Eufy HomeVac S11 Lite stick vacuum now selling for 40% off at $119.99. Eufy says the cordless appliance gives you 35 minutes of runtime on a single charge and has a 2-in-1 crevice tool attached to help clean the toughest parts of your home. </p><p><span>Save up to 40% on select Eufy vacuums</span> </p><p><big>5. Save $200: Our favorite electric scooter</big> </p><p>Cruise around town with ease on the Segway Ninebot MAX G30P electric scooter. Typically listed for $949.99, this foldable transport is now available for $749.99, 21% off. The Ninebot MAX is the best electric scooter we've ever tried thanks to its anti-lock braking system and front and rear shock absorbers that made for a safe and smooth ride. We also liked that compared with other scooters, the Ninebot MAX's battery has a relatively fast charge time of six hours.</p><p><span>Get the Segway Ninebot MAX G30P Electric Kick Scooter for $749.99 (Save $200)</span> </p><p class=\"tr-npp-section-title\">The best Amazon deals from this week</p><p><big>1. Samsung computer monitors</big> </p><p>Give your computer graphics a visual upgrade with select Samsung monitors on sale at Amazon today. The brand's 24-inch M5 Series FHD 1080p monitor, typically listed for $229.99, is on sale for $30 off or $199.99. Samsung says the monitor not only serves as a great PC tool with Microsoft Office 365 installed, but it can also serve as a streaming TV with the ability to stream from apps including Netflix and HBO Max. For a more expansive view, check out the 34-inch Samsung Odyssey G5 Ultra-Wide gaming monitor for a 22% discount that drops the price to $429.99. The brand says the curved screen can display more imagery while gaming with a 165-hertz refresh rate and one millisecond response time for the smoothest possible gameplay.</p><p><span>Save up to 22% on select Samsung computer monitors</span> </p><p><big>2. Old Bay Hot Sauce</big> </p><p>If you like a little zing to your favorite dishes, you can't go wrong with Old Bay hot sauce. You can get a 64-fluid-ounce container of this tasty seasoning for $10.74 thanks to a 20% coupon you can check off on the product page. Old Bay says its sauce is blended with paprika, celery salt, red and black pepper with no added MSG. Whether you want to give some heat to chicken wings or extra flavor to some mac and cheese, Old Bay makes your dishes all the tastier.</p><p><span>Get the Old Bay 64-Fluid-Ounce Hot Sauce for $10.74 with coupon (Save $2.68)</span> </p><p><big>3. Febreeze Small Spaces Unstopables Paradise Air Fresheners</big> </p><p>If your kitchen or your bathroom needs freshening, these Febreeze Unstopables Paradise air fresheners are essentials. Typically listed for $11.99, you can get a three-pack with Amazon's delivery Subscribe and Save membership for just $9.68, or 19% off, thanks to a $2.31 price cut. With Subscribe and Save, you can get 5% off the delivery of your first order and up to 15% off repeat deliveries that you can schedule to arrive anywhere every two weeks to every six months. Febreeze says these tiny fresheners can eliminate odors in even the smallest home spaces for 45 days.</p><p><span>Get the Febreze Small Spaces Unstopables Paradise Air Freshener 3-Count for $9.68 (Save $2.31)</span> </p><p><big>4. Staub Cast Iron 4-Quart Round Cocotte</big> </p><p>If you're looking for some reliable cookware to add to your kitchen, consider the Staub cast iron cocotte. Normally listed for $130.89, this 4-quart round Dutch oven with a glass lid can be yours for as low as $99.95 in cherry red, black and white. We named the larger Staub cast iron 5.5-quart round cocotte (from $324.95) the best Dutch oven we've ever tested, so this smaller model is sure to impress with the tempered glass lid for optimal heat control and a multi-coat enamel—which the brand claims is resistant to chips, scratches and discoloration. The pot is designed for searing, boiling, deep-frying, braising and more in the oven, and works on both induction and traditional stovetops.</p><p><span>Get the Staub Cast Iron 4-Quart Round Cocotte from $99.95 (Save $5.62 to $107.65)</span> </p><p><big>5. Beckham Hotel Collection Bed Pillows</big> </p><p>Sleep soundly with a new set of Beckham Hotel Collection bed pillows, the best affordable pillows we've ever tested. Usually selling for $49.99 for the queen size, this set of two plush pillows can be yours for just $31.99 today thanks to the extra 20% coupon on the product page. In testing, we found these cushions felt similar to down and offered optimal support for side sleepers. We especially loved that they were washable and didn't smell after opening (like other synthetic-fill pillows we tested). </p><p><span>Get the Beckham Hotel Collection Bed Pillows from $31.99 with coupon (Save $16.25 to $18)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Three-Month Trial of Amazon Music Unlimited for free (Save $29.97)</li><li>Hertzko Self-Cleaning Slicker Brush for Dogs and Cats for $14.99 (Save $15)</li><li>Bella 17289 Double Cooker from $19.50 (Save $1.92 to $3.49)</li><li>Errbic Solar Charger for $21.59 with coupon (Save $12.40) </li><li>Kasa Smart Plug Power Strip for $24.99 (Save $5)</li><li>H&amp;R Block Tax Software Deluxe + State 2021 PC Download for $28.44 (Save $16.55)</li><li>BalanceForm Bike Trainer Stand for $34.99 (Save $20.32)</li><li>JALL Wake Up Light Sunrise Alarm Clock for $40.83 with coupon (Save $5.15)</li><li>Logitech C920x Pro HD Webcam for $59.99 (Save $10)</li><li>Logitech G Pro Wireless Gaming Mouse for $77.99 (Save $52)</li><li>Levoit Core 200S Air Purifier for $79.98 (Save $10.01)</li><li>Bissell Power Fresh Steam Mop for $82.69 (Save $10)</li><li>Vornado AVH10 Vortex Heater for $83.99 (Save $41)</li><li>Bose SoundLink Micro for $99 (Save $20)</li><li>Ninja BL660 Professional Countertop Blender for $99.99 (Save $20)</li><li>Apple AirPods Pro for $189.99 (Save $59.01)</li><li>Philips Premium Airfryer XXL for $199.95 (Save $136 to $150)</li><li>Amazon Fire TV Omni Series 4K UHD Smart TV from $299.99 (Save $110 to $350)</li><li>iRobot Roomba i3 Wi-Fi Connected Robot Vacuum for $299.99 (Save $50)</li><li>Apple Watch Series 7 GPS + Cellular from $449 (Save $39.95 to $249.01)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals you can get today</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}