{"date": "2021-12-22 19:01:53.370000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_2tmwv3um&amp;referenceId=tag:reuters.com,2021:newsml_OVF94JXJF_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_2tmwv3um&amp;referenceId=tag:reuters.com,2021:newsml_OVF94JXJF_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Amazon, Meta, Twitter and Pinterest all said on Tuesday they will not send teams to the Consumer Electronics Show in Las Vegas next month due to concerns about the spread of COVID. Flora Bradley-Watson reports.<br/>Short Link: <a href=\"https://refini.tv/3qh6rAV\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3qh6rAV</a><br/><br/>Video Transcript:<br/><br/>Key names in Big Tech are pulling out of next month's Consumer Electronics Show due to concerns about COVID-19. Amazon, Meta, Twitter, and Pinterest all announced on Tuesday they would not send teams to the event in Las Vegas. CES serves as an annual showcase of new trends and gadgets in the technology industry. It typically attracts more than 180,000 people from around the world. Both Twitter and Facebook said they are now exploring virtual opportunities, while Amazon did not immediately respond to a request for comment. The show's sponsor T-Mobile said the vast majority of its contingent would no longer attend in person. Despite the absences, the Consumer Technology Association says the show will go ahead. It added that health precautions will be taken, including vaccination requirements, masking, and the availability of COVID-19 tests. Alphabet, Sony Electronics, General Motors, and Qualcomm are currently still planning to send representatives.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}