{"date": "2021-05-27 07:04:39+00:00", "ticker": "AVV", "mrkt_info": {"open": 3328.0, "close": 3448.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE:</strong> AVEVA, a global leader in industrial software, driving digital transformation and sustainability, today announced its results for the year ended 31 March 2021 (FY21).  The results showed that AVEVA had made strategic, financial, and operational progress in the face of the pandemic. </p>\n<p>The last year proved transformational for AVEVA.  The Group was quick to react to the COVID crisis, rapidly moving employees to remote working and conducting business transactions virtually.  Evolving how it operated it demonstrated the resilience and strength of both the business and its relationships with customers. Today, AVEVA is a stronger and better positioned business, with a more diversified customer base.  It has a fundamental role to play to in supporting customers’ energy transition and environmental efficiency journeys.</p>\n<p>Alongside the successful navigation of the global pandemic, AVEVA completed the transformational $5bn acquisition of OSIsoft in March 2021. This acquisition established AVEVA as a clear global leader bringing together industrial software applications with the market leading industrial data platform.</p>\n<p><strong>Industrial Digitalisation Driving Significant Growth as well Sustainability</strong></p>\n<p>The ongoing digitalisation of the industrial world continues to be a fundamental demand driver for AVEVA’s software.  Strong Subscription growth continued, and the Group also delivered Software as a Service (SaaS) to customers at increasing scale.  Despite the challenging macro-economic environment, AVEVA continued to invest in its future growth by increasing investment in areas of its world class technology and software, such as AI and Cloud.</p>\n<p>While digital transformation remains at the core of customers’ decisions to adopt AVEVA’s solutions, the company is also making a strong contribution to sustainability through its products. For example,  the remote deployment of AVEVA Unified Operations Centre enabled Saudi Aramco to monitor emissions and optimise energy usage; while Neste, the world’s leading producer of renewable diesel and sustainable aviation fuel, used AVEVA’s Unified Supply Chain to drive collaboration between its remote teams, boosting efficiency. Several of AVEVA’s EPC customers used AVEVA<sup>TM</sup> Unified Engineering to help pioneer hydrogen production designs while other engineering companies use our software for offshore windfarms.</p>\n<p><strong>Strong Customer Business Strengthens AVEVA’s Market Leadership</strong></p>\n<p>Whilst the pandemic had a direct impact on planned capital projects being postponed, demand shift from 3D design software to project execution software grew:</p>\n<ul class=\"bulleted-list arrowlist\">\n<li><strong>Engineering,</strong> which contributed 42% of revenue during the year, saw significant contract wins with EPC’s such as Wood, Worley, and Petrofac. Likewise, demand shift to plant operations led to an increase in orders from owner operators managing engineering information as the core of the digitalization strategy within their existing plant facilities. There were a number of significant wins including with Shell and BHP Group, while we also had an increase in orders from the Power End market with significant contract wins from companies including EDF.</li>\n<li><strong>Monitoring &amp; Control</strong> represented 32% of AVEVA’s total revenue as customers continued to focus on operations efficiency, remote operations, and collaboration. AVEVA also saw strength in mid-stream Oil &amp; Gas with as a result, there were several O&amp;G wins including from SoCalGas. In other sectors AVEVA also achieved significant order wins from customers including BHP Group.</li>\n<li><strong>Asset Performance Management</strong> represented 14% of total revenue with AVEVA winning its first mining customer in APM and continued a substantial global roll out with an Energy major.</li>\n<li><strong>Planning &amp; Operations</strong> represented 12% of total revenue with growth supported by sales of Supply Chain planning solutions to help customers in the Energy sector operate efficiently in the context of the disrupted market. There was also growth in the Food &amp; Beverage and Metals and Mining sectors for Manufacturing Execution software.</li>\n</ul>\n<p>Commenting on the results, Peter Herweck, CEO of AVEVA Group plc said, “Through 2021 we both helped our industrial customers to successfully navigate the short-term challenges of the pandemic whilst also creating innovative solutions to achieve their digitalisation goals. The acquisition of OSIsoft brought a real sense of excitement from our employees and customers and our conversation is now focused as the recognition of the power and value of the combined products sets become apparent.”</p>\n<p>“It’s clear that moving forward, AVEVA has a strong springboard for the future long-term growth of the business. As we look ahead, we do so in the knowledge that AVEVA is optimally positioned to support customers in their digitalisation journey and in creating more sustainable and resilient businesses,” Herweck concluded.</p>\n<p>This news release contains a summary of our results, for the full results, please see our investor relations website at <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a>. </p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}