{"date": "2022-02-23 14:00:27.540000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Kyndryl achieves Premier Global Alliance Partner status</h2>\n<h2 class=\"xn-hedline\">Together Kyndryl and AWS will establish Cloud Center of Excellence to develop joint solutions including services for mission critical infrastructure, mainframe, network and edge computing services, and ERP</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">NEW YORK, Feb. 23, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">NEW YORK</span>, <span class=\"xn-chron\">Feb. 23, 2022</span> /PRNewswire/ --<b> </b>Kyndryl (NYSE: KD), the world's largest IT infrastructure services provider, today announced a strategic partnership with Amazon Web Services Inc. (AWS) that brings together their respective expertise, skills, and global resources to help customers transform their businesses through Industry-focused enterprise cloud services and solutions. In addition to collaborating with AWS to provide solutions for Kyndryl's top enterprise customers around the world, Kyndryl plans to build out their own internal infrastructure in the cloud, leveraging AWS as a preferred cloud provider. As part of this announcement, AWS will become a Kyndryl Premier Global Alliance Partner.</p>\n<p>Kyndryl and AWS will invest in building a global AWS practice with the skills, services, and expertise to deliver a best-in-class customer experience. As part of the global partnership, Kyndryl will establish an AWS Cloud Center of Excellence (CCOE) to offer state-of-the-art customer solutions and services for supporting mission critical infrastructure, next generation technologies and modernizing applications and workflows across industries. The global AWS CCOE will enable Kyndryl services professionals across the globe to optimize their customers' migration journeys with AWS, tapping into the availability, reliability, and security of the world's leading cloud.</p>\n<p>To offer differentiated value to customers, Kyndryl and AWS today announced they are developing an accelerator for VMware Cloud on AWS leveraging their deep partnerships with VMware. Through the accelerator, skilled practitioners from AWS, VMware, and Kyndryl will deliver deep expertise and custom solutions to help the world's largest enterprises combine their existing VMware investments with AWS services. Given Kyndryl's high concentration of customers running VMware on premises, this provides an expedited path to VMware Cloud on AWS and helps organizations to run their mission-critical workloads in the cloud. </p>\n<p>As a Premier Global Alliance Partner and MSP-certified member of the AWS Partner Network (APN), Kyndryl has invested heavily in developing AWS competencies and has built an experienced team of AWS-certified services professionals through the Kyndryl Academy for AWS. Kyndryl and AWS will further invest in the education of more than 10,000 Kyndryl professionals by the end of 2022, upskilling them in a wide range of AWS skills to support its customers' rapid adoption of cloud services and solutions around the globe. </p>\n<p>\"Our ability to freely explore and unleash the combined benefits of AWS cloud services with Kyndryl's deep industry-specific managed services and expertise will provide an unprecedented level of knowledge and innovation,\" said <span class=\"xn-person\">Martin Schroeter</span>, Chairman and CEO of Kyndryl. \"Together, we will invest in enhancing Kyndryl's expertise in AWS to help companies modernize, innovate, and compete.\"</p>\n<p>\"Organizations everywhere are choosing AWS to transform their businesses and tackle some of the world's most difficult challenges – from putting automated vehicles on our streets, to improving healthcare outcomes, to addressing climate change. By combining forces with Kyndryl, we are helping customers of all sizes to modernize faster than ever before, grow their businesses, and transform what's possible,\" said <span class=\"xn-person\">Adam Selipsky</span>, Chief Executive Officer at AWS. \"Together, we are committed to educating, empowering, and enabling thousands of AWS certified practitioners and developing joint solutions that will accelerate customers' journeys and help them innovate on the world's leading cloud.\"</p>\n<p>\"VMware, AWS, and Kyndryl bring together a unique combination of customer focus, technology innovation, and industry leadership that, together, will accelerate customers' application modernization and cloud initiatives,\" said <span class=\"xn-person\">Raghu Raghuram</span>, Chief Executive Officer at VMware. \"AWS is VMware's preferred public cloud partner for vSphere workloads, and Kyndryl and VMware have a partnership built on more than two decades of collaboration. Together, our companies will help customers successfully navigate complex cloud journeys that lead to greater digital innovation while retaining enterprise control.\"</p>\n<p>For more information about the Kyndryl and AWS alliance please visit: <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3452730-1&amp;h=3280747849&amp;u=https%3A%2F%2Fwww.kyndryl.com%2Fus%2Fen%2Fabout-us%2Falliances&amp;a=https%3A%2F%2Fwww.kyndryl.com%2Fus%2Fen%2Fabout-us%2Falliances\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.kyndryl.com/us/en/about-us/alliances</a></p>\n<p><b>About Kyndryl <br/></b>Kyndryl (NYSE: KD) is the world's largest IT infrastructure services provider. The company designs, builds, manages, and modernizes the complex, mission-critical information systems that the world depends on every day. Kyndryl's nearly 90,000 employees serve over 4,000 customers in more than 60 countries around the world, including 75 percent of the Fortune 100. For more information, visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3452730-1&amp;h=1343996370&amp;u=http%3A%2F%2Fwww.kyndryl.com%2F&amp;a=www.kyndryl.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.kyndryl.com</a>.</p>\n<p> </p>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=NY71399&amp;sd=2022-02-23\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1OWTcxMzk5JnNkPTIwMjItMDItMjM=&amp;key=271b706a610a86e223bac292d905cd2d31430e10067ebb6124919fd64c9f05494f90f28d99cfcdaebeededb1e151f7dc691e93289e6100bd9f88e7a61020bbb8\"/></div></div> View original content:<a href=\"https://www.prnewswire.com/news-releases/kyndryl-and-aws-establish-strategic-partnership-to-accelerate-cloud-adoption-and-innovation-for-customers-301488471.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/kyndryl-and-aws-establish-strategic-partnership-to-accelerate-cloud-adoption-and-innovation-for-customers-301488471.html</a><p></p>\n<p>SOURCE  Kyndryl</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: KYNDRYL-AWS-Partnrshp</p></div>"}