{"date": "2021-12-28 16:29:39+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3393.39, "close": 3384.02}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Changes 'bans' to 'bags' in paragraph 8</p><p class=\"tr-by\">By Valerie Volcovici</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LOS ANGELES, Dec 28 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Big retailers are breaking California law and misleading consumers by selling plastic shopping bags bearing language and symbols that falsely suggest the bags can be recycled, a state-appointed commission alleged this month.</p><p>The group has asked California to force retailers to strip these bags of the ubiquitous \"chasing arrows\" logo and the words \"recycle\" and \"recyclable,\" Reuters has learned. If successful, that move could make the sacks ineligible for sale at checkout counters throughout America's most populous state. The commission also is taking aim at padded envelopes and packaging materials used for home delivery, and plastic films on some grocery items.</p><p>In a Dec. 3 letter viewed by Reuters, the California Statewide Commission on Recycling Markets and Curbside Recycling asked the California attorney general and regulator CalRecycle to crack down on what it claims is illegal labeling that's undermining the state's efforts to tackle plastic pollution.</p><p>Fooled by recycling symbols, Californians mistakenly are tossing this material into curbside collection programs that don't accept it, the commission said. That's driving up costs for recycling companies to fish the stuff out of the waste stream and fix equipment jammed by these soft plastics.</p><p>The complaint did not single out any retailers by name. The California Grocers Association (CGA) said it does not believe current recycling labels on reusable bags are misleading. CGA spokesperson Nate Rose said the bags meet the law's certification guidelines - including requirements that they be made of a minimum of 40% post-consumer recycled material and be durable enough to be used 125 times. </p><p>In an interview with Reuters, Heidi Sanborn, chair of the recycling commission, said it's not surprising that Californians are confused. </p><p>\"It is a Wild West of recycling labeling in California and there is no sheriff in town,\" said Sanborn, founding director of the National Stewardship Action Council, which works to cut product waste. The 16-member commission is comprised of waste industry executives, environmental advocates and public officials. It is tasked with advising CalRecycle and providing recommendations for improving the state's recycling system.</p><p>The commission's complaint comes as California grapples with what critics say has become a loophole in the state's 2017 ban on single-use shopping ba<span class=\"tr-strong\">g</span>s. That legislation, the first of its kind in the nation, came amid fierce opposition from the plastics industry, which spent nearly $6 million in a failed bid to stop it, according to state lobbying records. </p><p>A compromise provision in the measure allowed retailers to sell reusable plastic bags for a minimum of 10 cents each. The legislation also states the bags must be capable of being recycled in California.</p><p>It's that provision that has the recycling commission clamoring for enforcement by the state. In practice, converting soft plastics such a shopping bags and packaging films into new products is so cost-prohibitive that recyclers say no market exists for this material. Thus, these items are not widely accepted in curbside recycling programs across California. For that reason, the commission says, they should not be labeled \"recyclable<span class=\"tr-strong\">.\" </span></p><p>Similarly, the commission alleges that some retailers, amid rising public pressure to reduce waste, are deceiving consumers with language stating that their bags and plastic films can be returned to participating stores for recycling. </p><p>Four commission members told Reuters that retailers have not shown evidence that these programs are, in fact, recycling this material. In-store recycling bins, they said, tend to attract a jumble of trash that ends up in landfills. </p><p>Among retailers touting bag-return programs is CVS Pharmacy, the drug store unit of Rhode Island-based CVS Health Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CVS.N\" data-type=\"ric\" data-ric=\"CVS.N\" translate=\"no\" dir=\"ltr\">CVS.N</a>. The chain sells reusable plastic sacks bearing the chasing arrows logo and fine print instructing consumers to \"recycle this bag in participating stores.\"</p><p>    CVS Health spokesperson Eva Pereira did not respond to questions about how many of the company's more than 1,100 California stores participate. She said CVS hires outside firms to handle its store take-back recycling initiatives \"and expects that those partners' processes are compliant with applicable law.\" One of the company's main recycling solutions vendors, g2 revolution, did not respond to requests for comment.</p><p>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, too, promotes a plastics take-back program in California. Spokesperson Saige Kolpack said the Seattle-based retailer is \"making rapid progress\" in reducing its use of single-use plastic packaging. When asked by Reuters to provide evidence that waste returned through its California initiative is being recycled, she said: \"We don't have anything to share for that question.\"</p><p>Walmart spokesperson Lauren Willis said the bags the retail giant sells in California are designed to meet the requirements of the state's plastic bag law and \"are 100% recyclable through our in-store collection program along with other polyethylene film items that aren’t typically curbside recyclable.\" She did not respond to requests to provide documentation on how materials collected this way are recycled or how many of its California locations participate. Walmart has 311 retail units in California, including supercenters, neighborhood markets and Sam's Club warehouse stores.</p><p>Lance Klug, a spokesperson for CalRecycle, said the regulator supports ending \"deceptive\" labeling on plastic bags and packaging films. But he said enforcement lies with local district attorneys and California Attorney General Rob Bonta.</p><p>Bonta's office said it is committed to enforcing state environmental laws, but said it could not comment on a \"potential or ongoing investigation.\" </p><p>If the state follows the advice of the commission, it could effectively end the sale of these bags and films in California, or force retailers to make them truly recyclable, said commission member Jan Dell, founder of environmental group The Last Beach Cleanup.  </p><p>\"This will destroy their ability to claim that their products are recyclable,\" she said.</p><p>    </p><p>RECYCLING MENACE</p><p>    Globally, less than 10% of all the plastic ever produced has been recycled, according to the United Nations, because it's cheaper to bury or burn it.</p><p>This waste is clogging landfills, despoiling the oceans and harming wildlife. Governments worldwide have responded with polluter-pays laws and bans on single-use plastic such as drinking straws and shopping bags.</p><p>In California, the often thicker plastic bags now sold by retailers are supposed to be used dozens of times. In reality, environmentalists say, many consumers quickly toss them in the garbage. Worse yet, they said, those that end up in recycling bins are complicating the work of recycling firms.</p><p>Recyclers have to devote time and labor plucking bags out of the waste stream lest they damage their sorting machinery, said Pete Keller, vice president at Republic Services Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RSG.N\" data-type=\"ric\" data-ric=\"RSG.N\" translate=\"no\" dir=\"ltr\">RSG.N</a>, one of the largest U.S. waste managers. Errant bags frequently wrap around the rotating discs that separate waste by size and weight, he said, forcing recyclers to shut the equipment down.</p><p>    Keller said he supports stripping recycling language from these bags as part of a wider education effort to get Californians to stop throwing them into their curbside bins.</p><p>The plastic industry said that would be a mistake as more would end up as garbage. Some labels direct consumers to a website called How2Recycle, which gives instructions for recycling through store programs, according to Zachary Taylor, director of the American Recyclable Plastic Bag Alliance. The alliance is part of the Plastics Industry Association lobbying group that led the opposition to California's bag ban.</p><p>     \"Removing state-mandated labeling...will drive more plastic to landfills,\" Taylor said.</p><p>     It remains to be seen whether California responds to the recycling commission and forces retailers to prove their reusable bags are truly recyclable. </p><p>    Green groups say the state needs to begin cracking down now in preparation for an even bigger enforcement task ahead. In October, Governor Gavin Newsom signed into law a new environmental \"truth in labeling\" measure for all products and packaging sold in California - not just shopping bags. That legislation makes it illegal for companies to use the word \"recyclable\" or the chasing arrows symbol on items that aren't recyclable in the real world.</p><p>That legislation goes into effect in June 2025. Between now and then, regulator CalRecycle must come up with a list of plastics which it deems recyclable in curbside programs.</p><p>    </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Valerie Volcovici in Washington; editing by Rich Valdmanis and Marla Dickerson)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:valerie.volcovici@thomsonreuters.com\" data-type=\"email\" translate=\"no\">valerie.volcovici@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-CALIFORNIA/RECYCLING-PLASTICS (CORRECTED, EXCLUSIVE)</p></div>"}