{"date": "2021-05-24 10:00:40.400000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3275.0, "close": 3416.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article AVEVA, a global firm in industrial software, driving digital transformation and sustainability, has announced that it has been positioned by Gartner as a Leader in the 2021 Magic Quadrant for Manufacturing Execution Systems (MES) for its A...</p><p>AVEVA, a global firm in industrial software, driving digital transformation and sustainability, has announced that it has been positioned by Gartner as a Leader in the 2021 Magic Quadrant for Manufacturing Execution Systems (MES) for its AVEVA Manufacturing Execution System. The evaluation was based on specific criteria that analysed the company's overall completeness of vision and ability to execute.</p></div><div class=\"tr-npp-body\"><p>\"The last few years have been tumultuous for manufacturers, with demand swings, supply chain disruptions as a result of Covid-19 and increasing costs. Emerging post pandemic business imperatives include agility to meet customer demand, supply chain resilience, increased productivity, and sustainability. The optimisation and integration of both business planning and manufacturing execution into a single digital system represents the next step for manufacturers for growth and profitability. Manufacturing systems that enable a value chain, which is demand driven and dynamically optimised, are much needed and here to stay,\" commented Kim Custeau, Senior Vice President, APM and MES, AVEVA.</p><p>According to Gartner, \"Global MES solutions are a foundational building block of smart manufacturing strategies and digital business for manufacturers. Disruptive technologies and new providers are shaking things up. Supply chain technology leaders should use this research to select appropriate vendors and solutions.\"</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}