{"date": "2021-12-17 21:16:45+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3377.42, "close": 3341.58}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">S&amp;P 500, Dow lose &gt;1%; Nasdaq ~flat; small caps rally </li><li class=\"tr-summaryitem\">All 11 S&amp;P sectors end lower; financials weakest </li><li class=\"tr-summaryitem\">Dollar up; gold ~flat; crude, bitcoin drop</li><li class=\"tr-summaryitem\">U.S. 10-Year Treasury yield slips to ~1.41%</li></ul><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Dec 17</span><span class=\"tr-dl-sep\"> - </span>Welcome to the home for real-time coverage of markets brought to you by Reuters reporters. You can share your thoughts with us at <a href=\"mailto:markets.research@thomsonreuters.com\" data-type=\"email\" translate=\"no\">markets.research@thomsonreuters.com</a></p><p><br/></p><p><br/></p><p>WALL STREET ENDS DOWNER WEEK SINGING RATE HIKE BLUES (1605 EST/2105 GMT)</p><p>Wall Street skulked into the weekend with a downbeat/mixed close as investors, facing an absence of any clear market catalysts, continued to ruminate over the likelihood of the Fed hiking interest rates in the coming year to combat inflation. <a href=\"reuters://REALTIME/verb=Headlines/ric=.N\" data-type=\"newsExpression\" data-expression=\".N\" translate=\"no\" dir=\"ltr\">.N</a></p><p>The S&amp;P 500 and the Dow ended in the red, while gains in Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Broadcom <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AVGO.O\" data-type=\"ric\" data-ric=\"AVGO.O\" translate=\"no\" dir=\"ltr\">AVGO.O</a> and Tesla Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a> helped keep the Nasdaq's losses nominal.   </p><p>From last Friday's closing levels, the S&amp;P 500 and the Nasdaq clocked their third loss in the last four weeks, while the blue-chip Dow Industrials notched its fourth weekly drop in its last five.</p><p>The clear outperformers of the day were small caps. The Russell 2000 <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.RUT\" data-type=\"ric\" data-ric=\".RUT\" translate=\"no\" dir=\"ltr\">.RUT</a> gained 1% on the day, but joined its larger-cap indexes in the red for the week, its fifth weekly loss in the last six.   </p><p>Beyond a smattering of generally agreeable economic indicators, this was a two-issue week for market participants: a widely expected hawkish pivot from the Fed <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2T20Y1\" data-type=\"storyId\" data-story-id=\"nL1N2T20Y1\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> mixed with unknowns associated with the rapidly shifting pandemic landscape due to the suddenly dominant Omicron variant. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2T22AH\" data-type=\"storyId\" data-story-id=\"nL8N2T22AH\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Perhaps counterintuitively, airlines and cruise operators posted solid gains on Friday. The S&amp;P 1500 Airline index <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPCOMAIR\" data-type=\"ric\" data-ric=\".SPCOMAIR\" translate=\"no\" dir=\"ltr\">.SPCOMAIR</a> advanced 1.6%, while Royal Caribbean <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RCL.N\" data-type=\"ric\" data-ric=\"RCL.N\" translate=\"no\" dir=\"ltr\">RCL.N</a> Norwegian Cruise Lines <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NCLH.K\" data-type=\"ric\" data-ric=\"NCLH.K\" translate=\"no\" dir=\"ltr\">NCLH.K</a> and Carnival Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CCL.N\" data-type=\"ric\" data-ric=\"CCL.N\" translate=\"no\" dir=\"ltr\">CCL.N</a> jumped between 4% and 5%.</p><p>Among other winners and losers of the day, Oracle <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ORCL.N\" data-type=\"ric\" data-ric=\"ORCL.N\" translate=\"no\" dir=\"ltr\">ORCL.N</a> dropped 6.4% following a Wall Street Journal report that it was in talks to buy medical records company Cerner <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CERN.O\" data-type=\"ric\" data-ric=\"CERN.O\" translate=\"no\" dir=\"ltr\">CERN.O</a> <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2T14XR\" data-type=\"storyId\" data-story-id=\"nL4N2T14XR\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>, while Fedex <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FDX.N\" data-type=\"ric\" data-ric=\"FDX.N\" translate=\"no\" dir=\"ltr\">FDX.N</a> gained 4.9% after reinstating its FY 2022 guidance. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2T135X\" data-type=\"storyId\" data-story-id=\"nL1N2T135X\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>'Triple Witching,' or the quarterly simultaneous expiration of stock options, stock index futures, and stock index options contracts, added a touch of spice to the stew.</p><p>Here's your closing snapshot:</p><p><div class=\"tr-resource-ref\" id=\"g56ac24ba-9dc6-4ad9-bdb8-a95615d7691e\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/USA-STOCKS/myvmnarzjpr/closer.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9VU0EtU1RPQ0tTL215dm1uYXJ6anByL2Nsb3Nlci5wbmc=&amp;storyId=urn:newsml:reuters.com:20211217:nL1N2T23A4:3&amp;key=6fd352483b6d39c9c2c9d68b21e7fffa0dd09cedbf7447ed4f4a1c84bbe5e6e5860c398e4aa983c792a89392aacdfc9dbc62e1e0013984dd04af135faff2ee7f\"/></div></div></div></p><p>(Stephen Culp)</p><p>*****</p><p><br/></p><p>INDIVIDUAL INVESTORS ASSESS SMALL-CAP SLIDE (1357 EST/1857 GMT)</p><p>As part of the most recent American Association of Individual Investors (AAII) Sentiment Survey <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2T21G8\" data-type=\"storyId\" data-story-id=\"nL1N2T21G8\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>, AAII asked its members their assessment of the weakness that small-cap stocks have experienced over the past four weeks. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2T10YT\" data-type=\"storyId\" data-story-id=\"nL1N2T10YT\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>AAII reported that three out of 10 respondents (30%) said that they attributed their poor performance to a volatile and inflationary market, with small-cap stocks being more sensitive to macroeconomic trends.  </p><p>Conversely, 24% of respondents had \"a neutral or unfazed point of view,\" with respondents saying they don’t invest in small-cap stocks.</p><p>Meanwhile, about 15% of respondents mentioned seeking a safer investment in large-cap stocks, saying larger companies can absorb the higher costs and protect their profits better.</p><p>Against this, 14% of respondents attributed small-cap weakness to ongoing factors of the coronavirus, such as the new Omicron variant.</p><p>Lastly, 11% of respondents had a positive outlook on the situation, indicating that this could be a buying opportunity for those who invest in small-cap stocks.</p><p>Here are a couple of quotes from investors on the matter:</p><p>“It’s difficult to compete with larger companies that can absorb the increased salaries (competition for skilled workers) as well as financing costs. The supply chain has a negative impact on both types of companies, but again most large caps can absorb this better than small caps.\"</p><p>“It’s because of year-end selling and correction; it’s an opportunity to buy quality small-cap value.”</p><p> </p><p>(Terence Gabriel)</p><p>*****</p><p><br/></p><p>HOLIDAY AIR TRAFFIC SOARS ABOVE LAST YEAR'S LEVEL, BUT FLYING UNDER PRE-COVID 'NORMAL' (1238 EST/1738 GMT)</p><p>'Tis the season, once again, for candy canes, egg nog, family bickering and queueing up at airport security in your socks.</p><p>The Transportation Security Administration's (TSA) passenger throughput reading has emerged as one of the pandemic's most useful and valued indicators, providing up-to-the-minute data on commercial air travel, and by extension, the pace at which economic activity is returning to pre-COVID levels.</p><p>With holiday travel starting to peak, passenger traffic at airport security checkpoints on Thursday, December 16 was 2.06 million.</p><p>The good news is that represents a healthy 143.5% increase over the corresponding weekday of 2020.</p><p>The bad news is throughput remains 16.5% shy of the same Thursday in 2019, before COVID struck in earnest, bringing the global economy - and mobility - to a screeching halt.</p><p>That pandemic, with its succession of variants, has been a rude guest, long overstaying its welcome and delaying a full recovery from the crisis.</p><p>Omicron, the new dominant variant, has kept scientists and policy makers on their toes, with social distancing, testing and mask mandates in constant flux. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2T24HN\" data-type=\"storyId\" data-story-id=\"nL8N2T24HN\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>As illustrated by the graphic below, as air travel struggles to regain altitude, airline stocks have suffered.</p><p>The S&amp;P 1500 Airline index <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPCOMAIR\" data-type=\"ric\" data-ric=\".SPCOMAIR\" translate=\"no\" dir=\"ltr\">.SPCOMAIR</a> is down nearly 7% year-to-date, and at current levels has lost nearly a third of its value since its early April peak.</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g70381ec8-3c1e-4ca2-9b8f-399b5e68ad92\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/USA-STOCKS/dwpkrzmbkvm/tsa.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9VU0EtU1RPQ0tTL2R3cGtyem1ia3ZtL3RzYS5wbmc=&amp;storyId=urn:newsml:reuters.com:20211217:nL1N2T23A4:3&amp;key=1949ff87672152b44faa06db801a1f7614f5313f954c8a5ac01a3dc580f51f2e5f03e1fb5d6e0a9169147b672d7ce92da8611f8716d13c36e340f3ed2858c5b4\"/></div></div></div></p><p><br/></p><p>(Stephen Culp)</p><p>*****</p><p><br/></p><p>RESERVATIONS ABOUT THE FEDERAL RESERVE PLANS (1210 EST/1710 GMT)</p><p>As the dust settled further on Wednesday's Federal Reserve announcements, some economists were starting voice concerns. </p><p>At Mizuho Securities USA, US Chief Economist Steven Ricchiuto, was fairly direct. </p><p>\"Given our less constructive view on the macro outlook, we believe following through on the tightening suggested would be a mistake!\" Ricchiuto wrote.</p><p>The Fed, the economist writes, wants to defend its inflation fighting credibility as it faces surging prices triggered by the government’s virus mitigation strategy, and stimulus provided to ease the burden of lockdowns.</p><p>But this suggests to Ricchiuto that \"there are unknown and atypical dynamics at work in the economy\" and that policy based on FOMC forecasts \"has a poor track record even in normal times.\" So he says the high degree of uncertainty in the economy  could lead to a significant policy mistake.</p><p>While Ethan Harris, global economist at BofA, doesn't seem to be complaining about the tightening he sounds unimpressed with the plan's details. </p><p>Harris describes what the Fed is doing as a pivot \"from ultra-dovish to super-dovish\" and looks at how far they need to go. \"In past cycles, the Fed would already have been raising rates. In the Fed's new regime, however, they don't hike until they hit their goals; hence the funds rate will be zero at a time when normally it would be approaching neutral,\" wrote Harris. </p><p>\"This creates a challenging end game where they try to move to neutral or higher without causing a major shock to the economy,\" he wrote. </p><p>(Sinéad Carew)</p><p>      ***** </p><p><br/></p><p>MOSTLY STABLE YEAR AHEAD FOR U.S. PUBLIC FINANCE - MOODY'S (1146 EST/1646 GMT)</p><p>Most U.S. public finance sectors have a stable outlook for 2022, while a few are positive and only one sector -- non-profit and public healthcare -- has a negative outlook, Moody's Investors Service said this week.</p><p>Tax revenue growth in the 0% to 5% range and massive federal aid were drivers for the state sector's stable outlook. Local governments, with total revenue expected to climb 1% to 3% and their own share of federal cash related to the pandemic and infrastructure, were also deemed stable by the credit rating agency.</p><p>Non-profit healthcare, on the other hand, is facing a 2% to 9% decline in operating cash flow as expenses grow mainly due to staffing shortages increasing labor costs. </p><p>     \"Other factors pushing expenses higher are supply chain disruptions, increased drug costs, higher inflation and increased investment in cybersecurity,\" Moody's said in a report.</p><p>With increased demand anticipated next year, the airports, toll roads, and public ports sectors have positive outlooks.</p><p>Other sectors with stable outlooks for 2022 include higher education, mass transit, and public power.</p><p>   (Karen Pierog)</p><p>***** </p><p><br/></p><p>LOW INCOME EARNERS BRUSH OFF GREAT INFLATION EXPECTATIONS AS WAGES GROW (1130 EST/1530 GMT)</p><p>Lower income households are expecting to spend more even as they anticipate higher inflation, supported by wage growth as a strong labor demand continues to pull people into the jobs market at higher wages.</p><p>Near-term annual inflation expectations have climbed to an all-time high of 6% in November 2021, while spending intentions have also jumped to an record year-on-year high of 5.7%, driven largely by a 9.2% jump among the lowest income earners, according to NY Fed’s Survey of Consumer Expectations.</p><p>Recent rise in wages among this income group could support these spending aims. When economists at Morgan Stanley looked at COVID-CPI for low income households it was running at an annual 5.0% pace (August-October 2021 average) compared to average hourly earnings for lower-wage industries running at 7.4% year-on-year, putting annual real wage growth for lower-wage earners at 2.4%.</p><p>\"The holiday shopping season appears poised to be a record-breaking one, and lower-income cohorts seem to be operating with relatively better buying power,\" they write.</p><p>Moving into 2022, Morgan Stanley expects energy prices to ease after peaking in November and supply chain disruptions to lessen their hold on inflationary pressures. </p><p>This, coupled with continued job and wage growth backed by a strong labor demand, should in turn boost consumer confidence. </p><p>That is, unless Omicron throws a wrench in these plans.</p><p><br/></p><p>(Bansari Mayur Kamdar)</p><p>*****</p><p><br/></p><p><br/></p><p>BULLS SCATTER (1043 EST/1543 GMT)</p><p>The percentage of investors with a bullish short-term outlook for the U.S. stock market has slid to its lowest level in three months in the latest American Association of Individual Investors Sentiment Survey (AAII). With this, the number of investors describing their outlook for stocks as bearish rose to the upper end of its historical range.</p><p>AAII reported that bullish sentiment, or expectations that stock prices will rise over the next six months, fell 4.5 percentage points to 25.2%. This is the fourth consecutive week that bullish sentiment remains below the historical average of 38.0%. Bullish sentiment was last lower on September 16, 2021 (22.4%).</p><p>Bearish sentiment, or expectations that stock prices will fall over the next six months, gained by 8.8 percentage points to 39.3%. This is bearish sentiment’s fourth consecutive week above the historical average of 30.5%. </p><p>Neutral sentiment, or expectations that stock prices will stay essentially unchanged over the next six months, declined by 4.3 percentage points to 35.4%. This is the second consecutive week that neutral sentiment is above the historical average of 31.5%.</p><p>AAII noted that bullish sentiment is at an unusually low level. Historically, unusually low levels of optimism have been followed by better-than-average and better-than-median returns for the S&amp;P 500 index over the following six- and 12-month periods.</p><p>Additionally, AAII said that bearish sentiment is near the top end of its typical range, as noted above. The breakpoint between typical and unusually high levels of pessimism is currently 40.1%. </p><p>With these changes, the bull-bear spread fell to -14.1 from -0.8 last week <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SV1K1\" data-type=\"storyId\" data-story-id=\"nL1N2SV1K1\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g739ad426-6400-40f1-be09-72846454c153\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/buzz/znpnexgqavl/AAII12172021.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9idXp6L3pucG5leGdxYXZsL0FBSUkxMjE3MjAyMS5wbmc=&amp;storyId=urn:newsml:reuters.com:20211217:nL1N2T23A4:3&amp;key=329755560484907b35365047b0f0c4dbf5bfbe922bfa6958bce0abdc22eecb297409a924591229878020fda4014c84fb3c6f3afc6614771e1499cf7b5fe45fe8\"/></div></div></div></p><p><br/></p><p>(Terence Gabriel)</p><p>*****</p><p><br/></p><p>WALL STREET WEARS RED AGAIN (0955 EST/1455 GMT)</p><p>Wall Street slid into the red right out of the starting gate on Friday as investors, with little or no catalysts to chew on, continued to acclimate themselves to the new normal of pending rate hikes and tapering asset purchases from the Federal Reserve.</p><p>All three major U.S. stock indexes are sharply lower, with energy <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPNY\" data-type=\"ric\" data-ric=\".SPNY\" translate=\"no\" dir=\"ltr\">.SPNY</a>, financials <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPSY\" data-type=\"ric\" data-ric=\".SPSY\" translate=\"no\" dir=\"ltr\">.SPSY</a> and materials <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPLRCM\" data-type=\"ric\" data-ric=\".SPLRCM\" translate=\"no\" dir=\"ltr\">.SPLRCM</a> all vying for the title of biggest loser.</p><p>Indeed, in a change from the previous trading day, value stocks <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.IVX\" data-type=\"ric\" data-ric=\".IVX\" translate=\"no\" dir=\"ltr\">.IVX</a> are faring worse than growth <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.IGX\" data-type=\"ric\" data-ric=\".IGX\" translate=\"no\" dir=\"ltr\">.IGX</a>.</p><p>The S&amp;P 500 and the Nasdaq are on track for their third weekly decline over the last four, and the Dow has set a course for its fourth losing week in the last five.</p><p>New York Federal Reserve President John Williams, in an interview on CNBC, parroted Fed Chair Jerome Powell's Wednesday remarks that inflation and other economic data will be closely watched in the coming months for clues regarding the Fed's taper timeline and rate hikes. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nS0N2PY02Z\" data-type=\"storyId\" data-story-id=\"nS0N2PY02Z\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>The word 'Omicron' remains on everyone's lips as the nature and extent of this latest COVID variant is causing scientists to reconsider their 2022 expectations for the pandemic. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2T12OH\" data-type=\"storyId\" data-story-id=\"nL1N2T12OH\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Today is 'Triple Witching' (nee 'Quadruple Witching' until OneChicago ceased offering single stock futures in September 2020), which is the simultaneous expiration of stock options, stock index futures, and stock index options contracts which takes place once every quarter.</p><p>Triple witching can cause an increase in trading volume and/or volatility.</p><p>Here is your opening snapshot:</p><p><div class=\"tr-resource-ref\" id=\"d71f5a1d-e6c7-4880-a6ab-9c57dbc2ac73\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/USA-STOCKS/xmpjonwwevr/opener.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9VU0EtU1RPQ0tTL3htcGpvbnd3ZXZyL29wZW5lci5wbmc=&amp;storyId=urn:newsml:reuters.com:20211217:nL1N2T23A4:3&amp;key=49311c63883a34116ece20b4f8ff0e2519ed93fda2c6171ab56c865739ab4128bc4a8049600958e6f437fb6a1aed223402b91cbf1f77af1e797724e58c092696\"/></div></div></div></p><p>(Stephen Culp)</p><p>*****</p><p><br/></p><p>S&amp;P 500: ON THIN ICE? (0900 EST/1400 GMT)</p><p>The S&amp;P 500 index <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPX\" data-type=\"ric\" data-ric=\".SPX\" translate=\"no\" dir=\"ltr\">.SPX</a> ended at a record high of 4,712.02 on December 10. It has since backed away from that level by only about 1%.</p><p>Meanwhile, however, the percentage of S&amp;P 500 stocks trading above their 50-day moving average (DMA) remains severely depressed relative to earlier in the year, when the SPX was much lower:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g310e355d-a0b9-451e-acdb-584f93e85e5a\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/buzz/dwvkrzmykpm/SPX12172021.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9idXp6L2R3dmtyem15a3BtL1NQWDEyMTcyMDIxLnBuZw==&amp;storyId=urn:newsml:reuters.com:20211217:nL1N2T23A4:3&amp;key=872bb40acc41e1fb4dfe412dfe49c9a2ed6c458b32a5a5ece7948c9bd7cfc8c5eac9e470ac2b84c25db4a82ef159804af5228be72d41eff20e6a82b552d6a17a\"/></div></div></div></p><p><br/></p><p>This measure's divergence vs the S&amp;P 500 has been a problem for quite some time. In April, it peaked at 92%. More recently, in mid-November it could only hit 74%. Currently, only around 54% of SPX stocks are trading above this closely followed intermediate-term moving average.</p><p>That said, recent sub-30% lows in this measure offer the potential that enough stocks within the benchmark index may have become sufficiently washed out, that there may be potential for a rotation away from the few tech titans driving the index, and a broader advance to take hold. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2T10YT\" data-type=\"storyId\" data-story-id=\"nL1N2T10YT\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>There were a number of lows from the late-spring to early-fall 2019 in the 27%-31% area. In September and October 2020 there were lows at 25% and 28%. More recently, in September and November this measure stabilized at 24% and 29%. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2T00T5\" data-type=\"storyId\" data-story-id=\"nL1N2T00T5\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>A push above the December high, at 63%, may lead to increasing momentum, and see this measure push up above 75%.</p><p>Conversely, a fall below this week's low, at 50%, may see downside pressure intensify, which may become increasingly difficult for the SPX to endure, especially if the recent lows give way.</p><p>Of note, in the severe S&amp;P 500 declines in late-2018 and early-2020, this measure bottomed very close to zero. </p><p>     </p><p>(Terence Gabriel)</p><p>*****   </p><p><br/></p><p>FOR FRIDAY'S LIVE MARKETS' POSTS PRIOR TO 0900 EST/1400 GMT - CLICK HERE: <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2T23LM\" data-type=\"storyId\" data-story-id=\"nL8N2T23LM\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Terence Gabriel is a Reuters market analyst. The views expressed are his own)</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: GLOBAL-STOCKS/</p></div>"}