{"date": "2022-01-04 22:49:06+00:00", "ticker": "III", "mrkt_info": {"open": 1503.5, "close": 1444.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- Consideration of Hybrid Subordinated Notes Offering\n\n     Enbridge Inc. (Enbridge or the Company) announced today that, subject\nto market and other conditions, it is considering an offering of hybrid\nsubordinated debt securities in Canada on a private placement basis in\nreliance upon exemptions from the prospectus requirements under applicable\nsecurities legislation.\n\n     If a successful offering is completed, the Company intends to use the\nnet proceeds of the offering to redeem its issued and outstanding\nCumulative Redeemable Minimum Rate Reset Preference Shares, Series 17 (TSX:\nENB.PF.I), in accordance with their terms, and pending such redemption, to\nrepay short-term indebtedness as well as for general corporate purposes.\n\n     This news release does not constitute a notice of redemption with\nrespect to the Cumulative Redeemable Minimum Rate Reset Preference Shares,\nSeries 17, nor does it constitute an offer to sell or the solicitation of\nan offer to buy the hybrid subordinated debt securities in any\njurisdiction. There is no certainty that Enbridge will ultimately complete\nthe offering being considered or as to the timing or terms on which an\noffering might be completed. The hybrid subordinated debt securities\nconsidered to be offered by the Company have not been approved or\ndisapproved by any regulatory authority. The hybrid subordinated debt\nsecurities have not been and will not be registered under the United States\nSecurities Act of 1933, as amended, or any state securities law, and may\nnot be offered or sold within the United States.\n\n     About Enbridge Inc.\n\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which owns approximately 1,766\nmegawatts (net) in renewable power generation capacity in North America and\nEurope. The Company's common shares trade on the Toronto and New York stock\nexchanges under the symbol ENB. For more information, visit\nwww.enbridge.com.\n\n     Forward-Looking Information\n\n     Forward-looking information, or forward-looking statements, have been\nincluded in this news release to provide information about Enbridge and its\nsubsidiaries and affiliates, including management's assessment of Enbridge\nand its subsidiaries' future plans and operations. This information may not\nbe appropriate for other purposes. Forward-looking statements are typically\nidentified by words such as \"anticipate\", \"expect\", \"project\", \"estimate\",\n\"forecast\", \"plan\", \"intend\", \"target\", \"believe\", \"likely\", \"will\" and\nsimilar words suggesting future outcomes or statements regarding an\noutlook. Forward-looking information or statements in this news release\ninclude statements with respect to Enbridge's consideration of an offering\nof hybrid subordinated debt securities, the proposed redemption of\nEnbridge's outstanding Cumulative Redeemable Minimum Rate Reset Preference\nShares, Series 17 and the intended use of the net proceeds from any\nsuccessful offering of hybrid subordinated debt securities.\n\n     Although Enbridge believes these forward-looking statements are\nreasonable based on the information available on the date such statements\nare made and processes used to prepare the information, such statements are\nnot guarantees of future performance and readers are cautioned against\nplacing undue reliance on forward-looking statements. By their nature,\nthese statements involve a variety of assumptions, known and unknown risks\nand uncertainties and other factors, which may cause actual results, levels\nof activity and achievements to differ materially from those expressed or\nimplied by such statements. Assumptions regarding the expected supply of\nand demand for crude oil, natural gas, NGL and renewable energy, and the\nprices of these commodities, are material to and underlie all\nforward-looking statements, as they may impact current and future levels of\ndemand for the Company's services. Similarly, energy transition, including\nthe drivers and pace thereof, the COVID-19 pandemic, exchange rates,\ninflation and interest rates impact the economies and business environments\nin which the Company operates and may impact levels of demand for the\nCompany's services and cost of inputs, and are therefore inherent in all\nforward-looking statements. Due to the interdependencies and correlation of\nthese macroeconomic factors, the impact of any one assumption on a\nforward-looking statement cannot be determined with certainty.\n\n     Enbridge's forward-looking statements are subject to risks and\nuncertainties, including but not limited to those risks and uncertainties\ndiscussed in this news release and in the Company's other filings with\nCanadian and United States securities regulators. The impact of any one\nrisk, uncertainty or factor on a particular forward-looking statement is\nnot determinable with certainty as these are interdependent and Enbridge's\nfuture course of action depends on management's assessment of all\ninformation available at the relevant time. Except to the extent required\nby applicable law, Enbridge assumes no obligation to publicly update or\nrevise any forward-looking statements made in this news release or\notherwise, whether as a result of new information, future events or\notherwise. All subsequent forward-looking statements, whether written or\noral, attributable to Enbridge or persons acting on the Company's behalf,\nare expressly qualified in their entirety by these cautionary statements.\n\n     This news release does not constitute or form part of, and should not\nbe construed as, an offer to purchase or an invitation to sell securities\nof Enbridge, or the solicitation of an offer to purchase securities of\nEnbridge, and nothing contained herein shall form the basis of or be relied\non in connection with any contract or commitment.\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n\n     Media\nToll Free: (888) 992-0997\n\n     Investment Community\n\n     Toll Free: (800) 481-2804\n\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200300981.MNPRE2200303363-14471120220104</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}