{"date": "2021-12-16 15:57:00.482000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3381.83, "close": 3377.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>LYELL IMMUNOPHARMA INC (\"LYEL-Q\")\n- CGMP Qualification of LyFE(TM) Manufacturing Center in\n- Advance of Initiating Clinical Programs\n\n   Lyell Immunopharma, Inc. (Lyell), a T-cell reprogramming company\ndedicated to the mastery of T cells to cure patients with solid tumors,\nannounced today that its LyFE Manufacturing Center in Bothell, Washington\nhas been commissioned and qualified in compliance with the U.S. Food and\nDrug Administration's (FDA's) Current Good Manufacturing Practices (cGMP).\n\n   The cGMP qualification confirms Lyell has the proper design, monitoring\nand control of its manufacturing facility. Since becoming operational in\nApril 2021, the LyFE Center has completed successful engineering runs at\nscale in support of the Company's planned upcoming clinical trials.\n\n   \"We are advantageously positioned with qualified manufacturing\ninfrastructure that we own and control to support consistent and reliable\nmanufacture of cell products for our upcoming clinical trials,\" said Liz\nHomans, Chief Executive Officer of Lyell. \"We believe that combining cGMP\nmanufacturing with our deep understanding of T-cell biology will help us\nachieve our vision of curing patients with solid tumors.\"\n\n   With 70,000 square feet of space, the LyFE Manufacturing Center provides\nseveral key capabilities for cell therapy manufacturing. The facility\nutilizes electronic systems with advanced data and analytics for real-time\nfeedback, batch monitoring and process optimization. To support its digital\nmanufacturing capabilities, Lyell collaborates with Amazon Web Services\n(AWS). The LyFE Manufacturing Center is one of the first cell therapy\nmanufacturing facilities to benefit from AWS's extensive experience with\ncloud computing, Internet of Things (IoT) and advanced analytics.\n\n   \"Lyell is dedicated to developing safe and effective cell therapies for\npatients by investing in innovative operations and technology, including\nour LyFE Manufacturing Center that is designed to support a broad pipeline\nand is now qualified to support cGMP manufacturing standards,\" said Stephen\nHill, Chief Operating Officer of Lyell. \"Integrating digital systems into\nour manufacturing operations means quicker access to data, leading to\nfaster recognition and implementation of process improvements.\"\n\n   About Lyell Immunopharma, Inc.\n\n   Lyell is a T-cell reprogramming company dedicated to the mastery of T\ncells to cure patients with solid tumors. The Company focuses on addressing\nwhat it believes are the primary barriers that limit consistent, reliable,\nand curative responses to adoptive T-cell therapy: T-cell exhaustion and\nlack of durable stemness, which includes proliferative capacity, ability to\nself-renew and ability to differentiate and eliminate solid tumors. Lyell\nis applying its proprietary ex vivo genetic and epigenetic reprogramming\ntechnology platforms, Gen-R and Epi-R, to address these barriers in order\nto develop new medicines with improved, durable, and potentially curative\nclinical outcomes. Lyell is based in South San Francisco, California and\nSeattle and Bothell, Washington. To learn more, please visit www.Lyell.com.\n\n   Forward Looking Statements\n\n   This press release contains forward-looking statements within the\nmeaning of the Private Securities Litigation Reform Act of 1995.\nForward-looking statements expressed or implied in this press release\ninclude, but are not limited to, statements regarding: Lyell's ability to\nproduce cell products at scale for upcoming clinical trials across the\nCompany's CAR, TIL and TCR programs; the integration of digital systems\ninto our manufacturing operations and whether such integration will result\nin quicker access to data and faster recognition and implementation of\nprocess improvements; Lyell's ownership and control of manufacturing\ninfrastructure to support consistent and reliable manufacture of cell\nproducts for upcoming clinical trials; Lyell's vision of curing patients\nwith solid tumors; the therapeutic potential of Lyell's product candidates;\nand other statements that are not historical fact. These statements are\nbased on Lyell's current plans, objectives, estimates, expectations and\nintentions, are not guarantees of future performance and inherently involve\nsignificant risks and uncertainties. Actual results and the timing of\nevents could differ materially from those anticipated in such\nforward-looking statements as a result of these risks and uncertainties,\nwhich include, but are not limited to, risks and uncertainties related to:\nthe effects of the evolving COVID-19 pandemic; Lyell's ability to submit\nplanned INDs on the anticipated timing or at all; initiation of planned\nclinical trials and enrollment of patients in its future clinical trials;\nLyell's ability to manufacture and supply its product candidates for its\nfuture clinical trials; the preclinical profiles of Lyell's product\ncandidates not translating in clinical trials; the potential for results\nfrom clinical trials to differ from preclinical, early clinical,\npreliminary or expected results; significant adverse events, toxicities or\nother undesirable side effects associated with Lyell's product candidates;\nthe significant uncertainty associated with Lyell's product candidates ever\nreceiving any regulatory approvals; Lyell's ability to obtain, maintain, or\nprotect intellectual property rights related to its product candidates;\nimplementation of Lyell's strategic plans for its business and product\ncandidates; the sufficiency of Lyell's capital resources and need for\nadditional capital to achieve its goals; and other risks, including those\ndescribed under the heading \"Risk Factors\" in Lyell's Quarterly Report on\nForm 10-Q for the quarter ended September 30, 2021 and Lyell's future\nreports to be filed with the SEC. Forward-looking statements contained in\nthis press release are made as of this date, and Lyell undertakes no duty\nto update such information except as required under applicable law.\n\nEllen Rose\nVice President, Communications and Investor Relations\nerose@lyell.com\n\nTel   : 650-695-0677    LYELL IMMUNOPHARMA INC\nWWW   : <a href=\"https://www.lyell.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.lyell.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134801122.MNPRE2134803604-13301820211215</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}