{"date": "2021-12-06 15:11:13.942000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>KONA GOLD BEVERAGE INC (\"KGKG-0\")\n- Launching New Sparkling Lemonade in Q1 of 2022\n\n   Kona Gold Beverage Inc., a holding company focused on product\ndevelopment in the better-for-you and hemp and CBD functional beverage\nsector, is pleased to announce it has developed and will be launching a new\nline of beverages, Ooh La Lemin Sparkling Lemonade, which will launch in\nearly Q1 of 2022.  Ooh La Lemin Sparkling will be produced in 12oz sleek\ncans; it will be made with all natural ingredients; it is gluten and GMO\nfree; and it has 10 low calories.  Ooh La Lemin Sparkling will be available\nin six delicious flavors: Blue Raspberry, Citrus Splash, Cucumber\nWatermelon, Huckleberry, Original, and Pineapple Mango.The Sparkling Water\ncategory is one of the fastest growing categories in beverage, and Kona\nGold identified an opportunity to take advantage of that by creating the\nfirst shelf stable, all-natural, sparkling, and low-calorie lemonade in the\nmarket.  Sales in the non-Alcohol Sparkling Water category in the USA will\nbe close to $34 Billion USD in 2021, and the category is expected to double\nagain within the next 2-4 years.Kona Gold has already received commitments\nfrom distributors for its Ooh La Lemin Sparkling Lemonades. Additionally,\nthe Company has several meetings set up in the next two months with large\ndistributors and big box stores interested in selling the Company's new\nSparkling Lemonades.\"I am excited to be announcing to our shareholders and\nconsumers our newest addition to our beverage portfolio, Ooh La Lemin\nSparkling,\" stated Robert Clark, CEO of Kona Gold Beverage, Inc. \"Our team\nhas been working with a new flavor house who has hit the formulation of our\nnew Sparkling Lemonades out of the park with 6 amazing flavors. We set out\nto create an all-natural, low-calorie sparkling lemonade that can be sold\nin all retailers from organic super markets, to your local convenience\nstore, and we have successfully done that.  The Sparkling Category is on\nfire and is set to have massive growth over the coming years. We feel Ooh\nLa Lemin Sparkling will take a big bite out of that category.\"Clark\ncontinued, \"We will be launching Ooh La Lemin Sparkling in early Q1 and\nwill be aggressively marketing the launch with social media influencers and\nmedia ads, such as our January ad in United Airlines magazine that's in\nevery seat back on every United Airplane.  The reception from current and\npotential new distributors has been the strongest we've seen for any of our\nbrands, and we hope to be announcing some big distribution and chain deals\nin the very near future.\"The Company recently announced its launch of its\nnew ecommerce website for its Ooh La Lemin Lemonade brand and Ooh La\nLemin's availability on one of the biggest ecommerce platforms for the\nfirst time, Amazon.com. Kona Gold Beverage acquired the Lemin Lemonade\nbrand earlier this year and rebranded it to Ooh La Lemin, which has proven\nto be extremely successful for the brand, as sales have increased\napproximately 3-5 times in locations that carried the previous branded\nlemonades.  Ooh La Lemin, which was previously only available in 24 pack\ncases online, is now available in 12 pack cases as well, for the first\ntime.For more information regarding Kona Gold Beverage, please\nvisit:https://konagoldbeverage.com/ About Kona Gold Beverage, Inc.Kona Gold\nBeverage, Inc., a Delaware corporation, has created wholly-owned\nsubsidiaries, Kona Gold LLC, HighDrate, LLC, and Gold Leaf Distribution,\nLLC.  Kona Gold, LLC has developed a premium Hemp-Infused Energy Drink\nline; please visit its website at www.konagoldhemp.com.  HighDrate, LLC has\ndeveloped the beverage industry's first CBD-Infused Energy Water, available\nin 6 delicious flavors; please visit its website at www.highdrateme.com.\nGold Leaf Distribution, LLC was created to fill the Company's distribution\nneeds in markets that it wants to enter quickly; please visit its website\nat www.goldleafdist.com. Kona Gold Beverage, Inc. recently rebranded its\nLemin Lemonade to Ooh La Lemin Lemonade; please visit its website at\nwww.oohlalemin.com. Kona Gold and its family of companies are located on\nthe east coast of Florida in Melbourne and in Greer and Conway South\nCarolina.Safe Harbor Statement: The information posted in this release may\ncontain forward-looking statements within the meaning of the Private\nSecurities Litigation Reform Act of 1995. You can identify these statements\nby use of the words \"may,\" \"will,\" \"should,\" \"plans,\" \"expects,\"\n\"anticipates,\" \"continue,\" \"estimate,\" \"project,\" \"intend,\" and similar\nexpressions.  The Company may also make written or oral forward-looking\nstatements in its filings with the U.S. Securities and Exchange Commission,\nin press releases and other written materials, and in oral statements made\nby its officers, directors or employees to third parties.  There can be no\nassurance that such statements will prove to be accurate.  The Company\ncautions that these forward-looking statements are further qualified by\nother factors including, but not limited to, those set forth in the\nCompany's Registration Statement on Form S-1.  Forward-looking statements\ninvolve risks and uncertainties that could cause actual results to differ\nmaterially from those projected or anticipated.  These risks and\nuncertainties include, but are not limited to, general economic and\nbusiness conditions, effects of continued geopolitical unrest and regional\nconflicts, competition, changes in technology and methods of marketing,\ndelays in completing various engineering and manufacturing programs,\nchanges in customer order patterns, changes in product mix, continued\nsuccess in technological advances and delivering technological innovations,\nshortages in components, production delays due to performance quality\nissues with outsourced components, and various other factors beyond the\nCompany's control.  The Company does not undertake any obligation to update\npublicly or to revise any statements in this release, whether as a result\nof new information, future events, or otherwise.\n\nInvestor Relations Contact: Robert Clark\n844-714-2224\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133900349.MNPRE2133901580-07001520211206</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}