{"date": "2021-11-30 19:31:46.123000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Mediabrands Content Studio has launched First Snapchat Lens in LATAM to Use Body Tracking Technology, an Original Soundtrack and a Voiceover to Promote Amazon Prime Video's New Maradona Docudrama (IPG's New Mediabrands Content Studio Makes History with mARadona: the Homage of the Century.</p><p>The cutting-edge Lens, which was created as a tribute to Diego Maradona's \"Goal of the Century\" marks the first time Snapchat has ever used body tracking next-generation augmented reality technology, a musical soundtrack, and a recorded voiceover in Latin America.The history-making Lens allows Snapchatters to physically simulate and experience the sights and sounds of \"El Diez\" as he scored his legendary goal at Azteca Stadium in 1986. As Snapchatters attempt to recreate the athlete's signature gestures, Snapchat's augmented reality body tracking technology reads participants' body movements using \"anchors\" that identify and confirm that players have adopted the correct leg, torso, arm, and head positioning. As people attempt to beat the clock and advance, the Lens plays Argentine singer, Rodrigo's, original recording of \"La mano de Dios\" (The Hand of God), a song written in honor of Maradona.When a fan mirrors all of Maradona's original \"giro, pique, finta, toque, and Barrilete cósmico\" steps, they earn their own Goal of the Century while a first-of-its-kind audio voiceover cheers them on to victory. Fans can then share recorded versions of their attempts and invite others to interact with the Lens.The Maradona activation is part of a larger comprehensive advertising and media strategy MBCS and Rufus developed to raise awareness of the new Amazon Prime Video series. Taking the home viewing experience to a new level, the public can now watch the football star's storied life journey on camera and then personally relive the greatest moment of his career.\"Launching Maradona Blessed Dream has been one of the most touching campaigns across our region. Having the creative participation and innovation from MBCS and the Snap teams has been a remarkable experience to continue to drive valuable content for our audience,\" said Patricio González De León and Giannina Trejo on behalf of Amazon Prime Video.Already available to Snapchatters in Mexico, Chile and Peru, the Lens will be shortly activated across the rest of Latin America, with a strong focus on Argentina. It will then become available overseas in select markets.\"We are thrilled that the Lens has been so well-received internationally. Working in close collaboration with our media partner Snapchat has been instrumental for us at MBCS-fully enabling us to meet our goal of permeating culture. If we succeed in both entertaining social audiences by offering them the possibility of being part of mARadona: the Homage of the Century and interacting with Amazon Prime Video content, we will have achieved our objective,\" added Alita Pereyra, Regional Creative Director Mediabrands Latam, who developed and oversaw the campaign.The innovative activation was conceived of as part of a recent joint MBCS / Snapchat Hackathon in which over 100 creative leaders, representing 12 different countries from MBCS' network, participated. The Lens becomes the first of 21 original content concepts to launch.\"We are extremely proud to introduce Snapchatters to mARadona: the Homage of the Century. This extraordinary piece of work is only made possible thanks to our deep relationship with Amazon and our close collaboration with Snapchat. This is the first of many global strategic partnerships that we look forward to developing with our media partners and clients around the world,\" said Jill Gorecki, EVP, Executive Director, Strategic Content Partnerships at MBCS.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}