{"date": "2022-01-04 14:58:34.363000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Mumbai</p></div><div class=\"tr-npp-lead\"><p>Mumbai, Jan. 4 -- The Delhi High Court has dismissed petitions filed by Future Coupons Ltd and Future Retail Ltd seeking termination of proceedings against Amazon in the Singapore tribunal.</p><p>The high court's order follows a termination application filed by Future Coupons Ltd before the Delhi Court quashing the arbitration proceedings against Amazon in the Singapore International Arbitration Centre (SIAC).</p></div><div class=\"tr-npp-body\"><p>A bench led by Justice Amit Bansal said \"we dismiss the petitions filed by Future group entities, a detailed order will be uploaded later.</p><p>On Monday, Rohatgi, a senior counsel for Future Coupons asked the high court to compel the tribunal on quashing such proceedings terming them \"futile\" and \"irrelevant\".</p><p>The very basis for such litigation was the Competition Commission of India's 18 December order that withdrew its approval on Future Coupon's 2019 deal with Amazon.</p><p>Consequent to this, the Future Group moved the Singapore Arbitration tribunal on 23 December asking it to terminate the arbitration proceedings between Amazon and itself.</p><p>The SIAC stated that it could hear Future Coupon's termination application after hearing the entire matter on Jan 8, which was after the scheduled arbitration hearing that was fixed for 5-8 January.</p><p>The tribunal also mentioned that it would take into consideration Future Coupon's concerns while deciding on the matter.</p><p>Meanwhile, even as CCI has suspended the deal between Future and Amazon, the anti-trust watchdog has given Amazon time to file fresh documents by Feb 17 after which it will reconsider the approval for the deal. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}