{"date": "2021-11-29 15:00:00.426000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Media Alert: Intel at AWS re:Invent 2021</b>\n</p><p class=\"bwalignc\">\n<b>An interactive virtual “City on the Cloud” experience powered by Intel and AWS highlights key cloud technologies, partner and developer solutions, and customer stories.</b>\n</p><p>\nAs part of Intel's ongoing commitment to keep its employees and communities safe during the COVID-19 pandemic, Intel at AWS re:Invent 2021 will have a fully virtual presence. A custom-built, interactive 3D “City on the Cloud” experience will highlight key activations and track sessions, and enable developers, partners and customers to explore a rich suite of content showcasing the breadth of AWS solutions powered by Intel across workloads and verticals.\n</p><p>\nPlease join Intel online at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.intel.com%2Fcontent%2Fwww%2Fus%2Fen%2Fevents%2Faws-reinvent.html&amp;esheet=52541264&amp;newsitemid=20211129005183&amp;lan=en-US&amp;anchor=www.intel.com%2Fawsreinvent&amp;index=1&amp;md5=a5b6db428c7c826da277b2072212bd20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.intel.com/awsreinvent</a> where it will highlight content updates throughout the event. For every unique visitor to the microsite, Intel will donate to Girls in Tech, a nonprofit organization dedicated to eliminating the gender gap in tech (up to a total donation of $30,000).\n</p><p class=\"bwalignc\">\n<b>Intel@AWS re:Invent 2021 “City in the Cloud”</b>\n</p><p>\n<b>When:</b> Nov. 29-Dec.10\n<br/><b>Where:</b> <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.intel.com%2Fcontent%2Fwww%2Fus%2Fen%2Fevents%2Faws-reinvent.html&amp;esheet=52541264&amp;newsitemid=20211129005183&amp;lan=en-US&amp;anchor=www.intel.com%2Fawsreinvent&amp;index=2&amp;md5=ff5f0f60aa5170b8c17d8e5e97697424\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.intel.com/awsreinvent</a>\n</p><p>\n<b>SESSIONS</b>\n</p><p>\nIntel will present three track sessions during the week of Nov. 29-Dec. 3. All will be available on-demand the week of Dec. 6-10. The sessions will highlight compelling end-customer stories across different verticals utilizing AWS powered by Intel.\n</p><p>\n<b>Title:</b> <b>3DAT: Technology Leveling the Playing Field for Athletes Worldwide (Session: AIM211-S</b>)\n</p><p>\nIntel’s 3D Athlete Tracking technology (3DAT) running on AWS scalable architecture is revolutionizing how to train, coach and scout athletes worldwide. Using artificial intelligence (AI) modeling and any camera, 3DAT can extract information about the form and motion of athletes that goes undetected by the naked eye, making biomechanics more accessible than ever. Talent scouting app AiSCOUT utilizes 3DAT to provide opportunities to amateur soccer players across the globe to be scouted using only the player’s mobile phone. This is just the beginning. Learn how to use Intel’s 3DAT Cloud SDK and API to deploy new applications.\n<br/><b>Intel Speaker:</b> Jonathan Lee, director of Sports Performance Technology\n</p><p>\n<b>Title: Engineering for Social Impact Through the Power of HPC (Session: EUC305-S</b>)\n</p><p>\nHigh performance computing (HPC) in the cloud is redefining what is possible and driving positive social impact around the world. Most recently, one of the largest HPC runs in the cloud, conducted on AWS architecture and powered by Intel® Xeon® Scalable processors, has enabled open-source platform VirtualFlow to conduct drug discovery at the scale of billions of molecules. This platform plans to host the world’s largest virtual screening of drug molecules needed to accelerate cancer research.\n<br/><b>Intel Speaker: </b>Rebecca Weekly, vice president, general manager and senior principal engineer\n</p><p>\n<b>Title: CoWin: 1.3 Billion Lives Safer </b>(<b>Session: AIM327-S)</b>\n</p><p>\nTechnology has proven to be a game-changer in helping overcome the COVID-19 crisis. The CoWin vaccination platform in India supports possibly the largest vaccination drive in mankind, protecting Indians by providing easy and democratized access to vaccines. In this session, learn how the platform at its peak scaled to more than 3.2 billion hits a day, all made possible through the scalability of the AWS Cloud and Intel Xeon Scalable processors. Hear how this project is a strong testament to the power of the collaboration of AWS, Intel, partners and customers.\n<br/><b>Intel Speaker: </b>Sandra Rivera, executive vice president and general manager, Datacenter and AI Group\n</p><p>\n<b>CONTENT HUBS</b>\n</p><p>\nThe Intel AWS “City in the Cloud” features easy-to-navigate content “hot spots” throughout, highlighting customer case studies and partner solutions across multiple verticals (education, food/retail, healthcare and others). In addition, developers can explore the Habana AI Lab to learn about AI training with Habana® Gaudi® accelerators that power Amazon EC2 DL1 instances. Virtual meeting requests with the Habana team are also enabled on the site.\n</p><p>\n<b>About Intel</b>\n</p><p>\nIntel (Nasdaq: INTC) is an industry leader, creating world-changing technology that enables global progress and enriches lives. Inspired by Moore’s Law, we continuously work to advance the design and manufacturing of semiconductors to help address our customers’ greatest challenges. By embedding intelligence in the cloud, network, edge and every kind of computing device, we unleash the potential of data to transform business and society for the better. To learn more about Intel’s innovations, go to <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fnewsroom.intel.com%2F&amp;esheet=52541264&amp;newsitemid=20211129005183&amp;lan=en-US&amp;anchor=newsroom.intel.com&amp;index=3&amp;md5=487666bc7c961c64fe5db32ea7315bab\" data-type=\"url\" class=\"tr-link\" translate=\"no\">newsroom.intel.com</a> and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fintel.com%2F&amp;esheet=52541264&amp;newsitemid=20211129005183&amp;lan=en-US&amp;anchor=intel.com&amp;index=4&amp;md5=83598b085a2e3506e4d5a036b76452f2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">intel.com</a>.\n</p><p>\n© Intel Corporation. Intel, the Intel logo and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211129005183r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTI5MDA1MTgzcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=9c31d0c94c103260e40113766f19389f30e6f88794c6d9425ba0adc83d096e218eeefdad84f7d2e4fba137230b9ae934dad226730dfc5a851be17b3ba51d3d21\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211129005183/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211129005183/en/</a></span></p><p>\nTim Schulte\n<br/>1-408-767-8358\n<br/><a href=\"mailto:Tim.Schulte@intel.com\" data-type=\"email\" translate=\"no\">Tim.Schulte@intel.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CA-INTEL-CORPORATION</p></div>"}