{"date": "2021-11-13 00:17:05+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3472.5, "close": 3545.68}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds crash details from FAA, paragraphs 3-4</p><p class=\"tr-by\">By Kanishka Singh</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 12 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Medical research software mogul Glen de Vries, who flew to space last month with actor William Shatner aboard a rocketship operated by Jeff Bezos' Blue Origin, died in a small plane crash in New Jersey, state police said on Friday.</p><p>The plane crashed on Thursday in Sussex County, New Jersey, just northwest of New York City, police said, adding that De Vries, 49, and another man aboard the aircraft, Thomas Fischer, 54, were killed. </p><p>The aircraft, a single-engine Cessna 172, went down in a wooded area of a state park near Lake Kemah, New Jersey, about 40 minutes before sunset, according to the Federal Aviation Administration, which is investigating the crash.</p><p>No other official details surrounding the circumstances of the accident were immediately available.</p><p>    \"Such a tragic loss. Warm and full of life, Glen made us laugh and lit up the room. He was a visionary, and an innovator – a true leader,\" Bezos, Blue Origin's founder and executive chairman of online retail giant Amazon.com, said on Twitter, adding he was \"heartbroken\".</p><p>De Vries, an instrument-rated private pilot and founder of the clinical research company Medidata Solutions, soared to space last month in a suborbital joyride aboard the New Shepard rocketship of astro-tourism venture Blue Origin, riding along with three other civilian crew members.</p><p>The most notable of the four New Shepard passengers was Shatner, the 90-year-old actor best known for his role as Captain James T. Kirk on the original 1960s television show \"Star Trek.\" The Oct. 13 launch made Shatner the oldest person ever to fly into space.</p><p>The two other crewmates for that flight were former NASA engineer Chris Boshuizen and Blue Origin Vice President Audrey Powers.</p><p>Medidata Solutions, formed by de Vries in 1999, ranks as the world's most used clinical research platform, according to a career profile of de Vries that Blue Origin posted when he was chosen as one of the four New Shepard passengers.</p><p>He was vice chair of life sciences and healthcare at the French software company Dassault Systemes <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DAST.PA\" data-type=\"ric\" data-ric=\"DAST.PA\" translate=\"no\" dir=\"ltr\">DAST.PA</a>, which acquired Medidata in 2019. He also served as a trustee of Carnegie Mellon University in Pittsburgh.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Kanishka Singh in Bengaluru; Writing and additional reporting by Steve Gorman in Los Angeles; Editing by Will Dunham, Cynthia Osterman and Daniel Wallis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Kanishka.Singh@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Kanishka.Singh@thomsonreuters.com</a> ; +91 9620300091; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SPACE-EXPLORATION/BLUEORIGIN-DE VRIES (UPDATE 4, PIX, TV)</p></div>"}