{"date": "2021-12-09 15:11:35.221000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MINIM INC (\"MINM-Q\")\n- President Named A \"Female Executive of the Year\" and \"Most\n- Innovative Woman\" By Stevie Awards for Women in Business\n- Worldwide\n\n     Minim, Inc., the creator of intelligent networking products under the\nMotorola brand, announced that Nicole Zheng, Minim's President and Chief\nMarketing Officer, is a 2021 Silver Stevie(R) Award winner in two distinct\nnomination categories: \"Female Executive of the Year\" and \"Most Innovative\nWoman.\" The awards ceremony will take place virtually on Thursday, January\n13, 2022.\n\n     \"We're thrilled that Nicole has been recognized for her outstanding\ncontributions in technology,\" said Sandra Howe, Board Director at Minim.\n\"Nicole has taken marketing and operational creativity to new levels with\nan innovative approach to everything she touches. Her leadership as a\nfemale executive is an inspiration not only to those within the company,\nbut throughout the industry overall.\"\n\n     The Stevie Awards for Women in Business honor women executives,\nentrepreneurs, employees, and the companies they run - worldwide. More than\n1,500 entries were submitted this year for consideration in more than 100\ncategories, including Executive of the Year, Entrepreneur of the Year,\nCompany of the Year, Startup of the Year, and Women Run Workplace of the\nYear. Nicole Zheng was nominated and selected for \"Female Executive of the\nYear\" and \"Most Innovative Woman\" in the consumer products and technology\ncategories, respectively.\n\n     \"Women-owned and run organizations have contributed significantly to\nthe increase in innovation and entrepreneurial activity we've seen globally\nsince the beginning of the COVID-19 pandemic,\" said Maggie Gallagher\nMiller, president of the Stevie Awards. \"The nominations submitted to the\n18th Stevie Awards for Women in Business that attest to this are inspiring,\nhumbling, and motivating.\"\n\n     As more than 50% of US broadband households report an increase in\nbroadband usage since the start of the COVID-19 pandemic (Parks\nAssociates), Minim's intelligent Motorola networking products help families\nget the most out of their internet connections with advanced speeds, an\nintuitive mobile app, malware blocking, parental controls, and more.\nMultiple Motorola modems and modem/routers were identified in the Top 5\nAmazon Best Sellers this past Black Friday and Cyber Monday. Zheng's\ndecisive leadership and knowledge of the wider consumer and broadband\nmarkets have helped drive Minim's nationwide launches of its\nnext-generation DOCSIS 3.1 products and the new motosync app in eight\nretailers, including Best Buy, Walmart, Amazon, Target, and more.\n\n     \"Nicole is a multiplier on any initiative she touches -- from software\nproduct strategy, to our trademark asset sale, to recruiting exceptional\ne-commerce and technology talent just this year,\" said Gray Chynoweth,\nMinim's CEO. \"With her former life as an engineer and experience as an\noperator, Nicole's support is in high demand across the management team. We\nare all pleased to congratulate her on this well-deserved recognition.\"\n\n     Details about the Stevie Awards for Women in Business and the list of\nGold, Silver, and Bronze winners in all categories are available at\nwww.StevieAwards.com/Women. Registration for the ceremony is now on sale.\n\n     About Minim\n\n     Minim, Inc. (NASDAQ: MINM) is the creator of intelligent networking\nproducts that dependably connect people to the information they need and\nthe people they love. Headquartered in Manchester, NH, the company delivers\nsmart software-driven communications products under the globally recognized\nMotorola brand and Minim(R) trademark. Minim end users benefit from a\npersonalized and secure Wi-Fi experience, leading to happy and safe homes\nwhere things just work. To learn more, visit <a href=\"https://www.minim.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.minim.com</a>.\n\n     MOTOROLA and the Stylized M Logo are trademarks or registered\ntrademarks of Motorola Trademark Holdings, LLC and are used under license.\n\n     About the Stevie Awards\n\n     Stevie Awards are conferred in eight programs: the Asia-Pacific Stevie\nAwards, the German Stevie Awards, the Middle East &amp; North Africa Stevie\nAwards, The American Business Awards(R), The International Business\nAwards(R), the Stevie Awards for Great Employers, the Stevie Awards for\nWomen in Business, and the Stevie Awards for Sales &amp; Customer Service.\nStevie Awards competitions receive more than 12,000 entries each year from\norganizations in more than 70 nations. Honoring organizations of all types\nand sizes and the people behind them, the Stevies recognize outstanding\nperformances in the workplace worldwide. Learn more about the Stevie Awards\nat <a href=\"http://www.StevieAwards.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.StevieAwards.com</a>.\n\n     HCL Technologies sponsors the Red Ladder Women in Technology Awards in\nthe 2021 Stevie Awards for Women in Business.\n\nContact:\n\n     Nicole Zheng at (908) 337-2481 or nicole@minim.com\n\n     Investor Relations Contact:\n\n     James Carbonara, Hayden IR at (646) 755-7412 or james@haydenir.com\n\n     About Motorola Strategic Brand Partnerships\n\n     For over 90 years the Motorola brand has been known around the world\nfor high quality, innovative and trusted products. Motorola's Strategic\nBrand Partnership program seeks to leverage the power of this iconic brand\nby teaming with dynamic companies who offer unique, high-quality products\nthat enrich consumers' lives. Strategic brand partners work closely with\nMotorola engineers while developing and manufacturing their products,\nensuring that their products meet the exacting safety, quality, and\nreliability standards that consumers have come to expect from Motorola. To\nlearn more about Motorola strategic brand partnerships, follow us\n@ShopMotorola.\n\n     Forward-Looking Statements\n\n     This press release contains \"forward-looking statements\", within the\nmeaning of the safe harbor provisions of the U.S. Private Securities\nLitigation Reform Act of 1995.  Such forward-looking statements relate to\nMinim's plans, expectations, and intentions. Actual results may be\nmaterially different from expectations as a result of known and unknown\nrisks, including: risks associated with Minim's potential inability to\nrealize intended benefits of the acquisition by merger of Zoom\nConnectivity, Inc.; the potential increase in tariffs on the company's\nimports; potential supply interruptions from manufacturing the company's\nproducts in Vietnam; risks relating to global semiconductor shortages;\npotential changes in NAFTA; the potential need for additional funding which\nMinim may be unable to obtain; declining demand for certain of Minim's\nproducts; delays, unanticipated costs, interruptions or other uncertainties\nassociated with Minim's production and shipping; Minim's reliance on\nseveral key outsourcing partners; uncertainty of key customers' plans and\norders; risks relating to product certifications; Minim's dependence on key\nemployees; uncertainty of new product development, including certification\nand overall project delays, budget overruns; the risk that newly introduced\nproducts may contain undetected errors or defects or otherwise not perform\nas anticipated; costs and senior management distractions due to patent\nrelated matters; risks from a material weakness in our internal control\nover financial reporting; the impact of the COVID-19 pandemic; and other\nrisks set forth in Minim's filings with the Securities and Exchange\nCommission. Minim cautions readers not to place undue reliance upon any\nsuch forward-looking statements, which speak only as of the date made.\nMinim expressly disclaims any obligation or undertaking to release publicly\nany updates or revisions to any such statements to reflect any change in\nMinim's expectations or any change in events, conditions or circumstance on\nwhich any such statement is based.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134200314.MNPRE2134201681-06502320211209</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}