{"date": "2021-07-30 15:15:45.534000+00:00", "ticker": "III", "mrkt_info": {"open": 1287.0, "close": 1279.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 1301H3i Group PLC30 July 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>3i Group plc</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Total voting rights</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Following an allotment of shares under The 3i Group Share Incentive Plan on 30 July 2021, 3i Group plc (the \"Company\") had 973,197,309 issued ordinary shares of 73</span>\n<span>19/22</span>\n<span>p each admitted to trading on a regulated or prescribed market. Each ordinary share carries the right to one vote in relation to all circumstances at general meetings of the Company. The Company does not hold any ordinary shares in treasury.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The total voting rights figure may be used by shareholders (and others with notification obligations) as the denominator for the calculations by which they will determine whether they are required to notify their interest in, or a change to their interest in, the Company under the FCA's Disclosure Rules and Transparency Rules.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>For the purposes of the Transparency Directive the Home Member State of 3i Group plc is the United Kingdom.</span>\n<span>\n</span></p>\n<p>\n<span>30 July 2021</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>TVRURRVRAOUBOAR</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}