{"date": "2022-01-27 15:00:08.958000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">The Leading Provider of Vital Document Management™</h2>\n<h2 class=\"xn-hedline\">Kiip is Vital Document Management (VDM) for Individuals and the Organizations That Serve Them - launching in Partnership with Amazon Web Services (AWS)</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">NEW YORK, Jan. 27, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">NEW YORK</span>, <span class=\"xn-chron\">Jan. 27, 2022</span> /PRNewswire/ -- Kiip (/ kēēp /) launches today as the leading provider of simple, safe, and secure Vital Document Management<span>™</span> (VDM).</p>\n<div id=\"divReleaseHighlight625e\" style=\"BORDER-TOP:gray 1px solid;WIDTH:200px;BORDER-BOTTOM:gray 1px solid;FLOAT:left;TEXT-ALIGN:justify;MARGIN:5px 10px\">Kiip is vital document management for individuals and the organizations that serve them.</div><p>Kiip provides a platform for individuals to freely, simply, and securely store and manage their personal vital documents, enabling safer and faster sharing of their information with organizations when applying for benefits and services. </p>\n<p>Kiip ensures every individual has permanent, free access to their own information so they can safely and securely manage their documents from anywhere, on any device. Kiip is partnered with Amazon Web Services through the GovTechStart accelerator which supports startups building the next generation of technology solutions for state and local government agencies.</p>\n<p><b>\"Free, safe, and simple vital document management is the key to providing increased safety and security to millions of individuals while simultaneously improving the efficiency with which public and private organizations can deliver their services,\" said <span class=\"xn-person\">Noah Harlan</span>, Founder &amp; CEO of Kiip. </b></p>\n<p><b><u>KEY INFORMATION ABOUT KIIP</u></b></p>\n<ul type=\"disc\" class=\"bulleted-list arrowlist\"><li>In the US alone, <span class=\"xn-money\">$180 billion</span> in annual benefits and services are not received by eligible individuals and families because they are unaware of their eligibility or lack the documents required to prove eligibility. Eligible participation in some benefit programs is under 10% and the single most common reason for denial is lack of documentation.<br/><br/></li><li>For individuals, the lack of ready access to one's <b>own</b> documentation prevents or delays access to benefits and services, including obtaining food and shelter, applying for government-issued ID and banking or credit services, enrolling in school, or applying for public benefits. Documents frequently need to be re-acquired after being lost, destroyed, or stolen, and, while the impacts of these administrative burdens are felt most acutely by the most vulnerable communities, this \"time tax\" affects nearly every member of our society.<br/><br/></li><li>For organizations that serve individuals, nearly half of all time spent by staff determining eligibility is wasted chasing and waiting on documents. Kiip provides a streamlined system to ensure individuals have and can submit their documents, improving the efficiency and speed of delivery for public and private organizations.<br/><br/></li><li>Administrative burdens, including time spent on paperwork and collecting documentation required to prove eligibility, impact everyone from the Federal government to local community based organizations (CBOs). Mitigating administrative burden enhances organizations' ability to comprehensively advance equity, meet the needs of underserved communities, and improve operational efficiencies.<br/><br/></li><li>Kiip has raised <span class=\"xn-money\">$2 million</span> in a pre-seed investment round from a combination of major early stage private investors and venture capital firms. Born out of Two Bulls' public sector work, Kiip's founding team and staff all came across from the digital consultancy to work on this product full-time. </li></ul><ul type=\"disc\" class=\"bulleted-list arrowlist\"><li>Kiip is currently working with partners in <span class=\"xn-location\">Maryland</span>, <span class=\"xn-location\">Iowa</span>, <span class=\"xn-location\">New Hampshire</span>, <span class=\"xn-location\">Washington</span>, <span class=\"xn-location\">Texas</span> and <span class=\"xn-location\">Arizona</span> that include CBOs, non-profits, and government agencies working with at-risk communities. Kiip is available for procurement, in partnership with SHI International, in 30 states on NASPO cloud contract AR2488 and nationally in the AWS Marketplace shortly.<br/><br/></li><li><b>\"We have seen through our partners the scale of the problem of administrative burden and how powerfully Kiip impacts it with a privacy-first approach centered on individual control of their information,\" Harlan said.</b><br/><br/><span>Kiip CEO <span class=\"xn-person\">Noah Harlan</span>, co-founded Two Bulls, a creative software engineering consultancy operating under leadership of fellow co-founder and CEO <span class=\"xn-person\">James Kane</span>. Previously, Noah and Two Bulls co-founded Breadcrumb, the first cloud-backed, iPad-based point of sale system for the hospitality industry that was sold to Groupon.</span></li></ul><p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=NY43673&amp;sd=2022-01-27\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1OWTQzNjczJnNkPTIwMjItMDEtMjc=&amp;key=1b4ae68bfc3f33bb5dbe6c14588abde0d619c6480b86f9bc3deae08d49eca92c4146da2066e2e034e59f5ffa4c07a8a19c0d5eeb528fda950b56e99207687b65\"/></div></div> View original content:<a href=\"https://www.prnewswire.com/news-releases/launching-today---kiip-301469778.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/launching-today---kiip-301469778.html</a><p></p>\n<p>SOURCE  Kiip</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: KIIP-Launch</p></div>"}