{"date": "2021-12-03 19:39:16.497000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3437.36, "close": 3427.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Tigera has launched the integration of its Calico Cloud with AWS Control Tower, making it easier than ever for AWS users to get additional cluster security, granular workload access controls, live observability, and real-time troubleshooting capabilities for Amazon Elastic Kubernetes Service (EKS) clusters.</p><p>Calico Cloud is the first unified, cloud-native security and observability platform to integrate with AWS Control tower to ensure the security and health of workloads running on EKS.In addition, Calico Enterprise adds Egress Gateway support for AWS and EKS, enabling DevOps/SREs to authorize communication from specific namespaces in EKS to secure resources outside which can be on-premises or in a data center.Using AWS Control Tower, all security and network policies set up on an AWS account automatically populate on Calico Cloud, making it possible to get started immediately - no additional set up required.The integration enables every AWS Marketplace and AWS Control Tower customer to easily activate, deploy and configure Calico Cloud for EKS, taking full advantage of the resources pre-configured by AWS Control Tower as part of the initialization.Benefits of the Calico Cloud integration with AWS Control Tower include:Instant security and observability: AWS accounts and associated clusters are instantly secured and their health can be observed as soon they are launched or enrolled. There is no additional configuration required.Faster onboarding: AWS users can use a one-click deployment in the AWS Management Console or AWS CLI to connect the EKS environment to Calico Cloud. Existing accounts in landing zones will already be enrolled and will not require extra work to connect. Linking landing zone accounts with the Calico Cloud account is done automatically.Eliminate setup monitoring: Users spend minimal time managing and monitoring their setup for enabling EKS security and observability via Calico Cloud. Integration also scales as the number of landing zones increases.Multi-cluster and Multi-region controls: A centralized, unified, multi-cluster approach to security and observability can help with faster troubleshooting, adherence to compliance requirements, and uniform policy enforcements across regions, distributions, and dataplanes.Scalability and automatic updates: As EKS clusters are enrolled via AWS Control Tower, security and observability is automatically applied with no additional work required.\"The Calico Cloud integration with AWS Control Tower takes the pain out of setting up security and observability for EKS deployments and provides a centralized point of control to secure and monitor the health of cloud-native applications running on multiple AWS accounts across regions,\" said Amit Gupta, vice president of business development and product management, Tigera.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}