{"date": "2021-11-26 16:59:59+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3504.56, "close": 3507.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Saqib Iqbal Ahmed</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Nov 26 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Soaring volatility on Wall Street on concerns over a new coronavirus variant identified in South Africa sent investors scrambling into defensive options plays on Friday and boosted the Wall Street's most widely followed fear gauge to a more than two-month high.</p><p>The Cboe Volatility Index rose 8.37 points to 26.95, its highest since Sept. 20, as the S&amp;P 500 index fell 1.9% with travel, bank and commodity-linked stocks bearing the brunt of the selloff triggered by the discovery of a new and possibly vaccine-resistant coronavirus variant. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2SH34D\" data-type=\"storyId\" data-story-id=\"nL4N2SH34D\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span><span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SH089\" data-type=\"storyId\" data-story-id=\"nL1N2SH089\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><span class=\"tr-strong\">It was the biggest one-day jump the VIX had logged since Jan. 27.</span></p><p>Options traders loaded up on bets that offset further market declines, with puts on the S&amp;P 500 Index <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPX\" data-type=\"ric\" data-ric=\".SPX\" translate=\"no\" dir=\"ltr\">.SPX</a> and its tracking Exchange Traded Fund (ETF) <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SPY.P\" data-type=\"ric\" data-ric=\"SPY.P\" translate=\"no\" dir=\"ltr\">SPY.P</a> <span class=\"tr-strong\">logging </span>heavy volumes. </p><p>Puts convey the right to sell shares at a fixed price in the future and are typically used to hedge against a drop in stock prices. Calls provide the right to buy shares at the given price in the future and are usually used to put on bullish bets. </p><p>Puts on the S&amp;P 500 index outnumbered calls 2-to-1, the widest margin in about six weeks, according to data from options analytics firm Trade Alert. Trading in SPY put options was similarly elevated. </p><p>\"Risk off, hedges on seems to be the sentiment,\" Seth Golden, chief market strategist at investment research firm Finom Group, said. </p><p>The surge in volatility follows weeks of comparatively placid trading that saw the S&amp;P 500 march to record highs, with stocks seemingly shrugging off concerns over soaring inflation potentially pushing the Federal Reserve to normalize monetary policy at a faster-than-expected pace. </p><p>Steve Sosnick, chief strategist at Interactive Brokers, believes the severity of Friday’s sell-off may have been exacerbated by investors unwinding “one-way bets” expressing the view that there was little alternative to stocks. </p><p>\"Those types of setups have a nasty way of reversing quickly,\" he said.</p><p>Andrew Thrasher, portfolio manager for The Financial Enhancement Group, had been concerned that recent gains in a handful of technology stocks with disproportionately large weightings in the S&amp;P 500, including Apple Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a>, Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Microsoft Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a>, were masking weakness in the broader market. </p><p>\"This set the kindling for sellers to push markets lower and the latest COVID news appears to have stoked that bearish flame,\" he said.</p><p>The VIX index is still well below its all-time highs of <span class=\"tr-strong\">82.69</span>, hit during the market selloff in March 2020.</p><p>A VIX at around 45-50 would \"be close to panic,\" said Ophir Gottlieb, chief executive of Los Angeles-based Capital Market Laboratories.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Saqib Iqbal Ahmed; Editing by Ira Iosebashvili and Marguerita Choy)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:saqib.ahmed@thomsonreuters.com\" data-type=\"email\" translate=\"no\">saqib.ahmed@thomsonreuters.com</a> ; @SaqibReports; +1 646 223 6054; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://saqib.ahmed.thomsonreuters.com@reuters.net\">saqib.ahmed.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-STOCKS/OPTIONS</p></div>"}