{"date": "2022-01-19 15:00:01.029000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Growing AWS Partner Ecosystem Helps U.S. Enterprises Leverage Cloud to Meet Pandemic-Era Challenges</b>\n</p><p class=\"bwalignc\">\n<b>ISG Provider Lens™ report sees AWS – U.S. companies’ top choice among hyperscalers – at the center of a growing market for consulting, migration, managed services and other offerings</b>\n</p><p>\nU.S. enterprises are prioritizing cloud adoption in response to the COVID-19 pandemic and AWS is their preferred choice among hyperscale cloud providers, according to a new research report published today by Information Services Group (<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.isg-one.com&amp;esheet=52565187&amp;newsitemid=20220119005722&amp;lan=en-US&amp;anchor=ISG&amp;index=1&amp;md5=12cb588eed2f3aceb5eb48908757779a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ISG</a>) (Nasdaq: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.nasdaq.com%2Fsymbol%2Fiii&amp;esheet=52565187&amp;newsitemid=20220119005722&amp;lan=en-US&amp;anchor=III&amp;index=2&amp;md5=0a7f1dbe13c64aac8bd846aab609c9e1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">III</a>), a leading global technology research and advisory firm.\n</p><p>\nThe 2021 ISG Provider Lens™ AWS Ecosystem Partners report for the U.S. finds hyperscalers and service and solution providers working collaboratively to virtualize infrastructure, with hyperscalers focusing on accelerating the development of technology-agnostic solutions and products. AWS has responded to the needs of many U.S. industries by bringing in talent and expertise from various sectors to develop new offerings.\n</p><p>\nOver the past 18 months, companies in the U.S. have made cloud adoption a top priority, typically carried out in three phases: adopt, adapt and accelerate, ISG says. Selecting a preferred technology service provider (TSP), enterprises then adapt their traditional infrastructure and applications to the virtualized environment. Finally, they leverage their relationships with the TSP and a managed service provider (MSP) to enable rapid development of solutions and components.\n</p><p>\n“The cloud forms a foundation for the essential components of digital transformation, such as AI, automation, data engineering and analytics,” said Bernie Hoecker, partner and global leader, ISG Enterprise Cloud. “Working with service providers as partners, U.S. companies have been able to quickly build cloud-based infrastructures to meet new, pandemic-era challenges.”\n</p><p>\nThe already mature U.S. market for MSPs in the AWS ecosystem has grown increasingly competitive, especially in terms of recruiting skilled teams from a limited talent pool, ISG finds. Providers are focused on automating every phase of cloud management, including monitoring and optimization, while clients now expect them to take on expanded roles that encompass governance, risk and compliance.\n</p><p>\nMoving SAP implementations to the cloud is one of the most common cloud priorities for U.S. enterprises, and MSPs are meeting this demand by developing capabilities to participate in the wide array of AWS integration programs for SAP, the report says. They are building migration toolkits for specific functions and industries and offering provisioning and operation of SAP systems such as SAP HANA.\n</p><p>\nMSPs are also tapping into AWS data analytics and machine learning services, which AWS extends to the ecosystem to meet enterprises’ growing need to derive insights from vast stores of data. In addition, most providers are building IoT accelerators that work with the increasing number of AWS IoT solutions, allowing for development of applications and interfaces to connect IoT devices without provisioning a server, ISG says.\n</p><p>\nMany large organizations in the U.S. face steep challenges when they set out to migrate data, services and systems to an AWS cloud environment, the report says. AWS migration has enormous potential for improvement through emerging technologies, and MSPs are seizing the opportunity to help enterprises make smooth transitions. This includes offering proprietary cross-platform solutions that integrate with AWS.\n</p><p>\nConsulting partners also play a major role in U.S. enterprises’ AWS strategies, ISG says. These providers use a comprehensive, modular approach to cater to a wide range of requirements and can bring a combination of industry specialists, technologists and management experts to the table to guide clients on their cloud journeys.\n</p><p>\nThe 2021 ISG Provider Lens™ AWS Ecosystem – Partners report for the U.S. evaluates the capabilities of 59 providers across six quadrants: AWS Managed Services, AWS SAP Workloads, AWS Data Analytics and Machine Learning Services, AWS Internet of Things (IoT) Services, AWS Migration Services, and AWS Consulting Services.\n</p><p>\nThe report names Accenture, Capgemini, Cognizant, Deloitte, LTI and Wipro as Leaders in all six quadrants. It names HCL, Infosys and TCS as Leaders in five quadrants each, Tech Mahindra as a Leader in four quadrants and Rackspace Technology as a Leader in three quadrants. DXC Technology and Hexaware are named as Leaders in two quadrants each, and Genpact, Informatica, Mindtree and Mphasis are named as Leaders in one quadrant each.\n</p><p>\nIn addition, Mphasis, Tech Mahindra and Virtusa are named as Rising Stars – companies with a “promising portfolio” and “high future potential” by ISG’s definition – in two quadrants each. Cloud Reach, Persistent and To The New are named as Rising Stars in one quadrant each.\n</p><p>\nCustomized versions of the report are available from <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fhexaware.com%2Fnews%2Fhexaware-named-a-leader-in-internet-of-things-iot-and-aws-consulting-services-in-the-isg-provider-lens-aws-ecosystem-partners-2021-u-s-quadrant-study%2F&amp;esheet=52565187&amp;newsitemid=20220119005722&amp;lan=en-US&amp;anchor=Hexaware&amp;index=3&amp;md5=5ebde2fb92040c3da541c255c89ccbf4\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Hexaware</a> and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.lntinfotech.com%2Fnews-event%2Flti-recognized-as-a-leader-across-all-quadrants-in-the-isg-provider-lens-aws-ecosystem-partners-report-2021-for-the-us%2F&amp;esheet=52565187&amp;newsitemid=20220119005722&amp;lan=en-US&amp;anchor=LTI&amp;index=4&amp;md5=9b7d8cbedc23ad4fb088ec4921676a48\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LTI</a>.\n</p><p>\nThe 2021 ISG Provider Lens™ AWS Ecosystem – Partners report for the U.S. is available to subscribers or for one-time purchase on this <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fresearch.isg-one.com%2Freportaction%2FQuadrant-AWS-US-2021%2FMarketing&amp;esheet=52565187&amp;newsitemid=20220119005722&amp;lan=en-US&amp;anchor=webpage&amp;index=5&amp;md5=9437b23eaa4f009d4377eb02d38b9904\" data-type=\"url\" class=\"tr-link\" translate=\"no\">webpage</a>.\n</p><p>\n<b>About ISG Provider Lens™ Research</b>\n</p><p>\nThe ISG Provider Lens™ Quadrant research series is the only service provider evaluation of its kind to combine empirical, data-driven research and market analysis with the real-world experience and observations of ISG's global advisory team. Enterprises will find a wealth of detailed data and market analysis to help guide their selection of appropriate sourcing partners, while ISG advisors use the reports to validate their own market knowledge and make recommendations to ISG's enterprise clients. The research currently covers providers offering their services globally, across Europe, as well as in the U.S., Canada, Brazil, the U.K., France, Benelux, Germany, Switzerland, the Nordics, Australia and Singapore/Malaysia, with additional markets to be added in the future. For more information about ISG Provider Lens research, please visit this <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fc212.net%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D2369469-1%26h%3D861603975%26u%3Dhttps%253A%252F%252Fisg-one.com%252Fresearch%252Fisg-provider-lens%26a%3Dwebpage&amp;esheet=52565187&amp;newsitemid=20220119005722&amp;lan=en-US&amp;anchor=webpage&amp;index=6&amp;md5=8652d9e27a7c69312d39c4f17df7e0b2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">webpage</a>.\n</p><p>\nA companion research series, the ISG Provider Lens Archetype reports, offer a first-of-its-kind evaluation of providers from the perspective of specific buyer types.\n</p><p>\n<b>About ISG</b>\n</p><p>\nISG (Information Services Group) (Nasdaq: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.nasdaq.com%2Fsymbol%2Fiii&amp;esheet=52565187&amp;newsitemid=20220119005722&amp;lan=en-US&amp;anchor=III&amp;index=7&amp;md5=2187b80ec6b756793db699b1e77aae3b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">III</a>) is a leading global technology research and advisory firm. A trusted business partner to more than 700 clients, including more than 75 of the world’s top 100 enterprises, ISG is committed to helping corporations, public sector organizations, and service and technology providers achieve operational excellence and faster growth. The firm specializes in digital transformation services, including automation, cloud and data analytics; sourcing advisory; managed governance and risk services; network carrier services; strategy and operations design; change management; market intelligence and technology research and analysis. Founded in 2006, and based in Stamford, Conn., ISG employs more than 1,300 digital-ready professionals operating in more than 20 countries—a global team known for its innovative thinking, market influence, deep industry and technology expertise, and world-class research and analytical capabilities based on the industry’s most comprehensive marketplace data. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.isg-one.com&amp;esheet=52565187&amp;newsitemid=20220119005722&amp;lan=en-US&amp;anchor=www.isg-one.com&amp;index=8&amp;md5=74949d6610fbe47e6be33f27e719b26b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.isg-one.com</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220119005722r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMTE5MDA1NzIycjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=f82bbb33c52ed730195c922167d90550fae0c775b8376ad7d5ded37407f2cfd537cd4e2e207396426cbbfee37ca1344fdc532913a772c9c07c4d00d288662425\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220119005722/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220119005722/en/</a></span></p><p>\n<b>Press:</b>\n</p><p>\nWill Thoretz, ISG\n<br/>+1 203 517 3119\n<br/><a href=\"mailto:will.thoretz@isg-one.com\" data-type=\"email\" translate=\"no\">will.thoretz@isg-one.com</a>\n</p><p>\nErik Arvidson, Matter Communications for ISG\n<br/>+1 617 874 5214\n<br/><a href=\"mailto:isg@matternow.com\" data-type=\"email\" translate=\"no\">isg@matternow.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CT-ISG</p></div>"}