{"date": "2021-12-06 02:42:48.913000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>at AWS re:Invent, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company, announced three new Amazon Elastic Compute Cloud (Amazon EC2) instances powered by AWS-designed chips that help customers significantly improve the performance, cost, and energy efficiency of their workloads running on Amazon EC2. New C7g instances powered by next-generation AWS Graviton3 processors deliver up to up to 25% better performance than current generation C6g instances powered by AWS Graviton2 processors. New Trn1 instances powered by AWS Trainium chips provide the best price performance and the fastest time to train most machine learning models in Amazon EC2. New storage-optimized Im4gn/Is4gen/I4i instances based on AWS-designed AWS Nitro SSDs (solid-state drives) offer the best storage performance for I/O-intensive workloads running on Amazon EC2. Together, these instances herald the arrival of new Amazon EC2 instances based on AWS-designed chips that help customers power their most business-critical applications.</p><p>?With our investments in AWS-designed chips, customers have realized huge price performance benefits for some of today?s most business-critical workloads. These customers have asked us to continue pushing the envelope with each new EC2 instance generation,? said David Brown, Vice President, Amazon EC2 at AWS. ?AWS?s continued innovation means customers are now getting brand new, game changing instances to run their most important workloads with significantly better price performance than anywhere else.?</p></div><div class=\"tr-npp-body\"><p>C7g instances powered by new AWS Graviton3 processors deliver up to 25% better performance compared to current generation C6g instances powered by AWS Graviton2 processors</p><p>Customers like DirecTV, Discovery, Epic Games, Formula 1, Honeycomb.io, Intuit, Lyft, MercardoLibre, NextRoll, Nielsen, SmugMug, Snap, Splunk, and Sprinklr have seen significant performance gains and reduced costs from running AWS Graviton2-based instances in production since they launched in 2020. The Graviton2 instance portfolio offers 12 different instances that include general purpose, compute optimized, memory optimized, storage optimized, burstable, and accelerated computing instances, so customers have the deepest and broadest choice of cost-effective and power-efficient compute in the cloud. As customers bring more compute intensive workloads like high performance computing (HPC), gaming, and machine learning inference to the cloud, and as their compute, storage, memory, and networking demands grow, they are looking for even better price performance and energy efficiency to run these demanding workloads.</p><p>C7g instances, powered by next generation AWS Graviton3 processors, provide up to 25% better performance for compute-intensive workloads compared to current generation C6g instances powered by Graviton2 processors. AWS Graviton3 processors also deliver up to 2x higher floating point performance for scientific, machine learning, and media encoding workloads, up to 2x faster performance for cryptographic workloads, and up to 3x better performance for machine learning workloads compared to previous generation AWS Graviton2 processors. AWS Graviton3 processors are also more energy efficient, using up to 60% less energy for same performance than comparable EC2 instances. C7g instances are the first in the cloud to feature the latest DDR5 memory, which provides 50% higher memory bandwidth versus AWS Graviton2-based instances to improve the performance of memory-intensive applications like scientific computing. C7g instances also deliver 20% higher networking bandwidth compared to AWS Graviton2-based instances. C7g instances support Elastic Fabric Adapter (EFA), which allows applications to communicate directly with network interface cards, providing lower and more consistent latency, to enhance the performance of applications that require parallel processing at scale like HPC and video encoding. C7g instances are available today in preview.</p><p>Trn1 instances powered by AWS Trainium chips provide the best price performance and the fastest time to train most machine learning models in Amazon EC2</p><p>More and more customers are building, training, and deploying machine learning models to power applications that have the potential to reinvent their businesses and customer experiences. However, to ensure improved accuracy, these machine learning models must consume ever-growing amounts of training data, which causes them to become increasingly expensive to train. This dilemma can have the effect of limiting the number of machine learning models that customers are able to deploy. AWS provides the broadest and deepest choice of compute offerings for machine learning, including the EC2 P4d instances featuring NVIDIA A100 Tensor Core GPUs and EC2 DL1 instances featuring Gaudi accelerators from Habana Labs. But even with the fastest accelerated instances available today, it can still be prohibitively expensive and time consuming to train ever-larger machine learning models.</p><p>Trn1 instances powered by AWS Trainium chips offer the best price performance and the fastest machine learning model training in Amazon EC2, providing up to 40% lower cost to train deep learning models compared to the latest P4d instances. Trn1 instances offer 800 Gbps EFA networking bandwidth (2x higher than the latest EC2 GPU-based instances) and integrate with Amazon FSx for Lustre high performance storage?enabling customers to launch Trn1 instances with EC2 UltraClusters capability. With EC2 UltraClusters, developers can scale machine learning training to 10,000+ Trainium accelerators interconnected with petabit-scale networking, giving customers on-demand access to supercomputing-class performance to cut training time from months to days for even the largest and most complex models. Trn1 instances are available today in preview.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}