{"date": "2021-11-28 10:22:41.932000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3504.56, "close": 3507.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>At least 30 <a href=\"https://www.independent.co.uk/topic/extinction-rebellion\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Extinction Rebellion</a> (XR) activists have been arrested during the climate change group's nationwide protests against <a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> on Black Friday, police have confirmed.</p><p>A total of 17 people were detained at the Tilbury site in Essex, while a further four were arrested outside both the Manchester and Darlington depots.</p></div><div class=\"tr-npp-body\"><p>Demonstrations targeting the US firm's warehouses were also held in 10 other British towns and cities, including Newcastle and Peterborough. Others took place in Germany, the Netherlands and the US, according to XR.</p><p>Early on Friday morning, demonstrators gathered at sites across England and Scotland to set up bamboo structures and tents on roads in front of the warehouses.</p><p>The protests, which are planned to last two days, aim to draw attention to the business's effects on the environment and to their alleged \"exploitative business practices\".</p><p>\"The action is intended to draw attention to Amazon's exploitative and environmentally destructive business practices, disregard for workers' rights in the name of company profits, as well as the wastefulness of Black Friday,\" an XR spokesperson said.</p><p>They added that the obstructions were organised \"in solidarity\" with those demanding better working conditions and environmental standards as part of the Make Amazon Pay campaign.</p><p>\"Amazon continues to lobby the US government to fight against climate legislation while telling the public they are committed to green initiatives. They are committing the very definition of greenwash,\" the spokesperson added.</p><p>In response, Amazon said the company took its responsibilities \"very seriously\", claiming it provided \"excellent pay and benefits in a safe and modern work environment\" and also supported tens of thousands of small British businesses.</p><p>Addressing the protester's environmental concerns, it added that it was committed to becoming carbon neutral by 2040.</p><p>\"We know there is always more to do, and we'll continue to invent and invest on behalf of our employees, customers, small businesses and communities in the UK,\" the firm added.</p><p>The protests were criticised by some for the disruption they potentially caused residents in the areas targeted.</p><p>Anticipating this concern, the group tweeted: \"Why do we disrupt the public as well as government and big business? Yes it gets attention, but there's more to it than that.</p><p>\"If everyone understood the mass death, destruction and chaos coming down the tracks, millions would be on the streets demanding action, and getting it.\"</p><p>Meg Paton-Jones, an XR member attending the blockade at Dunfermline, the site of Amazon's largest warehouse in the UK, said she and her peers had been careful where they set up their blockade.</p><p>\"We started here at about 4am but are not blocking the employees' car park so the night shift can leave,\" she said.</p><p>\"We have good vibes and music,\" she added.</p><p>Down in Dartford, 20 activists started their protest shortly before 5am, with Kent Police saying that officers were at the scene trying to end the disruption \"to minimise traffic disruption in the area\".</p><p>At the Tilbury depot, activists took a dig at Amazon owner <a href=\"https://www.independent.co.uk/topic/jeff-bezos\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Jeff Bezos</a> for his recent trip into space, creating a model of a rocket with the words \"To Extinction and Beyond\" written on its side.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/world/americas/virgin-galactic-mother-daughter-space-tickets-b1964029.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Mom and teen daughter win tickets worth almost $1m for trip to space</a> </p><p><a href=\"https://www.independent.co.uk/news/alan-shepard-blue-origin-jeff-bezos-new-york-william-shatner-b1962821.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Good Morning America's Strahan among Blue Origin crew</a> </p><p><a href=\"https://www.independent.co.uk/space/jeff-bezos-blue-origin-michael-strahan-launch-b1962783.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Jeff Bezos to blast TV star and others into space</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/us-politics/bezos-obama-foundation-gift-donation-b1962512.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Bezos's $100m gift to Obama Foundation will fund leadership training</a> </p><p><a href=\"https://www.independent.co.uk/news/ceo-q-a-new-york-amazon-microsoft-b1959074.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Q&amp;A: Binance CEO on bubbles, meme coins and crypto's swings</a> </p><p><a href=\"https://www.independent.co.uk/weather/storm-arwen-news-live-weather-snow-b1964788.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Red warning expires even as 80,000 homes still without power -updates</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}