{"date": "2021-12-23 14:45:23.669000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>New Delhi [India], December 23 (ANI/PRNewswire): Holiday season and Christmas without music would be unthinkable, and as carols and seasonal songs take center stage, TPV Technology has announced attractive offers on the Philips Audio range of products with 'Philips Audio Days' on Amazon.in till 25th December 2021.</p><p>New Delhi [India], December 23 (ANI/PRNewswire): Holiday season and Christmas without music would be unthinkable, and as carols and seasonal songs take center stage, TPV Technology has announced attractive offers on the Philips Audio range of products with 'Philips Audio Days' on Amazon.in till 25th December 2021.</p></div><div class=\"tr-npp-body\"><p>To delight and celebrate the holiday season with their customers, a host of special offers and EMIs are being offered to make the special occasion even more melodious.</p><p>In order to fulfill customers' needs for an electrifying experience, the Philips audio range is a one-stop solution for all audiophiles. The stylish, durable &amp; ergonomically designed products make it the perfect audio partner whether at home or on the go. Be it a TWS, Wireless Headphones, BT Speaker or a Soundbar, with Philips Audio Days customers will get a huge variety of products with exclusive offers that fits all their audio needs this festive season. With rapid charge and long battery life that offers more playback time, ANC for an immersive audio experience, Bluetooth multipoint connectivity for an uninterrupted audio session or a powerful sound output, the Philips Audio range has it all.</p><p>Commenting on the announcement, Shailesh Prabhu, Country Head, TPV Technology India Pvt. Ltd. said,\"For the upcoming Holiday season, we are thrilled to announce exclusive offers on the Philips audio range of products. With this range we are focusing on providing a great sound experience to our consumers through latest features and designs that are appreciated by them. We believe the product offerings will be a perfect fit for consumers who are planning to travel this holiday season or those who want to just relax at home and enjoy a hi-fi immersive music experience.\"</p><p>TWS:</p><p>1. Philips TAT1235 TWS Headphones: The TAT1235 in-ear headphones offer true wireless freedom and great sound. With a small earbud they are designed for a snug fit. The touch control for music and calls, along with IPX5 water resistance provides for a comfortable experience and lets one switch over between calls and music with ease and move freely. The headphones come with a play time of up to 18 hours and are also equipped with built-in mic with echo cancellation for a clear voice. They also support smart pairing which connects previously-connected Bluetooth devices automatically with ease.</p><p>MRP: INR 5,999</p><p>Offer price : INR 2,399</p><p>2. Philips TAT1225 TWS Headphones offers play time of up to 18 hours for longer duration calls and also a complete package for listening to ones favourite music while working out or relaxing. It is equipped with built-in mic with echo cancellation for clear a clear voice. It also has an IPX4 splash-proof design, supports Voice Assistant and fast-pairing (with Bluetooth 5.1) for a seamless experience.</p><p>MRP: INR 4,999</p><p>Offer price : INR 1,599</p><p>HEADPHONES:</p><p>1. Philips TAPH805 ANC Over-Ear Bluetooth Headphones: TAPH805BK comes with Active Noise Cancellation which can be changed to ambient mode to match ones situation. With play time of 30 hours (25 hours with ANC off) along with quick charge option, these headphones are a complete package. The quick charge of 15 minutes offers 6 hours play. From focus playlist to an important call, it is also equipped with Google Assistant to make ones next move. It also features touch controls (on the right ear cup), a line-in cable for wired listening, and a protective carrying pouch.</p><p>MRP: INR 13,990</p><p>Offer price: INR 6,999</p><p>2. Philips TAH6506 Headphones: The newly launched Philips TAH6506BK over-ear wireless headphones feature ANC as well as Bluetooth multipoint connectivity, allowing users to connect to two devices at the same time. With the ANC turned on, the Philips headphones have a total playback time of up to 25 hours and up to 30 hours when turned off. Equipped with a USB Type-C port, these headphones can be quickly charged for just 15 minutes providing a play time of up to 2 hours. The Philips TAH6506BK headphones feature a multi-function button (MFB) that controls music, calls, and activates voice assistant. Bluetooth smart pairing allows for seamless pairing between device and the headphones. They also feature a compact, flat-folding design and come with a carrying pouch for storage and protection. Also included is 3.5 mm line-in cable for wired listening, should one run out of battery while on the go.</p><p>MRP: INR 11,999</p><p>Amazon Price: INR 5,799</p><p>3. Philips TAPH802 Over-Ear Bluetooth Headphones: TAPH802BK comes with playtime of 30 hours along with quick charge option, these headphones are a complete package. The quick charge gives between 2 and 6 hours extra power. Week in, week out, these headphones are up to the most demanding commute. A single charge takes just 1.5 hours, and gives one 30 hours play time or talk time. Not only this, it is also equipped for Hi-Res Audio that is enabled when one plugs in the line-in cable (included) for wired listening.</p><p>MRP: INR 10,990</p><p>Offer price: INR 4,499</p><p>NECKBANDS:</p><p>1. Philips TAPN505 ANC Neckband: If consumers are looking for a light weight neckband with smart functionality then TAPN505BK is the right fit. It offers Active Noise Cancellation for zero distractions and 14 hours of play time (10 hours with ANC on). The rapid charge option offers 2 hours of play time with a charge of just 5 minutes. These headphones offer Hi-Res audio which reproduces high frequencies of up to 40 kHz, providing more detail when one is on the move. It also includes a line-in cable (for wired listening and Hi-Res Audio) and a carrying pouch for protection.</p><p>MRP: INR 11,990</p><p>Offer price: INR 4,999</p><p>2. Philips TAPN402 in-Ear Neckband: Don't miss a beat. These IPX4 splash-proof wireless earbuds boast a slim neckband for convenience and comfort. Earbuds in or earbuds out, one will know where they are. Vibration Mode alerts customers when there is a call, and onegets 14 hours of play time. The neckband comes with a IPX4 Splash-Proof design for musical journeys in the rain. They also offer Hi-Res audio which reproduces high frequencies, providing more detail when one is on the move.</p><p>MRP: INR 7,990</p><p>Offer price: INR 3,299</p><p>3. Philips TAN2215 Neckband is a flexible neckband and comes with IPX4-rated splash-proof design, with 11 hours of play time and dynamic bass. Listeners can now enjoy the quality of sound in its truest sense with passive noise isolation for better sound at lower volume. It also sports magnetic ear tips which keep them in place when not in use; and the slender, flexible and lightweight neckband ensures durability and comfort.</p><p>MRP: INR 3,999</p><p>Offer price: INR 1,425</p><p>4. Philips TAE1205 Bluetooth Neckband: Keep music close. These IPX4 rated splash and sweat-resistant wireless headphones give one great sound, a comfortable in-ear fit, and up to 7 hours play time. When required, a quick 15-minute charge keeps the music playing another 1.5 hours.</p><p>MRP: INR 3,799</p><p>Offer price: INR 1,799</p><p>BLUETOOTH SPEAKER:</p><p>1. Philips BT2003 Wireless Portable Speaker: Combined with Bluetooth, compact, trendy camouflage design, USB Type-C charging and, the BT2003 is an ideal companion for the globetrotting fashionista in everyone. With its built-in microphone, this speaker also works as a speaker phone, one can connect on phone calls hands-free.</p><p>MRP: INR 2,499</p><p>Offer price: INR 1,199</p><p>MULTIMEDIA SPEAKERS:</p><p>1. Philips MMS2220B Multimedia Speaker: With a 120 W output, the MMS2220B Bluetooth speakers are ideal for home entertainment. They can either be placed as individual towers, or they can be converted into a soundbar on demand. The perfect accompaniment for home entertainment setup, so one can play multimedia music and videos with great sound quality.</p><p>MRP: INR 15,990</p><p>Offer price: INR 11,490</p><p>2. Philips SPA4040B Multimedia Speaker: With 45 W sound output and Bluetooth connectivity, these speakers are perfect for playing music, games, movies and online videos on mobile phones. One can experience more digital music via the built-in USB port.</p><p>MRP: INR 6,990</p><p>Offer price: INR 5,790</p><p>SOUNDBARS:</p><p>1. Philips TAPB603 Soundbar: Experience cinematic sound from ones sofa. This 320 W Dolby Atmos soundbar with wireless subwoofer draws customers deeper into the shows and movies they love. Customers will hear the drama flow around them, and even overhead. The central speaker in this soundbar ensures dialogue is crisp, clear--and beautifully balanced. The soundbar is also equipped with HDMI-out (ARC) which lets one use it with their TV remote.</p><p>MRP: INR 39,990</p><p>Offer price: INR 28,990</p><p>2. Philips TAB5305 Soundbar: This soundbar will help take the TV audio to the next level, delivering clearer sound and deeper bass. With Bluetooth, audio-in, and optical inputs, one can liberate their music too. The HDMI ARC makes it convenient to control the soundbar with TV remote. The TAB5305 comes with a distinct and compact wireless subwoofer delivering satisfying bass which makes the music sound fuller. Indulge in an electrifying audio experience with this stylish sound bar by Philips.</p><p>MRP: INR 14,990</p><p>Offer price: INR 8,990</p><p>This story is provided by PRNewswire. ANI will not be responsible in any way for the content of this article. (ANI/PRNewswire)</p><p>Copyright © 2021 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}