{"date": "2021-12-17 21:12:52.119000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3377.42, "close": 3341.58}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SCRYB INC (\"SCYB-Z\")\n- Cybeats Addresses Widespread 'Log4j' Vulnerability\n\n     Scryb Inc. (\"Scryb\" or the \"Company\") provides commentary on the\nwidespread log4j1 vulnerability discovered on December 9th, potentially\nallowing unauthorized remote access. The United States Cybersecurity and\nInfrastructure Security Agency issued an alert about the vulnerability,\nand noted that it is reportedly being actively exploited.2\n\n     Log4j is a java library for activity logging, software producers and\nconsumers are currently spending significant resources to identify where\nthis library exists in software or deployed systems. Some enterprises with\nadvanced software inventory systems are reporting success mitigating this\nvulnerability, whereas several organizations are set to spend extensive\nresources over the coming months to fully address this issue.  Having\nmanaged one's Software Bill of Materials (SBOM), these products that carry\nthe vulnerabilities would be far easier to identify and mitigate.\nWell-managed CI/CD pipelines including attestations such as SBOM are\ncurrently providing value and certainty to recovery plans.\n\n     \"This is the type of vulnerability that was leveraged in the Equifax\nbreach in 2017 and it will take a while until it stabilizes and all the\nimpacted software is patched,\" said Dmitry Raidman, co-founder and CTO,\nCybeats. \"Any java code based products are potentially to be affected, it\nmight take months until the patches are to be delivered to active\nenvironments, and some companies that are vulnerable to this exploit at the\nmoment are unaware. To manage this type of risk better in the future,\ncompanies may look at SBOM and VEX CSAF as means of obtaining transparency\nand knowing their software better.\"\n\n     This vulnerability serves as an important indicator of changes\nunderway in supply chain infrastructure. The transparency implicit in\nsoftware inventory systems and specifically, SBOM are necessary to ensure\nstability in software supply chains long term. Multiple Cybeats executives\nand advisors including CTO &amp; co-founder, Dmitry Raidman, were participants\nin the U.S. Department of Commerce SBOM working groups which resulted in\nthe SBOM standard adopted by the U.S. federal government. The Company has\ndeveloped the SBOM Studio(TM) product to accomplish in seconds what takes\nweeks. SBOM Studio(TM) provides management of SBOM's from design to\noperation including orchestration with access management for sharing, AI/ML\nvulnerability and risk analysis and security posture ranking for supply\nchain organizations and software components.\n\n     \"Forward-looking enterprises may take this as an opportunity to adopt\nprocesses represented by Software Bill of Materials to mitigate future\ncostly incidents like log4j and gain the other economic benefits and a\nbetter software asset inventory control,\" said Chris Blask, VP Strategy.\n\n     Subsequent Developments\n\n     Univeiled subsequent to the log4j revelations on December 9, Log4j is\nnow experiencing a second vulnerability already that has been weaponized\nand a new patch version 2.16.0.3\n\n     CNBC recently interviewed CISA Director, Jen Easterly, who said log4j\nis \"the most serious vulnerability she's seen in her decade-long career\".4\nThe log4j vulnerability has been conveyed using the analogy: how many rooms\nin all Quebec government buildings use 60-watt light bulbs? The answer is\nlikely to physically walk to each room and see if each bulb is 60-watt.5\n\n     Detecting the vulnerability in a website is a short process, but\nwithout an up-to-date inventory list, verifying whether all of the\ncomponents affected could take several months. Some regions such as Quebec\nhave reacted by shutting down nearly 4,000 websites as a preventative\nmeasure, until the gravity of the situation is assessed.6\n\n     Log4j is used in thousands of applications, and Authomize has\ngraciously compiled a robust and lengthy list of entities affected by this\nvulnerability which includes the likes of Amazon, Apache and Microsoft.7\n\n     About Cybeats\n\n     Cybeats is holistic software supply chain security that builds\ncertainty through visibility, comprehensive protection and proactive\nresponse, from launch to legacy. Cybeats. Software made certain.\n\n     Website: <a href=\"https://cybeats.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://cybeats.com</a>\n\n     About Scryb\n\n     Scryb is a platform that powers businesses and technologies with\napplied intelligence, real-time analytics, and actionable insights. The\nplatform boasts proven adaptability across diverse markets, from digital\nhealth and diagnostics to cybersecurity and manufacturing. The cloud-based\nplatform is composed of crucial elements including sensor technology, IoT,\npredictive analytics, and computer vision.\n\n     For more information, or to 'SubScryb' to the Company's mail list,\nvisit: <a href=\"https://www.scryb.ai\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.scryb.ai</a>.\n\n     Contact:\n     W. Clark Kent\n     President\n     Office. 647-872-9982\n     TF. 1-844-247-6633\n     Email: info@scryb.ai\n\n     Forward-looking Information Cautionary Statement\n\n     Except for statements of historic fact, this news release contains\ncertain \"forward-looking information\" within the meaning of applicable\nsecurities law.   Forward-looking information is frequently characterized\nby words such as \"plan\", \"expect\", \"project\", \"intend\", \"believe\",\n\"anticipate\", \"estimate\" and other similar words, or statements that\ncertain events or conditions \"may\" or \"will\" occur.   Forward-looking\nstatements are based on the opinions and estimates at the date the\nstatements are made, and are subject to a variety of risks and\nuncertainties and other factors that could cause actual events or results\nto differ materially from those anticipated in the forward-looking\nstatements including, but not limited to delays or uncertainties with\nregulatory approvals, including that of the CSE.  There are uncertainties\ninherent in forward-looking information, including factors beyond the\nCompany's control. There are no assurances that the commercialization plans\nfor the technology described in this news release will come into effect on\nthe terms or time frame described herein.  The Company undertakes no\nobligation to update forward-looking information if circumstances or\nmanagement's estimates or opinions should change except as required by law.\nThe reader is cautioned not to place undue reliance on forward-looking\nstatements.  Additional information identifying risks and uncertainties\nthat could affect financial results is contained in the Company's filings\nwith Canadian securities regulators, which filings are available at\nwww.sedar.com.\n\n     1 <a href=\"https://en.wikipedia.org/wiki/Log4j\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://en.wikipedia.org/wiki/Log4j</a>\n     2\n<a href=\"https://www.cisa.gov/uscert/ncas/current-activity/2021/12/10/apache-release\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cisa.gov/uscert/ncas/current-activity/2021/12/10/apache-release</a>\ns-log4j-version-2150-address-critical-rce\n\n     3\n<a href=\"https://thehackernews.com/2021/12/hackers-begin-exploiting-second-log4j.htm\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://thehackernews.com/2021/12/hackers-begin-exploiting-second-log4j.htm</a>\nl?m=1\n\n     4\n<a href=\"https://www.cnbc.com/video/2021/12/16/log4j-vulnerability-the-most-serious\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cnbc.com/video/2021/12/16/log4j-vulnerability-the-most-serious</a>-\nive-seen-in-my-decades-long-career-says-cisa-director.html\n\n     5\n<a href=\"https://www.cbc.ca/news/canada/montreal/quebec-cybersecurity-threat-governm\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cbc.ca/news/canada/montreal/quebec-cybersecurity-threat-governm</a>\nent-website-1.6283133\n\n     6\n<a href=\"https://montreal.ctvnews.ca/quebec-shuts-down-3-992-websites-as-preventativ\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://montreal.ctvnews.ca/quebec-shuts-down-3-992-websites-as-preventativ</a>\ne-measure-after-security-flaw-discovered-1.5704258\n\n     7\n<a href=\"https://github.com/authomize/log4j-log4shell-affected/blob/main/affected_co\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://github.com/authomize/log4j-log4shell-affected/blob/main/affected_co</a>\nmponents.md\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135000348.MNPRE2135001485-10484120211217</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}