{"date": "2021-07-30 17:34:00.038000+00:00", "ticker": "III", "mrkt_info": {"open": 1286.5, "close": 1293.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- Cross Carbon Ventures Announces Formation of Carbon Capture\n- Development Partnership\n\n    Svante Inc., Enbridge Inc., Cross River Infrastructure Partners LLC,\nand OTS Ltd., have entered into a commercial Memorandum of Understanding\nthat establishes Cross Carbon Ventures (CCV), an independent carbon capture\ndevelopment partnership. CCV will explore commercial opportunities in North\nAmerica to develop, build, own and operate carbon capture projects for\ncarbon intensive industries seeking to decarbonize their operations.\n\n    CCV will target the decarbonization of emissions by heavy industries\nincluding cement, steelmaking, petroleum refining, and large-scale hydrogen\nproduction through the development of point-source carbon capture projects.\n\n    \"Providing large-scale industrial emitters with a Carbon\nCapture-as-a-Service offering will be integral to scaling up the carbon\ncapture industry along with CO2 hubs to achieve global decarbonization\ntargets,\" said Aaron Ratner, President of CCV.\n\n    CCV will leverage Svante's innovative technology to capture carbon\ndirectly from industrial post-combustion flue gases to produce\npipeline-grade CO2 for safe transportation and storage.\n\n    \"CCV is an ideal partnership to commercialize our technology and to\nprovide a net-zero CO2 emission solution. CCV's offering, along with\nprogressive carbon abatement policies can make a Carbon\nCapture-as-a-Service business model profitable across a range of\nlarge-scale industrial applications,\" said Claude Letourneau, Svante's\nPresident and CEO.\n\n    Enbridge, North America's leading energy infrastructure company, has a\nunique asset footprint and capabilities spanning the transportation and\nstorage of conventional and low carbon energy sources that are essential to\nmeeting global emissions reduction goals.\n\n    CCV will also benefit from OTS's experience in operational readiness,\ncommissioning, operation and maintenance of complex first-of-a-kind\nsustainable infrastructure projects.\n\n    About Svante\n\n    Svante offers companies in emissions-intensive industries a viable way\nto capture large-scale CO2 emissions from existing infrastructure, either\nfor safe storage or to be used for further industrial use in a closed loop.\nWith the ability to capture CO2 directly from industrial sources at less\nthan half the capital cost of existing solutions, Svante makes\nindustrial-scale carbon capture a reality. Svante's technology is currently\nbeing deployed in the field at pilot plant-scale by industry leaders in the\nenergy and cement manufacturing sectors. The CO2MENT Pilot Plant Project -\na partnership between Lafarge (Holcim) and TOTAL S.A. - is operating a 1\ntonne per day (TPD) plant in Richmond, British Columbia, Canada that will\nre-inject captured CO2 into concrete, while the construction and\ncommissioning of a 30 TPD demonstration plant was completed in 2019 at an\nindustrial facility in Lloydminster, Saskatchewan, Canada. A 25 TPD\ndemonstration plant is currently under design and construction at Chevron\nU.S.A. located near Bakersfield, California. In addition, several\nfeasibility studies for commercial scale carbon capture projects ranging\nfrom 500 to 4,500 TPD are underway in North America and Europe.\n\n    Svante has attracted more than USD$195 million in investment since it\nwas founded in 2007 including the recent CDN$25 million investment from the\nGovernment of Canada's Strategic Innovation Fund. Svante's Board of\nDirectors includes Nobel Laureate and former Secretary of Energy, Steven\nChu, and Chairman Steven Berkenfeld, former Head of Industrial &amp; Cleantech\nPractice at Barclays Capital. To learn more about Svante's technology,\nclick here or visit Svante's website www.svanteinc.com, LinkedIn or Twitter\n(@svantesolutions).\n    About Enbridge\n\n    Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which generates approximately\n1,766 MW of net renewable power in North America and Europe. The Company's\ncommon shares trade on the Toronto and New York stock exchanges under the\nsymbol ENB. For more information, visit www.enbridge.com.\n\n    About Cross River Infrastructure Partners\n\n    Cross River Infrastructure Partners LLC is a platform of development\ncompanies deploying industry-leading climate technologies and sustainable\ninfrastructure projects across carbon capture and carbon utilization,\nsustainable protein, clean fuels and clean energy. Cross River focuses on\ndeveloping and commercializing early and first-of-a-kind projects in North\nAmerica. For more information, visit www.crossriverllc.com.\n\n    About OTS\n\n    OTS is a premier provider of Pre-Commissioning, Commissioning and\nStart-Up and Operations and Maintenance services for the energy, mining and\nutility sectors. With four locations throughout North America and a roster\nof hundreds of skilled employees, OTS has worked on major capital projects\nsince inception in 2005. Our leading quality management system, based on\nISO 9001:2015 standards, ensures consistency and precision in project\nexecution. Our management team is hands-on for every project and are always\naccessible. Real-time reporting, a commitment to safety and rigorous\ntraining, make OTS the best choice to get your project into a steady-state\noperation safely and efficiently. For more information, please visit\nwww.otsl.ca.\n\nContact Information:\n\nCross Carbon Ventures Contact\nAaron Ratner\naratner@crossriverllc.com\nEnbridge Contact\nmedia@enbridge.com\n+1 (888) 992 0997\n\nSvante Contact\nJulia McKenna\njmckenna@svanteinc.com\n+1 (778) 985 5722\n\nOTS Contact\nMatt Denney\nmdenney@otsl.ca\n+1 (902) 577-6209\n\nTel   : 403-231-3900    ENBRIDGE INC\nFax   : 403-231-5929\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2121000173.MNPRE2121000875-06435720210730</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}