{"date": "2022-01-05 13:00:06+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>BlackBerry Showcases BlackBerry IVY on Auto-Grade Hardware at CES 2022 with Partner Integrations from Amazon Web Services, HERE Technologies, Car IQ and Electra Vehicles</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">BlackBerry Showcases BlackBerry IVY on Auto-Grade Hardware at CES 2022 with Partner Integrations from Amazon Web Services, HERE Technologies, Car IQ and Electra Vehicles</p>\n<p>Canada NewsWire</p>\n<p>LAS VEGAS, Jan. 5, 2022</p>\n<p>\n<span>\n<span>EV Range Expert demo illustrates how the platform's adaptive and intelligent features enhance experiences for drivers, passengers and OEMs alike</span>\n</span>\n</p>\n<p>\n<span>LAS VEGAS</span> , <span>Jan. 5, 2022</span> /CNW/ -- <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3402689-1&amp;h=2366317045&amp;u=https%3A%2F%2Fwww.blackberry.com%2Fus%2Fen&amp;a=BlackBerry+Limited\" data-type=\"url\" class=\"tr-link\" translate=\"no\">BlackBerry Limited</a>\n</span> (NYSE: BB; TSX: BB) today unveiled how it is laying the groundwork for the software-defined vehicles of the future with an automotive-grade hardware demonstration of <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3402689-1&amp;h=1570062106&amp;u=https%3A%2F%2Fwww.blackberry.com%2Fus%2Fen%2Fproducts%2Fautomotive%2Fblackberry-ivy&amp;a=BlackBerry+IVY%E2%84%A2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">BlackBerry IVY™</a> , the company's Intelligent Vehicle Data Platform, co-developed with Amazon Web Services (AWS).</p>\n<p>\n\n</p>\n<p>This demonstration will be available to view at CES 2022 in Booth #4319 in the West Hall, marking the first time BlackBerry IVY has been publicly shown on physical hardware. The EV Range Expert demo showcases how BlackBerry IVY is leveraged to develop enhanced experiences for a family embarking on a road trip in their electric vehicle.</p>\n<p>At the booth, visitors can see in real-time the AI-based decisions being made by BlackBerry IVY and what the in-car experience could look like for drivers and passengers though a physical car dashboard. Incorporating technology from BlackBerry IVY ecosystem partners including HERE Technologies, Car IQ® and Electra Vehicles, the demo illustrates powerful use cases that can be enabled via the platform in the form of enhanced predictions, intelligent recommendations and in-car payment capabilities that utilize in-vehicle data from multiple sensors.</p>\n<p>Leveraging <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3402689-1&amp;h=2626727608&amp;u=https%3A%2F%2Fwww.electravehicles.com%2Feve-ai-adaptive-controls&amp;a=Electra%27s+EVE-Ai%E2%84%A2+360+Adaptive+Controls\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Electra's EVE-Ai™ 360 Adaptive Controls</a> for battery pack optimization, the demo provides an accurate battery state of charge (SoC) and range prediction based on driver detection and personalization, while actively working to extend range and preserve battery lifetime. Additionally, the demo ingests preloaded <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3402689-1&amp;h=387248066&amp;u=https%3A%2F%2Fwww.here.com%2F&amp;a=HERE+Technologies%27\" data-type=\"url\" class=\"tr-link\" translate=\"no\">HERE Technologies'</a> data to provide tailored guidance, pricing and availability of vehicle charge stop locations, more efficient routes with carbon footprint estimates, and individual driver customizations. A third integration via <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3402689-1&amp;h=2036914234&amp;u=https%3A%2F%2Fwww.gocariq.com%2F&amp;a=Car+IQ\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Car IQ</a> creates a \"digital fingerprint\" for the vehicle, allowing it to securely connect to a bank, card payment networks and in-vehicle marketplaces that allow the car to validate and autonomously pay for a wide range of frequently used services, including EV charging, tolls, parking, insurance, maintenance, and other payment and wallet capabilities. The multi-OS, distributed architecture demonstration features BlackBerry IVY running on both Linux and QNX across gateway and digital instrument cluster domains, in collaboration with KPIT Technologies.</p>\n<p>\"There's no better place than CES to showcase what the future of mobility will look like and it's a real thrill to finally lift the curtain on BlackBerry IVY and show to the world the vast potential that it can unlock for OEMs, Tier 1s and end users alike,\" said <span>Vito Giallorenzo</span> , SVP Corporate Development &amp; Chief Operating Officer, IoT. \"BlackBerry IVY allows automakers to develop a better understanding of how vehicles are used and can be improved while allowing software developers to create enhanced services and experiences for drivers. Being able to see in real-time how the platform enables all this is incredibly powerful and a great a catalyst to help those from across the transportation industry re-imagine all that is possible when you have the right tool, and I'm sure there will be no shortage of these 'light bulb' moments when visitors see it for themselves.\"</p>\n<p>BlackBerry's full suite of automotive offerings will be demonstrated at the Consumer Electronics Show (CES) in <span>Las Vegas</span> from <span>January 5</span> – 8, 2022, at the Las Vegas Convention Center. Visit BlackBerry at Booth #4319 in the West Hall.</p>\n<p>\n<span>About BlackBerry</span>\n</p>\n<p>BlackBerry (NYSE: BB; TSX: BB) provides intelligent security software and services to enterprises and governments around the world. The company secures more than <span>500M</span> endpoints including <span>195M</span> vehicles. Based in <span>Waterloo, Ontario</span> , the company leverages AI and machine learning to deliver innovative solutions in the areas of cybersecurity, safety, and data privacy solutions, and is a leader in the areas of endpoint security, endpoint management, encryption, and embedded systems. BlackBerry's vision is clear - to secure a connected future you can trust.</p>\n<p>BlackBerry. Intelligent Security. Everywhere.</p>\n<p>For more information, visit BlackBerry.com and follow @BlackBerry.</p>\n<p>\n<span>Trademarks, including but not limited to BLACKBERRY and EMBLEM Design are the trademarks or registered trademarks of BlackBerry Limited, and the exclusive rights to such trademarks are expressly reserved. All other trademarks are the property of their respective owners. BlackBerry is not responsible for any third-party products or services.</span>\n</p>\n<p>\n<span>Media Contacts:</span> BlackBerry Media Relations+1 (519) 597-7273 <a href=\"mailto:mediarelations@BlackBerry.com\" data-type=\"email\" translate=\"no\">mediarelations@BlackBerry.com</a>\n</p>\n<p>View original content to download multimedia: <a href=\"https://www.prnewswire.com/news-releases/blackberry-showcases-blackberry-ivy-on-auto-grade-hardware-at-ces-2022-with-partner-integrations-from-amazon-web-services-here-technologies-car-iq-and-electra-vehicles-301453478.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/blackberry-showcases-blackberry-ivy-on-auto-grade-hardware-at-ces-2022-with-partner-integrations-from-amazon-web-services-here-technologies-car-iq-and-electra-vehicles-301453478.html</a>\n</p>\n<p>SOURCE BlackBerry Limited</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/January2022/05/c7968.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/January2022/05/c7968.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}