{"date": "2022-02-04 10:03:28.859000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon's profits surged to $14.32bn in a fourth quarter marked by record holiday sales, the company said in its earnings report on Thursday, while also announcing an increase in the price of Amazon Prime membership to help compensate for rising operating costs.</p><p>In the three months ending in December 2021, sales for the e-commerce giant were up 24% from a sluggish third quarter to $137.4bn. Sales are also up 9% year-over-year from the same period in 2020.</p></div><div class=\"tr-npp-body\"><p>The fourth quarter includes the holiday shopping season, a crucial period for retail. According to its <a href=\"https://s2.q4cdn.com/299287126/files/doc_financials/2021/q4/business_and_financial_update.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">quarterly report</a> , Amazon had its most lucrative Black Friday and Cyber Monday weekend this year. And \"between Black Friday and Christmas, US-based third-party sellers sold an average of 11,500 products per minute\", the company announced it its earnings release.</p><p>But the company is still feeling some of the effects of a battered supply chain and has increased wages to attract and retain its sprawling workforce in the tight labor market. In September, Amazon upped its average starting wage again to $18 an hour, and began including <a href=\"https://www.theguardian.com/technology/2021/sep/14/amazon-offers-3000-sign-on-bonuses-to-us-delivery-and-warehouse-workers\" data-type=\"url\" class=\"tr-link\" translate=\"no\">signing bonuses</a> to entice hourly workers.</p><p>\"Lost productivity and network disruptions were driven primarily by labor capacity constraints due to challenges in staffing up our facilities for peak,\" Amazon's chief financial officer, Brian Olsavsky, said in an earnings call on Thursday, referring to the busy holiday season.</p><p>\"This was driven by the very tight labor market in the second half of 2021, and more recently by the emergence of the Omicron variant. We do expect these cost challenges to persist into Q1, albeit adjusted for lower seasonal volumes relative to the fourth quarter.\"</p><p>To compensate, the company is turning up the dial on one of its most successful revenue streams. The price of an annual Amazon Prime subscription will increase from $119 to $139 this month to account for the \"rise in wages and transportation costs\", according to the company. For new Prime members, this change will go into effect on 18 February, and after 25 March for existing members.</p><p>Amazon defended the cost rise in it in its earnings call, pointing out its array of premium content including Amazon original programming and the upcoming release of The Lord of the Rings: The Rings of Power. It also noted that Amazon will become the exclusive home of NFL Thursday Night Football starting in September.</p><p>Amazon remains one of the biggest winners of the past few years as consumer spending shifted to e-commerce during the pandemic. The company had its two most profitable quarters in the past two years.</p><p>This turnaround comes after a difficult third quarter for the company. Last quarter, Amazon reported a substantial profit decline – <a href=\"https://www.theguardian.com/technology/2021/oct/28/amazon-profits-jeff-bezos-earnings-revenues\" data-type=\"url\" class=\"tr-link\" translate=\"no\">its largest in four years</a> . Amazon blamed pandemic-induced supply chain disruptions and staffing issues for the drop – from $6.3bn to $3.2bn – which resulted in higher labor costs and spending on logistics investments, like warehouses and infrastructure. Amazon is the second-largest private employer in the US with <a href=\"https://www.businessinsider.com/amazon-employees-number-1-of-153-us-workers-head-count-2021-7\" data-type=\"url\" class=\"tr-link\" translate=\"no\">nearly a million workers</a> .</p><p>As some of the US's most profitable companies have <a href=\"https://www.theguardian.com/business/2022/jan/28/white-knuckle-week-for-tech-titans-as-shares-and-fortunes-fall\" data-type=\"url\" class=\"tr-link\" translate=\"no\">taken a beating</a> , Amazon's success contrasts with a shocking result from fellow giant Meta yesterday. The social networking giant's profits decreased 8% from last year, to $10.3bn. This was mostly fueled by increased spending on investments toward the Metaverse – the virtual reality-based version of the internet Mark Zuckerberg envisions – which totaled $10bn.</p><p>More surprising, the number of Facebook users declined for the very first time. This confirms the warning calls from internal documents made public by whistleblower Frances Haugen last year, one of which <a href=\"https://www.theguardian.com/technology/2022/feb/03/why-facebook-shares-are-in-freefall-meta-zuckerberg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">revealed</a> that \"engagement is declining for teens in most western, and several non-western, countries\". Until now, the company has managed to grow its user base consistently for years, despite scandals and controversy. In response to the earnings report, shares in Meta <a href=\"https://www.theguardian.com/technology/2022/feb/02/facebook-shares-slump-growth-fourth-quarter\" data-type=\"url\" class=\"tr-link\" translate=\"no\">dropped 25%</a> .</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 theguardian.com-NonSyndicated</p></div>"}