{"date": "2021-11-24 16:11:26.954000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.04, "close": 3504.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PLUG POWER INC (\"PLUG-Q;PLUN-F\")\n- Selected by Fertiglobe's Green Hydrogen Consortium to\n- Deliver 100MW Electrolyzer for Green Ammonia\n\n   Plug Power Inc., a leading provider of turnkey hydrogen solutions for\nthe global green hydrogen market, today announces it has been selected by\nFertiglobe (ADX: FERTIGLB) the strategic partnership between OCI NV\n(Euronext: OCI)  and the Abu Dhabi National Oil Company (ADNOC) and Scatec\nASA (OSE: SCATC), the Sovereign Fund of Egypt and Orascom Construction\n(NASDAQ Dubai: OC; EGX: ORAS), as the technology provider for a 100\nmegawatts electrolyzer to produce green hydrogen as feedstock for up to\n90,000 tons of green ammonia production at EBIC in Ain Sokhna, Egypt.\n\n   Egypt is an ideal location to produce green hydrogen given its unique\nrenewables profile with strong solar and wind loads, and close to markets\nwith a hydrogen deficit. Green ammonia, produced from renewable energy such\nas solar and wind instead of natural gas, is a versatile product that is an\nideal carrier fuel to store and transport hydrogen, and can help\ndecarbonize numerous sectors which represent around 80% of current global\nGreenhouse Gas (GHG) emissions, including as an important alternative fuel\nin the power sector in Japan and other countries.\n\n   \"Plug Power congratulates the members of Egypt's Green Hydrogen\nConsortium, including Fertiglobe, Orascom Construction and others, on their\nplans to develop the country's first green hydrogen production facility,\"\nsaid Andy Marsh, CEO of Plug Power. \"We are thrilled by the Consortium's\nexciting move to put Egypt and the MENA region on the green hydrogen map.\"\n\n   Marsh Continued, \"This order reinforces our strong booking momentum in\nthe electrolyzer business and puts Plug Power well on its path to achieving\nits 2022 electrolyzer sales plan. Plug Power is aggressively pursuing an\nextensive sales pipeline of green hydrogen and green ammonia projects. We\ncontinue to establish meaningful global partnerships in the green hydrogen\neconomy where we can deliver our commercial electrolyzer solutions.\"\n\n   Nassef Sawiris, Executive Chairman of OCI NV, commented: \"We are excited\nto announce this key milestone in this essential piece of our hydrogen\nstrategy. Plug Power is a leader in electrolysis technology, and this\nstrategic partnership further solidifies our execution strategy. At\nstart-up, this will be the largest green hydrogen and largest green ammonia\napplication globally. Construction is expected to follow an accelerated\nschedule to showcase the green hydrogen facility during COP 27 in Egypt in\nNovember 2022, highlighting Egypt's and Fertiglobe's growing leadership in\nthe renewable energy markets and commitment to a greener future.\"\n\n   Ahmed El-Hoshy, Chief Executive Officer of Fertiglobe, commented: \"This\nis a huge step forward in our ambition to decarbonize our footprint to net\nzero by 2050, and simultaneously help our customers decarbonize. As an\nearly mover in clean hydrogen-based fuels, we are pleased that Fertiglobe\nis partnering with Plug Power to deploy cutting edge technology at scale.\"\n\n   About Plug Power\n\n   Plug Power is building the hydrogen economy as the leading provider of\ncomprehensive hydrogen fuel cell (HFC) turnkey solutions. The Company's\ninnovative technology powers electric motors with hydrogen fuel cells amid\nan ongoing paradigm shift in the power, energy, and transportation\nindustries to address climate change and energy security, while providing\nefficiency gains and meeting sustainability goals. Plug Power created the\nfirst commercially viable market for hydrogen fuel cell (HFC) technology.\nAs a result, the Company has deployed over 50,000 fuel cell systems for\ne-mobility, more than anyone else in the world, and has become the largest\nbuyer of liquid hydrogen, having built and operated a hydrogen highway\nacross North America. Plug Power delivers a significant value proposition\nto end-customers, including meaningful environmental benefits, efficiency\ngains, fast fueling, and lower operational costs. Plug Power's vertically\nintegrated GenKey solution ties together all critical elements to power,\nfuel, and provide service to customers such as Amazon, BMW, The Southern\nCompany, Carrefour, and Walmart. The Company is now leveraging its\nknow-how, modular product architecture and foundational customers to\nrapidly expand into other key markets including zero-emission on-road\nvehicles, robotics, and data centers.\n\n   About Fertiglobe\n\n   Fertiglobe is the world's largest seaborne exporter of urea and ammonia\ncombined, and an early mover in clean ammonia. Fertiglobe's production\ncapacity comprises of 6.7 million tons of urea and merchant ammonia,\nproduced at four subsidiaries in the UAE, Egypt and Algeria, making it the\nlargest producer of nitrogen fertilizers in the Middle East and North\nAfrica (MENA), and benefits from direct access to six key ports and\ndistribution hubs on the Mediterranean Sea, Red Sea, and the Arab Gulf.\nHeadquartered in Abu Dhabi and incorporated in Abu Dhabi Global Market\n(ADGM), Fertiglobe employs more than 2,600 employees and was formed as a\nstrategic partnership between OCI N.V. (\"OCI\") and the Abu Dhabi National\nOil Company (\"ADNOC\"). Fertiglobe is listed on the Abu Dhabi Securities\nExchange (\"ADX\") under the symbol \"FERTIGLB\" and ISIN \"AEF000901015. To\nfind out more, visit: www.fertiglobe.com\n\n   About OCI N.V.\n\n   OCI N.V. (Euronext: OCI) is a leading global producer and distributor of\nhydrogen-based products providing low carbon fertilizers, fuels, and\nfeedstocks to agricultural, transportation, and industrial customers around\nthe world. OCI's production capacity spans four continents and comprises\napproximately 16.2 million metric tons per year of hydrogen-based products\nincluding nitrogen fertilizers, methanol, biofuels, diesel exhaust fluid,\nmelamine, and other products. OCI has more than 3,600 employees, is\nheadquartered in the Netherlands and listed on Euronext in Amsterdam. For\nmore information, please visit www.oci.nl\n\n   Plug Power Safe Harbor Statement\nThis communication contains \"forward-looking statements\" within the meaning\nof the Private Securities Litigation Reform Act of 1995 that involve\nsignificant risks and uncertainties about Plug Power Inc.(\"PLUG\"),\nincluding but not limited to statements about PLUG's expectations regarding\nits multi-year investment and growth, PLUG's clean hydrogen technology and\nfuel cell solutions playing a critical role in achieving climate and\ndecarbonization goals, deepening of relationships with key stakeholders,\nand acceleration of demand and adoption of hydrogen technology. You are\ncautioned that such statements should not be read as a guarantee of future\nperformance or results, and will not necessarily be accurate indications of\nthe times that, or by which, such performance or results will have been\nachieved. Such statements are subject to risks and uncertainties that could\ncause actual performance or results to differ materially from those\nexpressed in these statements. For a further description of the risks and\nuncertainties that could cause actual results to differ from those\nexpressed in these forward-looking statements, as well as risks relating to\nthe business of PLUG in general, see PLUG's public filings with the\nSecurities and Exchange Commission, including the \"Risk Factors\" section of\nPLUG's Annual Report on Form 10-K for the year ended December 31, 2020.\nReaders are cautioned not to place undue reliance on these forward-looking\nstatements. The forward-looking statements are made as of the date hereof,\nand PLUG undertakes no obligation to update such statements as a result of\nnew information.\n\nCaitlin Coffee\nAllison+Partners\n(312) 635-8204\nPlugPR@allisonpr.com\n\nTel   : 1-518-782-7700    PLUG POWER INC\nEmail : investors@plugpower.com\nWWW   : <a href=\"https://www.plugpower.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.plugpower.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132700495.MNPRE2132701566-07395620211124</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}