{"date": "2021-12-12 11:00:05+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3444.24, "close": 3381.83}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Cheney Orr and Gabriella Borter</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MAYFIELD, Ky., Dec 12 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Kentucky residents, many without power, gas or even a roof over their heads, woke on Sunday to a landscape scarred by a string of powerful tornadoes that officials fear killed at least 100 people while obliterating buildings, homes and anything else in their way.</p><p>Authorities said they had little hope of finding survivors beneath the rubble. Instead rescue workers, volunteers and residents were due to begin the long process of recovering what they could and clearing out fields of debris. </p><p>At least 100 people were believed to have been killed in  Kentucky alone after the tornadoes tore a 200-mile (320-km) path through the U.S. Midwest and South on Friday night. Six workers were killed at an Amazon warehouse in Illinois. A nursing home was struck in Missouri. More than 70,000 people were left without power in Tennessee. </p><p>But nowhere suffered as much as the small town of Mayfield, Kentucky, where the powerful twisters, which weather forecasters say are unusual in winter, destroyed a candle factory and the fire and police stations. Across the town of 10,000 people in the state's southwestern corner, homes were flattened or missing roofs, giant trees had been uprooted and street signs were mangled.</p><p>People combed through the rubble of their homes for belongings until night fell on Saturday. Then the power-deprived town was mired in darkness, save for occasional flashlights and emergency vehicle headlights. </p><p>Janet Kimp, 66, and her son Michael Kimp, 25, survived by hunkering down in their hallway - the only part of the house where the roof or the walls did not come crashing down, she said on Saturday. </p><p>This was but the latest disaster to afflict her: Kimp said her house burned down years ago, and then she had to file for bankruptcy following her husband's death. </p><p>\"I've lost it all again,\" Kimp said as she stood in the remnants of her living room, where furniture was overturned and debris littered the ground. She stayed the night at her daughter's house in Mayfield, which was spared. </p><p>Down the road, war veteran Robert Bowlin, 59, and his son Christopher Bowlin, 24, were hard-boiling eggs on a campfire outside their home. They used wood from a tree that had collapsed, narrowly avoiding their house. </p><p><br/></p><p>DESTRUCTIVE, UNUSUAL </p><p>Kentucky Governor Andy Beshear said the collection of tornadoes was the most destructive in the state's history. He said about 40 workers had been rescued at the Mayfield candle factory, which had about 110 people inside when it was reduced to a pile of rubble. It would be a \"miracle\" to find anyone else alive under the debris, Beshear said on Saturday afternoon.  </p><p>In Illinois, six Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> workers were <a href=\"https://www.reuters.com/world/us/injuries-reported-after-roof-collapse-amazon-warehouse-illinois-ap-2021-12-11\" data-type=\"url\" class=\"tr-link\" translate=\"no\">confirmed dead</a> on Saturday after a warehouse roof was ripped off, causing 11-inch thick concrete walls longer than football fields to collapse on themselves. </p><p>At least 45 Amazon employees made it out safely from the rubble of the 500,000-square-foot Edwardsville, Illinois facility, fire chief James Whiteford said. It was unclear how many workers were still missing as Amazon did not have an exact count of people working in the sorting and delivery center at the time the tornadoes hit, Whiteford said. </p><p>The genesis of the tornado outbreak was a series of overnight thunderstorms, including a super cell storm that formed in northeast Arkansas. That storm moved from Arkansas and Missouri and into Tennessee and Kentucky.</p><p>Unusually high temperatures and humidity created the environment for such an extreme weather event at this time of year, experts said. </p><p>\"I was watching the radar last night and I was saying, 'Wait a second, this is December. How is this happening in December?' This is the kind of thing you would only see at the height of the season - you know, March, April, May,\" said meteorologist Jeff Masters with Yale Climate Connections. </p><p>President Joe <a href=\"https://www.reuters.com/markets/commodities/biden-approves-kentucky-emergency-declaration-tornado-disaster-2021-12-11\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Biden</a> told reporters he would ask the Environmental Protection Agency to examine what role climate change may have played in fueling the storms. </p><p>Mayfield resident Jamel Alubahr, 25, said his three-year old nephew died and his sister was in the hospital with a skull fracture after being stuck under the rubble of a three-story home. </p><p>\"It all happened in the snap of a finger,\" said Alubahr, who is now staying with another sister in Mayfield. </p><p><br/></p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Cheney Orr and Gabriella Borter in Mayfield; Writing by Alexandra Ulmer;)</p><p class=\"tr-contactinfo\">((Alexandra.ulmer <a href=\"mailto:frances.kerry@thomsonreuters.com\" data-type=\"email\" translate=\"no\">@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-WEATHER/TORNADOES (TV, PIX)</p></div>"}