{"date": "2022-02-17 22:10:58.511000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3162.01, "close": 3052.03}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_idfl4wnu&amp;referenceId=1_idfl4wnu&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_idfl4wnu&amp;referenceId=1_idfl4wnu&amp;pageId=RefinitivNewscasts</a></pre>Source: Thomson Reuters<br/><br/>Description: The giant retailer is ably managing inflation and supply chain pressures. But boss Doug McMillon is moving closer to Amazon’s turf with his push into advertising and subscriptions. Jennifer Saba explains why it will be tougher for Walmart to flourish in this new territory.<br/>Short Link: <a href=\"https://refini.tv/3rXansJ\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3rXansJ</a><br/><br/>Video Transcript:<br/><br/>This video is sponsored by Refinitiv, a London Stock Exchange Group business, powering financial markets around the world.<br/><br/>Wal-Mart is looking past its wheelhouse. The $375 billion retailer reported stronger than expected quarterly sales and profit. It's a testament to its ability to manage inflation and supply chain pressures. But a push into advertising and subscriptions is taking the retailer closer to Amazon's turf. It will be harder for Wal-Mart to shine in this territory. Despite inflation hitting a 40-year high in the United States, Wal-Martâ\u0080\u0099s size and muscle has allowed it to increase sales to over $150 billion, keep expenses relatively in check and hold gross margins of nearly 24% steady year-over-year. Boss Doug McMillon is confident that consumers will keep spending despite a lapse of stimulus checks given to Americans last year. Wal-Mart is forecasting US sales excluding fuel to rise 3% this year. But the company is also making a play for the advertising market and to get shoppers to subscribe to its Prime-like service. The company said it made $2 billion in advertising revenue last year but declined to give the number of subscribers to its service. In the meantime, Amazon.com said it raked in 15 times the amount of ad revenue last year and tallies over 200 million Prime subscribers. Wal-Mart has many talents, but it will be harder to apply in this new domain.<br/></span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}