{"date": "2021-12-01 19:56:02.979000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Amazon Web Services and Secure Code Warrior Join Forces to Enhance Developer-Led Security</b>\n</p><p class=\"bwalignc\">\n<span>Australian start-up Secure Code Warrior joins the AWS Global Startup Program, AWS Marketplace</span>\n</p><p>\nDeveloper-led security has received a much-needed elevation due to a strategic partnership between <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fsecurecodewarrior.com%2F&amp;esheet=52539187&amp;newsitemid=20211129005045&amp;lan=en-US&amp;anchor=Secure+Code+Warrior&amp;index=1&amp;md5=0ab671d26a09d5cc6779906378951b52\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Secure Code Warrior</a><sup>®</sup>, an Australian-based start-up and Amazon Web Services (AWS), with enterprises now able to ensure enhanced cloud security and compliance.\n</p><p>\nSecure Code Warrior is now a part of the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fpartners%2Fprograms%2Fglobal-startup%2F&amp;esheet=52539187&amp;newsitemid=20211129005045&amp;lan=en-US&amp;anchor=AWS+Global+Startup+Program&amp;index=2&amp;md5=924983c84251512d5480f825c40529ee\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Global Startup Program</a>, in addition to being listed on the AWS Marketplace. This partnership is advantageous for both AWS and Secure Code Warrior’s customers as it fulfils the need for security to be intrinsic to a developer’s workflow and central to a company’s culture—meeting the growing market demand and increasing requirements to stop application vulnerabilities from day one.\n</p><p>\nVikram Ghosh, Senior Vice President of Strategic Alliances at Secure Code Warrior, said the increased backing from AWS will support the business to accelerate its global growth, particularly across North America, and provide customers with the tools they need to be secure in the cloud as cybersecurity becomes critical to companies moving their entire operations to this platform.\n</p><p>\n“Customers of Secure Code Warrior now know that while AWS is ensuring the security of the cloud, we [SCW] ensure their security within the cloud, thanks to our human-led approach that embeds secure coding into the developer’s DNA,” said Ghosh.\n</p><p>\nThis partnership between AWS and Secure Code Warrior also means customers can easily access and use its software through the AWS Marketplace. To date, this software meets AWS’ and Secure Code Warrior’s shared values around developer-driven security by offering exceptional customer support, keeping aligned software consistently updated, following industry best practices, and facilitating quality, secure code at scale—which aligns with AWS’ <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fcompliance%2Fshared-responsibility-model%2F&amp;esheet=52539187&amp;newsitemid=20211129005045&amp;lan=en-US&amp;anchor=Shared+Responsibility+Model&amp;index=3&amp;md5=849634931e17aac27f82048c41c39f66\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Shared Responsibility Model</a>.\n</p><p>\nSecure Code Warrior is one of a small number of Australian organizations that have been accepted into the coveted invite-only, Global Startup Program. Through this partnership, AWS came to understand Secure Code Warrior’s vision for human-driven secure coding, which ensures organizations are able to release quality, compliant code to customers with confidence.\n</p><p>\nNow available for purchase on the AWS Marketplace, Secure Code Warrior is granting customers the opportunity to scale in their respective markets by elevating code quality, empowering developers, and delivering secure software, faster.\n</p><p>\nGhosh added, “We’re excited by this evolution in Secure Code Warrior’s partnership with AWS, which through its Global Startup Program has a proven track record of driving company visibility and powering growth at speed. Through this partnership, we see a great opportunity for Secure Code Warrior to continue achieving growth at scale, while working to ensure software security is intrinsic to both developer and customer.”\n</p><p>\n<b>About Secure Code Warrior</b>\n</p><p>\nSecure Code Warrior makes secure coding a positive and engaging experience for developers. Our flagship Learning Platform delivers relevant skills-based pathways for developers to write secure code at speed; whilst intelligent and contextual developer tools fix common security bugs in real-time. Through inspiring a global community of security-conscious developers to embrace a preventative secure coding approach, our mission is to pioneer a people-first solution to security upskilling, stamping out poor coding patterns for good. Established in 2015, our customers include major financial institutions, telcos, retail, governments and global technology companies across Europe, North America and Asia-Pacific. Learn more at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.securecodewarrior.com&amp;esheet=52539187&amp;newsitemid=20211129005045&amp;lan=en-US&amp;anchor=securecodewarrior.com&amp;index=4&amp;md5=6fdebdfa33eadc48973f8b85094ab7d0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">securecodewarrior.com</a>.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211129005045/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211129005045/en/</a></span></p><p>\nSarah Taylor\n<br/><b>Email:</b> <a href=\"mailto:staylor@securecodewarrior.com\" data-type=\"email\" translate=\"no\">staylor@securecodewarrior.com</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: MA-SECURE-CODE-WARRIOR</p></div>"}