{"date": "2021-12-10 19:49:17.094000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3483.42, "close": 3391.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce retailer Amazon has introduced a network of staffed pickup points in Canada in an effort to offer more flexibility and convenience to customers.</p><p>Called Amazon Counters, the pick-up points are designed to allow customers to pick up their packages in-store quickly and easily from one of hundreds of locations across Canada.Millions of items sold on Amazon Canada can be delivered to Counter locations, with the retailer offering two-day and one-day shipping free of charge.The retailer plans to add hundreds more counters across the country next year.Amazon Canada country manager Mike Strauch said: \"With Counter, we've leveraged our growing logistics network to introduce an innovative and convenient way for customers to ship and receive their packages outside of the home.\"The network is also part of our ongoing commitment to supporting businesses across Canada by offering another way to bring in new customers and offer something new to their existing customers.\"Amazon Counter complements the retailer's existing network of pickup points, which include the secure self-service kiosk Locker.Customers can choose their preferred pickup location using a postcode after shopping on Amazon.ca or the company's mobile app.Shoppers will receive an e-mail containing either a barcode, six-digit code or information via the Amazon Shopping app when their package has arrived.Packages will stay for three days in the locker and seven days at the counter location.Last month, Amazon revealed plans to open a 'technologically advanced' fulfilment centre in Abu Dhabi, United Arab Emirates, by 2024.The facility will use machine learning and artificial intelligence (AI) technologies to make its operations more efficient while improving its customer experience and expediting deliveries.The retailer has partnered with the Abu Dhabi Investment Office (ADIO) to develop the fulfilment centre.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}