{"date": "2022-02-08 13:30:07.717000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Strategic Expansion to E-Commerce and Digital Management</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">AIRPORT CITY, Israel, Feb. 8, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p>AIRPORT CITY, <span class=\"xn-location\">Israel</span>, <span class=\"xn-chron\">Feb. 8, 2022</span> /PRNewswire/ --<b> MySize, Inc</b>. (NASDAQ: MYSZ) (TASE: MYSZ.TA) (\"MySize\" or the \"Company\"), the provider of AI-driven measurement solutions to drive revenue growth and reduce costs for its business clients, is pleased to announce that it has acquired Orgad, an omnichannel e-commerce platform. Orgad is headquartered in <span class=\"xn-location\">Israel</span> and operates globally, including the U.S. and <span class=\"xn-location\">Europe</span>.</p>\n<div id=\"prni_dvprnejpg6415left\" style=\"WIDTH:100%;TEXT-ALIGN:left\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img align=\"middle\" alt=\"My Size Inc. logo\" border=\"0\" id=\"prnejpg6415left\" src=\"https://mma.prnewswire.com/media/689689/MySize_Logo.jpg\" title=\"My Size Inc. logo\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvNjg5Njg5L015U2l6ZV9Mb2dvLmpwZw==&amp;key=ca91af2a2b4be0b5e5bd6cbd1a2da1abb78a521bbb799b61f3e3a7f94f22ee862cc54fbc224c7ab6f8baa8cbbe726eb59d3dba336b43ee1d12027796a4edfe07\"/></div></div></div><p>Orgad generated approximately <span class=\"xn-money\">$2.5 million</span> in revenue in 2021 with profitable operations. Its team consists of solid operators with deep understanding and knowledge in e-commerce, supply chain and technology. Orgad's focus on technology, operations and customer service to increase efficiencies and revenue growth is structured on a platform that is able to manage numerous retailers. </p>\n<p>Additionally, Orgad will integrate MySizeID into its digital offerings and platform. Incorporating MySizeID into Orgad's e-commerce solution is expected to increase its operational profit by reducing costly returns.</p>\n<p>Elad Bretfeld , Founder of Orgad, stated, \"We look forward to working with MySize and becoming part of a publicly listed company. We have identified additional e-commerce global opportunities that would benefit from our e-commerce platform and digital management expertise. We look forward to scaling our business and working with the existing team at MySize.\"</p>\n<p>Similar to Thrasio, Perch and Hour Loop, Orgad is an e-commerce platform engaged in online retailing in the global market. It operates as a third-party seller on Amazon.com, eBay and others. Orgad currently manages more than 1,000 stock-keeping units (\"SKUs\"), mainly in fashion, apparel and shoes, but is capable of managing tens of thousands of SKUs. </p>\n<p>Under the transaction terms, MySize agreed to pay to the Orgad sellers cash consideration of up to <span class=\"xn-money\">$1 million</span> in 3 installments over a period of 3 years, equity consideration of up to 2,790,049 shares of MySize common stock, and certain earn-out payments upon meeting revenue targets, subject in each case to the sellers being engaged with Orgad at the time each payment is due and subject further to post-closing adjustment.</p>\n<p>Ronen Luzon, Chief Executive Officer of MySize, commented, \"This is a major strategic move by MySize as we are expanding our business to also be a direct e-commerce seller. The Orgad team has built a strong business as a direct seller of clothing and footwear globally on Amazon.com, eBay and elsewhere. By using MySize technology Orgad will be able to increase its profitability by increasing conversion rates and reducing costly returns, which also improves their sustainability.\"</p>\n<p>Luzon, concluded, \"We will continue to evaluate additional proven e-commerce sellers. Our acquisition strategy is to bring vendors product selections to our customers. Our infrastructure of R&amp;D and sales and marketing is in place and ready to increase revenues and improve margins as we scale. We plan to expand our business rapidly by increasing the number of business managers, vendors and SKUs, which can also utilize MySizeID and SizeUP for the DIY market.\"</p>\n<p>For further information regarding terms and conditions contained in the purchase agreement, please see the Company's Form 8-K filed in connection with the transaction.</p>\n<p><b>About MySize, Inc.<br/></b>MySize, Inc. (NASDAQ: MYSZ) (TASE: MYSZ.TA) has developed a unique measurement technology based on sophisticated algorithms and cutting-edge technology with broad applications, including the apparel, e-commerce, DIY, shipping, and parcel delivery industries. This proprietary measurement technology is driven by several algorithms that are able to calculate and record measurements in a variety of novel ways. To learn more about MySize, please visit our website: <a href=\"http://www.mysizeid.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.mysizeid.com</a>. We routinely post information that may be important to investors in the Investor Relations section of our website. Follow us on <a href=\"https://www.facebook.com/mysizeid/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Facebook</a>, <a href=\"https://www.linkedin.com/company/mysizeid/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a>, <a href=\"https://www.instagram.com/mysizeid/?hl=en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Instagram</a>, and <a href=\"https://twitter.com/mysizeinc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a>.</p>\n<p>Please click <a href=\"https://www.youtube.com/watch?v=RzD7btn76cs\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a> for a demonstration of how MySizeID provides a full sizing solution for the retail industry.</p>\n<p>Register <a href=\"https://mysizeid.com/pricing/#CHOOSE\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a> for a free plan of MySizeID solution for your online store.<br/>Please click <a href=\"https://itunes.apple.com/il/app/mysizeid-measure-perfect-fit/id1433748661?mt=8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a> to download MySizeID for iOS.<br/>Please click <a href=\"https://play.google.com/store/apps/details?id=com.mysize.mysizeid&amp;hl=en_US\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a> to download MySizeID for Android.</p>\n<p>To learn more about MySize and for additional information, please visit: our website: <a href=\"http://www.mysizeid.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.mysizeid.com</a>. </p>\n<p><b>Forward-looking Statements:<br/></b>This press release contains certain forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements are identified by the use of the words \"could,\" \"believe,\" \"anticipate,\" \"intend,\" \"estimate,\" \"expect,\" \"may,\" \"continue,\" \"predict,\" \"potential,\" \"project\" and similar expressions that are intended to identify forward-looking statements. All forward-looking statements speak only as of the date of this press release. You should not place undue reliance on these forward-looking statements. Although we believe that our plans, objectives, expectations and intentions reflected in or suggested by the forward-looking statements are reasonable, we can give no assurance that these plans, objectives, expectations or intentions will be achieved. Forward-looking statements involve significant risks and uncertainties (some of which are beyond our control) and assumptions that could cause actual results to differ materially from historical experience and present expectations or projections. Actual results to differ materially from those in the forward-looking statements and the trading price for our common stock may fluctuate significantly. Forward-looking statements also are affected by the risk factors described in the Company's filings with the U.S. Securities and Exchange Commission. Except as required by law, we undertake no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events or otherwise, after the date on which the statements are made or to reflect the occurrence of unanticipated events.</p>\n<p><b>U.S. Press Contact:</b> <br/>Strauss Communications <br/><a href=\"mailto:joel@strausscomms.com\" data-type=\"email\" translate=\"no\">joel@strausscomms.com</a><br/><a href=\"http://www.strausscomms.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.strausscomms.com</a></p>\n<p><b>Investor Contacts:<br/></b>Or Kles, CFO <br/><a href=\"mailto:ir@mysizeid.com\" data-type=\"email\" translate=\"no\">ir@mysizeid.com</a></p>\n<p><span class=\"xn-person\">Brian Loper</span><br/>ClearThink<br/><a href=\"mailto:bloper@clearthink.capital\" data-type=\"email\" translate=\"no\">bloper@clearthink.capital</a></p>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=LN55507&amp;sd=2022-02-08\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1MTjU1NTA3JnNkPTIwMjItMDItMDg=&amp;key=3ace1b1ab579d5f29e869265367fcd091c9882c1b601007c676d272e07ff0cc421460f49a33bbf6c98b100acf4e426408a3eeb05389192b148be72c47428465d\"/></div></div> View original content:<a href=\"https://www.prnewswire.com/news-releases/mysize-acquires-orgad-an-omnichannel-e-commerce-platform-with-a-presence-on-amazoncom-301477580.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/mysize-acquires-orgad-an-omnichannel-e-commerce-platform-with-a-presence-on-amazoncom-301477580.html</a><p></p>\n<p>SOURCE  My Size Inc.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: MySize-Acquires-Orgad</p></div>"}