{"date": "2021-11-14 23:50:42.805000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>AS THE climate change conference in Glasgow ended, Khoi indigenous people, environmentalists and land activists have called on Amazon's billionaire founder Jeff Bezos to intercede in a development on sacred land in Observatory.</p><p>Bezos announced a $2 billion investment towards fighting climate change in Africa at COP26 while developers were \"barrelling\" ahead with the development on the floodplain at the confluence of the Black and Liesbeek rivers.</p></div><div class=\"tr-npp-body\"><p>The development would see tech giant Amazon taking up a huge space.</p><p>The Observatory Civic Association (OCA) and Goringhaicona Khoi Khoin Traditional Indigenous Council are headed to court next week to seek an interdict against the River Club developers from going ahead with the development.</p><p>The R4.5bn mixed use development entails 150 000 square metres of buildings, which, according to those fighting against it, violated \"environmental principles\" both nationally and internationally, including the Paris Agreement.</p><p>Amazon will be the main anchor tenant in the development as it plans to set up its Africa headquarters there.</p><p>\"We don't understand the logic of destroying sacred land in Cape Town and then performing on a world stage as a great philanthropist for climate change mitigation,\" OCA chairperson, Professor Leslie London said.</p><p>The organisation has appealed to Bezos twice and once to his ex-wife, MacKenzie Scott, and to the new head of Amazon, Andy Jassy, to intervene and stop the development.</p><p>\"None of them responded,\" said London this week.</p><p>In its annual sustainability report, Amazon said its activities emitted the equivalent of 60.64 million metric tons of carbon dioxide in 2020.</p><p>London said that was more than Hungary or Singapore.</p><p>More than 60 civic, Khoi and environmental organisations nominated the Two Rivers Urban Park for provincial heritage status in 2020.</p><p>In July, the Heritage Western Cape requested the South African Heritage Agency (Sahra) to declare the entire park, which includes the River Club development site, a national heritage resource. The agency is currently in the process of grading the area.</p><p>During a protest on the site on Friday, activists and the indigenous people slammed the development as the \"antithesis of what Bezos was pledging\" as the site was the \"ecosystem of endangered flora and fauna and was the green lung of the city\".</p><p>Tauriq Jenkins of the Goringhaicona Khoi Khoin Indigenous Traditional Council said: \"This site is also the epicentre of colonialism, resistance and dispossession of land. When we lose the river, we lose everything. When the world's richest man and richest company put a price on something sacred to most of us, we have to hold the line.\"</p><p>Jenkins described the site as the place where the \"Truth and Reconciliation Commission\" for the San and Khoi people would take place.</p><p>\"It recognises the untold intergenerational trauma that for so long has not been addressed. This is the ground where we can tell our children that the wiping out of indigenous communities began.</p><p>\"The first Frontier Wars were fought here in 1659, which resulted in a 180-year series of wars of resistance by the San and Khoi, the extinction of sacred animals, and forced removals of indigenous people,\" he said.</p><p>Jenkins said the site was also part of the 1520 Battle of d'Almeida in which Portuguese \"colonists\" were defeated.</p><p>Later, it became the site of 180 years of resistance against the Dutch settlers and also marked the first privatisation of land for commercial objectives.</p><p>Protester John Daniels said the developers should stop the project and move it \"elsewhere\".</p><p>\"There's lots of other pieces of land that the City of Cape Town could have chosen to allow the development. I have no problem with Amazon wanting to create employment opportunities, but not on this sacred ground, not at the expense of the Khoi nation and heritage,\" said Daniels.</p><p>London said the interdict application would be followed by another court attempt to review and declare the approval decisions by the provincial government and the City of Cape Town unlawful.</p><p>\"We have a strong case based on the impacts on heritage and the multiple violations of environmental policies involved. We have an excellent legal team, which includes Cullinans Attorneys (environmental and green business law firm) and Advocate Tembeka Ngcukaitobi as our silk,\" said London.</p><p>Weekend Argus © 1999 - 2021 Independent Newspapers (Pty) Limited. All rights strictly reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}