{"date": "2022-01-12 12:00:00.414000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p align=\"center\">Company announces Cellebrite Guardian is available on AWS, part of the Company’s industry leading investigative Digital Intelligence platform<br/></p><p align=\"center\"><span>Customers can now harness the power of AWS with Cellebrite Guardian to manage and collaborate on digital evidence as part of their investigative workflow </span><br/></p><p align=\"left\">PETAH TIKVA, ISRAEL and TYSONS CORNER, Va., Jan.  12, 2022  (GLOBE NEWSWIRE) -- Cellebrite (Nasdaq: CLBT), a global leader in Digital Intelligence (DI) solutions for the public and private sectors, today announced that it has joined the AWS Partner Network (APN) as an Advanced Technology Partner and is providing Cellebrite Guardian, an investigative digital evidence management solution designed specifically for investigators, examiners, and attorneys, on Amazon Web Services (AWS). Cellebrite Guardian is the latest offering in Cellebrite's end-to-end investigative DI Platform designed to help public safety agencies and enterprises modernize their investigative workflow.</p><p>By joining the APN, Cellebrite gains access to a community of over 10,000 Partners in 150 countries using AWS to build solutions and services for customers across a range of different sectors and disciplines. Access to the APN’s joint go-to-market programs, expertise, and resources will support Cellebrite’s ability to expand its portfolio of cloud-based solutions that help customers reduce risk, increase collaboration, and drive down storage, hardware, and system maintenance costs.</p><p>Ryan Reynolds, US Justice and Public Safety Leader at AWS<strong>,</strong> said: “We welcome Cellebrite into our AWS Partner Network where customers will find an industry-leading solution that allows them to securely manage, collaborate, and gain insights from digital evidence as part of their investigative efforts.”</p><p>Leeor Ben-Peretz, Chief Strategy Officer at Cellebrite, commented: “Introducing new market-leading DI solutions in the cloud is a significant area of focus for Cellebrite. The AWS Partner Network will enable us to scale quickly and meet growing customer demands for cloud-based investigative solutions<span>.”</span></p><p>Cellebrite and AWS customer, Joshua Lee, a police sergeant in the City of Mesa (Arizona) Police Department, said: \"Using Cellebrite Guardian to manage chain of custody for physical evidence and digital evidence, while streamlining every step throughout the workflow, makes it an essential solution for conducting effective investigations and accelerating time to action. The transformational change from paper and USB drives to Cellebrite Guardian will directly and positively impact the ability of investigative teams to optimize resources. Guardian is flexible and can be adapted to any workflow, helping to eliminate manual processes, and allows investigators to review findings in real-time. It is great that two industry leaders have teamed up to provide an essential solution when backlogs are just getting longer.\"</p><p>For more information on Cellebrite Guardian, please visit <a href=\"https://www.globenewswire.com/Tracker?data=Xmc3ueRqM186sS3Xu4NsAHwrIIfLrT67CGzLJw0JLl-IV6NRzxvo7k9jHQH8FjwpH2N-h7ABANdasvTjUyWHhNXj8ebBI3x9YCuhwq9Cz8E=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.</p><p><strong>About Cellebrite</strong><br/>Cellebrite’s (Nasdaq: CLBT) mission is to enable its customers to protect and save lives, accelerate justice, and preserve privacy in communities around the world. We are a global leader in Digital Intelligence solutions for the public and private sectors, empowering organizations in mastering the complexities of legally sanctioned digital investigations by streamlining intelligence processes. Trusted by thousands of leading agencies and companies worldwide, Cellebrite’s Digital Intelligence platform and solutions transform how customers collect, review, analyze and manage data in legally sanctioned investigations. <br/></p><p>To learn more visit us at <a href=\"https://www.globenewswire.com/Tracker?data=uL6-D3387nVbvw2aD_dKJb2GY1Yephrn9F7TS1PcV7YjggG9Ue_zN0U3JYK3NwTOWmHgYTYmGsgZ3L9Y7SDXRvGOWaXl71JWXnwigrpwRjU=\"><strong>www.cellebrite.com</strong></a> and <a href=\"https://www.globenewswire.com/Tracker?data=Yy3xOv2TlSJ4MzmNCxWeERTzBAWykI3-OCFRrnH8XtgZB5769Tcmz-EL8Wh4jJc08Lvr7MAcdgA3UngPhjwwdO4G5ICIEZ2dxAecJ_A4HuNa5jdOCVK7CQ00eY3cLEAL\"><strong>https://investors.cellebrite.com</strong></a>.<br/></p><p><strong>Caution Regarding Forward Looking Statements</strong></p><p>This document includes “forward looking statements” within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words such as “forecast,” “intend,” “seek,” “target,” “anticipate,” “believe,” “could,” “continue,” “expect,” “estimate,” “may,” “plan,” “outlook,” “future” and “project” and other similar expressions that predict, project or indicate future events or trends or that are not statements of historical matters. Such forward looking statements include estimated financial information. Such forward looking statements with respect to revenues, earnings, performance, strategies, prospects, and other aspects of the business of Cellebrite are based on current expectations that are subject to risks and uncertainties. A number of factors could cause actual results or outcomes to differ materially from those indicated by such forward looking statements. These factors include, but are not limited to: Cellebrite’s ability to develop technologically advanced solutions and successfully integrate with the software solutions used by customers; acceptance of solutions by customers; errors, failures, defects or bugs in solutions; a failure to maintain sales and marketing personnel productivity or hire, integrate and retain additional sales and marketing personnel; the impact of the global COVID-19 pandemic; the impact of competition on pricing and on Cellebrite’s market share; sub-optimal results from products due to misuse by customers; Cellebrite’s failure to maintain and enhance its reputation and brand; inaccuracy of the estimates of Cellebrite’s market opportunity and forecasts of market growth; changes to packaging and licensing models that adversely affect the ability to attract or retain customers; failure to manage future growth effectively; failure to introduce new solutions and add-ons; issues in the use of artificial intelligence resulting in reputational harm or liability; the need for additional capital to support the growth of Cellebrite’s business; a failure to maintain the security of operations and the integrity of software solutions; the impact of government budgeting cycles and appropriations, early termination, audits, investigations, sanctions and penalties; a decline in government budgets, changes in spending or budgetary priorities, or delays in contract awards; a failure to adequately obtain, maintain, protect and enforce Cellebrite’s intellectual property or infringement of the intellectual property rights of others; perceptions or court or regulatory decisions that Cellebrite’s solutions violate privacy rights; the use of solutions by customers in a way that is, or that is perceived to be, incompatible with human rights; failure to comply with laws regarding privacy, data protection and security, technology protection, sanctions, export controls and other matters; and other factors, risks and uncertainties set forth in the sections titled “Risk Factors” and “Cautionary Note Regarding Forward-Looking Statements” in the final proxy statement/prospectus relating to Cellebrite’s consummated business combination filed with the SEC on August 5, 2021 and in other documents filed by Cellebrite with the SEC, which are available free of charge at <a href=\"https://www.globenewswire.com/Tracker?data=dFpfiVVaBMvC0yc8VEQYZK__bDPdixb-Vwl3tliDoqU1jrnGRN5-gKVOzmmolPVEr5Si57eVL3RNek9nfHczzQ==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sec.gov</a>. You are cautioned not to place undue reliance upon any forward-looking statements, which speak only as of the date made, in this communication or elsewhere. Cellebrite undertakes no obligation to update its forward-looking statements, whether as a result of new information, future developments or otherwise, should circumstances change, except as otherwise required by securities and other applicable laws.</p><p><strong>Media</strong>        <br/>Adam Jaffe<br/>VP of Global Communications<br/>+1 973 206 7643<br/><a href=\"https://www.globenewswire.com/Tracker?data=v4noDZbETM2f9OU63HubOV5zCzk_hln8GlWvyWYoFK4kXbRE1NjcVq-JiGUns-_n0nYvQmM7vPiPO0Wisn6yKThaSCl-1uyXsf9DeQJoBUz_4prY9A3EPjdgTB_P0y_t\" data-type=\"url\" class=\"tr-link\" translate=\"no\">adam.jaffe@cellebrite.com </a>– or –<br/><a href=\"https://www.globenewswire.com/Tracker?data=gRDhfphbsUNJexpkmt6KvtZ23DWOseVRI8md-bB4oJT6CHOCm_52Hs_szYpBaEFvcTL572FBh7SZU4d7uw-4rfZg8t4gzmNXu8Rlf0_EWUgqAN3p-ukzFEILeScm0soZ\" data-type=\"url\" class=\"tr-link\" translate=\"no\">RapidResponse@cellebrite.com</a></p><p><strong>Investors</strong><br/>Anat Earon-Heilborn<br/>VP Investor Relations<br/>+972 73 394 8440<br/><a href=\"https://www.globenewswire.com/Tracker?data=KvuE4lMT0vVwmWY-j_SqhLdoy3CXCCkf4sdZn-IxKxVmnpdxyp4Ve3UZ_qxFaUDS-p2kxZkaG9geQY-YdLRIITN18dPaWsNXwa8D3nU-OH8=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">investors@cellebrite.com</a></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQyNTMzOSM0NjUxMzY5IzIwMTc4OTc=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RReU5UTXpPU00wTmpVeE16WTVJekl3TVRjNE9UYz0=&amp;key=89c3e78759cfba07a3377843ed18cfa50d96f3bdb8da4cacff13880c2571cd7c06e95d4954a15c70d341a4549f330b72c956b3429cc010aa7899b63f0d8b1027\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/NzQ4YmI2NDYtNzc0NC00ZDYwLThkYmUtNjUyMDg0NTA3NTVmLTEwMjk0Njg=/tiny/Cellebrite-DI-Ltd.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9OelE0WW1JMk5EWXROemMwTkMwMFpEWXdMVGhrWW1VdE5qVXlNRGcwTlRBM05UVm1MVEV3TWprME5qZz0vdGlueS9DZWxsZWJyaXRlLURJLUx0ZC5wbmc=&amp;key=f31109f94b5bdc0d4b70b10c98ac4730ee48437e340967906055c4528beeb7cafd30c0a7396e86d43f87a092640d9e1a9473951b666684dfcb37812c5a2bdcbb\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/4286afa1-55a1-4d14-b6a4-f48b320d9b0a\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/4286afa1-55a1-4d14-b6a4-f48b320d9b0a/small/notag-2x-2-png.png\" style=\"max-height:37px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS80Mjg2YWZhMS01NWExLTRkMTQtYjZhNC1mNDhiMzIwZDliMGEvc21hbGwvbm90YWctMngtMi1wbmcucG5n&amp;key=d233f5bf25314e34b34c47436dc03d3ff2520f8035f461097251b1b26c76d11e62f8cd3184d20d7ae84a6a7ece004e92fc94924ff725115ee4b6ab2d556f07ec\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2022</p></div>"}