{"date": "2022-01-10 02:00:23.365000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>Amazon has moved the National Company Law Appellate Tribunal (NCLAT) against the Competition Commission of India's (CCI) order suspending the company's 2019 deal with Future Coupons, sources said. The case is likely to be heard this week.</p><p>The appeal comes after the CCI had in December suspended the deal Amazon had made with Future Coupons after an investigation revealed that the former had concealed significant information while seeking regulatory approval for the pact. In 2019, Kishore Biyani-led Future Group's Future Coupons had inked a deal with Amazon. As part of the deal, Amazon had acquired 49 per cent stake in Future Coupons, the promoter firm of Future Retail in a deal worth nearly Rs 2,000 crore.</p></div><div class=\"tr-npp-body\"><p>While Future Retail would be able to place its products on Amazon's online market place, the two had also agreed that the Future Retail's products would also be a part of Amazon's new plan, which intended to deliver products in select cities within two hours of a customer ordering them. .</p><p>The deal had also given Amazon a 'call' option, which enabled it to exercise the option of acquiring all or part of Future Coupon's promoter, Future Retail's shareholding in the company, within 3-10 years of the agreement.</p><p>Later, in 2020, Biyani's Future Group entered into another agreement with Reliance Retail, a subsidiary of the Reliance Industries Limited (RIL) group, to sell its retail, wholesale, logistics and warehousing to the latter.</p><p>The second deal, however, ran into legal trouble, with Amazon claiming it to be a violation of the pact it had with Future Coupons. The global e-commerce giant said that Future Group-Reliance Retail deal was a violation of a non-compete clause and a right-of-first-refusal pact it had signed with the Future Group.</p><p>The deal also required Future Group to inform Amazon before entering into any sale agreement with third parties.</p><p>On its part, the Future Group has said that it had not sold any stake in the company, and was merely selling its assets and had therefore not violated any terms of the contract.</p><p>Copyright 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}