{"date": "2021-07-13 07:30:12.527000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3953.0, "close": 3890.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article AVEVA, a global firm in industrial software driving digital transformation and sustainability, announced it has won the 2021 Microsoft Energy Partner of the Year Award and was also named the finalist (runner-up) of 2021 Microsoft Sustainab...</p><p>AVEVA, a global firm in industrial software driving digital transformation and sustainability, announced it has won the 2021 Microsoft Energy Partner of the Year Award and was also named the finalist (runner-up) of 2021 Microsoft Sustainability Changemaker Partner of the Year Award.  The company was honored among a global field of top Microsoft partners for demonstrating excellence in innovation and implementation of customer solutions based on Microsoft technology. <br/><br/> \"We are delighted to win Microsoft's prestigious Energy Partner of the Year award and be named a finalist for Sustainability Changemaker Partner of the Year. These awards recognise our industry-specific expertise in enabling energy and manufacturing companies to meet their sustainability goals and achieve business resiliency through advanced digital technologies during these globally transformative times. AVEVA empowers customers with real-time energy operational data management, integrated with AI and analytics to help manage their energy consumption and emissions. Our purpose, values and strategy create long term value and we are aspiring to a world where economic growth supports environmental sustainability,\" said Kerry Grimes, Head, Global Partners, AVEVA. <br/><br/> The Microsoft Partner of the Year Awards recognise Microsoft partners that have developed and delivered outstanding Microsoft-based solutions during the past year. Awards were classified in various categories, with honorees chosen from a set of more than 4,400 submitted nominations from more than 100 countries worldwide. AVEVA was recognised for providing outstanding solutions and services across the energy sector.   <br/><br/> The Energy Partner of the Year Award recognises a partner organisation that excels at providing innovative and unique services or solutions based on Microsoft technologies to energy companies which include oil and gas, power and utilities, mining and renewables demonstrating thought leadership in their industry. <br/><br/> \"I am honored to announce the winners and finalists of the 2021 Microsoft Partner of the Year Awards. These remarkable partners have displayed a deep commitment to building world-class solutions for customers-from cloud-to-edge-and represent some of the best and brightest our ecosystem has to offer,\" said Rodney Clark, Corporate Vice President, Global Partner Solutions, Channel Sales and Channel Chief, Microsoft.</p></div><div class=\"tr-npp-body\"><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}