{"date": "2021-12-09 17:41:38.194000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>WISeKey and CasperLabs to Present the Latest Developments in Blockchain Identity and NFT Marketplace During WISeKey's Investor Day on December 13 at the NASDAQ MarketSite in NYC</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>WISeKey and CasperLabs to Present the Latest Developments in\n- Blockchain Identity and NFT Marketplace During WISeKey's Investor\n- Day on December 13 at the NASDAQ MarketSite in NYC\n\n     WISeKey and CasperLabs to Present the Latest Developments in\nBlockchain Identity and NFT Marketplace During WISeKey's Investor Day on\nDecember 13 at the NASDAQ MarketSite in NYC\n\n     WISeKey and CasperLabs to discuss their cooperation in WISe.ART NFT\nMarketplace and how WISeKey delivers a secure NFT marketplace on the\nCasperLabs network\n\n     WISeKey International Holding Ltd. (\"WISeKey\") a leading global\ncybersecurity, AI, Blockchain and IoT company, today announced that on\nDecember 13, during WISeKey's Investor Day, the company will present new\ndevelopments in the blockchain identity and WISe.ART NFT marketplace using\nCasperLabs. CasperLabs is a leading blockchain company for the enterprise\nmarket and provides support for organizations building on the Casper\nnetwork.\n\n     The strategic partnership between WISeKey and CasperLabs which started\nearlier this year, is designed to bring trust to the WISe.ART NFT\nMarketplace platform and has already provided a dedicated, secure\nmarketplace on the Casper Network for buying and selling NFTs, including\nartwork and luxury goods.\n\n     \"By combining our Root of Trust with the Casper blockchain, we have\ncreated an innovative Trust Protocol that enables a wide range of use cases\nand business models, simply not possible with current blockchain-based\nsolutions on their own,\" said Carlos Moreira, Founder and CEO of WISeKey.\n\"The first application of this collaboration will be the auctioning of\ndigital twins of artwork and luxury collectibles, which we indisputably\nmove into the virtual world, yet make their illegal use impossible.\"\n\n     Casper blockchain is the first fully decentralized, truly scalable\nblockchain designed for real-world speed and security. Casper's familiar\ntools, open architectures and expert support make it simple and readily\naccessible for developers, and its public software platform makes pricing\npredictable and transparent for businesses. Unlike first generation\nblockchains, Casper provides an upgradable infrastructure that powers\ninnovation and facilitates deployments across public, private and hybrid\nenvironments.\n\n     \"CasperLabs is committed to ensuring successful outcomes for\norganizations looking to build innovative applications on the Casper\nNetwork,\" said Mrinal Manohar, Cofounder and CEO at CasperLabs. \"Our\npartnership with WISeKey will set a new standard for responsible and secure\nNFT transactions during a period of historic interest. Both teams are\ndeeply committed to delivering a more environmentally friendly and scalable\noption for the NFT community as it continues to evolve and excite new\naudiences worldwide.\"\n\n     Casper Network's Proof-of-Stake (PoS) architecture allows for a higher\nvolume of secure transactions with no drop in performance, while producing\na fraction of the energy expended by traditional blockchain protocols. As\ninterest in NFTs continues to accelerate, both organizations are committed\nto promoting a more environmentally-friendly consumption and distribution\nmodel.\n\n     With the support of CasperLabs, WISeKey's unique Digital\nIdentification NFT platform technology will run on the Casper Network to\ndeliver the most secure and scalable blockchain backend for creating real\ndigital twins for valuable objects. This unique approach will make it\npossible to mint provenance and a digital version into an NFT that contains\nsmart contracts on how the digital twin may be used, removing any\nuncertainty of what an NFT actually means to a collector by delivering\nauthenticated digital twins to the art and luxury market.\n\n     The WISeKey NFT platform is secured by WISeKey's various security\ntechnologies enabling the authentication of digital identity based NFTs,\nphysical objects as well as digital assets, in a safe end-to-end process.\nThe user is in full control of its WISeID NFT and other NFTs need to\nrequest access to its identity information so WISeID NFTs users can decide\nby themselves what level of information they wish to share, thus keeping\nfull control. The WISeKey approach to the Metaverse has as objective to\nprovide safe infrastructure identity services based on blockchain\ntechnologies for a wide range of users, including individuals, corporations\nand government institutions. As our digital lives become increasingly\ndigitalized, Metaverse will leverage the advantages of the internet to\nestablish a virtual world for its users. Businesses and communities will\ndepend on users' digital identities to manage assets.\n\n     To view previous holograminar organized by WISekey go to\n<a href=\"https://youtu.be/Vpi9lb9Uvfk\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://youtu.be/Vpi9lb9Uvfk</a>.\n\n     WISeKey's Investor Day will be a hybrid event (in-person and virtual):\nInvestors interested to attend in-person should contact Lena Cati at\nlcati@equityny.com / 212-836-9611, to receive additional registration\ndetails.\n\n     The event will also be webcast live which can be accessed using the\nfollowing link <a href=\"https://www.wisekey.com/wisekey-webinar\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.wisekey.com/wisekey-webinar</a>/. Pre-registration\nis required.\n\n     Agenda of the Investor Day is below.\n//st\n\nTime     Topic                             Speakers\n\n9:30 am  REGISTRATION\n\n10:00 am MANAGEMENT PRESENTATIONS\n\n         Recent business developments and  Carlos Moreira, CEO of\n         milestones Recap of 2021          WISeKey\n         Activities\n\n         US Market Opportunities           Richard Venia, US Sales\n                                           Director of WISeKey\n\n         Recent Financial Highlights       John O'Hara, International\n                                           Financial Controller of\n                                           WISeKey\n\n         The Code to the Metaverse         David Fergusson, Executive\n         Programming Our Future for Good   MD of Generational Equity\n                                           and WISeKey Board Member\n\n         Vision and Growth Strategy for    Carlos Moreira, CEO of\n         2022 and Beyond Trends and        WISeKey\n         Opportunities Across the\n         Enterprise\n\n12:00 pm PRODUCT SHOWCASE:\n         CUSTOMERS/SUPPLIERS\n\n         Flying success: How WISeKey and   Carlos Moreira, CEO of\n         Parrot combine their expertise    WISeKey Victor Vuillard,\n         to apply IoT security to drones,  Chief Security Officer,\n         a key asset of tomorrow's         CTO Cybersecurity, DPO of\n         industry Special exponential      Parrot\n         technology demonstration using\n         holograms Powered by\n\n12:30 pm LUNCH / NETWORKING\n\n1:30 pm  PRODUCT SHOWCASE:\n         CUSTOMERS/SUPPLIERS (Cont.)\n\n         Launch of WISe.Art CasperLabs     Carlos Moreira, CEO of\n         NFT Marketplace                   WISeKey Mrinal Manohar,\n                                           CEO of CasperLabs\n\n         Demonstration of WISe.Art NFT     Carlos Moreira, CEO of\n         Marketplace                       WISeKey\n\n3:00 pm  Q&amp;A SESSION\n\n//et\n\n     About CasperLabs\n\n     CasperLabs, a leading blockchain company for the enterprise market, is\nre-imagining blockchain for enterprise with a future proof solution. The\ncompany also provides support for organizations building on the Casper\nnetwork. Guided by open-source principles, CasperLabs is committed to\nsupporting the next wave of blockchain adoption among businesses and\nproviding developers with a reliable and secure framework to build private,\npublic and hybrid blockchain applications. Its team possesses deep\nenterprise technology experience, hailing from organizations including\nGoogle, Adobe, AWS, Dropbox and Microsoft. To learn more, visit\ncasperlabs.io.\n\n     About WISeKey\n\n     WISeKey (NASDAQ: WKEY; SIX Swiss Exchange: WIHN) is a leading global\ncybersecurity company currently deploying large scale digital identity\necosystems for people and objects using Blockchain, AI and IoT respecting\nthe Human as the Fulcrum of the Internet. WISeKey microprocessors secure\nthe pervasive computing shaping today's Internet of Everything. WISeKey IoT\nhas an install base of over 1.5 billion microchips in virtually all IoT\nsectors (connected cars, smart cities, drones, agricultural sensors,\nanti-counterfeiting, smart lighting, servers, computers, mobile phones,\ncrypto tokens etc.).  WISeKey is uniquely positioned to be at the edge of\nIoT as our semiconductors produce a huge amount of Big Data that, when\nanalyzed with Artificial Intelligence (AI), can help industrial\napplications to predict the failure of their equipment before it happens.\n\n     Our technology is Trusted by the OISTE/WISeKey's Swiss based\ncryptographic Root of Trust (\"RoT\") provides secure authentication and\nidentification, in both physical and virtual environments, for the Internet\nof Things, Blockchain and Artificial Intelligence. The WISeKey RoT serves\nas a common trust anchor to ensure the integrity of online transactions\namong objects and between objects and people. For more information, visit\nwww.wisekey.com.\n\n     Press and investor contacts:\n\n//st\n  WISeKey International Holding Ltd   WISeKey Investor Relations (US)\n\n Contact Information:\n\n  Carlos Moreira                      Lena Cati The Equity Group\n  Chairman &amp; CEO Tel: +41 22 594      Inc. Tel: +1 212 836-9611\n  3000 info@wisekey.com               lcati@equityny.com\n\n//et\n\n     Disclaimer:\nThis communication expressly or implicitly contains certain forward-looking\nstatements concerning WISeKey International Holding Ltd and its business.\nSuch statements involve certain known and unknown risks, uncertainties, and\nother factors, which could cause the actual results, financial condition,\nperformance or achievements of WISeKey International Holding Ltd to be\nmaterially different from any future results, performance or achievements\nexpressed or implied by such forward-looking statements. WISeKey\nInternational Holding Ltd is providing this communication as of this date\nand does not undertake to update any forward-looking statements contained\nherein as a result of new information, future events or otherwise.\n\n     This press release does not constitute an offer to sell, or a\nsolicitation of an offer to buy, any securities, and it does not constitute\nan offering prospectus within the meaning of article 652a or article 1156\nof the Swiss Code of Obligations or a listing prospectus within the meaning\nof the listing rules of the SIX Swiss Exchange. Investors must rely on\ntheir own evaluation of WISeKey and its securities, including the merits\nand risks involved. Nothing contained herein is, or shall be relied on as,\na promise or representation as to the future performance of WISeKey.\n\nTel   : +41-2259430000    WISEKEY INTERNATIONAL HOLDINGS SA\nWWW   : <a href=\"https://www.wisekey.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.wisekey.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134200491.MNPRE2134202355-09174920211209</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}