{"date": "2022-01-10 19:30:01+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The Day Ahead is an email and PDF publication that includes the day's major stories and events, analyses and other features. To receive The Day Ahead, Eikon users can register at <a href=\"reuters://REALTIME/verb=Headlines/ric=DAY/US\" data-type=\"newsExpression\" data-expression=\"DAY/US\" translate=\"no\" dir=\"ltr\">DAY/US</a>. Thomson One users can register at RT/DAY/US. All times in ET/GMT</p><p class=\"tr-story-p1\"></p><p>Federal Reserve Chairman Jerome Powell will testify before a Senate Banking Committee hearing to consider the renomination to chair the Federal Reserve Board of Governors.</p><p><br/></p><p>A hearing will be held on Johnson &amp; Johnson's request for a final order shielding it from talc-related lawsuits while its subsidiary that holds its talc liabilities, LTL Management, goes through bankruptcy. A temporary order protecting J&amp;J is currently in place.</p><p><br/></p><p>Federal Reserve Bank of Kansas City President Esther George will speak on the economic and monetary policy outlook before the VIRTUAL Central Exchange event.</p><p><br/></p><p>India's Supreme Court is set to hear Amazon.com Inc and Future Group's dispute on the Indian firm's $3.4 billion sale of retail assets to market leader Reliance Industries. The U.S. firm has accused Future of violating certain contracts by agreeing to the sale while Future has denied any wrongdoing.</p><p><br/></p><p>Brazil's government statistics agency IBGE is expected to report the country's IPCA consumer price index likely fell to 0.65%  from November to December. </p><p> </p><p>Mexico's industrial output likely rose 0.5% in November after a 0.6% increase in October, the national statistics agency is expected to report. </p><p><br/></p><p class=\"tr-signoff\"> (Compiled by Nachiket Tekawade in Bengaluru; Editing by Ramakrishnan M.)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Nachiket.Tekawade@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Nachiket.Tekawade@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMERS-WHATTOWATCH/</p></div>"}