{"date": "2021-12-31 15:02:09.036000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.02, "close": 3334.34}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>HANNOVER HOUSE INC (\"HHSE-0\")\n- New Productions and Ventures Position Hannover House for Record\n- Revenues in 2022\n\n     Elevated from streaming income and high-end feature productions,\nHannover House, Inc. is looking for a record year in 2022 for both gross\nrevenues and profits. The veteran indie studio (founded in 1993) is\nforecasting gross revenues of more than $20-million with pre-tax profits of\nover $4-million in the coming year. The company's prior revenue record was\nset in 2007, at $11.4-million in gross revenues - a time when the company\nheld an impressive number of titles in the Walmart and Best Buy DVD budget\nbins.\n\n     \"We are emerging from a rebuilding period these past three years,\"\nsaid Eric Parkinson, President and C.E.O. of Hannover House. \"As the\nphysical DVD and BluRay business evolved into a consumer streaming\npreference, we had to retool our operations to evolve into this new medium.\nAs a result, our MyFlix multi-studio streaming concept is expected to\ngenerate at least $15-million in 2022, and this result would comprise\nthree-quarters of the company's total gross revenues for the year. The\nother significant paradigm change for Hannover House is the company's new\ninvolvement in facilitating the production of high-end feature productions,\nwhich will generate overhead and fees for the company. These new\nproductions are expected to generate about $3.5-million in revenues, with a\nmargin of about $1.5-million in 2022.  And finally, the company's\nlong-standing activities in selling physical DVDs, BluRays and Books will\ncontinue to generate activities, but at a far less consequential level as\ncompared to MyFlix and the major productions,\" he concluded.\n\n     The MyFlix service will offer the best of several successful streaming\ncompetitors. Consumers will have a very large access to titles through\nMyFlix - over 15,000 titles - and these can be watched through a monthly\nsubscription (ala Netflix), or on per-transaction fee basis (ala Amazon),\nor under an \"ad supported\" option in which the programs are interrupted\nwith ads (ala Tubi). MyFlix hopes to eventually offer an educational\nportal, interactive games, and the option to upload videos (ala YouTube).\nThe launch of MyFlix will cost about $4-million, which the company expects\nto be provided through an investor-backed credit line.\n\n     \"If you compare MyFlix to existing services, it's very easy to project\npotential revenues in excess of $100-million by year two of the venture.\nWe're taking a far more conservative view and projecting just north of\n$1-million per month, which is only $86 per title. So, we may need to\nrevise the 2022 forecasts by late summer if the consumer response is closer\nto the venture's potential,\" said Parkinson.\n\n     Hannover House shares are traded on the OTC Pinksheets exchange, and\nhave been hovering under $.02 for the last several years.\n\n     \"Our major shareholders are confident that the share price will\ndramatically improve as we move into 2022,\" Parkinson continued. \"If\ncompetitors like Netflix can support a market-cap of $250-Billion, it's not\nunrealistic to look at Hannover House / MyFlix as supporting a market-cap\napproaching $1-Billion at a reasonable time as MyFlix builds brand\nawareness. Obviously, if this were to occur, the impact on the Hannover\nHouse stock shares would be significant.\"\n\n     Hannover House, Inc. is a Wyoming registered corporation. The company\nmaintains a production office in Oklahoma and a marketing office in\nArkansas.\n\nContact Information:\n\nERIC PARKINSON / Eric@HannoverHouse.com / 818-481-5277.\n\nTel   : 818-481-5277    HANNOVER HOUSE INC\nWWW   : <a href=\"https://www.hannoverhouse.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.hannoverhouse.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2136400168.MNPRE2136400432-07010420211231</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}