{"date": "2022-02-16 23:00:00.220000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3130.21, "close": 3093.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Announces Global Expansion of AWS Local Zones</b>\n</p><p class=\"bwalignc\">\n<span>Building off the successful launch of AWS Local Zones in 16 US cities, over 30 new AWS Local Zones will deliver single-digit millisecond latency performance at the edge of the cloud to hundreds of millions of people worldwide</span>\n</p><p class=\"bwalignc\">\n<span>Netflix, Couchbase, Supercell, and FOX Corporation among thousands of customers using AWS Local Zones</span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced the completion of its first 16 AWS Local Zones in the U.S. and plans to launch new AWS Local Zones in 32 new metropolitan areas in 26 countries around the world. AWS Local Zones are a type of infrastructure deployment that extends AWS Regions to place compute, storage, database, and other AWS services at the edge of the cloud near large population, industry, and information technology (IT) centers—enabling customers to deploy applications that require single-digit millisecond latency closer to end users or on-premises data centers. AWS Local Zones allow customers to use core AWS services locally while seamlessly connecting to the rest of their workloads running in AWS Regions with the same elasticity, pay-as-you-go model, application programming interfaces (APIs), and toolsets. To learn more about AWS Local Zones, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fabout-aws%2Fglobal-infrastructure%2Flocalzones&amp;esheet=52580931&amp;newsitemid=20220216006251&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fabout-aws%2Fglobal-infrastructure%2Flocalzones&amp;index=1&amp;md5=4819c1dd7596ca0ee95ceb9006d62e7e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/about-aws/global-infrastructure/localzones</a>.\n</p><p>\nThe vast majority of customers receive the necessary latency required to support their applications’ performance by running them in AWS Regions (geographic locations around the world where AWS clusters data centers to serve customers in local AWS Availability Zones). However, for applications that require ultra-low latency (e.g., remote real-time gaming, media and entertainment content creation, live video streaming, engineering simulations, augmented and virtual reality, machine learning inference at the edge, etc.), customers want AWS infrastructure closer to their end users to support a seamless experience. Other customers have local data residency requirements where they must run parts of their applications in on-premises data centers, but they also want to take advantage of AWS services and similarly benefit from the ultra-low latency that AWS Local Zones can provide to these types of hybrid applications. Both of these use cases would otherwise require customers to procure, operate, and maintain IT infrastructure—and use a different set of APIs and tools for the on-premises and AWS environments—which creates unnecessary costs and operational complexity. Prior to today, customers could use AWS Local Zones to deliver applications that require single-digit millisecond latency in 16 cities in the U.S. (Atlanta, Boston, Chicago, Dallas, Denver, Houston, Kansas City, Las Vegas, Los Angeles, Miami, Minneapolis, New York City, Philadelphia, Phoenix, Portland, and Seattle). However, customers in Africa, Asia Pacific, Europe, Latin America, and the Middle East would also like to use AWS Local Zones to deliver applications closer to end users and run hybrid workloads near their data centers with single-digit millisecond latencies around the world.\n</p><p>\nOver the next two years, new AWS Local Zones will launch in Amsterdam, Athens, Auckland, Bangkok, Bengaluru, Berlin, Bogotá, Brisbane, Brussels, Buenos Aires, Chennai, Copenhagen, Delhi, Hanoi, Helsinki, Johannesburg, Kolkata, Lima, Lisbon, Manila, Munich, Nairobi, Oslo, Perth, Prague, Querétaro, Rio de Janeiro, Santiago, Toronto, Vancouver, Vienna, and Warsaw. The new AWS Local Zones will give customers around the world the ability to offer hundreds of millions of end users single-digit millisecond performance for their applications. Using AWS Local Zones, customers outside the U.S. have the ability to meet data residency requirements in regulated sectors like health care and life sciences, financial services, and government. AWS manages and supports Local Zones, meaning customers do not need to incur the expense and effort of procuring, operating, and maintaining infrastructure in various cities to support low-latency applications. Customers can connect to AWS Local Zones through an internet connection or use AWS Direct Connect to route traffic over a private AWS network connection.\n</p><p>\n“The edge of the cloud is expanding and is now becoming available virtually everywhere,” said Prasad Kalyanaraman, Vice President of Infrastructure Services at AWS. “Thousands of AWS customers using U.S.-based AWS Local Zones are able to optimize low-latency applications designed specifically for their industries and the use cases of their customers. With the success of our first Local Zones in 16 U.S. cities, we are expanding to more locations for our customers around the world who have asked for these same capabilities to push the edge of cloud services to new places. AWS Local Zones will now be available in over 30 new locations globally, providing customers with a powerful new capability to leverage cloud services within a few milliseconds of hundreds of millions of end users around the world.”\n</p><p>\nNetflix is one of the world’s leading entertainment services with 214 million paid memberships in over 190 countries for TV series, documentaries, and feature films across a wide variety of genres and languages. “Netflix is poised to become one of the world’s most prolific producers of visual effects and original animated content. To meet that demand, we are hiring the best artistic talent from all over the world. These artists need specialized hardware and access to petabytes of images to create stunning visual effects and animations,” said Stephen Kowalski, Director of Digital Production Infrastructure Engineering at Netflix. “Historically, artists had specialized machines built for them at their desks; now, we are working to move their workstations to AWS to take advantage of the cloud. In order to provide a good working experience for our artists, they need low latency access to their virtual workstations. AWS Local Zones brings cloud resources closer to our artists and have been a game changer for these applications. By taking advantage of AWS Local Zones, we have migrated a portion of our content creation process to AWS while ensuring an even better experience for artists. We are excited about the expansion of AWS Local Zones globally, which brings cloud resources closer to creators, allowing artists to get to work anywhere in the world and create without boundaries.”\n</p><p>\nCouchbase delivers the modern database for enterprise applications. Developers worldwide choose Couchbase for its advantages in data model flexibility, elastic scalability, performance, and 24x365 availability to build business-critical web, mobile, and IoT applications. “The database is just as critical to edge computing as the infrastructure and network. Apps that are stateful and need to store data require a modern database. And that database needs to be able to operate and synchronize across the entire architecture, not just on a single edge device or endpoint,” said Wayne Carter, Vice President of Engineering at Couchbase. “Couchbase is using AWS Local Zones to provide low latency and single-digit millisecond database access times for applications, ensuring developers’ apps are always available and fast. Using AWS Local Zones, along with Couchbase’s edge computing capabilities, means that our customers are able to store, query, search, and analyze data in real-time with high availability.”\n</p><p>\nFinland-based Supercell is one of the most recognized mobile game developers in the world. Since its founding in 2010, Supercell has brought five chart-topping games to the market: <span>Hay Day</span>, <span>Clash of Clans</span>, <span>Boom Beach</span>, <span>Clash Royale</span>, and <span>Brawl Stars</span>. “Our player base has scaled at an incredible pace, and we have relied on AWS to manage our infrastructure and match our growth. We deploy game servers in multiple AWS Regions today to serve our end users globally and evaluate all new Regions as they come online,” said Juho Mäkinen, Lead of Infrastructure and Services at Supercell. “We are also using AWS Local Zones as deployment targets in the U.S., and we are considering additional Local Zones as they become available in order to bring the latency-sensitive portions of game servers closer to more end users.”\n</p><p>\nThe FOX Corporation creates and distributes some of the most compelling entertainment, sports, and news content in the industry, through its iconic domestic brands including FOX Entertainment, FOX Sports, FOX News Media, and the network of FOX television stations. “Home to exceptional artists, it’s our mission to find and leverage technology which removes any friction or barrier from the creative process, allowing our storytellers to focus solely on the content, not the way it’s created,” said Christian Kennel, Vice President Post and Production Technology at FOX Entertainment. “With AWS Local Zones in close proximity to our production hubs, shoots, and the famed FOX lot, we’re able to deliver cloud resources directly to our artists, allowing them to craft their vision without the limitations of traditional remote solutions. Creative workflows like editorial, motion graphics, and finishing demand ultra-low latency, and AWS represents the best of breed solution that FOX has come to rely upon. Integrating AWS into the FOX workflow enables us to execute and deploy much faster, taking us closer to the goal of allowing artists to create from the field, the home, or the lot, with seamless access to every resource necessary to create the award-winning content for which FOX is known.\n</p><p>\nUbitus is a cloud gaming technology leader that offers turnkey solutions to help customers build their cloud game businesses. “Today, we use AWS Local Zones in the U.S. to provide players a consistent, low-latency gameplay experience, and it has transformed the way we deliver service to our customers,” said Wesley Kuo, CEO at Ubitus. “With AWS Local Zones, we can deploy and test clusters of game servers in cities across the world to ensure all customers get a great experience regardless of where they are located. AWS Local Zones is reinforcing Ubitus’s cloud game services, and its expansion to more cities helps us deliver the low-latency gaming experience our customers want and expect.”\n</p><p>\nJackTrip Labs leverages edge computing technologies to bring live music over the internet to patrons everywhere. When performing music over the internet, low audio latency between performers is critical for a smooth experience. “JackTrip is using AWS Local Zones to run low-latency audio servers closer to musicians, enabling musicians to perform live music together over the internet,” said Mike Dickey, CEO at JackTrip Labs. “With the expansion of AWS Local Zones to more than 30 cities around the world, we are able to provide more robust, high-fidelity interactions for more musicians around the world to connect with audiences anywhere.”\n</p><p>\nEdgegap is a leading game hosting service provider focused on delivering the best online experience for players. “Providing the best online experience to our players logging in from all over the world is our competitive advantage. High or unstable latency is detrimental to our end-user experience and ultimately to revenue in gaming,” said Mathieu Duperré, CEO at Edgegap Technologies. “With AWS Local Zones, Edgegap can now deploy even closer to where the players are, elevating their gaming experience to new heights. This means our clients like <span>Die by the Blade</span> game maker, Triple Hill Interactive, can successfully run a one-versus-one global tournament online, or the makers of fast-paced arena shooter <span>Brutal Grounds</span>, Agog, can now provide a fair environment for every gamer anywhere.”\n</p><p>\nJamKazam is proprietary networked music performance software that enables real-time rehearsing, jamming, and performing with musicians at remote locations, overcoming latency. “Playing music live and in sync over the internet requires extremely low latency between musicians. Every millisecond counts,” said Seth Call, Co-founder and Director of Engineering at JamKazam. “AWS Local Zones enable us to offer a solution that lets musicians reliably play with each other with incredibly low latency by providing a ‘shortcut’ path across the internet. Without exaggeration, this is the biggest opportunity for our company in years. It’s a boon to musicians who can stop spending hours traveling and setting up and tearing down gear to instead spend their time rehearsing and jamming anytime in less than five minutes online.”\n</p><p>\nEsports Engine is a turnkey esports solutions company working with gaming publishers, rightsholders, brands, and teams to provide production, broadcast, tournament, and program design. “In gaming production, low latency matters and every millisecond counts. Having high-powered computing available in proximity lets us quickly scale up our productions as needed,” said Ryan Thompson, Co-Founder and Chief Production Officer at Esports Engine. “With AWS Local Zones, we’re able to deploy resources in more geographic locations across our multiple studios. This has been integral to the success of our crew members who are able to access cloud studio servers at such low latency that it almost feels like they’re using a computer locally.”\n</p><p>\nPre1.com is a leading CRM/ad management software platform for the newspaper industry. “Our clients have typically run their applications on local hardware, but with the advent of COVID and the fast pace of social media environments, the media world had to make a change to keep up,” said Don Bauernfeind, CEO at Pre1.com. “AWS Local Zones provided us with a great solution that we could offer to our clients. We were able to move their applications to the cloud with low latency and high stability. Our clients reduced their local hardware support costs while improving overall operational efficiency. Plus, it has made our life better from a support perspective. We are constantly looking for ways to collaborate with AWS to help us find a win-win for our clients and our team.”\n</p><p>\nMasomo, founded in 2015, is an interactive entertainment company transforming the power of social in mobile games. “We deploy select portions of our latency-sensitive game servers in various locations across the world in order to reach the breadth of our end users with lower latency. Providing end-users with low-latency gameplay is an important part of ensuring fairness and consistent player experience,” said Oğuzhan Yilmaz, CTO at Masomo. “With AWS Local Zones, we get the single-digit millisecond latency and proximity in lots of cities across the country, helping us improve end users’ latency, reduce churn, and provide end users with a great experience.”\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 84 Availability Zones (AZs) within 26 geographic regions, with announced plans for 24 more Availability Zones and eight more AWS Regions in Australia, Canada, India, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Faws.amazon.com&amp;esheet=52580931&amp;newsitemid=20220216006251&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=2&amp;md5=d5e37d0b37022b4fead10a9a5b5b5198\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52580931&amp;newsitemid=20220216006251&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=3&amp;md5=ea04c5cf76478cb119683c70088728bf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220216006251r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMjE2MDA2MjUxcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=c6ffab8b76e926cc42b3411b9740811c67deedbaf74ba9549c25faf4e13bbeec12d1986ede8a7d6c9f7d5c9129a92ff4cfd42976d12f9312772165742146d53c\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220216006251/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220216006251/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52580931&amp;newsitemid=20220216006251&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=4&amp;md5=725d023a07c841fec2e7a6a68afc070f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}