{"date": "2021-12-03 18:25:29+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3437.36, "close": 3427.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        Hosted by Amazon Web Services (AWS), re:Invent is a must-attend event for the cloud computing industry every year. Despite the event being hybrid, this year was no different. During Day One of the conference, AWS <a href=\"https://aws.amazon.com/blogs/apn/introducing-the-aws-energy-competency-partners/?sc_channel=sm&amp;sc_campaign=AWS_reInvent,APN%20Competency,APN%20Launches,APN%20Marketing,APN_Programs,APN_Blog&amp;sc_publisher=TWITTER&amp;sc_country=Partners&amp;sc_geo=GLOBAL&amp;sc_outcome=awareness&amp;trk=apn_blog\" data-type=\"url\" class=\"tr-link\" translate=\"no\">announced its inaugural Energy Competency partners</a>, and AspenTech was proud to be named as one of them.\n      </p>\n                <p>\n        The AWS Energy Competency Program designates highly specialized AWS Partners who have demonstrated technical expertise and repeat customer success. These partners enable energy producers worldwide to build and operate assets efficiently and safely, while working to transition to a lower carbon world.\n      </p>\n                <p>\n        Achieving the AWS Energy Competency differentiates AspenTech as an AWS Partner with deep expertise within the energy industry, including proven customer success with customers like Shell and BP in developing solutions across the value chain.\n      </p>\n                <p>\n        AspenTech's AWS Energy Competency status complements our pre-existing AWS IoT Competency. AspenTech achieved the AWS IoT Competency for demonstrating success in providing specialized edge-to-cloud IoT solutions. The Aspen AIoT Hub™, which is the basis for the AWS IoT Competency, is the cloud-ready environment for AspenTech's Industrial AI solutions, allowing organizations to unlock hidden value from their industrial data. The <a href=\"https://www.aspentech.com/en/solutions/artificial-intelligence-of-things/?SRC=blog-global-AWScomp\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Aspen AIoT Hub</a> combined with AWS Cloud technology provides customers with flexibility and scalability benefits to achieve greater automation, improve resource efficiencies and drive overall operational excellence that supports a carbon neutral future.\n      </p>\n                <p>\n        AspenTech's AWS Energy and IoT Competencies, not to mention our 40 years of experience, put us in the best position to help companies gain a competitive edge from their industrial data in the cloud. Market volatility, Industry 4.0 and the pressure to meet sustainability goals has made the need for digital transformation in the industrial sector critical. Digital and cloud technologies like AspenTech and AWS are helping customers meet these demands, and most importantly, work toward a more sustainable energy future.\n      </p>\n                <p>\n        On Day Three, Robert Boucher, Director of AIoT Solution Consulting, and Michael Krause, Director of AIoT Solution Management, at AspenTech presented \"Unlocking Business Value from Industrial Data\" in the AWS Energy theatre. Their presentation explained AspenTech's energy customers' challenges around volatility, sustainability and an evolving workforce. AspenTech's talk mirrored much of what I learned on-site as I walked the expo floor, attended other presentations and spoke to colleagues and customers at AWS re:Invent this year.\n      </p>\n                <p>\n        To learn more about the Aspen AIoT Hub or AspenTech's AWS Energy Competency status, please visit:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aspentech.com/en/resources/press-releases/aspen-technology-achieves-aws-energy-competency-status\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Aspen Technology Achieves AWS Energy Competency Status press release</a>\n                  </li>\n                  <li>\n                    <a href=\"https://www.aspentech.com/en/resources/case-studies/shell-accelerates-planning-improves-margins-with-aspen-pims-ao-in-the-aws-cloud\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Shell Accelerates Planning, Improves Margins with Aspen PIMS-AO™ in the AWS Cloud (case study)</a>\n                  </li>\n                  <li>\n                    <a href=\"https://www.aspentech.com/en/partner-network/amazon-web-services\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Unlocking Value from AI-Ready, Industrial Data on the AWS Cloud</a>\n                  </li>\n                  <li>\n                    <a href=\"https://www.aspentech.com/en/solutions/artificial-intelligence-of-things\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Aspen AIoT Hub solution page</a>\n                    <br/>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aspentech.com/en/resources/blog/live-from-aws-reinvent-2021-aspentech-achieves-aws-energy-competency-status\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Aspen Technology Inc.</strong> published this content on <strong>03 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>03 December 2021 18:25:29 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Aspen Technology Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Aspen-Technology-Inc.</p></div>"}