{"date": "2021-12-07 02:00:03.869000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Funding of over $50 million puts the company in prime position to aggregate Chinese Amazon vendors</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">BEIJING, Dec. 6, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">BEIJING</span>, <span class=\"xn-chron\">Dec. 6, 2021</span> /PRNewswire/ -- Nebula Brands, <span class=\"xn-location\">China's</span> leading aggregator of third–party Amazon vendors, today announced that it has successfully completed a Series B fundraising round with investments led by the <span class=\"xn-location\">Asia</span> fund of <span>L</span> Catterton, the largest global consumer-focused private equity firm. The investors which participated in the round have agreed to collectively provide Nebula Brands with over $50 million, subject to continued strong performance.</p>\n<p>The investment will enable Nebula Brands to capitalize on the robust growth of Chinese third–party Amazon vendors, who are increasingly driving the expansion of the marketplace. Between 2018 and 2021, the number of active Chinese third-party Amazon vendors and the gross merchandise value (\"GMV\") of transactions they generated grew faster than the wider market. <span class=\"xn-location\">China</span> now accounts for over one-third of the total Amazon market, with approximately 600,000 third-party vendors collectively generating transactions with a GMV of <span class=\"xn-money\">$135 billion</span>. Chinese vendors' share of the market is expected to rise further and account for 45% of third-party sales on Amazon in 2025.</p>\n<p>Nebula Brands is uniquely poised to tap into this growth, having assembled a strong team of more than 50 professionals in <span class=\"xn-location\">China</span> with deep knowledge of the market and extensive on-the-ground sourcing, underwriting, and operating experience. This team brings experience from renowned e–commerce, technology, and financial firms and has developed a data analytics-enabled due diligence framework that streamlines its acquisition process. Since the company's founding in May 2021, it has built a solid acquisition pipeline, focusing on the highest-ranked vendors across 10 key categories, including household goods, personal care, fitness, beauty, and pet supplies.</p>\n<p>Nebula Brands Co-Founder <span class=\"xn-person\">William Wang</span> commented, \"The Chinese third-party vendor marketplace is experiencing rapid growth, with the ability to quickly scale and provide high quality products efficiently to Amazon customers across the globe. Hundreds of vendors are ready to evolve into top international brands, and we can help them reach new heights. The model of aggregating Fulfillment by Amazon vendors and strengthening their operations has already proven to be extremely effective in some markets in the west and is set to take-off in <span class=\"xn-location\">China</span>, where Nebula Brands is leading the charge. We are excited about partnering with <span>L</span> Catterton, which brings deep consumer and operational expertise and a fantastic track record of value creation for portfolio companies.\"</p>\n<p><span>L</span> Catterton Asia Managing Partner Scott Chen added, \"Supported by visionary founders and an incredibly talented team, Nebula Brands has developed an efficient acquisition process and promising pipeline within a remarkably short period of time. There are significant opportunities for the company to leverage our operating capabilities, functional expertise, and global presence as we have extensive experience in its key categories. We look forward to partnering with the team to further drive Nebula Brands' growth and market leadership.\" </p>\n<p><span>L</span> Catterton has significant experience investing in many fast-growing, disruptive digitally-enabled brands globally. Current and past investments in the space include Vroom, Peloton, ClassPass, Freetrade, Eco, Public Goods, Butternut Box, Sociolla, and Zenyum.</p>\n<p><b>About Nebula Brands</b></p>\n<p>Nebula Brands is a tech-driven company with a unique combination of merger and acquisition, online retail, e–commerce, branding, and local supply chain knowledge that can take Amazon brands to the next level of growth. As the leading Amazon brand acquisition group in <span class=\"xn-location\">China</span>, Nebula Brands has been expanding the global presence of domestic products through an \"Acquisition Capital + Brand Operation\" model. The company strives to help more Chinese consumer brands shine on the Amazon platform.</p>\n<p><b>About <span>L</span> Catterton</b></p>\n<p>With approximately <span class=\"xn-money\">$30 billion</span> of equity capital across its fund strategies and 17 offices around the world, <span>L</span> Catterton is the largest global consumer-focused private equity firm. <span>L</span> Catterton's team of nearly 200 investment and operating professionals partners with management teams around the world to implement strategic plans to foster growth, leveraging deep category insight, operational excellence, and a broad partnership network. Since 1989, the firm has made over 250 investments in leading consumer brands. For more information about <span>L</span> Catterton, please visit lcatterton.com.</p>\n<p><b>CONTACTS</b></p>\n<p><b>Nebula Brands</b></p>\n<p><span class=\"xn-person\">William Wang</span> <br/>Co-Founder <br/><a href=\"mailto:william.w@nebula.site\" data-type=\"email\" translate=\"no\">william.w@nebula.site</a> <br/>+86 186 6933 8926 </p>\n<p><b><span>L</span> Catterton </b></p>\n<p><span class=\"xn-person\">Julie Hamilton</span> (U.S.)<br/>Managing Director, Firm Communications<br/><a href=\"mailto:media@lcatterton.com\" data-type=\"email\" translate=\"no\">media@lcatterton.com</a> <br/>+1 203 742 5185</p>\n<p><span class=\"xn-person\">Bob Ong</span> / <span class=\"xn-person\">Bonnie Gan</span> (<span class=\"xn-location\">Asia</span>)<br/><a href=\"mailto:bob.ong@lcatterton.com/\" data-type=\"email\" translate=\"no\">bob.ong@lcatterton.com</a> / <a href=\"mailto:bonnie.gan@lcatterton.com\" data-type=\"email\" translate=\"no\">bonnie.gan@lcatterton.com</a> <br/>+65 6672 7619 / +86 10 8555 1807</p>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=NY98508&amp;sd=2021-12-06\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1OWTk4NTA4JnNkPTIwMjEtMTItMDY=&amp;key=1b989f74841abec4dd6989bb1934ddd915a1a7e3f0abb527a69a63aeb6e88882ba7a046bedb24586bbe16315b056eef5ff4a4bf9d259e743c0c58930975d7da1\"/></div></div> View original content:<a href=\"https://www.prnewswire.com/news-releases/nebula-brands-receives-series-b-investment-led-by-l-catterton-asia-301438481.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/nebula-brands-receives-series-b-investment-led-by-l-catterton-asia-301438481.html</a><p></p>\n<p>SOURCE  L Catterton</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NEBULA-Series-B</p></div>"}