{"date": "2022-02-03 22:06:16.457000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Amazon Prime membership has so many benefits that we think it's more than worth the price of entry. For certain users, however, there are ways to get it for even less—you you can save up to 50% on the fee if you qualify for an Amazon Prime discount.  An Amazon Prime membership normally costs $12.99 a month after a 30-day free trial or $119 a year if you sign up for the full 12 months (which equates to about $9.92 a month for an overall savings of $36.88). With discounted plans, however, the price can drop as low as $5.99 a month, saving you nearly half off on the popular service.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>There are two ways to qualify for a discount on an Amazon Prime membership: The first is with the Amazon Prime student discount, and the second is for EBT and select government assistance recipients. Here's everything you need to know about Amazon Prime discounts—including what you need to qualify and how to sign up.</p><p class=\"tr-npp-section-title\">Amazon Prime student discount</p><p>Students enjoy a free Amazon Prime trial period for six months, then pay just $6.49 a month, a savings of $6.50 a month over the regular price. (Students can also pay annually for a total cost of $59 a year, for a savings of $60 annually on a standard annual membership, and an additional $17.88 in savings over paying for the student membership monthly.) Exclusive offers are included with student memberships, such as access to the Showtime Amazon Prime Video add-on channel for $0.99 a month along with access to Amazon Prime Video (typically $8.99 a month on its own), and access to the unlimited version of Amazon Music for the first year that lets them access more than 75 million songs, unlimited song skips and more (valued at $9.99 a month). There's also unlimited Amazon Photo storage with 5GB for documents and videos as well. </p><p>A student membership also includes a two-month free trial to Amazon Kindle Unlimited for digital versions of books and free food delivery from Grubhub for any order placed at $12 or more. </p><p>► <span>Presidents' Day: </span> Shop the best deals on TVs, appliances and everything in-between ahead of the holiday</p><p>► <span>Valentine's Day: </span> Shopping for your Valentine? We've got deals on chocolates and so much more </p><p><span>How can students prove they qualify for an Amazon Prime membership discount?</span> </p><p>Students can prove they qualify for an Amazon Prime membership discount by providing a .edu e-mail address upon sign-up—it doesn't have to be the e-mail used for logging in but must be provided for the initial verification process. Other accepted means, which can be e-mailed to student-verification@amazon.com, include a transcript, class list or tuition bill that shows your name, the name of the educational institution and the current term; or an official acceptance letter for an upcoming term that includes the date you will begin.</p><p><span>What benefits can you access with a student Amazon Prime membership?</span> </p><p>Students with an Amazon Prime membership enjoy most of the same benefits as standard members including fast and free delivery on most items, including two-hour grocery delivery; access to Amazon Prime Video, Amazon Prime Music and Prime Gaming, including one from Twitch channel during the trial and one free channel every 30 days once the trial period is over; access to Prime Reading and Textbook Rental that offers up to 90% off the price of titles; early Prime member deals; discounts at Whole Foods; early access to Lightning deals; unlimited photo storage with Amazon Photos; and Prime Wardrobe. </p><p>Exclusive offers for students include the Showtime add-on channel for $0.99 a month for up to the first year; Amazon Music Unlimited for $0.99 a month; and a free two-month trial to Kindle Unlimited, where you can select from millions of book titles to read on any device. There are also student-exclusive deals and discounts. </p><p><span>Are there limitations during the free trial period for students?</span> </p><p>Yes. During the six-month free trial period for students, you might not be able to access some features, such as streaming music or Kindle book rentals. This access is available, however, once the 6-month trial period is over.</p><p><span>Do you pay month-by-month for a student Amazon Prime membership?</span> </p><p>After the six-month trial period is finished, you will be billed month-to-month at the discounted rate. You can choose to pay annually as well. If you sign up as a student with an existing Amazon Prime account, you will get a refund on the remaining months left in your Prime subscription. However, you won't have access to certain benefits until the six-month trial period is over. </p><p><span>How often do you have to verify your eligibility for a student Amazon Prime membership?</span> </p><p>As a student, the discounted rate is effective for a maximum of four years. Whenever the account is up for renewal (either monthly or annually), however, you will need to verify your current student status. You can do this by going to the Manage Your Prime Membership menu (if you pay monthly) or Manage Your Student Membership (if you pay annually) to submit the requested documentation to confirm that you are still a student. You will be automatically upgraded at the regular rate if you do not re-verify, but if you submit approved documentation within 60 days, the difference will be refunded. You are signed up again for the discounted rate each time from the date you provide proof of enrollment verification.</p><p><span>Do you get the same access to Amazon Prime as regular members with a discounted Amazon Prime membership?</span> </p><p>For the most part, yes. Students get most of the same access as regular members of Amazon Prime—they also receive additional, tailored perks and discounts, including discounts on textbooks and free food delivery. There are some features not included, however: Discounted memberships include unlimited two-day shipping on eligible items but not same-day or next-day shipping. (Students can pay an additional $3.99 to upgrade to one-day shipping if desired.)</p><p><span>Does a student Amazon Prime membership expire when you graduate?</span> </p><p>Yes. Once you can no longer verify your student status (such as after you graduate!) or a four-year period has elapsed, your discounted Amazon Prime membership will expire. If you sign up prior to graduation, you can still enjoy the benefits until the renewal period is up. This can extend your access by as much as several months if you pay annually, or a few weeks if you pay monthly.</p><p class=\"tr-npp-section-title\">Amazon Prime EBT or government assistance membership</p><p>A second way to save on an Amazon Prime membership is available to customers who have an EBT card or other qualifying government assistance documentation. (Note, however, that the membership can't be paid for with EBT funds.) The rate for this membership is $5.99 a month, a savings of $7 a month from the full-price membership, and also comes with a 30-day free trial. </p><p>User get get free delivery, access to exclusive deals and member savings, access to Amazon Prime Video, unlimited photo storage with Amazon Photos plus up to 5GB video storage; secure delivery and returns using Amazon Hub lockers; up to 15% off everyday essentials and up to 20% off diapers with a subscription for recurring deliveries; Amazon Cash or gift card payments as well as SNAP EBT for eligible groceries with free shipping and automatic virtual coupons applied at checkout. </p><p><span>How do you prove you qualify for an Amazon Prime membership discount with government assistance?</span> </p><p>Supplemental Security Income (SSI) recipients can provide a photo of their complete eligibility letter. For SNAP users, simply enter your EBT number and upload an image of the EBT card. If you have a Direct Express (DE) debit card, you can submit an image. For a limited time, Amazon is also accepting Economic Impact Payment (EIP) debit cards, which also can be verified by providing an image.</p><p>If you are receiving Temporary Assistance for Needy Families (TANF), an image of the eligibility letter will suffice, as will an image of a letter noting your participation in the National School Lunch Program (NSLP) that includes both your child's name and the name of the school. If you are part of the Low Income Home Energy Assistance Program (LIHEAP), you can send an image of the letter confirming your participation, and the same goes for the Women, Infants, and Children (WIC) program or Tribal assistance (TTANF).</p><p>Make sure that the image and all text is readable in the photo. The letter must show the date it was issued (which must be within the last 12 months) or the date of expiry. It must also include the name of the beneficiary. </p><p>With a qualifying EBT card or proof of involvement in an accepted government assistance program, you can receive benefits like access to SNAP-eligible groceries on Amazon Grocery and Amazon Fresh, and exclusive discounts on things like groceries and other essentials with offers from various brands.</p><p><span>Are there limitations during the free trial period?</span> </p><p>The 30-day free trial for EBT or other government assistance program recipients includes all the same perks as a standard 30-day Amazon Prime free trial.</p><p><span>Do you pay month by month for a discounted Amazon Prime membership for government assistance recipients?</span> </p><p>After the six-month trial period is finished, you will be billed month-to-month at the discounted rate.  </p><p><span>How often do you have to verify your eligibility for a discounted Amazon Prime membership?</span> </p><p>To continue receiving a discounted Amazon Prime membership with an EBT card or other qualifying government assistance program, you must verify your status every 12 months. The discount can be received for up to four years from the initial date of signup. To make things simple, Amazon will send an e-mail whenever it is time to verify your credentials to ensure you continue to qualify for the discount.</p><p><span>Do you get the same access to Amazon Prime as regular members with a discounted Amazon Prime membership?</span> </p><p>For the most part, yes. Qualifying EBT and other government assistance programs get most of the same access as regular members of Amazon Prime—they also receive additional, tailored perks and discounts including discounts on groceries and essentials like baby food and diapers.</p><p>Like with student memberships, there are some features not included—discounted memberships include unlimited two-day shipping on eligible items but not  same-day or next-day shipping. </p><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Looking for an Amazon Prime membership discount? Here's how to save up to 50%</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}