{"date": "2021-11-01 15:58:30.631000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Oct 27, 2021</p></div><div class=\"tr-npp-lead\"><p>More than 100 companies in our watch list reported earnings after markets closed Monday and before they opened again on Tuesday. Of those, 37 missed consensus earnings estimates and 25 missed revenue estimates.</p><p>After markets close Wednesday, we'll get reports from three companies: <a href=\"https://247wallst.com/investing/2021/10/26/earnings-previews-ebay-ford-teladoc/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">eBay, Ford and Teladoc</a> . On Thursday morning, reports are due from four more companies we follow: <a href=\"https://247wallst.com/investing/2021/10/26/earnings-previews-caterpillar-comcast-linde-sirius-xm/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Caterpillar, Comcast, Linde and Sirius XM</a> .Here's a look at four companies scheduled to report results after markets close Thursday.</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Amazon</p><p>In mid-July, Amazon.com Inc. ( <a href=\"https://247wallst.com/companies/amzn/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">NASDAQ: AMZN</a> ) posted a new 12-month and all-time high share price. For the entire 12-month period, Amazon stock has risen by a modest 5.8%. Since mid-July, the stock has dropped by 9.5%. While the e-commerce giant is expected to post solid revenue growth in the third quarter, rising costs for labor are expected to weigh on operating profits. The COVID-19 pandemic boosted the company's revenue last year. This year is following a different narrative.When 49 of 49 analysts give a stock a Buy or Strong Buy rating, that stock may be a good one. That's what analysts think of Amazon stock. At a recent price of around $3,397, the upside potential based on a median price target of $4,150 is 22.5%. At the high price target of $5,000, the upside potential is 47%.</p><p>Analysts are looking for third-quarter revenue of $111.66 billion, which would be down about 1.3% sequentially but up 16% year over year. Adjusted earnings per share (EPS) are expected to be $8.96, down nearly 41% sequentially and down 27.6% year over year. For the full fiscal year, EPS are expected to be $52.67, up nearly 26%, on sales of $475.63 billion, which would be 23% higher.</p><p>Amazon stock trades at 63.0 times expected 2021 EPS, 49.7 times estimated 2022 earnings and 35.8 times estimated 2023 earnings. The stock's 52-week trading range is $2,881.00 to $3,773.08. Amazon does not pay a dividend.</p><p class=\"tr-npp-section-title\">Apple</p><p>Apple Inc. ( <a href=\"https://247wallst.com/companies/aapl/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">NASDAQ: AAPL</a> ), with its market cap of $2.48 trillion, is the most valuable publicly traded company in the United States. Amazon is the fourth-most valuable, trailing Apply by about $720 billion. Not counting Apple or Amazon, there are only four other companies worth more than that $720 billion difference: Microsoft, Alphabet, Facebook and Tesla.</p><p>Is it any surprise, then, that governments around the world are seeking to rein in the power of the tech giants? And Apple gets a lot of attention because it is the biggest. That attention may be Apple's strongest headwind–that, and the same supply chain issues that plague every other maker of a product that has a physical manifestation. Still, Apple stock is up nearly 31% over the past 12 months, although it's down more than 4.5% since early last month.</p><p>While not as bullish on Apple as they are on Amazon, of 43 analysts covering Apple, 33 give the stock a rating of Buy or Strong Buy. Another eight rate the shares at Hold. At a price of around $149.25, the upside potential based on a median price target of $170 is nearly 14%. At the high price target of $198, the upside potential is nearly 33%.</p><p>Analysts expect Apple to report fiscal fourth-quarter revenue of $84.94 billion, up 4.3% sequentially and more than 31% year over year. Adjusted EPS are expected to come in at $1.24, down nearly 5% sequentially and up almost 70% year over year. For the fiscal year that ended in September, analysts expect the company to report EPS of $5.58, up 70%, on sales of $366.53 billion, up more than 33%.</p><p>Apple stock trades at 26.6 times expected 2021 EPS, 26.4 times estimated 2022 earnings and 25.0 times estimated 2023 earnings. The stock's 52-week range is $107.32 to $157.26. Apple pays an annual dividend of $0.88 (yield of 0.59%).</p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 24/7 Wall St.</p></div>"}