{"date": "2022-01-04 14:01:04+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>INNERSCOPE HEARING TECHNOLOGIES INC (\"INND-0\")\n- CEO to Present at The Emerging Growth Conference on\n- Jan. 5, 2022\n\n     InnerScope Hearing Technologies Inc. (\"InnerScope\"), an emerging and\ndisruptive leader in the Direct-to-Consumer Hearing Technology space,\nannounces today that InnerScope CEO Matthew Moore has been invited to\npresent at the Emerging Growth Conference.\n\n     Moore's confirmed presentation time is:\n\n     3 - 3:30 p.m. EST / 12 - 12:30 p.m. PST, Wednesday, Jan. 5, 2022\n\n     The Emerging Growth Conference is a live interactive online event,\nwhich will allow InnerScope's existing shareholders and the investment\ncommunity to interact with InnerScope's CEO in real-time.\n\n     Moore will perform his presentation and may subsequently open the\nfloor for questions. Anyone can ask questions during the event, and Moore\nwill do his best to get through as many of them as possible.\n\n     Please register using the registration link below and receive any\nreleased updates to ensure you can attend InnerScope's presentation at 3 -\n3:30 p.m. Eastern Time on Wednesday, Jan. 5, 2022\n\n     Here is the unique registration link:\n\n<a href=\"https://goto.webcasts.com/starthere.jsp?ei=1518570&amp;&quot;\" class=\"tr-link\">https://goto.webcasts.com/starthere.jsp?ei=1518570&amp;</a>;tp_key=bbd5fd57f5&amp;sti=in\nnd\n\n     If attendees cannot join the event live on the day of the conference,\nan archived webcast will also be made available on EmergingGrowth.com.\nInnerScope will also release a link to the webcast following the event.\n\n     Moore's presentation will highlight InnerScope's two recent\ndirect-to-consumer hearing aid company acquisitions with iHear Medical\nInc., its 40+ patents, and its iHearTest, the only FDA-cleared, in-home\nhearing test on the market and sold at CVS Pharmacy's; and HearAssist II\nLLC., Walmart's largest hearing aid supplier. In addition, Moore will\ndiscuss InnerScope's 2022 growth trajectory with these pivotal acquisitions\nand a key partnership with Atlazo Inc., a leader in intelligent\nsemiconductor solutions, to develop new types of unprecedented artificial\nintelligence hearing products.\n\n     About InnerScope Hearing Technologies, Inc. (OTC PINK: INND):\n\n     InnerScope Hearing Technologies Inc. is a leading Direct-to-Consumer\n(DTC) manufacturer and distributor of FDA-registered hearing aids, hearing\nassistive devices, hearing health-related products, and Personal Sound\nAmplifier Products (PSAPs) (\"Hearing Products\") dedicated to addressing the\nglobal demand for affordable hearing solutions. InnerScope's Hearing\nProducts and its business model break through the persistent barriers that\nprevent access to effective hearing solutions.\n\n     InnerScope's recent acquisition of iHear Medical Inc., a DTC\ncloud-based hearing solution provider, gives the Company access to over 40\npatents and an FDA-registered manufacturing and R&amp;D facility. In addition,\nInnerScope has acquired HearingAssist, an established leader in the\ndirect-to-consumer hearing aid market with a customer base of over 400,000.\nThese acquisitions, combined with a partnership with Atlazo Inc., a\nsemiconductor innovator for next-generation AI smart devices, will allow\nInnerScope to take the lead position in the direct-to-consumer hearing\nsolutions market by selling innovated proprietary advanced hearing products\nthrough Walmart and other major Big Box retailers.\n\n     InnerScope has a full line of Hearing Products including proprietary,\nfree to the public, automated self-check hearing screening kiosks, which\nare currently being deployed in some of the nation's largest retailers and\npharmacy chains. InnerScope's Hearing Products are presently displayed in\n757 Walmart stores in five states. These Hearing Products are also\navailable through these multiple retail/wholesale channels: Walmart.com,\nAmazon.com,  Giant Eagle, Hy-Vee, Hartig Drug, Food City, and Cardinal\nHealth dba RGH Enterprises Inc. Additional major retailers are launching\nsoon in-store and online.\n\n     For information related to InnerScope Hearing Technologies' latest\nhearing aids and related hearing products, please visit:\n<a href=\"http://myheariq.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://myheariq.com</a>\n\n     <a href=\"http://iheardirect.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://iheardirect.com</a>\n\n     <a href=\"http://hearingassist.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://hearingassist.com</a>\n\n     For the most up-to-date information about InnerScope Hearing\nTechnologies (OTC: INND), please visit and follow our official Twitter\naccount @inndstock page:\n<a href=\"https://twitter.com/inndstock\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/inndstock</a>\n\n     InnerScope Hyperlinks:\nAtlazo Inc.\nAcquisition of iHear Medical Inc.\n\n     Acquisition of HearingAssist\niHearTest\nautomated self-check hearing screening kiosk\nDirect-to-Consumer Hearing Products.\n\n     InnerScope's Hearing Health Flexible Subscription Plans\n\n     About the Emerging Growth Conference:\n\n     The Emerging Growth Conference is an effective way for public\ncompanies to present and communicate their new products, services, and\nother major announcements to the investment community from the convenience\nof their office, in a time-efficient manner. The audience includes\npotentially tens of thousands of Individual and Institutional investors, as\nwell as Investment advisors and analysts.\n\n     All sessions will be conducted through video webcasts and will take\nplace in the Eastern time zone. Each company's presentations will be\ndelivered by their executive management team. The Emerging Growth\nConference focus and coverage includes a wide range of growth sectors and\ntimely market themes, including augmented reality, artificial intelligence,\nscientific, medical instruments and therapeutics, biotechnologies,\ncannabis, food &amp; beverage, energy, and more.\n\n     Safe Harbor\n\n     This news release contains \"forward-looking statements\" within the\nmeaning of Section 27A of the Securities Act of 1933, as amended, and\nSection 21E of the Securities Exchange Act of 1934, as amended intended to\nbe covered by the \"safe harbor\" created by those sections. Any statements\nthat are not historical facts contained in this press release are also\n\"forward-looking statements,\" as that term is defined under the Private\nSecurities Litigation Reform Act of 1995 (PSLRA). Such statements may be\nidentified by words such as \"expects,\" \"plans,\" \"projects,\" \"will,\" \"may,\"\n\"anticipates,\" \"believes,\" \"should,\" \"intends,\" \"estimates,\" and other\nwords of similar meaning. Such forward-looking statements are based on\ncurrent expectations, involve known and unknown risks, a reliance on third\nparties for information, transactions or orders that may be canceled, and\nother factors that may cause our actual results, performance or\nachievements, or developments in our industry, to differ materially from\nthe anticipated results, performance or achievements expressed or implied\nby such forward-looking statements. Factors that could cause actual results\nto differ materially from anticipated results include risks and\nuncertainties related to the fluctuation of global economic conditions, the\nperformance of management and our employees, our ability to obtain\nfinancing or maintain contractual relationships with vendors and customers,\ncompetition, general economic conditions and other factors that are\ndetailed in our periodic reports filed with the Securities and Exchange\nCommission (\"S.E.C.\"). We intend that all forward-looking statements be\nsubject to the safe-harbor provisions of the PSLRA, Securities Act, and\nSecurities Exchange Act.\n\n Contact Information:\n\nContact:\nInnerScope Hearing Technologies, Inc.\nInvestor Relations\nir@innd.com\n833-788-0506\nwww.innd.com\n\n     Investor Relations Agency Contact:\nSkyline Corporate Communications Group, LLC\n Lisa Gray, Senior Account Manager\nOne Rockefeller Plaza, 11th Floor\n New York, NY 10020\n Office: (646) 893-5835\n Email: lisa@skylineccg.com\n\n     Corporate Communications:\n InvestorBrandNetwork (IBN)\n Los Angeles, California\n www.InvestorBrandNetwork.com\n 310.299.1717 Office\n Editor@InvestorBrandNetwork.com\n\nTel   : 1-916-218-4100    INNERSCOPE ADVERTISING AGY INC\nWWW   : <a href=\"https://www.innd.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.innd.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200300278.MNPRE2200301321-05594320220104</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}