{"date": "2021-11-29 14:00:12.782000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Data-first approach allows AWS customers to immediately deploy AI and ML applications to modernize their data estate and reduce time to business outcomes</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">SAN RAMON, Calif., Nov. 29, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">SAN RAMON, Calif.</span>, <span class=\"xn-chron\">Nov. 29, 2021</span> /PRNewswire/ -- <u><a href=\"https://wandisco.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">WANdisco</a></u>, the live data company, announced today that it has achieved <u><a href=\"https://aws.amazon.com/migration/partner-solutions/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Web Services (AWS) Migration and Modernization Competency</a></u> status for AWS Partners. With this new and expanded designation, AWS recognizes the success of WANdisco's <u><a href=\"https://wandisco.com/partners/aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LiveData Migrator</a></u> beyond migration to enable and accelerate data and application modernization journeys at scale. AWS customers looking to drive digital transformation, while also ensuring business continuity, can turn to WANdisco with confidence to ensure the success of their modernization initiatives.</p>\n<p>AWS launched the AWS Migration and Modernization Competency to allow customers to easily and confidently engage highly specialized AWS Partners that activate data and modernize applications. It takes the heavy lifting out of identifying industry leaders with proven success and technical prowess.</p>\n<p>\"WANdisco is proud to be one of the first AWS Partners to achieve the new AWS Migration and Modernization Competency status, and now to be recognized in the expanded data mobility category,\" said <span class=\"xn-person\">David Richards</span>, Founder and Chief Executive Officer at WANdisco. \"Our proven track record and data-first approach to helping large enterprises more rapidly and safely achieve their petabyte-scale data modernization goals is unmatched. Our team, working with strategic systems integrators and independent software vendors (ISVs), is dedicated to helping enterprises accelerate their AWS analytics journey with the industry's most advanced data modernization platform. We want every customer to unlock the agility and pace of innovation made possible by AWS.\"</p>\n<p>Achieving the AWS Migration and Modernization Competency highlights WANdisco's deep domain expertise in helping customers more rapidly and safely embrace cloud and application transformation—effectively reducing licensing costs, optimizing operational costs, and improving performance, agility, and resiliency. </p>\n<p>\"The AWS Migration and Modernization Competency provides the widest and deepest variety of migration and modernization solutions that allow customers and partners to migrate and modernize to AWS at scale,\" said <span class=\"xn-person\">Bill Platt</span>, General Manager, AWS Migration Services. </p>\n<p>AWS is enabling scalable, flexible, and cost-effective solutions from startups to global enterprises. To support the seamless integration and deployment of these solutions, AWS established the <u><a href=\"https://aws.amazon.com/partners/competencies/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Competency Program</a></u> to help customers identify AWS Partners with deep industry experience and expertise. When it comes to data modernization, WANdisco has demonstrated these capabilities at petabyte scale.</p>\n<p>WANdisco <u><a href=\"https://www.wandisco.com/partners/aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LiveData Migrator</a></u> allows production applications to continue to operate on-premises while their data is migrated to Amazon Simple Storage Service (Amazon S3). With WANdisco's unique, patented approach, production data becomes available in the cloud immediately and continues to be updated with changes throughout the migration, allowing customers to use AWS cloud services on that data to drive business outcomes without delays or the risk of inaccurate data. It also supports data modernization and transformation where required for cloud-native data platforms, allowing customers to benefit more easily from machine learning, analytics, and other capabilities in AWS for any amount of data.</p>\n<p>WANdisco <u><a href=\"https://www.wandisco.com/partners/aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LiveData Migrator</a></u> gives enterprises the opportunity to free their systems from the capital constraints of acquiring storage hardware by leveraging Amazon S3 and associated services. LiveData Migrator delivers fast time to cloud analytics and business value for moving unstructured data into cloud storage to then take advantage of machine-learning (ML) powered cloud analytics such as Amazon EMR, Databricks, or Snowflake to gain valuable business insights. LiveData Migrator ensures on-premises and cloud environments are kept consistent, setting the foundation for a hybrid cloud architecture. </p>\n<p><b>About WANdisco</b></p>\n<p>WANdisco is the LiveData company. WANdisco's LiveData Cloud Services enable enterprises to create an environment where data is always available, accurate and protected, creating a strong backbone for their IT infrastructure and a bedrock for running consistent, accurate machine learning applications. With zero downtime and zero data loss, WANdisco LiveData Platform keeps geographically dispersed data at any scale consistent between on-premises and cloud environments allowing businesses to operate seamlessly in a hybrid or multi-cloud environment. For more information on WANdisco, visit <u><a href=\"http://www.wandisco.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.wandisco.com</a></u>.</p>\n<p><b>Media Contact:<br/></b>LaunchSquad for WANdisco<br/><u><a href=\"mailto:wandisco@launchsquad.com\" data-type=\"email\" translate=\"no\">wandisco@launchsquad.com</a> <br/></u>+1 (212) 564-3665</p>\n <p> </p>\n<p> </p>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=LN87254&amp;sd=2021-11-29\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1MTjg3MjU0JnNkPTIwMjEtMTEtMjk=&amp;key=b8ff2225ff68bbdfbad6fbbc9e32c64f689d1e905486a5ce3e20671fdbf5caf9c608a4b7090a1c4924b7889d1e50320ecf70aea53fd8565a74da233f2258a82b\"/></div></div> View original content:<a href=\"https://www.prnewswire.com/news-releases/wandisco-achieves-aws-migration-and-modernization-competency-status-to-accelerate-enterprise-digital-transformations-301432143.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/wandisco-achieves-aws-migration-and-modernization-competency-status-to-accelerate-enterprise-digital-transformations-301432143.html</a><p></p>\n<p>SOURCE  WANdisco</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WANdisco-AWS</p></div>"}