{"date": "2021-12-18 09:30:32.502000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3377.42, "close": 3341.58}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The Competition Commission of India (CCI) has withdrawn approval for Amazon's investment in Future Coupons Private Ltd. that was granted in 2019. The unprecedented move by the regulator could deal a blow to Amazon's attempts to thwart a takeover of the Future Group's retail assets by Reliance Industries Ltd (RIL). An explanation of the context of the order by the CCI and ongoing litigation between Amazon and the Future Group.</p><p>Why did the CCI withdraw approval for Amazon's investment in FCPL?</p></div><div class=\"tr-npp-body\"><p>The CCI said it has concluded that Amazon \"misled\" the regulator about its intentions regarding its investment in FCPL. The CCI in its order noted that the company had \"misled the Commission to believe, through false statements and material omissions, that the combination and its purpose were the interest of Amazon in the business of FCPL\" and suppressed \"the purpose of establishing strategic alignment and partnership between Amazon Group and FRL (Future Retail Ltd) as well as have a 'foot-in-the-door' in the India retail sector.\"</p><p>Amazon's investment in FCPL gave the former a call option on acquiring the promoter stake of FCPL, Future Retail within 3-10 years. Amazon has relied on this aspect of the agreement in winning a stay on an acquisition of the Future Group's retail businesses by RIL from the Singapore International Arbitration Centre (SIAC).</p><p>The CCI noted in its order that internal emails from Amazon revealed that the company intended to acquire Future Retail once foreign investment laws are relaxed and not just the investment opportunity in FCL.</p><p>\"When foreign investment laws are relaxed and higher stake or acquisition of multi-brand retail assets is permitted beyond today's possibilities, we would have a foot-in-the-door to acquire more in this strategic asset, should we so desire at the time,\" said an internal email from Amazon regarding the transaction.</p><p>The CCI kept the approval it had granted for the investment in abeyance and directed Amazon to file information regarding the investment within 60 days which the CCI will examine afresh.</p><p>How does this impact the potential sale of Future Group's retail assets to RIL?</p><p>Amazon had approached the Singapore International Arbitration Centre (SIAC) and won a stay on the proposed sale of the Future Group's retail assets to RIL which was later upheld by the Supreme Court. Amazon had cited covenants in the FCPL shareholders agreement and share subscription agreement that gave it \"special and material rights available with FCPL with respect to FRL's business and its Retail Assets.\"</p><p>The order by the CCI could ease the path for RIL to acquire the Future Group's retail assets as it may void the investment made by Amazon in FCPL and its rights under the shareholders agreements and share subscription agreement</p><p>Experts noted however that the order was likely to be challenged. Amazon had argued in submissions before the CCI that the regulator did not have the power to revoke approval for a combination under the Competition Act.</p><p>\"CCI order suspending its approval granted for Amazon's strategic investments in the Future Group is a welcome, though belated, step, since the competition concerns ought to have been examined in the first place . However, its legal validity before higher courts will have to be tested for sure,\" said MM Sharma, Head of competition law practice at Vaish Associates Advocates.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}