{"date": "2021-05-17 02:43:34.699000+00:00", "ticker": "AAF", "mrkt_info": {"open": 78.95, "close": 78.65}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Bharti Airtel is set to announce its March quarter results of FY21 (Q4FY21) on Monday amid expectations of a strong operating print and a moderation in average revenue per user (ARPU) with interconnect usage charge (IUC) going to zero. Analysts will keep a keen eye on the management's commentary on ARPU trajectory and non wireless business.</p><p>For the entire telecom sector as well, Emkay expects the zero IUC regime to distort headline numbers and a decline in ARPU. Bharti was a net-payer of IUC while Jio and Vodafone Idea were net receivers on Ebitda level.</p></div><div class=\"tr-npp-body\"><p>Emkay expects Bharti's underlying momentum to remain intact through mix improvement, resulting in lowest wireless revenue decline of 2 per cent, while Vodafone Idea and Jio may see 11 per cent and 5 per cent declines, respectively. Besides, Bharti Airtel is expected to outperform on data subscriber adds for the third quarter in a row.</p><p>Last week, Airtel Africa said its profit after tax (PAT) for the March 2021 quarter doubled to $154 million, helped by growth in key services like data and mobile money. The underlying revenue for the fourth quarter ended March 31 stood at $1,038 million, rising 15.4 per cent year-on-year (YoY) on a reported currency basis.</p><p>At the bourses, Bharti Airtel remained flat (up 1.57 per cent) in the quarter under review as compared to 3.68 per cent rise in the benchmark S&amp;P BSE Sensex in the same period, ACE Equity data show.</p><p>Here's what leading brokerages expect from Airtel's Q4FY21 numbers:</p><p>ICICI Securities</p><p>The brokerage sees continued traction in subscriber addition for Airtel at around 90 lakh for the quarter. It expects Q4FY21 to witness the impact of IUC going to zero, impacting both topline and costs. \"The reported ARPU is likely to see around 6.5 per cent QoQ decline (around 9 per cent decline owing to IUC impact offset by around 2.5 per cent like to like growth) at Rs 155,\" it said.</p><p>ICICI Securities expects Indian wireless revenues to see 3.1 per cent sequential decline at Rs 14,326 crore while India non-wireless revenues traction may remain robust, especially broadband and enterprise. Consolidated reported revenues are expected to slip 1 per cent QoQ (up 10.7 per cent YoY) at Rs 26,252 crore while profit after tax (PAT) may come in at Rs 169 crore against the loss of Rs 5,237 crore reported in the year-ago quarter.</p><p>With IUC going to zero, removal of revenues, costs will result in improved optical margins, the brokerage said. India Ebitda margins are seen at 48.5 per cent, up 330 bps QoQ, while reported earnings before interest, tax, depreciation, and ammortisation (Ebitda) is expected to grow 2.3 per cent QoQ at Rs 12,326 crore.</p><p>Emkay</p><p>The brokerage expects Airtel's net sales to remain flat sequentially, but grow 11.7 per cent YoY, at Rs 26,498.8 crore. Among segments, India wireless revenues are seen declining 2 per cent QoQ, impacted by zero IUC revenues, while being offset by gross subscriber additions of 1 crore. Strong data subscriber additions should aid in limiting the ARPU decline to 7 per cent QoQ at Rs 155, Emkay said.</p><p>\"Data volumes and minutes on the network are likely to rise 9 per cent and 5 per cent QoQ, respectively. Supported by a low base, revenue for the home broadband business should see a 4 per cent QoQ rise, while the enterprise segment should see a moderation. The home broadband segment should witness a moderation in ARPU due to the residual impact of lower-priced plans,\" the brokerage said.</p><p>\"Consolidated Ebitda is projected to rise 2.1 per cent QoQ to Rs 12,302.2 crore, aided by sustained operating leverage in the India wireless business via continued subscriber mix improvement. Ebitda margin is seen growing 97 bps QoQ to 46.4 per cent,\" it said.</p><p>Axis Securities</p><p>In terms of the headline numbers, analysts at Axis Securities expect Airtel's top-line to increase 0.6 per cent sequentially to Rs 26,681 crore. The same is an increase of 12.5 per cent YoY from Rs 23,723 crore reported in the year-ago quarter. Meanwhile, the telecom operator is seen posting a profit of Rs 1,453 crore in the quarter under review.</p><p>\"We see positive net DTH additions and higher commission cost and S&amp;M cost which will lead to lower margin expansion of 661 basis points (bps) at 49 per cent. Ebitda is seen at Rs 13,195 crore, up 29.8 per cent YoY,\" the brokerage said.</p><p>JM Financial</p><p>JM Financial is building in total wireless net subscriber addition of around 70 lakh and mobile broadband (MBB)/4G subscriber addition of around 1 crore for Airtel in the quarter under review. In the core wireless segment, revenue is expected to decline 4.4 per cent QoQ to Rs 14,100 crore and Ebitda to grow 8.4 per cent QoQ to Rs 7,000 crore.</p><p>The brokerage expects Airtel's consolidated revenue to remain flat QoQ at Rs 26,562 crore, due to strong performance from other India businesses and Airtel Africa while profit is seen growing sequentially to Rs 1,720.9 crore. On the operational front, Airtel may report an Ebitda of Rs 12,763 crore and Ebitda margin of 48.1 per cent, up 250 bps.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}