{"date": "2022-02-04 08:37:29+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n                  <h4>\n          MARKET COMMENTARY\n        </h4>\n                </div>\n                <p>\n        SOUTH AFRICAN MARKET COMMENTARY\n      </p>\n                <p>\n        Local stocks closed lower yesterday, as the JSE All Share index posted a 0.22% loss ( to 75,022 index points) driven by a downtick in industrials. The Top 40 index was 0.28% lower at the close of the session. On an individual share basis, Aspen Pharmacare was the worst performing Top 40 component on the day, shedding 4.19%. In other news, South African private sector activity rose slightly in January as the Omicron wave of Covid-19 cases receded, lifting demand and stabilising new business, a survey showed on Thursday.\n      </p>\n                <p>\n        EUROPEAN MARKET COMMENTARY\n      </p>\n                <p>\n        European stocks closed lower on Thursday as investors reacted to policy decisions from both the European Central Bank and the Bank of England amid persistent inflationary pressures. In the U.K., the Bank of England raised interest rates again and began the process of quantitative tightening. As expected, the BOE's Monetary Policy Committee voted unanimously for a 25-basis point rate increase to take the main Bank Rate to 0.5%. Separately, the European Central Bank opted to hold interest rates steady, defying growing pressure to curb stimulus plans.\n      </p>\n                <p>\n        US MARKET COMMENTARY\n      </p>\n                <p>\n        U.S. stocks fell on Thursday as investors' renewed optimism on big tech names, driven by a slew of strong earnings, took a turn down after Facebook-parent Meta Platforms reported disappointing quarterly results. Meta Platforms shares plunged 26.4% after the company's quarterly profit fell short of expectations. The company also issued weaker-than-expected revenue guidance for the current quarter. Other social media names followed Meta lower yesterday. Snap shares slid 23.6%, and Twitter dropped 5.5%.\n      </p>\n                <p>\n        ASIAN MARKET COMMENTARY\n      </p>\n                <p>\n        Shares in Asia-Pacific were mixed this morning, following heavy losses overnight on Wall Street that saw the tech-heavy Nasdaq Composite plunging nearly 4%. In Australia, benchmark S&amp;P/ASX 200 Index shed around 0.14%. The broader All Ordinaries Index is down 7.40 points or 0.10 percent to 7,367.20. Australian markets ended slightly lower on Thursday. Among major miners, Rio Tinto and Mineral Resources are down around 1% each, while BHP Group was down more than 1%.\n      </p>\n                <p>\n        CURRENCY MARKET COMMENTARY\n      </p>\n                <p>\n        The rand weakened early on Thursday, with the market soured by continued scheduled power cuts locally and as global risk appetite faltered. Despite this, the rand managed to post a 0.38% gain versus the dollar as it traded around the R15.29 mark. Power utility Eskom said on Wednesday it would implement power cuts until Monday because of breakdowns at some of its generating units, the latest in a series of outages that have constrained economic growth in South Africa.\n      </p>\n                <p>\n        COMMODITIES MARKET COMMENTARY\n      </p>\n                <p>\n        Gold prices were steady this morning, and set for a weekly gain as a weaker dollar, concerns over stubborn inflation and tensions surrounding Ukraine lifted demand for the safe-haven bullion. Meanwhile, oil prices climbed earlier today, extending sharp gains in the previous session as frigid weather swept across large swathes of the United States, threatening to further disrupt oil supplies.\n      </p>\n                <div>\n                  <h4>\n          LOCAL COMPANIES\n        </h4>\n                </div>\n                <p>\n        Curro Holdings Limited (COH) -3.9%\n      </p>\n                <p>\n        Recurring headline earnings will increase by between 30.3% and 43.7% from R179 million in the previous financial year and headline earnings will increase by between 36.0% and 50.0% from R171 million in the previous financial year. The rights offer in September 2020 resulted in an additional 27% weighted average shares in issue during the financial year ended December 2021 compared to the previous financial year, which consequently reduce the respective earnings per share figures meaningfully. The company had 597 961 595 shares in issue throughout the 2021 financial year, compared to a weighted average of 470 998 749 shares for the previous comparable period. Curro recognised impairments of R207 million (net of tax) in the previous financial year, relating to lower-yielding school assets. These impairment charges were included in the calculation of EPS, but are added back for purposes of the calculation of HEPS, and accordingly accounted for the key difference between HEPS and EPS in the previous financial year. The Company is currently finalising its financial results for the year ended 31 December 2021. These results will be published on Wednesday, 23 February 2022.\n      </p>\n                <p>\n        DRDGold Limited (DRD) -1.1%\n      </p>\n                <p>\n        DRDGOLD is in the process of finalising its results for the six months ended 31 December 2021 and shareholders are accordingly advised that the Company has reasonable certainty that it will report earnings per share (\"EPS\") and headline earnings per share (\"HEPS\") of between 52.5 cents and 63.6 cents compared to EPS and HEPS of 111 cents for the six months ended 31 December 2020 (\"Previous Corresponding Period\"), being a decrease of between 43% and 53%, respectively. Revenue decreased by R478.9 million, or 16%, to R2,498.5 million (2020: R2,977.4 million). Ergo Mining Proprietary Limited's (\"Ergo\") revenue decreased by R464.1 million, or 20%, to R1,804.6 million (2020: R2,268.7 million), due mainly to a 13% decrease in the Rand gold price received as well as a 9% decrease in gold sold to 2,090Kg (2020: 2,296Kg). Far West Gold Recoveries Proprietary Limited's (\"FWGR\") revenue decreased by R14.9 million, or 2%, to R693.8 million (2020: R708.7 million) despite a 13% increase in gold sold to 801Kg (2020: 710Kg), due to a 13% decrease in the Rand gold price received. Cash operating costs increased by R161.4 million, or 11%, to R1,680.2 million (2020:R1,518.8 million). As at 31 December 2021, DRDGOLD's cash and cash equivalents was R2,239.1 million (30 June 2021: R2,180.0 million), with a revolving credit facility with ABSA Bank Limited of R200 million, available if needed. During the interim period ended 31 December 2021, DRDGOLD generated free cash flow (cash inflow from operating activities less cash outflow from investing activities) of R406.9 million (2020: R759.6 million) and paid cash dividends of R345.5 million (2020: R299.1 million). The Group remains free of any bank debt as at 31 December 2021 (30 June 2021: Rnil).\n      </p>\n                <div>\n                  <h4>\n          INTERNATIONAL COMPANIES\n        </h4>\n                </div>\n                <p>\n        Amazon.com Inc. (AMZN) -7.8%\n      </p>\n                <p>\n        Amazon on Thursday said revenue climbed 9% in the fourth quarter and the company reported a gain of almost $12 billion from its investment in electric vehicle company Rivian. Amazon guided for first quarter revenue of between $112 billion and $117 billion, below the average estimate of $120 billion, according to Refinitiv. Operating profit in the fourth quarter will be in the range of $3 billion to $6 billion. Fourth-quarter sales grew 9.4% to $137.4 billion. That's Amazon's first period of single-digit growth since 2017. Amazon disclosed revenue from its fast-growing advertising business for the first time. Advertising services grew 32% year over year to $9.7 billion during the quarter. Previously, Amazon included advertising revenue in its \"other\" business segment. Amazon's big profit gain on Rivian is the result of the electric vehicle maker's IPO in November. Earnings per share, including the Rivian gain, was $27.75 for the quarter.\n      </p>\n                <p>\n        Ford Motor Company (F) -3.6%\n      </p>\n                <p>\n        Ford Motor's shares slid after it reported fourth-quarter earnings Thursday that significantly missed Wall Street's earnings expectations and slightly missed on revenue. For the quarter, Ford's North American operations, as they have been, contributed the most to the automaker's earnings, up by 68% to $1.8 billion compared to a year earlier. International losses included $150 million in China, down 130%, and $159 million, a 139% decline, in Europe. The automaker's fourth-quarter net income swung to a $12.3 billion profit from a $2.8 billion loss during the last three months of 2020. That included an $8.2 billion gain on its investment in electric vehicle start-up Rivian Automotive. After backing out that and other items, like taxes, Ford's adjusted earnings came to $2.0 billion for the fourth quarter.\n      </p>\n                <p>\n                  <a href=\"https://contenthub.sasfin.com/media/yl0pfpgh/taking-stock-04-february-2022.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download full report here</a>\n                </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://contenthub.sasfin.com/market-commentary/articles/taking-stcok-04-february-2022-amazon-shares-soar-on-cloud-revenue/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Sasfin Holdings Limited</strong> published this content on <strong>04 February 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>04 February 2022 08:37:29 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Sasfin Holdings Limited</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Sasfin-Holdings-Limited</p></div>"}