{"date": "2021-10-11 06:13:39+00:00", "ticker": "AVV", "mrkt_info": {"open": 3456.0, "close": 3611.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\">\n<li><span>Participating with strategic partner, Schneider Electric, AVEVA will demonstrate its Unified Operations Center for Smart Cities at the Middle East’s biggest technology exhibition</span><strong> </strong></li>\n</ul>\n<p>Dubai, United Arab Emirates – AVEVA, a global leader in industrial software, driving digital transformation and sustainability, today announced that it is participating in GITEX Technology Week 2021 to be held from 17–21 October. Together with its strategic partner, Schneider Electric, AVEVA will demonstrate its AVEVA™ Unified Operations Center for Smart Cities, which seamlessly integrates systems, sites, people and assets for cities of the future, at the Middle East’s largest technology exhibition.</p>\n<p>With increasing urbanization, mounting cost pressures, and demand for improved quality of life, there is now a global move towards infrastructure consolidation, upgrade, and continuous improvement of cities. AVEVA’s Unified Operations Center for Smart Cities drives streamlined operational efficiency and reduced energy costs, while promoting adherence to cybersecurity, safety, and regulatory compliance.</p>\n<p>“Our Unified Operations Center is the command-and-control solution for infrastructure and smart city operators based on an integrative ‘System of Systems’ approach. It can be used to collate information from various data sources to anticipate and resolve problems even before they are presented, coordinate various resources and processes for seamless operation, and generally make more strategic decisions. It converges OT and IT technology into a single pane-of-glass solution, where the operator can effectively monitor and control entire city operations through a ‘City in a Box’ approach as we like to call it,” says Dr Tariq Aslam, Head of MEA, AVEVA.</p>\n<p>AVEVA’s Unified Operations Center for Smart Cities and Schneider Electric’s IoT-enabled sustainability platform – EcoStruxure Resource Advisor offer smart city operators a powerful solution. The EcoStruxure Resource Advisor is a best-in-class, AI-assisted, cloud-based solution for managing cross-enterprise energy and sustainability data, which shows how operators can track data across more than 400 categories to have near real-time access to their resource performance.</p>\n<p>EcoStruxure is powered by Microsoft Azure enabling integration and interoperability to turn data into meaningful insights. The data is paired with Schneider’s unique approach to energy and sustainability consulting, bringing together technology and expertise, resulting in a “mind-plus-machine” approach to climate action.</p>\n<p>“AVEVA, Schneider Electric and Microsoft are accelerating the delivery of smart city innovation across regions. Our unique combination of capabilities helps municipalities capitalize on the power of technology to become more agile, resilient, and sustainable. We plan to demonstrate smart cities in action on our Unified Operations Center with our strategic partners, Schneider Electric and Microsoft on their stands,” Dr Aslam adds.</p>\n<p>“We will be showcasing the AVEVA Unified Operations Center for Smart Cities, to demonstrate how technologies such as AI and big data can transform how an urban environment is run to make it more efficient, greener, and better for the public and businesses,” says Ayman Ismail, Industry and Business Development VP, Schneider Electric Gulf Countries. “Digitization and digital technologies will make our cities more efficient and more sustainable, and we must prioritize technology developments as we look to create places to live that improve the quality of life for residents and visitors alike.”</p>\n<p>It is estimated that by 2030, the world will have 43 megacities, each with more than 10 million inhabitants. Converting existing infrastructure to smart infrastructure is the key to improving cities. With unified data and analytics, smart city operators are empowered with better information, which means they can make more informed decision to optimize operations for the new environment in which they are operating.</p>\n<p>AVEVA’s vast portfolio of smart city software solutions span facilities management, utilities, transportation, and data centers. Taking an integrated approach, AVEVA’s solutions enable disparate functions to collect, analyze, and then act on unified and holistic intelligence – supported by the help of real-time data – to enable civic leaders to make better decisions and improve living standards.</p>\n<p>Due to the scalability of the solution, Unified Operations Center is ideally suited for not just megacities but also smaller municipalities looking to take an integrated system of systems approach to monitoring and controlling their city operations. AVEVA works with megacities such as London, as well as smaller municipalities with populations of 50,000 or fewer, that are looking to leverage technology to improve sustainability and resilience.</p>\n<p>AVEVA will be holding demos of its Unified Operations Center solution on Schneider Electric’s stand H5-B40. Senior representatives from the company will be at GITEX Technology Week 2021 to meet with customers and partners and share their global success stories with them.</p>\n<p>-Ends-</p>\n<p><strong>About AVEVA</strong></p>\n<p><span>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at www.aveva.com.</span></p>\n<p><span>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}