{"date": "2022-01-12 16:11:22.499000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON CANADA (\"AMZN-Q\")\n- Prime Video Reveals the All-Star Lineup for Canadian Amazon\n- Original LOL: Last One Laughing Canada\n\n     Prime Video announced the premiere date for the Amazon Original series\nLOL: Last One Laughing Canada, along with the key art that reveals a\nstar-studded cast of Canadian comedic talent: Caroline Rhea, Debra\nDiGiovanni, Dave Foley, Jon Lajoie, Tom Green, Mae Martin, Colin Mochrie,\nBrandon Ash-Mohammed, Andrew Phung, and K. Trevor Wilson. The first two\nepisodes of the series will launch on Friday, February 18. Episodes Three\nand Four will release on the following Friday, February 25, and the Fifth\nand Sixth Episodes will launch on Friday, March 4. The series joins\nupcoming Canadian Amazon Original comedies previously announced, The Kids\nin the Hall?and?The Lake. LOL: Last One Laughing Canada will be available\nexclusively on Prime Video in 240 countries and territories worldwide.\n\n     The six-part competition series pits 10 of the best comedic talents\nfrom Canada against each other in a celebrity showdown, where anything can\nhappen. As the clock counts down in six half-hour wacky competition, their\nobjective is to eliminate others from the house by making each other laugh,\nwhile not laughing themselves. The comedian who doesn't break a smile and\noutlasts their competitors wins the grand prize of $100,000 for their\ncharity of choice. The series uses over thirty cameras to catch all of the\nderanged hijinks during the unpredictable competition as the all-star cast\nbring their various styles to the table, including stand-up, musical\nperformance, improvisational, and physical comedy, among others.\n\n     \"Our first local Amazon Original followed Canada's passion for hockey.\nWe are excited to follow up that success with another area of Canadian\nexcellence--comedy,\" said Christina Wayne, head of Canadian Originals at\nAmazon Studios. \"Our commitment to Canadian audiences continues with an LOL\nthat features a star-studded cast and unforgettable moments.\"\n\n     LOL: Last One Laughing Canada?is the latest adaptation of the\nsuccessful Amazon Original series in Japan entitled \"Documental,\" created\nby and starring Hitoshi Matsumoto and owned by Yoshimoto Kogyo, where\nMatsumoto leads 10 comedians betting their own money in an anything goes\n\"battle of laughter behind closed doors.\" The fan-favourite format became\nthe most watched title of all time on Prime Video in Italy and Germany, and\nhad successful local versions in Mexico, Australia, India, France, and\nSpain.?\n\n     LOL: Last One Laughing Canada?comes from Amazon Studios, produced in\nassociation with Insight Productions (a Boat Rocker company). Executive\nProducers are John Brunton, Erin Brock, and Shannon Farr. As part of Prime\nVideo's continued investment in Canada,?LOL: Last One Laughing Canada?is\nthe?third announced Canadian Amazon Original series, following?The Kids in\nthe Hall?and?All or Nothing: Toronto Maple Leafs.?Since 2015, Amazon\nStudios has filmed?24?Amazon Original series and films in?Canada,\nincluding?The Man in the?High Castle?and?Upload?in?Vancouver,?The\nBoys?and?The Expanse?in?Toronto,?Tales from the Loop?in?Winnipeg, as well\nas parts of?Tom Clancy's?Jack Ryan?and?The Voyeurs?in?Montreal.?\n\n     LOL: Last One Laughing Canada?will join the thousands of TV shows and\nmovies from Hollywood and worldwide in the Prime Video catalog,\nincluding?award-winning and critically acclaimed Amazon Originals like The\nWheel of Time,?Harlem, Tampa Baes,?The Boys,?Tom Clancy's Jack Ryan,?and\nEmmy- and Golden Globe-winners?Fleabag?and?The Marvelous Mrs. Maisel.\n\n     About Prime Video\n\n     Prime Video is a premium streaming service that offers customers a\nvast collection of movies and television series--all with the ease of\nfinding what they love to watch in one place.?Find out more\nat?primevideo.com.\n\n//st\n\n  * Included with Prime Video:?Watch movies, TV series, news, award-winning\nAmazon Originals, and other exclusives.\n  * Enjoy hits like Coming 2 America, Borat Subsequent Moviefilm, Justin\nBieber: Our World, and?The Boys, plus Emmy Award-winning\ncomedies?Fleabag?and The Marvelous. Mrs. Maisel.?\n  * Prime Video Channels: Prime members can add channels like Hayu, Starz\nand STACKTV, an all-in entertainment multipack offering the latest episodes\nof hit shows from 13 great networks. No extra apps to download, and no\ncable required. Most subscriptions start with a free trial, and you can\ncancel anytime. View the full list of channels available\nat?primevideo.com/channels.\n  * Rent or Buy: Enjoy even more movies from new releases to classic\nfavourites, available to rent or buy - no Prime membership required. View\ntitles available by visiting?primevideo.com/store.?\n  * Instant Access:?Watch at home or on the go with the Prime Video app on\nFire TV, Roku, Apple TV, Chromecast, Windows 10, Android and iOS,\ncompatible Smart TVs and set top boxes, select game consoles or online\nat?primevideo.com. In the Prime Video app on mobile and tablet, Prime\nmembers can download most videos and watch them anywhere offline at no\nadditional cost.?For a complete list of compatible devices,\nvisit?primevideo.com/help.\n  * Enhanced experiences: Make the most of every viewing with 4K Ultra HD-\nand High Dynamic Range (HDR)-compatible content. Go behind the scenes of\nyour favourite movies and TV shows with exclusive X-Ray access, powered by\nIMDb.\n\n//et\n\n     Prime Video is just one of many shopping and entertainment benefits\nincluded with a Prime membership for just CAD$ 79/year or CAD$ 7.99/month\n(plus applicable taxes), along with fast, free shipping on millions of\nPrime-eligible items at Amazon.ca, unlimited photo storage, gaming,\nexclusive deals and discounts, and access to ad-free music and Kindle\nebooks.?To sign up or start a 30-day free trial of Prime,\nvisit:?amazon.ca/prime.\n\n     About Insight Production Company, Ltd. Insight Productions (a Boat\nRocker company) is celebrated for its award-winning ratings juggernauts and\nis Canada's most established content producer.  Headed by John Brunton,\nInsight is an industry leader in the development and production of hit\ncontent, and renowned for its comedy programming and live events.\nInsight's showrunners include Erin Brock, Lindsay Cox, Mark Lysakowski, and\nEric Abboud.  Brock serves as the showrunner on Big Brother Canada, the\nhighest rated Canadian series of 2020.  Insight also produces The Amazing\nRace Canada, the most watched Canadian show on record, and The Tragically\nHip: A National Celebration, a live concert special watched by one in three\nCanadians.  Memorable comedy shows include The Jon Dore Television Show; A\nRussell Peters Christmas; and But I'm Chris Jericho!  Insight Productions\nwas founded in 1979 and has since created thousands of hours of\ngroundbreaking content.\n\n Contact Information:\n\nFor further information: Publicity Contact: Amazon: Owen Mccorquodale,\n[email protected]\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201100374.MNPRE2201101775-07510720220112</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}