{"date": "2022-02-17 14:41:40.414000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3130.21, "close": 3093.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z;NEXCF-0\")\n- Launches 3D SaaS Solutions ARitize Swirl for Ecommerce and ARitize\n- Social Swirl for Social Media Ads\n\n    Nextech AR Solutions Corp. (\"Nextech\" or the \"Company\"), a Metaverse\nCompany and leading provider of augmented reality (\"AR\") experience\ntechnologies and services is excited to announce the launch of two new Saas\nsolutions, ARitize Swirl and ARitize Social Swirl. ARitize Swirl is a\nself-serve platform that allows for the creation and management of\nclickable 3D and AR banners for ecommerce websites and is supported by\nShopify, WooCommerce, BigCommerce and Magento. ARitize Social Swirl is a\nSaaS solution which creates social media ads using AR filters designed to\nwork with client's existing 3D models. This new offering paves the way for\nanother revenue stream tied to ecommerce advertising by offering a simple\nno code required integrated way for the company's 3D models to be used for\nimmersive ads on Instagram, Snap and Meta.\n\n    These two SaaS offerings complement Nextech's existing ARitize 3D\nstudio of products, where clients manage their 3D models for ecommerce, and\nthen take those same 3D models and put them in 3D banner ads, and run 3D AR\nsocial ads. As demand for 3D models continues to grow, Nextech is becoming\na one-stop shop for ecommerce site owners. With this launch the company\nfurther solidifies its position as the premier provider of 3D modeling\nsolutions for ecommerce and the metaverse.\n\n    ARitize Swirl\n\n    An ARitize Swirl is a swirling (rotating) 3D asset on the header or\npage of an ecommerce website. In a few simple steps, any customer can\ncreate a fully interactive ARitize Swirl 3D/AR banner using their existing\n3D models, and embed them into their ecommerce website to create 6X higher\npurchase intent, increase conversions and click-through rates. The ARitize\nSwirl self-serve creator tool is an upsell opportunity for existing ARitize\n3D clients, and allows for the creation and management of 3D and AR banners\nfor their ecommerce websites, highlighting the products that clients wish\nto promote. All of the client's ARitize 3D models are accessible through\nthis platform. Existing 3D models, generated through ARitize 3D, are made\navailable to be searched by title or SKU. Custom dimensions can be entered,\nor set dimensions can be selected from a list of presets. Unique\nbackgrounds can be uploaded by users, or premade template backgrounds can\nbe selected from an image library. ARitize Swirls can be previewed and\nreviewed before publishing, and embed codes are automatically generated\nonce an ARitize Swirl is published, and can be copied and pasted onto the\nuser's ecommerce site. ??Banners can also be managed, edited, and archived\non the self-serve platform, giving users ultimately flexibility when it\ncomes to their Swirls.\n\n    View a video showcasing ARitize Swirl - click here\n\n    ARitize Swirl Examples\n\n    Furniture: Stool - click here\n\n    Accessories: Purse - click here\n\n    Equipment: Snowboard - click here\n\n    Furniture: Chair - click here\n\n    Footwear: Running Shoe - click here\n\n    ARitize Swirl includes:\n\n//st\n\n  * 3D and AR Website Banners\n  * Immersive and Interactive\n  * No 3D or AR experience required\n  * On-demand creation\n  * ecommerce Owners and Websites\n  * 360 Degree Product Visualization\n  * Boost Customer Experience\n  * Watch Customer Engagement Soar\n  * Purchase Intent increases if you're interacting with a 3D product\n\n//et\n\n    ARitize Social Swirl\n\n    ARitize Social Swirl is a social media AR filter designed to promote\nand visualize ecommerce products in an interactive and shareable way.\nAvailable for Instagram, Meta, and Snapchat, ARitize Social Swirls are\ndesigned to create new engagement opportunities for customers. ARitize\nSocial Swirls is a managed service where Nextech creates ads for clients\nwith their existing 3D models, or from Nextech's existing list of AR\ntemplates, to be advertised on the client's Instagram, Facebook and\nSnapchat. Nextech also creates custom filters to match client's branding.\nWhen users click on the ad, they have the ability to see the product in 3D\nin their space, giving the user the ability to experience and interact with\nthe product, before sending them to the client's website to purchase the\nproduct.\n\n    View an ARitize Social Swirl example - click here\n\n    Nextech AR CEO Evan Gappelberg commented, \"We are very excited to\nlaunch ARitize Swirl and ARitize Social Swirl. These two new 3D/AR\nsolutions are part of our bigger mission which is to be the first\nvertically integrated AI powered 3D model factory for the metaverse\". He\ncontinues \"The ability for our clients to create banners and social media\nads using their existing 3D models means that our clients don't need to\nhire outside agencies, 3D modelling companies or other tech providers in\norder to integrate their 3D models across their various platforms. Using\nour technology, we provide our clients with the one-stop solution to do it\nthemselves. Today's news is just another building block that adds to our\nrevenue potential with a highly profitable SaaS offering, which is great\nfor our growing business\".\n\n    An update to previously announced appointments, Chris Burton, Head of\nGlobal Sales, and Bradley Gittings, VP Investor Relations have both\ndeparted the company to pursue other opportunities. We wish them the best\nin their next pursuits.\n\n    To learn more, please follow us on Twitter, YouTube, Instagram,\nLinkedIn, and Facebook, or visit our website: <a href=\"https://www.Nextechar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.Nextechar.com</a>.\n\n    On behalf of the Board of Nextech AR Solutions Corp.\n\n    Evan GappelbergCEO and Directorinfo@nextechar.com 866-274-8493\n\n    About Nextech AR\n\n    Nextech AR Solutions is a Metaverse company that develops and operates\naugmented reality (\"AR\") platforms, transporting three-dimensional (\"3D\")\nproduct visualizations, human holograms and 360 portals to its audiences\naltering e-commerce, digital advertising, hybrid virtual events (events\nheld in a digital format blended with in-person attendance) and learning\nand training experiences.\n\n    Nextech focuses on developing AR solutions for the Metaverse, however\nmost of the Company's revenues are derived from three e-Commerce platforms:\nvacuumcleanermarket.com (\"VCM\"), infinitepetlife.com (\"IPL\") and\nTrulyfesupplements.com (\"TruLyfe\"). VCM and product sales of residential\nvacuums, supplies and parts, and small home appliances sold on Amazon.\n\n    Forward-looking Statements\n\n    The CSE and the NEO have not reviewed and do not accept responsibility\nfor the adequacy or accuracy of this release.\n\n    Certain information contained herein may constitute \"forward-looking\ninformation\" under Canadian securities legislation. Generally,\nforward-looking information can be identified by the use of forward-looking\nterminology such as, \"will be\" or variations of such words and phrases or\nstatements that certain actions, events or results \"will\" occur.\nForward-looking statements regarding the completion of the transaction are\nsubject to known and unknown risks, uncertainties and other factors. There\ncan be no assurance that such statements will prove to be accurate, as\nfuture events could differ materially from those anticipated in such\nstatements. Accordingly, readers should not place undue reliance on\nforward-looking statements and forward-looking information. Nextech will\nnot update any forward-looking statements or forward-looking information\nthat are incorporated by reference herein, except as required by applicable\nsecurities laws.\n\n     Contact Information:\n\n     Investor Relations Contact\n     Lindsay Betts\n     investor.relations@Nextechar.com\n     866-ARITIZE (274-8493) Ext 7201\n\n                            ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204700275.MNPRE2204701484-06162720220217</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}