{"date": "2021-11-07 09:22:41.490000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 255.7, "close": 257.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>British investment manager Abrdn has acquired London-headquartered investing insights platform Finimize, further accelerating its ongoing digitalisation efforts led by CEO Stephen Bird.</p><p>Financial terms of the deal were not disclosed.Finimize, which has over one million subscribers, offers insights and advises in order to help investors make informed decisions.Following the deal, the platform will now gain access to abrdn global network of partners, its research team and its operational infrastructure.Finimize CEO Max Rofagha said: \"Fintechs have reduced barriers to entry for retail investors, but there's a huge demand for accessible high-quality investing information.\"We believe our platform needs to be bite-size, mobile and social to fit modern investors' busy lives. We envisage Finimize will become the most convenient way for people to learn, research and discuss investing.\"Abrdn will tap Finimize's content delivery technology, editorial and content skills and insights to cater to its investor community.Bird said: \"The acquisition of Finimize by abrdn further supports our strategic ambition to deliver client-led growth through enabling our clients to be better investors. Finimize's vision to empower smarter investors is a perfect fit for the group\".Under the terms of the deal, Finimize will remain as an independent brand and insights platform while Rofagha will join abrdn's leadership team.The latest acquisition follows Abrdn's takeover of AI-driven wealth management platform Exo Investing in this August.The firm, formerly Standard Life Aberdeen, is said to be looking to expand its digital capabilities to serve its personal and institutional clients.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}