{"date": "2022-01-20 17:51:18.541000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3125.98, "close": 2852.86}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-abstract\"><p>US e-commerce giant Amazon has written to the independent directors of Future Retail (FRL), including Gagan Singh, Ravindra Dhariwal, and Jacob Mathew, reiterating its willingness and ability to assist FRL in addressing any financial concerns, within the framework of the agreements. This includes the solution proposed in the term sheet between Samara Capital,</p></div><div class=\"tr-npp-lead\"><p>and FRL, which contemplated an infusion of ~7,000 crore in FRL.</p><p>The letter has also been sent to the top executives at Union Bank of India, Bank of India, State Bank of India, Bank of Baroda, Central Bank of India, Punjab National Bank, UCO Bank, and Indian Bank.</p></div><div class=\"tr-npp-body\"><p>\u0093We write further to our earlier letters, including ones dated December 2, 2020, April 23, 2021, and December 15, 2021, addressed to the independent directors of FRL,\u0094 said Amazon's letter to FRL's independent directors, dated January 19, which Business Standard has reviewed.</p><p>According to sources, as early as June 2020, Amazon-backed private equity firm Samara Capital had signed a non-binding term sheet with FRL that entailed a ~7,000 crore investment. This was two months prior to Kishore Biyani-led Future Group announcing its ~24,713 crore (or $3.4 billion) merger deal with RIL at the end of August 2020.</p><p>\u0093Without prejudice, Amazon reiterates that FRL is bound by valid and subsisting injunctions issued by the arbitral tribunal, and enforced by Indian courts. Amongst others, FRL is prohibited from \u0093directly or indirectly taking any steps to transfer, dispose, alienate or encumber FRL\u0092s retail assets without Amazon\u0092s consent\u0094, read Amazon\u0092s letter.</p><p>Amazon has said in the letter that it has also become aware, from certain media sources, that FRL is proposing to sell its small-format stores, comprising Easyday and Heritage Fresh brands.</p><p>\u0093Any sale of small-format stores without obtaining the consent of Amazon would be in violation of the injunctions, which continue to operate and are binding on FRL and the directors of FRL, including its independent directors,\u0094 said the letter.</p><p>Amazon said it has consistently emphasised its willingness to assist FRL before the arbitral tribunal and Indian courts. Amazon, through its counsel, reiterated its commitment to finding solutions for FRL before the Supreme Court (SC), as recently as January 11, 2021.</p><p>It has nominated Abhijeet Muzumdar (head of Amazon Smbhav Venture Fund and corporate development) to lead any and all such engagements with interested stakeholders and decision-makers in FRL, including independent directors, to find a commercial solution for FRL.</p><p>\u0093We are more than willing to explore effective solutions to assist FRL,\u0094 said the letter.</p><p>A query to Future Group and Amazon remained unanswered till the time of going to press.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}