{"date": "2021-11-04 09:26:17.411000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Oct 29, 2021</p></div><div class=\"tr-npp-lead\"><p>After the closing bell on Thursday, Amazon <a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> posted dismal results for Q3. The e-commerce giant missed revenue and earnings estimates, and offered weak fourth-quarter guidance. This reflects a deceleration in growth after the pandemic stoked a surge in online shopping last year and earlier in 2021.Earnings per share came in at $6.12, widely lagging the Zacks Consensus Estimate of $9.10 and deteriorating from the year-ago earnings of $12.37. Revenues grew 15% year over year to $110.8 billion but fell short of the consensus estimate of $111.8 billion. This marks the slowest growth in more than six years.Amazon's cloud computing business — Amazon Web Services — continued to shine with revenues surging 39% year over year to $16.1 billion. Amazon is fighting through a tough part of the year ahead of the holiday shopping season given labor supply shortages, increased wage costs, global supply chain issues, and increased freight and shipping costs. As such, it expects to incur several additional billions of dollars in costs in Q4 (read: <a href=\"https://www.zacks.com/stock/news/1817531/etfs-to-tap-as-cloud-powers-microsoft-fiscal-q1-earnings\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ETFs to Tap As Cloud Powers Microsoft Fiscal Q1 Earnings</a> ).The e-commerce giant offered a downbeat revenue guidance of $130-$140 billion for the fourth quarter, suggesting 4-12% year-over-year growth. The high end of the range is well below the current Zacks Consensus Estimate of $141.91 billion, which indicates 13% growth.</p><p>Following the disappointing results, AMZN shares dropped as much as 5% in aftermarket hours on elevated volume. The stock currently has a Zacks Rank #4 (Sell) and Growth Score of A (see: <a href=\"https://www.zacks.com/funds/etfs/etf-categories/Consumer-Discretionary-ETFs-9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">all the Consumer Discretionary ETFs here</a> ).Given this, ETFs with the highest allocation to this Internet giant will be in focus in the days ahead. Below we have highlighted five of them:<span>ProShares Online Retail ETF <a href=\"https://www.zacks.com/stock/quote/ONLN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ONLN</a> </span>This is the first ETF focused exclusively on retailers that principally sell online or through other non-store channels. It follows the ProShares Online Retail Index, holding 40 stocks in its basket. Amazon is the top firm accounting for 25.2% of the portfolio. The product has amassed $880.7 million in its asset base and currently trades in a moderate volume of around 50,000 shares a day, on average. It charges 58 bps in annual fees from investors (read: <a href=\"https://www.zacks.com/stock/news/1812749/4-sector-etfs-stocks-to-win-on-upbeat-september-retail-sales?art_rec=etfs-overview-zacks_news-ID01-txt-1812749\" data-type=\"url\" class=\"tr-link\" translate=\"no\">4 Sector ETFs &amp; Stocks to Win on Upbeat September Retail Sales</a> ).<span>Fidelity MSCI Consumer Discretionary Index ETF <a href=\"https://www.zacks.com/stock/quote/FDIS\" data-type=\"url\" class=\"tr-link\" translate=\"no\">FDIS</a> </span>This fund tracks the MSCI USA IMI Consumer Discretionary Index, holding 298 stocks in its basket. Of these, AMZN takes the top spot with 22.9% share. Internet &amp; direct marketing retail makes up for the top sector with 26.5% share followed by specialty retail (19.8%), and hotels, restaurants &amp; leisure (17.6%). The product has amassed $1.7 billion in its asset base while trading in a good volume of around 91,000 shares a day on average. It charges 8 bps in annual fees from investors and has a Zacks ETF Rank #2 (Buy) with a Medium risk outlook.<span>Consumer Discretionary Select Sector SPDR Fund <a href=\"https://www.zacks.com/stock/quote/XLY\" data-type=\"url\" class=\"tr-link\" translate=\"no\">XLY</a> </span>This product offers exposure to the broad consumer discretionary space by tracking the Consumer Discretionary Select Sector Index. It is the largest and most-popular product in this space, with AUM of nearly $22 billion and an average daily volume of around 4.8 million shares. Holding 63 securities in its basket, Amazon takes the top spot with 20.7% of assets. Internet &amp; direct marketing retail dominates about 22.6% of the portfolio, while automobiles, specialty retail, and hotels restaurants, and leisure round off the next two spots with a double-digit allocation each. The fund charges 0.12% in expense ratio and has a Zacks ETF Rank #2 with a Medium risk outlook.<span>Vanguard Consumer Discretionary ETF <a href=\"https://www.zacks.com/stock/quote/VCR\" data-type=\"url\" class=\"tr-link\" translate=\"no\">VCR</a> </span>This fund currently follows the MSCI US Investable Market Consumer Discretionary 25/50 Index and holds 297 stocks in its basket. Of these, Amazon occupies the top position with 22.9% allocation. Internet &amp; direct marketing retail takes the largest share at 26.7% while automobile manufacturers, restaurants and home improvement retail and round off the next two spots. VCR charges investors 10 bps in annual fees, while volume is moderate at nearly 67,000 shares a day. The product has managed about $7 billion in its asset base and carries a Zacks ETF Rank #1 (Strong Buy) with a Medium risk outlook (read: <a href=\"https://www.zacks.com/stock/news/1812672/5-consumer-discretionary-etfs-rising-to-new-highs?art_rec=etfs-overview-zacks_news-ID01-txt-1812672\" data-type=\"url\" class=\"tr-link\" translate=\"no\">5 Consumer Discretionary ETFs Rising to New Highs</a> ).<span>VanEck Vectors Retail ETF <a href=\"https://www.zacks.com/stock/quote/RTH\" data-type=\"url\" class=\"tr-link\" translate=\"no\">RTH</a> </span>This fund provides exposure to the 25 largest retail firms by tracking the MVIS US Listed Retail 25 Index. Of these, AMZN takes the top position in the basket with 19.4% share. The product has amassed $218.4 million in its asset base and charges 35 bps in annual fees. Volume is light as it exchanges nearly 27,000 shares per day. RTH has a Zacks ETF Rank #2 (Buy) with a Medium risk outlook.</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Market Impact</p><p><span>Want key ETF info delivered straight to your inbox?</span></p><p>Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.</p><p><a href=\"https://www.zacks.com/registration/newsletter/?type=FND&amp;adid=NEWSTEX_CONTENT_ZU_FUNDSNEWSLETTERMONEYSENSEEDCETF_ETFNEWSANDCOMMENTARY_IND_10292021&amp;cid=CS-NEWSTEX-FT-etf_news_and_commentary-1819961\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get it free &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ETFNEWSANDCOMMENTARY&amp;cid=CS-NEWSTEX-FT-etf_news_and_commentary-1819961\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ETFNEWSANDCOMMENTARY&amp;cid=CS-NEWSTEX-FT-etf_news_and_commentary-1819961\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=ETF225&amp;adid=NEWSTEX_CONTENT_ETF_ARTCAT_ETFNEWSANDCOMMENTARY&amp;d_alert=rd_final_rank&amp;t=RTH&amp;split=1&amp;cid=CS-NEWSTEX-FT-etf_news_and_commentary-1819961\" data-type=\"url\" class=\"tr-link\" translate=\"no\">VanEck Retail ETF (RTH): ETF Research Reports</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=ETF225&amp;adid=NEWSTEX_CONTENT_ETF_ARTCAT_ETFNEWSANDCOMMENTARY&amp;d_alert=rd_final_rank&amp;t=XLY&amp;split=1&amp;cid=CS-NEWSTEX-FT-etf_news_and_commentary-1819961\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Consumer Discretionary Select Sector SPDR ETF (XLY): ETF Research Reports</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=ETF225&amp;adid=NEWSTEX_CONTENT_ETF_ARTCAT_ETFNEWSANDCOMMENTARY&amp;d_alert=rd_final_rank&amp;t=VCR&amp;split=1&amp;cid=CS-NEWSTEX-FT-etf_news_and_commentary-1819961\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Vanguard Consumer Discretionary ETF (VCR): ETF Research Reports</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=ETF225&amp;adid=NEWSTEX_CONTENT_ETF_ARTCAT_ETFNEWSANDCOMMENTARY&amp;d_alert=rd_final_rank&amp;t=FDIS&amp;split=1&amp;cid=CS-NEWSTEX-FT-etf_news_and_commentary-1819961\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Fidelity MSCI Consumer Discretionary Index ETF (FDIS): ETF Research Reports</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=ETF225&amp;adid=NEWSTEX_CONTENT_ETF_ARTCAT_ETFNEWSANDCOMMENTARY&amp;d_alert=rd_final_rank&amp;t=ONLN&amp;split=1&amp;cid=CS-NEWSTEX-FT-etf_news_and_commentary-1819961\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ProShares Online Retail ETF (ONLN): ETF Research Reports</a></p><p> </p><p><a href=\"http://www.zacks.com/stock/news/1819961/etfs-in-focus-post-dismal-amazon-q3-results?cid=CS-NEWSTEX-FT-etf_news_and_commentary-1819961\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}