{"date": "2022-02-03 09:18:18+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3023.87, "close": 2776.91}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Recasts and writes through</p><p class=\"tr-by\">By Aditya Kalra and Abhirup Roy</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Feb 3 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Lenders to Future Retail <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FRTL.NS\" data-type=\"ric\" data-ric=\"FRTL.NS\" translate=\"no\" dir=\"ltr\">FRTL.NS</a>, the company being fought over by Reliance Industries <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a> and Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, have told India's Supreme Court that its assets should be put up for auction after it missed payments.</p><p>They also said they have started classifying loans to the country's second-largest retailer as non-performing and would have to make combined provisions of 80 billion-90 billion rupees ($1.1 billion-$1.2 billion) due to the non-payment.</p><p>\"Let it be subjected to an open bid...This is the only solution,\" Rakesh Dwivedi, a lawyer acting for 30 or so of Future's lenders, told the Supreme Court judges, citing the prolonged litigation so far between Future and Amazon. </p><p>Dwivedi added that Future's two suitors - Amazon and Reliance - could then bid for the retailer's assets.</p><p>The court did not hand down any decisions on Thursday and said it will hear the matter again in due course. Future declined to comment.</p><p>Future failed to complete a planned $3.4 billion sale of its retail assets to Reliance after business partner Amazon successfully argued in arbitration and in court that the Indian retail giant violated certain non-compete contractual terms.</p><p>Future has denied any wrongdoing.</p><p>Amazon is keen to own a part of Future whenever Indian investment regulations permit but has said its plans will be soured if Future is allowed to sell its assets.</p><p>Future has said it was unable to pay 35 billion rupees ($470 million) it owed to lenders on Dec. 31 as it could not sell certain small stores due to the row with Amazon. It had hoped to use a 30-day grace period to resolve the situation, but was not able to do so.</p><p>Last month, Future filed legal action against its lenders to stop them from initiating insolvency proceedings,  hoping to acquire more time to make its payments and avoid having its loans designated as non-performing which gives the banks more control over its finances.</p><p>Future, which has seen its businesses hit hard by the pandemic, has 1,700 outlets including some 900 small-sized stores, with the rest being large-format hypermarkets and fashion outlets. </p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Aditya Kalra and Abhirup Roy; Editing by Edwina Gibbs)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:abhirup.roy@thomsonreuters.com\" data-type=\"email\" translate=\"no\">abhirup.roy@thomsonreuters.com</a> ; + 91 22 6180 7067; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://abhirup.roy.thomsonreuters.com@reuters.net\">abhirup.roy.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-INDIA/FUTURE-RELIANCE (UPDATE 2, PIX)</p></div>"}