{"date": "2021-11-04 18:28:45+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds NASA statement, Bezos tweet</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 4 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A federal judge on Thursday rejected a lawsuit by Jeff Bezos' space company Blue Origin against the U.S. government over NASA's decision to award a $2.9 billion lunar lander contract to rival billionaire Elon Musk's SpaceX.</p><p>Judge Richard Hertling of the U.S. Court of Federal Claims in Washington granted the government's motion to dismiss the suit <a href=\"https://www.reuters.com/business/aerospace-defense/blue-origin-sues-us-government-over-spacex-lunar-lander-contract-2021-08-16\" data-type=\"url\" class=\"tr-link\" translate=\"no\">filed on Aug. 16</a>. The judge's opinion explaining his reasoning was sealed, as were many other documents in the case, pending a meeting this month on proposed redactions.</p><p>Blue Origin, created by Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> founder Bezos, expressed disappointment. \"Not the decision we wanted, but we respect the court’s judgment, and wish full success for NASA and SpaceX on the contract,\" Bezos wrote on Twitter.</p><p>NASA said on Thursday \"it will resume work with SpaceX\" on the lunar lander contract \"as soon as possible.\" The space agency added it \"continues working with multiple American companies to bolster competition and commercial readiness for crewed transportation to the lunar surface.\"</p><p>NASA <a href=\"https://www.reuters.com/article/ctech-us-blue-origin-nasa-spacex-idCAKBN2FK26Z-OCATC\" data-type=\"url\" class=\"tr-link\" translate=\"no\">halted work</a> on the lunar lander contract through Nov. 1, part of an agreement among the parties to expedite the litigation schedule, which culminated in Thursday's ruling.</p><p>The U.S. Government Accountability Office (GAO) in July sided with the NASA over its decision to pick a single lunar lander provider, rejecting Blue Origin's protest.</p><p>SpaceX, headed by Tesla Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a> Chief Executive Musk, joined the proceedings as an intervener shortly after the lawsuit was filed.</p><p>NASA had sought proposals for a spacecraft that would carry astronauts to the lunar surface under its Artemis program to return humans to the moon for the first time since 1972.</p><p>NASA said on Thursday \"there will be forthcoming opportunities for companies to partner with NASA in establishing a long-term human presence at the Moon under the agency’s Artemis program, including a call in 2022 to U.S. industry for recurring crewed lunar landing services.\"</p><p>SpaceX did not immediately comment.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Peter Szekely in New York and David Shepardson in Washington; Editing by Will Dunham and Jonathan Oatis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Peter.Szekely@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Peter.Szekely@thomsonreuters.com</a> ; (646) 223-5302; Reuters Messaging: @peszeke))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: BLUE ORIGIN-NASA/SPACEX (UPDATE 1, PIX)</p></div>"}