{"date": "2021-11-16 09:30:45+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Aditya Kalra</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Nov 16 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>An Indian court ruled on Tuesday that the country's antitrust body has two weeks to decide whether Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> misled authorities while seeking approval for a 2019 deal with India's Future Group, a group of Indian retailers said.</p><p>The Confederation of All India Traders (CAIT) said in a statement it had filed the case to the Delhi High Court on Monday and the ruling was made on Tuesday. </p><p>Amazon and Future, India's second-largest retailer, have been <a href=\"https://reut.rs/3BV0tJG\" data-type=\"url\" class=\"tr-link\" translate=\"no\">locked in a legal battle since last year</a>. The e-commerce giant successfully blocked Future's bid to sell its retail assets to rival Reliance <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a> for $3.4 billion, accusing its partner of breaching some pre-existing agreements.</p><p>Future, which denies any wrongdoing and fears liquidation if it fails to sell assets, <a href=\"https://reut.rs/30sX0FI\" data-type=\"url\" class=\"tr-link\" translate=\"no\">has been arguing</a> before the Competition Commission of India (CCI) that approval for the 2019 Amazon deal should be revoked as the U.S. firm had made misleading representations while seeking approval. Amazon has said it is confident of addressing such regulatory concerns.</p><p>On Tuesday, the CAIT said the antitrust body should not delay deciding on the matter, which has ramifications for the public interest and could hit their businesses if the Future-Reliance deal fails.</p><p>A two-judge panel said the CCI must decide on the dispute between Amazon and Future within two weeks, the retailer group said in its statement, adding that \"traders should not be made a scapegoat or suffer any financial loss.\"</p><p>The CCI and Amazon did not respond to a request for comment.</p><p>At the heart of the two companies' legal dispute is Amazon’s deal to invest $200 million in Future Coupons, a unit of Future Group, in 2019. </p><p>One person familiar with the case said on Tuesday it would be unprecedented for the CCI to outrightly revoke a deal even if there has been misrepresentations, but any decision could affect the ongoing dispute.</p><p>\"If there's no (2019) transaction, there's no dispute between Amazon, Future,\" said the source, who asked not to be identified because the person was not authorised to speak to the media.</p><p>In July, <a href=\"https://reut.rs/3HkZhmN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Reuters exclusively</a> reported that the CCI had reviewed a complaint from Future and then accused Amazon of concealing facts while seeking approval to invest in a Future Group unit in 2019, after the watchdog compared legal disclosures made by Amazon at several forums. </p><p>Amazon told Reuters at the time that it was confident of addressing the watchdog's concerns.</p><p><br/></p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Aditya Kalra and Abhirup Roy; Editing by Ana Nicolaci da Costa)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON-INDIA/FUTURE (PIX)</p></div>"}