{"date": "2022-02-23 14:15:59+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Adj EBIT margin at 11.8% in 2021 vs target of around 10%</li><li class=\"tr-summaryitem\">Margin in North America at record 16.3%</li><li class=\"tr-summaryitem\">Company ahead of schedule with synergies, CFO says</li><li class=\"tr-summaryitem\">Shares up 6.5%</li><li class=\"tr-summaryitem\">No plan to split ICE and EV businesses, CFO says</li></ul><p class=\"tr-advisory\">Recasts, adds company quotes, background</p><p class=\"tr-by\">By Giulio Piovaccari and Gilles Guillaume</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MILAN, Feb 23 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Stellantis <a href=\"reuters://REALTIME/Verb=FullQuote/ric=STLA.MI\" data-type=\"ric\" data-ric=\"STLA.MI\" translate=\"no\" dir=\"ltr\">STLA.MI</a> beat its profitability target in the first year following its creation from the merger of Fiat Chrysler and Peugeot maker PSA, boosting hopes the automaker can cope with rising raw material costs and a shortage of semiconductor chips.</p><p>Milan-listed shares in the world's No.4 carmaker were up 6.5% in Wednesday afternoon trading.</p><p>The company, whose brands include Jeep, Ram, Opel and Maserati, reported an adjusted operating profit margin of 11.8% in 2021, above its target of around 10%. That was thanks to strong progress on synergies from the merger, which generated around 3.2 billion euros ($3.6 billion) in net cash benefits.</p><p>In a conference call with analysts, Chief Executive Carlos Tavares said the results demonstrated that \"we are going to deliver on our commitments.\"</p><p>The figures come less than a week before Stellantis presents a strategic plan for the next few years, which should among other things address its struggling business in China.</p><p>Tavares said he expected Chinese authorities would approve Stellantis' plans to increase its stake in its Chinese joint venture with Guangzhou Automobile Group (GAC) <a href=\"reuters://REALTIME/Verb=FullQuote/ric=601238.SS\" data-type=\"ric\" data-ric=\"601238.SS\" translate=\"no\" dir=\"ltr\">601238.SS</a>.  </p><p>The carmaker also said it expected to post a double-digit margin again this year. The pro-forma figure for 2020 was 6.9%.</p><p>The outlook is \"very vague, but it leaves room\" for Stellantis to beat expectations, Banca Akros analyst Gabriele Gambarova wrote in a client note.</p><p>Finance chief Richard Palmer told reporters rising prices for raw materials, such as metals, would remain a problem for the industry this year, but the semiconductor shortage, which cost the group around 20% of planned production in 2021, peaked in the third quarter of last year.</p><p>\"We think this (Stellantis' 2022) guidance is sensible given the difficulty in assessing volume, price, or mix in FY22, and with other headwinds such as raw materials,\" Morgan Stanley analysts wrote in a client note.</p><p>Margins in North America, where Stellantis sells highly-profitable Jeep and Ram pickup truck models, climbed to a record 16.3% in 2021.</p><p>Rival General Motors' <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GM.N\" data-type=\"ric\" data-ric=\"GM.N\" translate=\"no\" dir=\"ltr\">GM.N</a> comparable margin for 2021 in North America was 10.2%.</p><p>   </p><p><div class=\"tr-resource-ref\" id=\"g904b33f4-4c47-42ac-b992-981f0fa98059\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/mkt/gdpzybrojvw/WEqgP-stellantis%20(1).png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9ta3QvZ2Rwenlicm9qdncvV0VxZ1Atc3RlbGxhbnRpcyUyMCgxKS5wbmc=&amp;storyId=urn:newsml:reuters.com:20220223:nL8N2UY1VR:1&amp;key=656a476bae2678361d6d0992289c0df496f44092c46afb33d62d55e213a467bcda95932704d8451bdbbb32e0e8f89dc88c4a43a7e008eff63f3d9acecbb2c51b\"/></div></div></div></p><p><br/></p><p>Palmer said cash synergies booked last year put the group ahead of schedule to reach 80% of its 5 billion euro cost saving runrate target by 2024.</p><p>He added Stellantis did not have a significant direct exposure to Russia, which faces fresh international economic sanctions over its actions in Ukraine.</p><p>\"We have flexibility in production,\" Palmer said. \"We are confident we can manage the Russia crisis.\" </p><p>Tavares has so far mapped out a 30 billion euro electrification strategy, and formed alliances with Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and iPhone assembler Foxconn <a href=\"reuters://REALTIME/Verb=FullQuote/ric=2317.TW\" data-type=\"ric\" data-ric=\"2317.TW\" translate=\"no\" dir=\"ltr\">2317.TW</a> to accelerate development of software and semiconductors for future connected vehicles.</p><p>He has also drawn up plans for five battery plants and cut deals with unions to keep streamlining European operations - side-stepping potential labour conflicts and boosting margins. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2SK3IL\" data-type=\"storyId\" data-story-id=\"nL8N2SK3IL\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Palmer said the group had no current plans to create separate entities for electric and combustion engine cars, as is being considered by rivals Renault <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RENA.PA\" data-type=\"ric\" data-ric=\"RENA.PA\" translate=\"no\" dir=\"ltr\">RENA.PA</a> and Ford <a href=\"reuters://REALTIME/Verb=FullQuote/ric=F.N\" data-type=\"ric\" data-ric=\"F.N\" translate=\"no\" dir=\"ltr\">F.N</a>.</p><p>\"We just created a new company and that should be enough to start with as long as we manage complexity and diversity,\" he said.</p><p>In a separate statement, Stellantis said it was paying out 1.9 billion euros in benefits to employees based on last year's results, up 70% on 2020. </p><p>($1 = 0.8829 euros)</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (<br/>Additional reporting by Nick Carey in London<br/>Editing by Mark Potter)</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: STELLANTIS-RESULTS/ (UPDATE 5, PIX)</p></div>"}