{"date": "2022-01-06 20:13:09.195000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3287.14, "close": 3251.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Make 2022 the year of good decisions.</span> Start by signing up for our newsletter for twice-weekly tips, reviews and more from our experts.</span> </p><p>Below, you'll find our top 10 Amazon deals right now, including a foot massager, some filtering face masks and a snow brush, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. </p><p>► <span>Macy's is closing more stores in 2022:</span> Will your location close? See the list.</p><p>► <span>Ending soon</span><span>:</span>  Get Coach handbags, wallets and more for 50% off.</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p class=\"tr-npp-section-title\">The 10 best Amazon deals you can get today</p><p><big>1. 12% off: These exhaling face masks</big> </p><p>Stay protected this winter with these SupplyAid KN95 face masks on sale at Amazon today. Typically listed for $15.99, you can get a five-pack of the masks for 12% off, or $14.04. SupplyAid says the masks come with an exhalation valve to offer protection against dust, pollen and hazardous air. The developer recommends users store the masks in a dry and ventilated location.</p><p><span>Get the SupplyAid KN95 Face Mask with Exhalation Valve 5-Pack for $14.04 (Save $1.95)</span> </p><p><big>2. Less than $25: This adjustable car phone mount</big> </p><p>Keep even the biggest smartphones secure while you're on the road with this Vicseed car phone mount. Usually listed for $24.95, this hands-free device is now available at a 15% discount for $21.20. The brand says the universal mount can fit a variety of smartphones, including the iPhone 13 Pro Max, the Samsung Galaxy Note S21 Ultra 5G and more. It also features a telescopic arm that can extend out to nine inches and a highly flexible ball joint that can move 360 degrees.</p><p><span>Get the Vicseed Universal Car Mount for $21.20 (Save $3.75)</span> </p><p><big>3. 35% off: Our favorite bathroom scale</big> </p><p>Keep a close eye on your fitness progress from the comfort of your bathroom with the Renpho Bluetooth Smart Scale, on sale for just $23.91, $13.08 off its list price of $36.99. The Renpho is our favorite bathroom scale thanks to its fast-acting technology, which provides accurate measurements to the Renpho mobile app. The scale can also calculate bone mass, body fat percentage, metabolic age and other statistics in a speedy fashion on the app and on the scale.</p><p><span>Get the Renpho ES-CS20M Smart Bluetooth Body Fat Scale for $23.91 with coupon (Save $13.08)</span> </p><p><big>4. Save $20: This compact USB microphone</big> </p><p>Get grade-A audio on your next podcast or game stream with the Blue Yeti Nano USB microphone. Typically listed for $99.99, this wired device is on sale for $79.99 thanks to a 20% discount. Blue says the Yeti Nano features two built-in custom mic capsules to capture the presence and detail of any voice, along with onboard controls to find the right volume. At only 8.3 inches tall and 3.78 inches wide, it's also sized to fit on any desktop. </p><p><span>Get the Blue Yeti Nano Premium Condenser USB Microphone for $79.99 (Save $20)</span> </p><p><big>5. 28% off: This versatile foot massager</big> </p><p>Skip spending money at the masseuse and try this Renpho RF-FM059 foot massager. Normally priced at $139.99, you can get this relaxation accessory for $100.49 with its current $29.50 price cut and an additional $10 coupon on the product page. The FM059 is an alternate version of our favorite foot massager, the Renpho RF-FM059R ($124.99), the only difference being the FM059 comes without the remote. You'll still get the massager's easy-to-use control panel and customizable knead level for just the right feeling on your feet.</p><p><span>Get the Renpho RF-FM059 Foot Massager for $100.49 with coupon (Save $39.50)</span> </p><p><big>6. Up to 20% off: These Breville juicers</big> </p><p>If you prefer your fruits and veggies mixed into a tasty smoothie, Amazon is offering a collection of Breville juicers on sale today. There's the brand's Juice Fountain Compact, typically listed for $89.89 but now on sale for $79.95. This particular model is one of the best juicers we've ever tested thanks to its ability to collect pulp around the exterior edge of the strainer basket and speedy juicing ability. There's also the Breville Juice Fountain Plus, available at a 20% discount from $159.95 down to $127.95. The brand says its stainless steel juicer features an extra-wide three-inch chute so it can handle entire vegetables and fruits, plus an integrated froth separator in its juice jug to get the most juice out of whatever you're making. </p><p><span>Save up to 20% on Breville juicers</span> </p><p><big>7. 41% off: Our favorite oven thermometer</big> </p><p>Make your next baking project all the easier with the KT Thermo Dial Oven Thermometer. Normally priced at $15.60, you can get this three-inch tool for $9.18 with the already-active 36% discount and an additional 6% coupon on the product page. The KT Thermo is our favorite oven thermometer for its large and uncluttered face that can be easily read through most oven doors. We found its hook could snugly lock into an oven rack while its base was wide enough to be perched on the grates. </p><p><span>Get the KT Thermo 3-Inch Dial Oven Thermometer for $9.18 with coupon (Save $6.42)</span> </p><p><big>8. Save $25: This popular hairstyling tool</big> </p><p>Creating salon-quality hairstyles has never been easier with the Revlon One-Step hairdryer and volumizer. This cult-favorite hairstyling tool is one of our favorites (it earned an honorable mention!) and right now you can pick it up from Amazon for as little as $34.88, a $25.11 markdown. During testing, the volumizer cut our styling time in half and dried our locks from root to tip with minimal effort. </p><p><span>Get the Revlon One-Step Hair Dryer And Volumizer Hot Air Brush from $34.88 (Save $15 to $25.11)</span> </p><p><big>9. Less than $100: This portable starter box</big> </p><p>You can always have a spare charge for your car battery this winter with the Noco Boost Plus 12-Volt jump starter box. Typically listed for $125.95, this 1,000-amp power bank is on sale for $99.95 courtesy of a $26 price cut. Noco says the Boost Plus has enough charge for up to 20 jump-starts and is rated for gasoline engines up to six liters and diesel engines up to three liters. It's protected by a rubberized over-molded casing and is water-resistant to withstand the toughest outdoor conditions.  </p><p><span>Get the Noco Boost Plus GB40 1000 Amp 12-Volt Jump Starter Box for $99.95 (Save $26)</span> </p><p><big>10. 36% off This long snow brush</big> </p><p>Clear up your vision before your morning drive to work with the Mallory 532 Cool-Force snow brush. Normally priced at $12.45, Amazon is offering the 26-inch accessory for $7.98. The over-two-foot length of the brush offers a long reach while still being small enough to be stored in your car. It also features a foam grip for comfort and a four-inch-wide scraper blade to chip away shards of ice. </p><p><span>Get the Mallory 26-Inch 532 Cool-Force Snowbrush with Ice Scraper for $7.98 (Save $4.47)</span> </p><p class=\"tr-npp-section-title\">Amazon deals you may have missed</p><p><big>1. Omega Juicer Extractor Nutrition System</big> </p><p>If you love to be hands-on with your food and drinks at home, add the Omega Juicer Extractor and Nutrition System to your kitchen tools today. Normally priced at $377.99, this 150-watt appliance is on sale today for $302.39, or for 20% off, with a coupon on the product page. Omega says the device uses a low speed (80 RPMs) to extract the maximum amount of nutrients, vitamins, taste and juice from fruits, vegetables, leafy greens and wheatgrass. Not only that, its quiet but powerful motor can also grind coffee, mince herbs and make baby food with its adjustable end cap.</p><p><span>Get the Omega Juicer Extractor and Nutrition System for $302.39 with coupon (Save $75.60)</span> </p><p><big>2. LG OLED C1 Series 4K Smart TV</big> </p><p>Those looking to invest in a truly eye-catching TV will marvel at the LG OLED C1 Smart TV. Typically listed from $2,499.99, you can get a 65-inch model for $1,896.99, a 24% price cut (smaller sizes are cheaper, but not on sale). We adore the C1, and named it the best TV on the market for its incredible brightness and the rich colors it displayed, no matter the movie or TV show. Its four HDMI 2.1 ports and customizable picture enhancements also make it a great screen for gamers playing on the latest consoles. </p><p><span>Get the LG OLED C1 Series Alexa Built-In 4K Smart TV from $1,296.99 (Save $603 to $803)</span> </p><p><big>3. Febreeze Unstopables Air Fresheners</big> </p><p>Whether your kitchen or your bathroom needs freshening, these Febreeze Unstopables Fresh air fresheners are essentials for your home. Typically listed for $14.50, you can get a three-pack of this compact odor eliminator with Amazon's delivery membership for just $8.37, or 42% off, thanks to a $2.53 price cut and a $3 coupon you can check off on the product page. With Subscribe and Save, you can get 5% off the delivery of your first order and up to 15% off repeat deliveries that you can schedule to arrive anywhere every two weeks to every six months. Febreeze says these tiny devices can eliminate odors in even the smallest home spaces for 45 days. </p><p><span>Get the Febreeze Unstopables Fresh Small Spaces Air Freshener for $8.37 with coupon code (Save $6.13)</span> </p><p><big>4. TriggerPoint GRID Foam Roller</big> </p><p>Add more tools to your workout routine with the TriggerPoint GRID foam roller. Normally priced at $39.99, you can get this 13-inch muscle tool for as low as $22.72 with a 43% discount. The GRID is our favorite compact foam roller due to the lasting durability from its hard plastic and dense foam material. Its varied rolling surface allows for different levels of deep tissue massage while being both firm and cushioned enough for comfort.</p><p><span>Get the TriggerPoint GRID Original Foam Roller from $22.72 (Save $5 to $17.27)</span> </p><p><big>5. Bowflex SelectTech 552 Adjustable Dumbbell</big> </p><p>Toughen up this year with the Bowflex SelectTech 552 adjustable dumbbell. Typically listed for $199, this 52.5-pound fitness tool can be yours for 25% off at $149. The SelectTech 552 can be set for weights from 5 to 52.5 pounds, with the ability to increase the load by 2.5-pound increments, and it's the best adjustable dumbbell we've ever tried, mainly for how easy it was to re-rack thanks to a tray that separates the weight plates from each other.</p><p><span>Get the Bowflex SelectTech 552 Adjustable Dumbbell for $149 (Save $50)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 20% on Fitness Equipment from Bowflex and Schwinn</li><li>Save up to 38% on Medify Air Purifiers</li><li>Save up to 50% on Amazon fitness trackers</li><li>Buy Two, Get One for Half Off Beauty Essentials</li><li>Save $10 on purchases of $40 or more home cleaning products</li><li>Philips One by Sonicare Battery Toothbrush from $14.95 (Save $10 to $10.04)</li><li>Lifewit Large Capacity Clothes Storage Bag Organizer, 3-Pack for $16.99 (Save $13)</li><li>BalanceFrom GoYoga All-Purpose Exercise Yoga Mat with Carrying Strap from $17.02 (Save $25.90 to $32.93)</li><li>1-Year subscription to Amazon Kids+ for $19.99 (Save $79.01)</li><li>Hilife HL7 Clothes Steamer for $21.66 (Save $14.33)</li><li>Pure Enrichment PureRelief XL Heating Pad for $27.99 with coupon (Save $7)</li><li>Amazon Echo Show 5 (2nd Generation) for $44.99 (Save $40)</li><li>Amazon Fire HD 10 64 GB Tablet for $94.99 (Save $95)</li><li>DeWalt 20-Volt Max Cordless Drill 2-Tool Combo Kit for $160.65 (Save $38.35)</li><li>AKRacing Nitro Gaming Chair for $299.99 (Save $179.01)</li><li>Apple Watch Series 7 from $369 (Save $30)</li><li>KitchenAid Artisan Series 5-Quart Stand Mixer from $429 (Save $30.04 to $30.99)</li><li>Echelon EX-5 Exercise Bike for $848 (Save $351.99)</li><li>NordicTrack Commercial Series 1750 Treadmill with 30-Day iFit Membership for $1,599 (Save $400)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today in January 2022</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}