{"date": "2021-12-02 19:25:11.889000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Wednesday, Dec  1</p></div><div class=\"tr-npp-lead\"><p>December 1 (Renewables Now) - Amazon.com Inc (NASDAQ:AMZN) today unveiled 18 new utility-scale wind and solar energy projects across the US and Europe, adding 2 GW to its renewable energy portfolio.</p><p>Including the new projects, the US e-commerce giant has procured 5.6 GW of renewable power capacity this year, 40% more than the 4 GW secured in 2020.</p></div><div class=\"tr-npp-body\"><p>The latest projects, located in the US, Finland, Germany, Italy, Spain and the UK, increase the company's total committed renewable power capacity to over 12 GW. It now has 274 renewable energy projects around the world including 105 utility-scale wind and solar projects and 169 solar rooftops on facilities and stores. Amazon says this makes it the largest corporate buyer of renewable energy globally.</p><p>The newly announced projects include eight projects in the US -- more than 1 GW of solar projects, among which Amazon's first solar projects in Arizona and Georgia, as well as additional projects in Ohio, Texas and Virginia. The company added its second solar-plus-storage project, a 300-MW solar scheme coupled with a 150-MW battery energy storage in Arizona.</p><p>Amazon further added more than 630 MW of solar projects in Spain and four wind projects in Finland representing 158 MW of capacity. The company also invested in its third project in Italy, a 40-MW solar scheme, and expanded its UK portfolio with a new wind project in Northern Ireland.</p><p>Amazon's renewable energy procurement places the online retailer and web services provider on a path to power 100% of its operations with renewables by 2025, five years earlier than its original 2030 goal. The company also has a target of reaching net-zero carbon by 2040.</p><p>In June, Amazon announced its renewable procurement had reached 10 GW.</p><p>Separately it was announced today that Amazon has signed corporate power purchase agreements (PPAs) with Danish clean energy group Ørsted A/S (CPH:ORSTED) for an additional 100 MW from Ørsted's 900-MW Borkum Riffgrund 3 offshore wind project in Germany and the 16-MW Ballykeel onshore wind farm in Northern Ireland.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SeeNews. All rights reserved.</p></div>"}