{"date": "2021-11-02 14:41:52.694000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MEDIGUS LTD (\"MDGS-Q\")\nSCOUTCAM INC. (\"SCTC-0\")\n- Medigus: ScoutCam Rounds Out Management Team with Appointments of\n- Arik Priel as Chief SW Architect and Roee Peled as VP Business\n- Development\n\n     Medigus Ltd., a technology company engaged in advanced medical\nsolutions, innovative internet technologies and electric vehicle and\ncharging solutions, announced that ScoutCam Inc. (27.76%) a leading\nprovider of turnkey I4.0 visualization solutions, composed of field proven\nhighly resilient image acquisition unit, data collection and storage with\ndedicated AI capabilities, announced the additions of Arik Priel as\nScoutCam's new Chief SW Architect and Roee Peled as the ScoutCam's new Vice\nPresident of Business Development.\n\n     Arik brings over 20 years of experience in leading multidisciplinary\nR&amp;D and engineering teams in defining and navigating product development\nfrom concept to deployment, with a focus on cloud-based architectures and\nAI- based technologies.\n\n     Prior to joining ScoutCam, Arik held several senior technology\npositions, most recently as CTO of Octopol, where he combined state of the\nart AI models together with cutting edge software technology. Prior to\nOctopol, Arik served as Director of Technology at Green &amp; Gold Analytics,\nwhere he established partnerships with Microsoft and Amazon Web Services.\nArik also previously served as VP R&amp;D and established the Israeli\ninnovation center of Ivanti (f/k/a Landesk). Arik earned both his BSc in\nComputer Science and Economics and MBA from Bar-Ilan University.\n\n     Mr. Peled is a proven business development and sales executive,\nspecializing in identifying and opening new sectors and geographic markets\nin the IoT, 3D/LiDAR, Cybersecurity and Machine/Deep Learning industries.\nHe has overseen transactions in multi-disciplined and complex B2B sales\nprocesses (SaaS/Capex-Opex) and has deep technical knowledge in hardware\nand software.\n\n     Prior to joining ScoutCam, Roee held senior business development and\nsales positions with PointGrab, imVision, Mantis Vision, Orckit Systems and\ncomAbility Ltd. He earned his BSc in Electrical Engineering from Tel-Aviv\nUniversity and an MBA from Bar Ilan University.\n\n     \"ScoutCam develops novel, state-of-the-art products in the I4.0 domain\n- focusing on Condition Based Monitoring (CBM) and Predictive Maintenance\n(PdM) for a variety of sectors (Aviation, Energy and Automotive), and as we\ncontinue to advance our visualization solutions, the universe of potential\napplications expands. To strengthen our leadership position in the market\nit's important that we assemble a team with the experience and expertise to\nnot only meet that demand but recognize new areas worth pursuing. The\naddition of Arik to our team in a leadership role will strengthen our\nability to innovate for Industry 4.0. Arik's role will be to help build and\ntransform ScoutCam's products to be more software based, while Roee's focus\nwill be introducing our solutions to new customers within our existing\nmarkets as well as identifying applications in new sectors, and in addition\nassisting in pivoting ScoutCam's business model to a recurring revenue\nmodel,\" said Yovav Sameah, Chief Executive Officer of ScoutCam.\n\n     About ScoutCam\n\n     ScoutCam is a leading provider of image-based platforms. Pioneering\nthe use of its proprietary visualization technology, ScoutCam offers\nstate-of-the-art solutions across a variety of Predictive Maintenance and\nCondition Based Monitoring markets, thus paving the way for the energy,\nautomotive and aviation industries. ScoutCam's solutions are based on small\nand highly resilient cameras, specialized AI analysis and supplementary\ntechnologies. For more information, please visit\n(span)https://www.scoutcam.com\n\n     About Medigus\n\n     Based in Israel, Medigus Ltd. (Nasdaq: MDGS) is a technology company\nfocused on innovative growth partnerships, mainly in advanced medical\nsolutions, digital commerce and electric vehicle markets. Medigus'\naffiliations in the medical solutions arena include ownership in ScoutCam\nInc. and Polyzion Ltd. The Company's affiliates in digital commerce include\nGix Internet Ltd., Jeff's Brands Ltd. and Eventer Technologies Ltd. In the\nelectric vehicle market, Charging Robotics Ltd. and Revoltz are also part\nof the Company's portfolio of technology solution providers. To learn more\nabout Medigus' advanced technologies, please visit <a href=\"http://www.medigus.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.medigus.com</a>/.\n\n     Forward-Looking Statements\n\n     This press release contains forward-looking statements within the\nmeaning of the \"safe harbor\" provisions of the Private Securities\nLitigation Reform Act of 1995 and other Federal securities laws. Words such\nas \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\"\n\"estimates\" and similar expressions or variations of such words are\nintended to identify forward-looking statements. For example, Medigus uses\nforward-looking statements in this press release when it suggests the\npotential for the new appointments in ScoutCam may or will lead to market\ngrowth in the future. Because such statements deal with future events and\nare based on Medigus' current expectations, they are subject to various\nrisks and uncertainties, and actual results, performance or achievements of\nMedigus could differ materially from those described in or implied by the\nstatements in this press release.\n\n     The forward-looking statements contained or implied in this press\nrelease are subject to other risks and uncertainties, including those\ndiscussed in any filings with the Securities and Exchange Commission\n(\"SEC\"). Except as otherwise required by law, Medigus undertakes no\nobligation to publicly release any revisions to these forward-looking\nstatements to reflect events or circumstances after the date hereof or to\nreflect the occurrence of unanticipated events. References and links to\nwebsites have been provided as a convenience, and the information contained\non such websites is not incorporated by reference into this press release.\nMedigus is not responsible for the contents of third-party websites.\n\n     Contact:\n     Tali Dinar\n     Chief Financial Officer\n     +972-8-6466-880\n     ir@medigus.com\n\n     Investor Relations Contact:\n     Miri Segal\n     CEO\n     MS-IR LLC\n     +1-917-607-8654\n     msegal@ms-ir.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130500705.MNPRE2130502623-07355320211102</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}