{"date": "2021-12-01 03:05:14+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        Digital Earth Africa is helping Zanzibar fight the effects of climate change and protect the island's precious mangrove habitat. The story is also part of a new documentary series, Climate Next.\n      </div>\n                <div>\n                  <p>\n          Zanzibar Island, located off the coast of Tanzania in East Africa, spans 950 square miles of lush vegetation and idyllic beaches that support its tourism-driven economy, in addition to the agricultural and fishing industries that help feed its 1.5 million inhabitants. Zanzibar is known for its most famous coastal ecosystem: mangrove forests.\n        </p>\n                  <p>\n          Mangroves are an incredibly hardy family of trees and shrubs-their deep, salt-tolerant roots thrive on coastlines and serve as natural barriers to storms and rising seas. In Zanzibar, the forests protect the island's human residents and help fish hide from predators. But the mangroves also help protect the planet: They are incredibly effective in naturally combating climate change thanks to their <span><a href=\"https://earth.org/data_visualization/the-true-value-of-mangroves/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ability to sequester three to four times more carbon</a></span>from the Earth's atmosphere than tropical forests.\n        </p>\n                  <p>\n          However, Zanzibar's mangrove forests are quickly becoming threatened by the effects of climate change, including rising sea levels, coastal erosion, and vanishing natural habitats. Research shows that <span><a href=\"https://www4.unfccc.int/sites/ndcstaging/PublishedDocuments/United%20Republic%20of%20Tanzania%20First%20NDC/TANZANIA_NDC_SUBMISSION_30%20JULY%202021.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">70% of natural disasters in Tanzania are climate related</a></span>. These effects threaten the future existence of plants and animals native to the island, as well as the livelihoods of the islanders who heavily depend on agriculture and fishing. Mangroves, a bedrock of the ecosystem, are also increasingly threatened by human activity like deforestation.\n        </p>\n                  <div>\n          \"Zanzibar will be history. That's why we give education to the villagers of Zanzibar to plant more mangroves.\" \n          <div><div>\n              Iddi Hassan Ali\n            </div><div>\n              Chairman of Zanzibar Volunteers for Environmental Conservation\n            </div></div></div>\n                  <p>\n          The urgency of climate change's effects on Zanzibar, a semiautonomous archipelago in Tanzania, has prompted the Tanzanian government to turn to <span><a href=\"https://www.digitalearthafrica.org/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Digital Earth Africa</a></span>, an organization that provides a trove of digital data including decades of satellite imagery of Africa. The data and tools provided by Digital Earth Africa, which runs on Amazon Web Services (AWS), examine near-real-time images of Earth. Government officials, NGOs, business leaders, and farmers across use the data to inform future research, decisions, and conservation efforts.\n        </p>\n                  <p>\n          Digital Earth Africa-and the Zanzibar researchers using the service to help fight the effects of climate change-are part of a new AWS original documentary series titled \"<span><a href=\"https://aws-preview.aka.amazon.com/sustainability/climatenext/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Climate Next</a></span>.\" The four-part series features stories about people and communities around the world driving innovation and creating scalable solutions to address climate change.\n        </p>\n                  <p>\n          Through the <span><a href=\"https://sustainability.aboutamazon.com/environment/the-cloud/asdi\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Sustainability Data Initiative (ASDI)</a></span>, AWS is storing petabytes of satellite data to support Digital Earth Africa, at no cost to the project. Today, Digital Earth Africa is the world's largest <span>open data cube</span>for accessing and analyzing decades of satellite imagery of Africa's lands and seas running on AWS.\n        </p>\n                  <p>\n          Zanzibar native Khairiya Masoud, an assistant lecturer at The State University of Zanzibar (SUZA), said her personal experiences with climate change on the island prompted her to pursue education as a full-time career. Masoud oversees SUZA's Digital Earth Africa club, an extracurricular group that equips students with knowledge of advanced geospatial tools and Earth observation data through Digital Earth Africa. The club improves students' skills and geospatial problem-solving.\n        </p>\n                  <p>\n          AWS is also providing leaders like Massoud Hamad and Raya Ahmada, and assistant lecturers at SUZA, access to all of Digital Earth Africa's data and analysis tools at no cost. The analysis allows the team to obtain important insights that they can apply directly to their conservation efforts, such as protecting and restoring mangroves. In Zanzibar, <span><a href=\"https://www.youthmappers.org/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">YouthMappers</a></span>and other conservation groups build community awareness around the importance of mangrove forests as a way to demonstrate the impacts of climate change on the island.\n        </p>\n                  <div>\n          Khairiya Masoud, Assistant Lecturer at The State University of Zanzibar (SUZA), ensures that young people are equipped with the skills they need to use geospatial technology. Masoud has incorporated Digital Earth Africa into the curriculum for her students at SUZA. \n          <div>\n            Photo by Sameer Satchu\n          </div></div>\n                  <p>\n          \"As we all know, climate change has been an issue not only in Zanzibar. It's a worldwide problem,\" said Ahmada. \"We are part of the community and we are taking part in helping the community, working with them, supporting them where [they are] in need, also helping in giving them education about [climate change], but also taking parts into [volunteering] programs.\"\n        </p>\n                  <p>\n          For conservationists, more information means better decisions. With the assistance of AWS Cloud compute and storage capabilities, conservationists are able to access and analyze more information than ever before, including a time series analysis of the mangroves to see ecological trends over the decades.\n        </p>\n                  <p>\n          Dr. Kenneth Mubea, the user engagement manager at Digital Earth Africa, supports engagements with partners across the continent who wish to use the organization's data and services-especially those who work in government, academia, and civil society.\n        </p>\n                  <p>\n          \"Digital Earth Africa is helping provide the data that is required, which was already a gap before. All this analysis-ready data is available through AWS in the click of one button,\" said Mubea. \"With the various partnerships we engaged, with the various governments in Africa, they asked for more. And we are able to deploy these for the 54 countries in Africa, so that we leave no one behind.\"\n        </p>\n                  <div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/news/sustainability/listen-to-the-rainforest-chorus-thats-helping-scientists-protect-african-elephants\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Listen to the rainforest chorus that's helping scientists protect African elephants</a>\n                      </span>\n                    </div>\n                    <div>\n            Elusive elephants, gorillas, grey parrots, and tree frogs are among the animal sounds in 1 million hours of rainforest recordings that could help save threatened species.\n          </div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/news/sustainability/listen-to-the-rainforest-chorus-thats-helping-scientists-protect-african-elephants\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                      </span>\n                    </div>\n                  </div>\n                  <p>\n          Digital Earth Africa's data and tools are already informing conservation efforts on the ground. Iddi Hassan Ali is the chairman of Zanzibar Volunteers for Environmental Conservation (ZAVECO) and helps drive the progress on planting mangroves, which he said are crucial across the island.\n        </p>\n                  <p>\n          \"Zanzibar, as we know, this is an island, and without mangroves after maybe 20, 25 years, if there's no group like us, volunteers for planting, Zanzibar will disappear because the salt water is coming in the villages,\" said Hassan Ali. \"Zanzibar will be history. That's why we give education to the villagers of Zanzibar to plant more mangroves.\"\n        </p>\n                  <p>\n          Planting mangroves is what local leaders like Hamad, Ahmada, and SUZA students do nearly every week. Each time they go out, their goal is to plant 1,000 mangrove seeds.\n        </p>\n                  <p>\n          Just like communities around the globe, people in Zanzibar are dependent on the natural resources around them-and with these resources comes responsibility. As the climate continues to change, Digital Earth Africa offers critical resources to help governments and communities across Africa better manage and monitor their natural resources to ensure a more sustainable future.\n        </p>\n                  <p>\n          Amazon and AWS are proud to support innovation and life-changing organizations in Zanzibar and elsewhere in the world and will keep working to help future generations enjoy a clean and sustainable environment.\n        </p>\n                  <p>\n          To find out more about the Amazon Sustainability Data Initiative and its grant program, please visit <span><a href=\"https://sustainability.aboutamazon.com/environment/the-cloud/asdi\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazonsdi.com</a></span>. Learn more about how <span><a href=\"https://aws.amazon.com/government-education/aerospace-and-satellite/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Aerospace and Satellite</a></span>supports customers and partners.\n        </p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/sustainability\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sustainability</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/innovation\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Innovation</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/aws/climate-next-how-data-and-community-can-save-zanzibars-mangroves\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>01 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>01 December 2021 03:05:14 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}