{"date": "2022-02-12 17:45:09.029000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3065.87, "close": 3130.21}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Washington [US], February 12 (ANI): A live-action 'Blade Runner' sequel series, titled 'Blade Runner 2099', is currently under development at Amazon.</p><p>Washington [US], February 12 (ANI): A live-action 'Blade Runner' sequel series, titled 'Blade Runner 2099', is currently under development at Amazon.</p></div><div class=\"tr-npp-body\"><p>According to Variety, the series will serve as a follow-up to the 'Blade Runner' sequel 'Blade Runner 2049'. Silka Luisa will write and executive produce, with Ridley Scott set to executive produce via Scott Free Productions.</p><p>Andrew Kosove and Broderick Johnson of Alcon Entertainment are also executive producing along with David W. Zucker of Scott Free, 'Blade Runner 2049' screenwriter Michael Green, Ben Roberts, Cynthia Yorkin, and Clayton Krueger.</p><p>Alcon Entertainment and Amazon Studios will also produce along with Scott Free.</p><p>Though plot details on the series are being kept under wraps, the title indicates it will portray possible events fifty years after that of the most recent film in the franchise, which debuted in theatres in 2017 with Denis Villeneuve as director.</p><p>Apart from the two films, Adult Swim recently aired the anime series 'Blade Runner: Black Lotus', which takes place in the year 2032.</p><p>As per Variety, Scott had previously teased that a 'Blade Runner' live-action series was in the works, telling the BBC in November 2021 that the pilot had already been written and a series bible had been prepared. (ANI)</p><p>Copyright © 2022 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 SyndiGate. All Rights Reserved.</p></div>"}