{"date": "2021-11-04 19:45:17.615000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Washington [US], November 4 (ANI/Sputnik): Amazon founder and owner Jeff Bezos has lost his legal battle against NASA over the contract to build lunar lander for the US Artemis Program, the US Federal Court of Claims ruled on Thursday according to a CNBC report.</p><p>Washington [US], November 4 (ANI/Sputnik): Amazon founder and owner Jeff Bezos has lost his legal battle against NASA over the contract to build lunar lander for the US Artemis Program, the US Federal Court of Claims ruled on Thursday according to a CNBC report.</p></div><div class=\"tr-npp-body\"><p>Judge Richard Hertling ruled against Bezos' Blue Origin in the company's lawsuit against NASA that protested the space agency's decision to give the contract instead to rival billionaire mogul Elon Musk's SpaceX in April, the report said.</p><p>NASA awarded SpaceX with a $2.9 billion contract to build the Human Landing System (HLS) for the first US human return to the moon in more than half a century since the Apollo program ended in 1972.</p><p>The original expectation was that two separate contracts would be ordered, but NASA scaled the program back after receiving a smaller appropriation from Congress than expected for it, the report said.</p><p>Blue Origin protested the decision with the Government Accountability Office but in July that office denied the appeal Judge Hertling dismissed Blue Origin's legal appeal, the report added.</p><p>NASA's work with SpaceX on the HLS contract was suspended during the lawsuit but will now on Monday, according to the report. (ANI/Sputnik)</p><p>Copyright © 2021 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}