{"date": "2022-02-03 18:34:59.999000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Below, you'll find our top Amazon deals right now, including one of our favorite TVs, a portable massager and a useful kitchen tool, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. If you're looking for N95 and KN95 masks this winter, Amazon also has plenty of choices on sale right now.</p><p>► <span>Presidents' Day:</span> Shop the best deals on TVs, appliances and everything in-between</p><p>► <span>Valentine's Day:</span>  Shopping for your Valentine? We've got deals on chocolates and so much more</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p class=\"tr-npp-section-title\">The best Amazon deals of the day</p><p><big>1. 18% off: One of our favorite TVs</big> </p><p>If you want to upgrade your screen to watch this year's Super Bowl, the Sony A90J Bravia XR OLED TV just might be the TV you're looking for. Typically listed from $2,799.99, this 4K smart TV is on sale in its 55-, 65- and 83-inch sizes starting as low as $2,298. The A90J is one of the best TVs we've tested thanks to its blending of picture-perfect black levels and some of the brightest highlights we've ever seen. Its Google TV smart platform is also speedy and flexible enough to suit experienced users and newcomers alike.</p><p><span>Get the Sony A90J Bravia XR OLED 4K Ultra HD Smart Google TV from $2,298 (Save $501.99 to $2,001.99)</span> </p><p><big>2. Less than $20: This multifunction hairstyling tool</big> </p><p>Reduce frizz and add shine to your hair with the InfinitiPro by Conair 3-in-1 ceramic styler. Normally priced at $34.99, this handy hair styling tool can be yours for $19.99, or 43% off. Conair says the styler has three heat settings and two speed settings for you to find the right mode to detangle, straighten and volumize your hair. It also comes with three attachments.</p><p><span>Get the InfinitiPro by Conair 1875 Watt 3-in-1 Ceramic Styler from $19.99 (Save $5 to $15)</span> </p><p><big>3. 38% off: This soothing plant</big> </p><p>If you're shopping for a Valentine's Day gift this year, bring some nature into the homes of your loved ones with the Costa Farms aloe vera indoor plant. Typically listed for $20.99, this seven-inch greenery is now 38% off, or $13.01. Costa Farms says the plant comes in a four-inch diameter décor pot and can help purify the air.</p><p><span>Get the Costa Farms 7-Inch Aloe Vera White-Natural Décor Planter for $13.01 (Save $7.98)</span> </p><p><big>4. Save $36: This portable back massager </big> </p><p>Relax anytime you want with the InvoSpa Shiatsu electric body massager, on sale for more than half off. Normally priced at $70, you can get the device in blue with a travel bag for $33.97. InvoSpa says the massager can be positioned on your neck, shoulders and upper and lower back to relieve sore muscles with infrared heat. It also comes with a wall power adapter and car charger to use at home or on the road. </p><p><span>Get the InvoSpa Shiatsu Electric Full Body Massager from $33.97 (Save $15 to $36.03)</span> </p><p><big>5. Less than $15: This 2-in-1 kitchen tool</big> </p><p>Never struggle with a can of soup again with the KitchenAid Classic can opener,  which can be yours for less than $15 right now. Typically listed for $15.68, you can get this kitchen essential in Hot Sauce red for just $13.55. KitchenAid says the opener features a stainless steel blade and an easy-turn knob for the simplest possible experience. It also has a convenient bottle opener at its top to pop open a beverage while you cook.</p><p><span>Get the KitchenAid Classic Multifunction Can Opener/Bottle Opener from $13.55 (Save $0.95 to $6.15)</span> </p><p class=\"tr-npp-section-title\">The best Amazon deals from this week</p><p><big>1. Schwinn IC4 Indoor Cycling Bike</big> </p><p>Skip the gym this year by bringing high-quality fitness into your home with this Schwinn IC4 indoor exercise bike. Typically priced at $1,199, this fitness cycle is now available for $599 thanks to a $400 price cut and an additional $200 coupon to check off. We named the IC4 the best basic exercise bike for its quiet flywheel and pedals, as well as its accompanying accessories, which include a pair of three-pound dumbbells, a Bluetooth heart-rate monitor and a USB charging station for your smartphones or tablets. We found it to be easy to set up at home and appreciated the Bluetooth connectivity that lets you stream workouts and sessions from workout apps to your tablet or phone on the bike.</p><p><span>Get the Schwinn Fitness IC4 Indoor Cycling Exercise Bike for $599 with coupon (Save $600)</span> </p><p><big>2. Amazon Music Unlimited with Echo Dot (3rd Generation)</big> </p><p>Right now, Amazon is letting shoppers get its most compact smart speaker for a massive discount when they try out its premiere streaming service. New subscribers to Amazon Music Unlimited will get the third-generation Echo Dot speaker for just $4.99—a whopping $35 discount from the speaker's current price of $39.99. That means you pay $9.99 ($7.99 for Prime members, $0.99 for students) to stream and even download as many as 70 million songs on your mobile device, then less than $5 for the device to play your favorite tunes via Bluetooth connection over the Echo Dot, for a total cost of $14.98. After the initial purchase, you'll pay the $9.99 fee every month. Though smaller than the newest Echo Dot model ($49.99), the third-generation Dot is still one of the best Echo speakers for giving you access to all standard Alexa features at a fraction of the cost of the rest of the Echo series.</p><p><span>Get one month of Amazon Music Unlimited with an Echo Dot (3rd Generation) for $14.98 (Save $35)</span> </p><p><big>3. Snow Joe 22-Inch 15-Amp Electric Snow Thrower</big> </p><p>If you're still digging yourself out of the most recent blizzard, this Snow Joe 15-Amp electric snow thrower can help clear the remaining powder on your driveway. Typically listed for $299.99, you can get this 22-inch wide outdoor appliance for 44% off, or $169. Snow Joe says the thrower's wide capacity is meant to handle large driveways and walkways, and it has a 180-degree adjustable chute to move the snow wherever you want. It also features dual LED headlamps so you can get work done even when it's dark out.</p><p><span>Get the Snow Joe 22-Inch 15-Amp Electric Snow Thrower for $169 (Save $130.99)</span> </p><p><big>4. SupplyAID RRS KN95 Face Masks</big> </p><p>Stay protected this year with the SupplyAID KN95 disposable face masks, on sale at Amazon today. Typically listed for $10.97, you can get a 5-pack of these triple-layer masks for $5.75, or 48% off. SupplyAid says the masks are best suited for daily travel protection, and provide a 95% filter efficiency to keep you safe from airborne particles.</p><p><span>Get the SupplyAID RRS KN95 Face Masks, 5-Pack for $5.75 (Save $5.22)</span> </p><p><big>5. Black + Decker BDH2000PL 20-Volt Max Handheld Vacuum</big> </p><p>Get the dust and debris out of the smaller, more difficult spaces in your house with the Black + Decker 20-Volt Max handheld vacuum. Typically listed for $89.99, this cordless appliance is now available for 23% off at $69. The 20-Volt Max is our favorite affordable handheld vacuum, having impressed us with its pivot joint that lets you bend the unit 200 degrees to clean hard-to-reach areas. During our tests, the vacuum captured 70 percent of the dirt we laid out for it. </p><p><span>Get the Black + Decker BDH2000PL 20-Volt Max Handheld Vacuum for $69 (Save $20.99)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 30% on Amazon Fire TV Omni Series</li><li>Save up to 45% on Crest and Oral-B Tooth Whitening Kits and Toothbrushes</li><li>Tile Mate (2022) for $19.99 (Save $5)</li><li>totes Women's Chelsea Ankle Rain Boots from $23.49 (Save $2.75 to $31.51)</li><li>Tile Sticker for $23.99 (Save $6)</li><li>Lodge LSRG3 Cast Iron Single-Burner Reversible Grill/Griddle for $24.90 (Save $22.10)</li><li>AquaSonic Black Series Ultra Whitening Toothbrush for $36.95 (Save $23)</li><li>TurboTax Deluxe 2021 Tax Software Federal and State Tax Return PC Download for $39.99 (Save $20)</li><li>Cincom Rechargeable Hand Massager with Heat for $59.99 with coupon (Save $20)</li><li>Instant Vortex 5.7-Quart Air Fryer for $79.95 (Save $20.04)</li><li>Amazon Echo Buds (Second Generation) for $79.99 (Save $40)</li><li>Sony WH-CH710N Noise Canceling Headphones for $98 (Save $81.99)</li><li>NOCO Boost Plus Jump Starter Box for $99.95 (Save $26)</li><li>Fitbit Charge 5 from $119.25 (Save $60 to $60.70)</li><li>Airthings Corentium Home Radon Detector for $131.99 (Save $67.96)</li><li>Apple 2021 TV 4K from $159.99 at checkout (Save $19.01)</li><li>Apple AirPods Pro for $197 (Save $52)</li><li>eufy by Anker RoboVac G30 Robot Vacuum for $229.99 with coupon (Save $90)</li><li>Apple 2020 iPad Air 256 GB for $649.99 (Save $99.01)</li><li>Samsung 75-Inch Class Neo QLED QN90A 4K UHD Quantum HDR Smart TV for $2,597.99 (Save $902)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}