{"date": "2021-09-01 08:05:47+00:00", "ticker": "III", "mrkt_info": {"open": 1337.5, "close": 1338.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><h4>\n      3i-backed Havea accelerates the international growth of Aragan with the acquisition of ixX in Belgium\n    </h4><p><strong>3i Group plc ('3i') today announces that Havea Group ('Havea'), one of the European leaders in natural health products, has acquired ixX pharma, a key Belgian player in food supplements.</strong></p><p>\n      Founded in 2005 by Danny Bral and René Zagers, ixX pharma is one of the leading independent players in the Belgian premium food supplements market based on its unique scientific approach and renowned products, including ImmunixX, J-ixX and PEA-ixX. Thanks to René Zagers and Danny Bral's commitment, ixX pharma has developed a large range of products in segments such as immunity, vitamins &amp; minerals, and pain relief. Brand awareness and recommendations by pharmacists have enabled ixX pharma to achieve a 14% organic topline CAGR with c.€12m of revenue in 2020.\n    </p><p>\n      Aragan is Havea's brand which specialises in the design and distribution in pharmacies of premium food supplements based on natural ingredients. The brand is mainly present in France and generates revenue of c.€30m.\n    </p><p>\n      By combining the expertise of Aragan in France and of ixX pharma in Belgium, Havea is supporting Aragan's international growth and capitalising on the common DNA of the two brands, which is based on a scientific approach and the naturality of their products. The acquisition of ixX pharma also builds on Havea's existing presence in Belgium, through Densmore &amp; Vitavea.\n    </p><p>\n      The combined entity will enable Havea to accelerate its growth ambition for Aragan, which now has revenue approaching €50m, through accelerated digitalisation and e-commerce, increasing 'medicalisation' of the brand, and a complementary brand offering with enhanced innovation capabilities.\n    </p><p>\n      Havea will leverage the expertise of the ixX pharma team, based in Nieuwkerken-Waas - in particular, Danny Bral, head of scientific research, development and marketing, René Zagers, commercial partner of the pharmacists for 40 years and Peter Coussement, head of operations - to continue to develop the brand. The transaction is expected to close in mid-September 2021.\n    </p><p>\n      Danny Bral and René Zagers, co-founders of ixX pharma said: 'We recently decided to start a new development phase for ixX pharma, by joining a partner capable of boosting the brand's growth. We are convinced that by joining Havea, ixX pharma will keep its unique identity while benefiting from the platform Havea has built for its brands.'\n    </p><p>\n      Nicolas Brodetsky, CEO of Havea commented: 'I am thrilled to welcome ixX pharma and its team to Havea and for Aragan and ixX pharma to join forces. Both brands share a very similar model based on pharmacists' advice. The brand awareness and expertise of ixX pharma in the Belgian food supplements markets will enable Havea to become a key player in Belgium, by leveraging the common DNA of ixX pharma and Aragan.'\n    </p><p>\n      Rémi Carnimolla, 3i France Managing Partner added: ' Only ten months after its last acquisition (of Calmosine), 3i is happy to support Havea with a new acquisition; the fifth acquisition in five years. The combination with ixX pharma is perfectly aligned with the group's strategy of developing an international platform in the high growth, food supplements markets, particularly in the premium segment.'\n    </p><p><strong><a href=\"https://www.3i.com/media/5391/havea-ixx-010921.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download this press release</a></strong></p><p><strong>-Ends-</strong><br/><br/></p><p><strong>For further information, contact:</strong></p><div class=\"story-table-container\"><table class=\"story-basic-table\"><tbody><tr><td><p><strong>3i Group plc</strong></p><p>\n              Kathryn van der Kroft\n            </p><p>\n              Media enquiries\n            </p><p>\n              Silvia Santoro\n            </p><p>\n              Shareholder enquiries\n            </p></td><td><p>\n              Tel: +44 20 7975 3021\n            </p><p>\n              Email: <a href=\"mailto:kathryn.vanderkroft@3i.com\" data-type=\"email\" translate=\"no\">kathryn.vanderkroft@3i.com</a></p><p>\n              Tel: +44 20 7975 3258\n            </p><p>\n              Email: <a href=\"mailto:silvia.santoro@3i.com\" data-type=\"email\" translate=\"no\">silvia.santoro@3i.com</a></p></td></tr></tbody></table></div><p><strong>Notes to editors:</strong></p><p><strong>About 3i Group</strong></p><p>\n      3i is a leading international investment manager focused on mid-market Private Equity and Infrastructure. Its core investment markets are northern Europe and North America. For further information, please visit: <a href=\"http://www.3i.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.3i.com</a></p><p><strong>About Havea</strong></p><p>\n      Havea Group develops, manufactures and sells a wide range of natural healthcare and wellness products, including dietary supplements, natural/organic cosmetics, medical devices and herbal teas. The Group's turnover (c.€200m) is largely generated by its 7 strategic brands (Aragan, Biolane, Densmore, Dermovitamina, Naturé Moi, Vitavea and Yves Ponroy) and its presence across all major distribution channels in France and in over 60 countries worldwide.\n    </p><p><strong>About ixX pharma</strong></p><p>\n      ixX pharma is a Belgian company specialised in the development and distribution of food supplements in Belgium and Luxembourg. Founded in 2005, ixX pharma offers innovative products, with a strong R&amp;D approach and based on solid scientific fundamentals to contribute to a healthier lifestyle.\n    </p><p><strong>Regulatory information</strong></p><p>\n      This transaction involved a recommendation of 3i Investments plc, advised by 3i France.\n    </p><div id=\"public_attachments\"><p><strong>Attachments</strong></p><ul class=\"bulleted-list arrowlist\"><li><a href=\"https://www.3i.com/media-centre/corporate-and-portfolio-news/2021/3i-backed-havea-accelerates-the-international-growth-of-aragan-with-the-acquisition-of-ixx-in-belgium/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a></li></ul></div><div id=\"public_disclaimer\"><p><strong>Disclaimer</strong></p><p><strong>3i Group plc</strong> published this content on <strong>01 September 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>01 September 2021 08:05:47 UTC</strong></p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - 3i Group plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: 3i-Group-plc</p></div>"}