{"date": "2022-02-24 13:00:01.864000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n<b>Airspan Networks’ 5G Network in a Box, Athonet Core on Display at AWS Experience at MWC 2022</b>\n</p><p>\n<span>Industrial and smart factory use case live demos to include mini-factory floor 1/50<sup>th</sup> to scale, robotic dogs</span>\n</p><p>\n<span>Airspan software now has the ability to run on AWS and AWS Snowball Edge</span>\n</p><p>\nThe telecommunications and cloud industries are experiencing an increase in interest from enterprises in numerous 5G private networks use cases. Airspan Networks Inc., a subsidiary of Airspan Networks Holdings Inc. (NYSE American: MIMO) and Athonet are demonstrating their use of Amazon Web Services (AWS) and edge computing technology to realize industrial and smart factory use cases through live demos at the AWS Experience booth at Mobile World Congress 2022 in Barcelona, Spain, February 28 – March 3.\n</p><p>\nAt its AWS Experiential Demos booth, Atrium, AWS will demonstrate a 5G Stand Alone Private Network using 100 MHz of n77 spectrum, leveraging the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.airspan.com%2Fnews%2Fairspan-networks-wins-two-2021-fierce-telecom-innovation-awards%2F&amp;esheet=52584943&amp;newsitemid=20220224005423&amp;lan=en-US&amp;anchor=Airspan+5G+Network+In+a+Box%2F5G+Starter+Kit+solution&amp;index=1&amp;md5=f56b21e3cc81e2e95aabfdf04712895a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Airspan 5G Network In a Box/5G Starter Kit solution</a> and the Athonet 5G mobile core. The Airspan 5G Starter Kit and Athonet solutions can run on both AWS Cloud and AWS Snowball Edge, a service providing secure, rugged devices to the network edge. The demo’s end-to-end 5G network solution includes two Airspan indoor OpenRANGE Air Velocity 2700 radios, an Air 5G Distributed Unit (DU) and Centralized Unit (CU), along with the Airspan Control Platform (ACP), a single platform to manage Airspan’s diverse portfolio of multi-technology products including 5G, 5G CBRS and Open RAN. The demo highlights how ISVs who offer 5G RAN and 5G Core functions can leverage the scalability of AWS and AWS cloud automation tools to quickly set up a private 5G network on AWS.\n</p><p>\nThe AWS showcase will demonstrate AWS’ ability to simplify private networks by offering scalability, simplicity of deployment and management, as well as how to automate critical smart factory applications and use cases, over a live network featuring Airspan’s 5G Starter Kit. To do so, the booth will feature a mini-smart factory floor – set to 1/50<sup>th</sup> scale, and a robotic dog.\n</p><p>\n“Combining the AWS Cloud and AWS edge compute technology with Airspan’s leadership in 5G private network deployments and the Athonet core is creating innovative 5G Private Network solutions and use cases for customers and partners that are scalable and critical for enterprises to monetize 5G technology,” said Airspan Chairman and CEO Eric Stonestrom.\n</p><p>\n“With the Athonet 5G architecture running on AWS we can bring up multi-vendor networks on-demand using the agility and simplicity of the AWS Cloud and Airspan’s innovative Open RAN radio solutions,” said Gianluca Verin, chief executive officer, Athonet. “The solution helps end users break free from technology lock-ins and deploy best-of-breed networks to suit their particular use case and budget.”\n</p><p>\n<b>About Airspan Networks</b>\n</p><p>\nAirspan Networks Holdings Inc. (NYSE American: MIMO) is a U.S.-based provider of groundbreaking, disruptive software and hardware for 5G networks, and a pioneer in end-to-end Open RAN solutions that provide interoperability with other vendors. As a result of innovative technology and significant R&amp;D investments to build and expand 5G solutions, Airspan believes it is well-positioned with 5G indoor and outdoor, Open RAN, private networks for enterprise customers and industrial use applications, fixed wireless access (FWA), and CBRS solutions to help mobile network operators of all sizes deploy their networks of the future, today. With over one million cells shipped to 1,000 customers in more than 100 countries, Airspan has global scale. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.airspan.com%2F&amp;esheet=52584943&amp;newsitemid=20220224005423&amp;lan=en-US&amp;anchor=www.airspan.com&amp;index=2&amp;md5=569168c4b3fcda26a87369caf7cd3eaf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.airspan.com</a>.\n</p><p>\n<b>About Athonet</b>\n</p><p>\nAthonet is a leader in private cellular network technology delivering a mobile core to enterprises and communication service providers to connect applications, devices and radios. With more than 10 years of experience in delivering 4G/5G mobile core solutions to customers and partners in every region of the world, Athonet supports key industries where network control, mobility, security, performance, and cost are important for business outcomes. Find out more <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.athonet.com&amp;esheet=52584943&amp;newsitemid=20220224005423&amp;lan=en-US&amp;anchor=www.athonet.com&amp;index=3&amp;md5=12e72879cb1a9c6f69096acb05789cf2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.athonet.com</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220224005423r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMjI0MDA1NDIzcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=6619372d9b19ec1af120a1161df79923b390bdd942aae91166746209c2ee45faf427b4f928fd2a4068c11cd37327129a8c60640976d569177bdccbdedb829f42\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220224005423/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220224005423/en/</a></span></p><p>\n<b>Airspan Media Contact: \n</b><br/>Howie Waterman\n<br/>Head of Media Relations\n<br/><a href=\"mailto:hwaterman@airspan.com\" data-type=\"email\" translate=\"no\">hwaterman@airspan.com</a><br/>917-359-5505\n</p><p>\n<b>Athonet Media Contact: \n</b><br/>Kris Kozamchak\n<br/><a href=\"mailto:kris.kozamchak@ext.athonet.com\" data-type=\"email\" translate=\"no\">kris.kozamchak@ext.athonet.com</a><br/>214-536-1098\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: FL-AIRSPAN-NETWORKS</p></div>"}