{"date": "2021-11-02 19:32:25.287000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce retailer Amazon has revealed plans to open two new logistics centres in Italy that will be operational in autumn this year.</p><p>As part of this plan, the retailer will establish a fulfilment centre in Novara and a sortation centre in Spilamberto (MO).To be located in Agognate, a hamlet of Novara municipality in Piedmont region, the fulfilment centre will create up to 900 jobs within three years of the launch of the site.The site will be complete with advanced Amazon Robotics technology.The Spilamberto (MO) sortation centre will be the second building of this type opened by Amazon in Emilia Romagna region after the Castel San Giovanni facility. It will create more than 200 new permanent jobs within 2023.The retailer invested more than ?230m in this project.Amazon EU operations VP Stefano Perego said: \"We are proud and excited to expand our operation with two new facilities in Piedmont and Emilia-Romagna.\"This new investment is another sign of our commitment to the people and communities of Italy, creating 1,100 new permanent jobs and helping us deliver to even more customers across the country.\"I would like to highlight we implemented over 150 safety measures to face the Covid emergency, ensuring we can continue to serve communities while taking care of our employees.\"Amazon, which entered Italy in 2010, has already invested more than ?5.8bn and employs 8,500 people in the country.Despite the pandemic, the retailer opened two new fulfilment centres in Castelguglielmo / San Bellino, Rovigo and in Colleferro, Rome in 2020.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}