{"date": "2021-12-16 00:04:45+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3381.83, "close": 3377.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Dawn Chmielewski</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Dec 15 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The banker who advised some of the biggest media mergers of 2021 said on Wednesday he was exploring ways to accept cryptocurrency as payment for services, a powerful endorsement of the budding digital currency.</p><p>LionTree Chairman and CEO Aryeh Bourkoff cited the example of a group of individuals pooling $40 million worth of ether cryptocurrency to <span class=\"tr-strong\">attempt to </span>acquire a privately owned copy of the U.S. Constitution at auction, and donate the document to a museum.</p><p>“I love this story not only because I agree that an original copy of the U.S. Constitution should be accessible to all Americans,” Bourkoff wrote, in an annual letter that lays out his financial predictions for the coming year. “But because it epitomizes the potential of the new economy: cutting-edge technology at the service of communities who can act upon their shared ideas not only recreationally, but in ways that create lasting value.”</p><p>Bourkoff said cryptocurrency holds the potential of fulfilling the internet’s promise of empowering individuals. But there are hurdles to overcome first,  he wrote, including developing platforms and user interfaces that are easy to use, to expand its appeal beyond a largely male, tech-savvy early-adopter set.</p><p>The technology needs to become more energy efficient, he said, noting that a single transaction using ethereum technology requires as much electricity as an average U.S. home uses in a week.  Regulators will need to find a response to a currency that is explicitly marketed as an alternative to government-issued currency.</p><p>“Globally, countries will have to balance regulation and innovation, and weigh their desire to attract the next generation of entrepreneurs against their urge for control 14 through centralized currencies,” wrote Bourkoff.</p><p>LionTree was involved in several of the year’s biggest media transactions, advising AT&amp;T Inc<a href=\"reuters://REALTIME/Verb=FullQuote/ric=T.N\" data-type=\"ric\" data-ric=\"T.N\" translate=\"no\" dir=\"ltr\">T.N</a> on its proposed merger of WarnerMedia with Discovery Inc<a href=\"reuters://REALTIME/Verb=FullQuote/ric=DISCA.O\" data-type=\"ric\" data-ric=\"DISCA.O\" translate=\"no\" dir=\"ltr\">DISCA.O</a>, guiding MGM<a href=\"reuters://REALTIME/verb=Headlines/ric=MGMYR.UL\" data-type=\"newsExpression\" data-expression=\"MGMYR.UL\" translate=\"no\" dir=\"ltr\">MGMYR.UL</a>  through its planned $8.45 billion sale to Amazon.com Inc<a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>  and advising ViacomCBS on the planned sale of Simon &amp; Schuster for $2.175 billion.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Dawn Chmielewski in Los Angeles; additional reporting by Krystal Hu in New York; Editing by David Gregorio)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:K.Li@thomsonreuters.com\" data-type=\"email\" translate=\"no\">K.Li@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: DEALS-LIONTREE/CRYPTO-CURRENCY</p></div>"}