{"date": "2021-11-01 14:10:21.503000+00:00", "ticker": "AAF", "mrkt_info": {"open": 110.0, "close": 110.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 9421QAirtel Africa PLC01 November 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Airtel Africa and UNICEF announce multi-million dollar partnership to scale-up digital learning for children across Africa</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>NEW YORK / NAIROBI,</span>\n</span>\n<span>\n<span>1 November <span>2021</span>\n</span>\n</span>\n<span>\n<span>-</span>\n</span>\n<span>\n<span>\n</span>\n<span>Airtel Africa and UNICEF announced today a five-year pan-African partnership to help accelerate the roll-out of digital learning through connecting schools to the internet and ensuring free access to learning platforms across 13 countries. By providing equal access to quality digital learning, particularly for the most vulnerable children, the partnership will help to ensure that every child reaches their full potential.</span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Airtel Africa, a leading provider of telecommunications and mobile money services in Africa, is the first African private sector partner to make a multimillion-dollar commitment to 'Reimagine Education', a global initiative launched by UNICEF in 2020 calling for public and private sector investment in digital learning as an essential service for every child and young person across the globe. This initiative aims to to give children a chance to catch up on their learning needs amid the ongoing global pandemic.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"Hundreds of millions of children in Africa have seen their education disrupted or put on hold because of the COVID-19 pandemic,\" said UNICEF Executive Director Henrietta Fore. \"By championing digital education for children in Africa, this partnership with Airtel Africa will help put children's learning back on track.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Airtel Africa's financial and in-kind contribution for this partnership is $57 million over five years to 2027. The programme will call on technology and expertise, in addition to direct financial support to connect schools and communities to the internet, enable free access to online educational content for learners. It will also provide vital data insights to inform UNICEF's work to scale-up digital learning and help ensure it is sustainable and meets students' needs across Africa <span>.</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"As a business, we have focused on education as a key area of our corporate social responsibility, and we are delighted that this partnership with UNICEF will enable us to accelerate results. It also coincides with the launch of our new sustainability strategy, which lays out our commitment to education,\" said Olusegun Ogunsanya, CEO of Airtel Africa</span>\n<span>.</span>\n<span>\"We are excited to be working with UNICEF to advance the education agenda on the continent through facilitating connectivity and online access to play a role in driving change,\" he added.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Airtel Africa and UNICEF pan-African partnership will benefit learners in Chad, Congo, Democratic Republic of the Congo, Gabon, Kenya, Madagascar, Malawi, Niger, Nigeria, Rwanda, Tanzania, Uganda and Zambia.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>****</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>About UNICEF</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>UNICEF promotes the rights and wellbeing of every child, in everything we do. Together with our partners, we work in 190 countries and territories to translate that commitment into practical action, focusing special effort on reaching the most vulnerable and excluded children, to the benefit of all children, everywhere. For more information about UNICEF and its work for children, visit</span>\n<span>\n<a href=\"http://www.unicef.org\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.unicef.org</a>\n</span>\n<span>. Follow UNICEF in Africa on Twitter and Facebook.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>About Airtel Africa</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Airtel Africa is a leading provider of telecommunications and mobile money services, with a presence in 14 countries in Africa, primarily in East Africa and Central and West Africa. Airtel Africa offers an integrated suite of telecommunications solutions to its subscribers, including mobile voice and data services as well as mobile money services both nationally and internationally. The Group aims to continue providing a simple and intuitive customer experience through streamlined customer journeys.</span>\n</p>\n<p>\n<span>\n<span>UNICEF does not endorse any company, brand, product or service.</span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>For more information, please contact:</span>\n</span>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Michael Okwiri | Vice President - Corporate Communications &amp; CSR | Airtel Africa plc|</span>\n</p>\n<p>\n<span>Tel: +254 73325 3080 |</span>\n<span>\n<a href=\"mailto:Michael.okwiri@africa.airtel.com\" data-type=\"email\" translate=\"no\">Michael.okwiri@africa.airtel.com</a>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Malene Jensen | UNICEF Regional Chief of Communication| Eastern &amp; Southern Africa</span>\n</p>\n<p>\n<span>Tel: +254 797 048 529 |</span>\n<span>\n<a href=\"mailto:mjensen@unicef.org\" data-type=\"email\" translate=\"no\">mjensen@unicef.org</a>\n</span>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Sandra Bisin | UNICEF Regional Communication Advisor | West &amp; Central Africa</span>\n</p>\n<p>\n<span>Tel: +221 77 819 2300 |</span>\n<span>\n<a href=\"mailto:sbisin@unicef.org\" data-type=\"email\" translate=\"no\">sbisin@unicef.org</a>\n</span>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by Reach, the non-regulatory press release distribution service of RNS, part of the London Stock Exchange. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .Reach is a non-regulatory news service. By using this service an issuer is confirming that the information contained within this announcement is of a non-regulatory nature. Reach announcements are identified with an orange label and the word \"Reach\" in the source column of the News Explorer pages of London Stock Exchange's website so that they are distinguished from the RNS UK regulatory service. Other vendors subscribing for Reach press releases may use a different method to distinguish Reach announcements from UK regulatory news.RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>NRABBBJTMTIMBPB</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}