{"date": "2021-11-15 12:11:57.345000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Nov. 14 -- The Madhya Pradesh Police claims to have busted an interstate drug peddling gang that was using Amazon's e-commerce website for moving more than 1000 kg of marijuana from Visakhapatnam in Andhra Pradesh to three states.</p><p>Two Bhind residents Suraj Pawaiya and Vijendra Singh Tomar were arrested with 20 kg of Marijuana from a road side eatery at Gohad, said Manoj Kumar Singh,the Bhind police chief.</p></div><div class=\"tr-npp-body\"><p>\"These two accused are part of a drug peddling gang which has a network across the nation. Police are trying to nab the other four identified and six unidentified accused,\" Singh said.</p><p>\"A company registered in 2007 as an Ahmedabad-based textile firm, Babu Tex Private Limited, which used to sell Marijuana as stevia dry leaves. Acting on a tip-off, police raided a Dhaba in Gohad of Bhind and recovered packaging material of amazon e-commercial company and two air tickets from Visakhapatnam to Delhi,\" said Singh.</p><p>Police claims that during interrogation, Pawaiya revealed that they used to send marijuana from Visakhapatnam to agents at Bhind, Agra, Delhi, Gwalior and Kota. \"The supply used to be suspended most of the time and would resume when it was bought by the agents. On the site, the price of 2 Kg leaves was shown as Rs.180 and the payment used to be done online,\" said Om Prakash Mishra, in-charge, Gohad police station.</p><p>Police said that over one tonne of marijuana, estimated to be worth Rs.1.1 crore, had already been transported through the e-commerce site. Police added that they were trying to nab the other accused to get to the source of Marijuana and to other suppliers and agents.</p><p>Police also wrote to Amazon asking them to explain if there was any method of verifying the sellers because it could be conveniently misused for illegal trade. \"If any person from the verification team is found involved, we will book that person too,\" said Singh.</p><p>No one from Amazon has responded so far despite attempts. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}