{"date": "2021-03-22 07:00:02.351000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3449.0, "close": 3390.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\"><p class=\"xn-distributor\">Canada NewsWire</p><p class=\"xn-dateline\">LONDON and SAN LEANDRO, Calif., March 22, 2021</p></div><div class=\"xn-content\"><p><span>Industrial Software Market Leaders Introduce 'Performance Intelligence' to create Industrial </span><span>Software and Data Leadership</span></p><p><span class=\"xn-location\">LONDON</span> and <span class=\"xn-location\">SAN LEANDRO, Calif.</span>, <span class=\"xn-chron\">March 22, 2021</span> /CNW/ -- <a href=\"https://www.aveva.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AVEVA</a>, a global leader in engineering and industrial software, has joined forces with <a href=\"https://www.osisoft.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">OSIsoft</a> to meet the expanding information management needs of industrial companies and accelerate their digital transformation. The combined portfolio brings OSIsoft's world-class data management together with AVEVA's leading industrial software to unlock <span>Performance Intelligence</span>. </p><p>Providing greater operational agility and resilience, <span>Performance Intelligence</span> connects information and artificial intelligence (AI) with human insight, to enable faster and more accurate decision making, helping industries boost sustainability. By pairing the trusted capabilities of OSIsoft's PI System with the leading industrial software of AVEVA, <span>Performance Intelligence</span> gives the people behind essential processes the rich, reliable data they need to better measure and understand the entire industrial lifecycle. Areas where <span>Performance Intelligence</span> is likely to have the most impact will include organizational productivity, operational agility, and sustainability.</p><p>The global big data and analytics market is growing exponentially and projected to be worth <span class=\"xn-money\">$274 billion</span> by 2022. Staying ahead of the curve requires a new understanding of the scope and scale of industrial information to leverage that data effectively. Insight into industrial information from edge to enterprise reduces downtime, production costs, and energy consumption – optimizing resources and driving sustainability. Our combined software portfolio is driving digital transformation for over 20,000 customers globally, operational efficiency to empower people, industries, and communities. </p><p><span class=\"xn-person\">Craig Hayman</span>, CEO at AVEVA, said, \"Together we're redefining the capabilities of industrial software. Through Performance Intelligence, we can see worlds of data from bold new angles, and inspire better understanding of complex value chains, to boost performance and drive sustainability. The combined impact of AVEVA and OSIsoft will enable our customers to manage complex industries more efficiently. Our expanded capabilities elevate AVEVA's commitment to deliver operational agility that turns opportunity into business value for our customers.\"   </p><p><span class=\"xn-person\">Phil Aiken AM</span>, Chairman, AVEVA Group commented, \"'AVEVA's sustained performance and growth has laid the groundwork that enables the acquisition of a market leader such as OSIsoft. Our joint portfolio of offerings and potential new capabilities will help deliver AVEVA's long-term strategy for growth and market leadership in industrial software and information management by accelerating the solid growth trajectory and continuing to help customers on their digitalization journeys.\" </p><p>Also commenting on today's announcement, CEO and Chairman of Schneider Electric, supporting major shareholder and alliance partner of AVEVA, <span class=\"xn-person\">Jean-Pascal Tricoire</span>, said, \"AVEVA and OSIsoft joining forces creates an industrial software and data leader. Through its extended ecosystem and broader, deeper portfolio, AVEVA delivers an enhanced level of efficiency to support the digital transformation of industries. We support AVEVA's agnostic approach, working in collaboration with customers and partners to offer integrated solutions that elevate performance and operational agility.\"</p><p>\"We stand in awe of the innovation of our customers – the people who operate our society's essential industries –  who use our technology every day to improve performance, protect health and safety, keep the lights on and make the world run more smoothly,\" said OSIsoft  founder, Dr. J. <span class=\"xn-person\">Patrick Kennedy</span>. \"They have inspired us to join forces with AVEVA so that we can broaden our scope and increase the value we can bring to their important work.\" </p><p>\"This acquisition is a major milestone for AVEVA, enabling our team to draw on Dr. J <span class=\"xn-person\">Patrick Kennedy's</span> vast leadership experience and domain expertise. We are honored to continue the journey together with Pat in his new role as Chairman Emeritus. With <span>Performance Intelligence,</span> we can confidently say that AVEVA is paving the way to become <span>the</span> industrial software and data leader, heralding the start of an exciting new chapter for the industrial software market,\" concluded Hayman. </p><p><b>About AVEVA<br/></b>AVEVA, a global leader in industrial software, drives digital transformation for industrial organizations managing complex operational processes. Through Performance Intelligence, AVEVA connects the power of information and artificial intelligence (AI) with human insight, to enable faster and more accurate decision making, helping industries to boost operational delivery and sustainability. Our cloud-enabled data platform, combined with software that spans design, engineering and operations, asset performance, monitoring, and control solutions, delivers proven business value and outcomes to over 20,000 customers worldwide, supported by the largest industrial software ecosystem, including 5,500 partners and 5,700 certified developers. AVEVA is headquartered in <span class=\"xn-location\">Cambridge, UK</span>, with over 6,000 employees at 90 locations in more than 40 countries. For more details visit: <a href=\"http://www.aveva.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a></p><p>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies. </p><p><a href=\"mailto:External.communications@aveva.com\" data-type=\"email\" translate=\"no\">External.communications@aveva.com</a>   </p><p> </p><p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=LN16021&amp;sd=2021-03-22\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1MTjE2MDIxJnNkPTIwMjEtMDMtMjI=&amp;key=5c640143eba03a9a7463c8bd3f3c7f1d41c2ba60bfb940d6c15e8dbc756b559567d1fffe0c7bed7c7ee0c7ad389b6d5f1e4c0dbe38a9d7bcab84bec321c2b322\"/></div></div> View original content:<a href=\"http://www.prnewswire.com/news-releases/aveva-and-osisoft-combine-to-unlock-the-potential-of-data-to-drive-increased-performance-for-industrial-organizations-301252419.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.prnewswire.com/news-releases/aveva-and-osisoft-combine-to-unlock-the-potential-of-data-to-drive-increased-performance-for-industrial-organizations-301252419.html</a><p></p><p>SOURCE  AVEVA</p><div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p></p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=C4442&amp;sd=2021-03-22\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1DNDQ0MiZzZD0yMDIxLTAzLTIy&amp;key=2790af4fd670d21729565a6d6fc0efa3df0b06450fb145246c955e7afe2a831065d0b7b3291f64737cd5065feca88fc7ffda1068485225f97e02a168c3f72c3c\"/></div></div> View original content: <a href=\"http://www.newswire.ca/en/releases/archive/March2021/22/c4442.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/March2021/22/c4442.html</a><p></p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright CNW Group Ltd. 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AVEVA-OSIsoft</p></div>"}