{"date": "2021-12-22 14:43:20.527000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Dec 22, 2021</p></div><div class=\"tr-npp-lead\"><p><span>Cousins Properties</span><a href=\"https://www.zacks.com/stock/quote/CUZ\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CUZ</a> is witnessing solid demand for its properties from both new and existing tenants as indicated by its recent leasing activities.The company secured a 330,000-square-foot lease deal with<span>Amazon</span><a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> to occupy 100% of its Domain 9 development in Austin, TX. Amazon intends to occupy the new space in three phases, commencing first-quarter 2024.Moreover, Cousins Properties signed two leases for an aggregate of 95,000 square feet at its 100 Mill office development in Downtown Tempe, AZ. With this, the development, which is slated for delivery in the first half of 2022, is 80% preleased. This project is being developed by a joint venture in which Cousins Properties has a 90% ownership stake, while Hines owns the remaining 10% interest.A 63,000-square-foot expansion lease has been signed by Amazon for 100 Mill, leading its total square footage at the property to 158,000 square feet. The move comes as part of Amazon's growth plans for its Phoenix Tech Hub. In the first half of 2022, Amazon plans to occupy the initial 95,000 square feet and in the second half of 2022, it plans to occupy 63,000 square feet of expansion space. The other one at 100 Mill is a new 32,000-square-foot lease signed by a growing technology firm based in San Francisco — LiveRamp — for its new hub, thereby marking its foray into the Phoenix market.Demand for office space is strong both at Domain in Austin, TX and at 100 Mill in Tempe, AZ. With the latest development, Cousins Properties' 2.5-million-square-foot Domain portfolio is 99.7% leased. Also, with the availability of talent pool and easy accessibility, an increasing number of technology companies from the West Coast are choosing Phoenix as a market for expansion. Amid these, the leasing pipeline for residual space at 100 Mill remains strong.Cousins Properties has an unmatched portfolio of class A office assets concentrated in the high-growth Sun Belt markets. This region is experiencing a population influx. Hence, amid favorable migration trends and a pro-business environment, corporate relocations and expansions in the Sun Belt markets have been prominent, thereby driving demand for office space.Assets in these markets are also anticipated to command higher rents compared with the broader market. Hence, CUZ's leading trophy portfolio of class A and highly amenitized office realties across the Sun Belt region is positioned to benefit from the emerging trend.However, the office real estate market has been significantly affected by the pandemic, and the flexible working environment and its recovery is likely to be prolonged. Shares of this Zacks Rank #4 (Sell) company have rallied 4.4% over the past six months compared with the <a href=\"https://www.zacks.com/stocks/industry-rank/industry/reit-and-equity-trust-other-266\" data-type=\"url\" class=\"tr-link\" translate=\"no\">industry</a> 's growth of 7.1%. You can see <a href=\"https://www.zacks.com/stocks/buy-list/?ADID=zp_1link&amp;ICID=zpi%20_1link\"><span>the complete list of today's Zacks #1 Rank (Strong Buy) stocks here</span></a> .</p><p>Image Source: Zacks Investment Research</p></div><div class=\"tr-npp-body\"><p>Amazon carries a Zacks Rank of 5 (Strong Sell) at present. The long-term growth rate for Amazon is projected at 24.7%.The Zacks Consensus Estimate for AMZN's 2021 earnings per share has been revised 2.4% downward in a month.</p><p class=\"tr-npp-section-title\">Stocks to Consider</p><p>Some better-ranked stocks from the REIT sector include<span>Prologis, Inc.</span><a href=\"https://www.zacks.com/stock/quote/PLD\" data-type=\"url\" class=\"tr-link\" translate=\"no\">PLD</a> and<span>Rexford Industrial Realty, Inc.</span><a href=\"https://www.zacks.com/stock/quote/REXR\" data-type=\"url\" class=\"tr-link\" translate=\"no\">REXR</a> .Prologis holds a Zacks Rank of 2 at present. 2021 funds from operations (FFO) per share for Prologis will likely increase 8.4% year over year.The Zacks Consensus Estimate for PLD's 2021 FFO per share has been revised marginally upward in a month.The Zacks Consensus Estimate for Rexford Industrial's ongoing-year FFO per share has moved 4.5% north to $1.63 over the past two months.The Zacks Consensus Estimate for Rexford Industrial's 2021 FFO per share suggests an increase of 23.5% year over year. Currently, REXR carries a Zacks Rank of 2.Note: <span>Anything related to earnings presented in this write-up represents funds from operations (FFO) — a widely used metric to gauge the performance of REITs</span> .</p><p><span>Breakout Biotech Stocks with Triple-Digit Profit Potential</span></p><p>The biotech sector is projected to surge beyond $2.4 trillion by 2028 as scientists develop treatments for thousands of diseases. They're also finding ways to edit the human genome to literally erase our vulnerability to these diseases.</p><p>Zacks has just released Century of Biology: 7 Biotech Stocks to Buy Right Now to help investors profit from 7 stocks poised for outperformance. Recommendations from previous editions of this report have produced gains of +205%, +258% and +477%. The stocks in this report could perform even better.</p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/4e87?add=1725&amp;adid=NEWSTEX_CONTENT_ZU_BIOTECHREPORT_ANALYSTBLOG_255_12222021&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_finance_sector-1842160\" data-type=\"url\" class=\"tr-link\" translate=\"no\">See these 7 breakthrough stocks now &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_255&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_finance_sector-1842160\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_255&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_finance_sector-1842160\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=PLD&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_255&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_finance_sector-1842160\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Prologis, Inc. (PLD): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=CUZ&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_255&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_finance_sector-1842160\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Cousins Properties Incorporated (CUZ): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZR_LINK&amp;d_alert=rd_final_rank&amp;t=REXR&amp;ADID=NEWSTEX_CONTENT_ZR_ARTCAT_ANALYSTBLOG_255&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_finance_sector-1842160\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Rexford Industrial Realty, Inc. (REXR): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/stock/news/1842160/cousins-properties-cuz-signs-lease-with-amazon-liveramp?cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_finance_sector-1842160\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p><a href=\"http://www.zacks.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Investment Research</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}