{"date": "2021-12-24 18:01:50.070000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3421.37, "close": 3413.22}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Dec 24, 2021</p></div><div class=\"tr-npp-lead\"><p>Investors interested in stocks from the Internet - Commerce sector have probably already heard of JD.com, Inc. (JD) and Amazon (AMZN). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.</p><p>Everyone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits.</p></div><div class=\"tr-npp-body\"><p>Currently, JD.com, Inc. has a Zacks Rank of #2 (Buy), while Amazon has a Zacks Rank of #5 (Strong Sell). The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that JD has an improving earnings outlook. But this is just one piece of the puzzle for value investors.</p><p>Value investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels.</p><p>The Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value.</p><p>JD currently has a forward P/E ratio of 41.48, while AMZN has a forward P/E of 83.88. We also note that JD has a PEG ratio of 1.54. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. AMZN currently has a PEG ratio of 3.40.</p><p>Another notable valuation metric for JD is its P/B ratio of 2.39. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, AMZN has a P/B of 14.39.</p><p>These are just a few of the metrics contributing to JD's Value grade of B and AMZN's Value grade of F.</p><p>JD stands above AMZN thanks to its solid earnings outlook, and based on these valuation figures, we also feel that JD is the superior value option right now.</p><p><span>More Stock News: This Is Bigger than the iPhone!</span></p><p>It could become the mother of all technological revolutions. Apple sold a mere 1 billion iPhones in 10 years but a new breakthrough is expected to generate more than 77 billion devices by 2025, creating a $1.3 trillion market.</p><p>Zacks has just released a Special Report that spotlights this fast-emerging phenomenon and 4 tickers for taking advantage of it. If you don't buy now, you may kick yourself in 2022.</p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/4e87?add=1669&amp;adid=NEWSTEX_CONTENT_ZU_IOTREPORT_TALEOFTAPE_512_12242021&amp;cid=CS-NEWSTEX-FT-tale_of_the_tape%7Cyseop_template_3-1843395\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click here for the 4 trades &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_TALEOFTAPE_512&amp;cid=CS-NEWSTEX-FT-tale_of_the_tape%7Cyseop_template_3-1843395\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZR_LINK&amp;d_alert=rd_final_rank&amp;t=JD&amp;ADID=NEWSTEX_CONTENT_ZR_ARTCAT_TALEOFTAPE_512&amp;cid=CS-NEWSTEX-FT-tale_of_the_tape%7Cyseop_template_3-1843395\" data-type=\"url\" class=\"tr-link\" translate=\"no\">JD.com, Inc. (JD): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_TALEOFTAPE_512&amp;cid=CS-NEWSTEX-FT-tale_of_the_tape%7Cyseop_template_3-1843395\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/stock/news/1843395/jd-vs-amzn-which-stock-is-the-better-value-option?cid=CS-NEWSTEX-FT-tale_of_the_tape%7Cyseop_template_3-1843395\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}