{"date": "2021-07-01 13:25:36.022000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3727.0, "close": 3809.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ENPNEWSWIRE-(C)2021 ENPUBLISHING</p><p>Release date- 30062021 - The New Connected Build Solution Optimizes Project Efficiency and Improves Sustainability Outcomes for Capital Projects Across the Power, Energy, Chemicals and Mining Industries.</p></div><div class=\"tr-npp-body\"><p>AVEVA, a global leader in industrial software driving digital transformation and sustainability, has formed a new alliance with Wood, the global consulting and engineering company, to accelerate digital transformation of industries such as power, energy, chemicals and mining with the launch of a new solution called Connected Build, a key part of their Digital Twin offering . Wood has standardized its use of AVEVA Enterprise Resource Management as a key component of the Connected Build offering to its industrial clients globally.</p><p>Connected Build optimizes project delivery while improving collaboration on new build projects and facilitating the digital modernization of existing plants and refurbishments. The new solution capitalizes on design efficiencies to deliver the build accurately the first time, unlocking sustainability and value benefits while ensuring worker safety. As part of Wood's vision for operational excellence, leveraging technology to standardize and optimize delivery is key to achieving efficiencies and to meet sustainability targets.</p><p>The new Connected Build solution is a key part of Wood's Engineering Digital Twin strategy by sharing project status and materials availability data in real-time with all stakeholders, optimizing project execution through benefits such as improved labor productivity, reduced material waste and costs, shortened project cycles and improved yield. When applied to the engineering and build phases, the Connected Build approach results in rapid and seamless project handover, while shortening time to production and improving digital resiliency for Wood's clients.</p><p>'New operating environments call for dynamic new engineering solutions. AVEVA is a strong supporter of Wood's bold innovation vision of delivering reliable and reproducible capital project efficiencies and operations optimization in the industrial space. With Connected Build, AVEVA and Wood are realizing value for customers across diverse industries and geographies through data-driven digital transformation,' said Amish Sabharwal, Executive Vice President, Engineering Business, AVEVA.</p><p>'The AVEVA-Wood alliance combines engineering with execution technology and expertise to deliver the perfect mix of enhanced project efficiency, sustainability and operational agility for our clients across the power generation and transmission, energy, chemicals, and mining industries,' says Darren Martin, Group CTO, Wood.</p><p>Initial deployments of Wood's Connected Build Digital Twin have set a new benchmark for digital engineering, boosting safety, and improving overall asset performance while delivering savings on the total cost of the project and an additional saving in operations and maintenance.</p><p>AVEVA and Wood share a significant history of innovation. Wood has previously integrated its own Go-Technology commissioning solution into its use of the AVEVA Engineering Design software suite. To support the rapid acceleration of their Connected Build offering, Wood has standardized AVEVA Enterprise Resource Management to provide a single, coordinated platform approach across all stages of a project, from design and materials procurement, to construction, advanced work packaging, commissioning and completions.</p><p>Going forward, the two organizations will remain strategically aligned with a laser focus on delivering maximum value for shared clients through continuous technology improvements and developments.</p><p>About Wood</p><p>Wood is a global leader in consulting and engineering across energy and the built environment, helping to unlock solutions to some of the world's most critical challenges. We provide consulting, projects and operations solutions in more than 60 countries, employing around 40,000 people. www.woodplc.com</p><p>About AVEVA</p><p>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence. AVEVA's comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at www.aveva.com.</p><p>Copyright 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</p><p>Enquiries:</p><p>AVEVA Media Contacts</p><p>Rose Bambi</p><p>Senior Director Global PR and External Communications</p><p>Tel: +44 (0) 208 323 2789</p><p>rose.bambi@aveva.com</p><p>Caroline Stephens</p><p>Senior Global PR Manager</p><p>caroline.stephens@aveva.com</p><p>Catherine Singh</p><p>Global PR/Social Media Coordinator</p><p>catherine.singh@aveva.com</p><p>External Communications Alias</p><p>external.communications@aveva.com</p><p>[Editorial queries for this story should be sent to newswire@enpublishing.co.uk]</p><p>((Comments on this story may be sent to info@enpublishing.co.uk))</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 M2 Communications Ltd.</p></div>"}