{"date": "2021-11-11 14:31:04.657000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3576.23, "close": 3472.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article Aerospike Inc. and AWS  unveiled a new advertising technology (Ad Tech) industry solution designed to accelerate and optimize deployments of the Aerospike real-time data platform on Amazon Elastic Compute Cloud (Amazon EC2). Modern Ad Tech...</p><p>Aerospike Inc. and AWS  unveiled a new advertising technology (Ad Tech) industry solution designed to accelerate and optimize deployments of the Aerospike real-time data platform on Amazon Elastic Compute Cloud (Amazon EC2).</p></div><div class=\"tr-npp-body\"><p>Modern Ad Tech platforms race to buy, sell, and serve hundreds of billions, or even trillions of ads per day to the right customer. Workloads reach tens of millions of read and write events per second at or near petabyte scale. This scale of data use and throughput requires extreme and elastic capacity and predictable, linear, sub-millisecond performance.</p><p>The Aerospike real-time data platform enables organizations to act instantly across billions of transactions while reducing server footprint by up to 80 percent. Aerospike for Ad Tech on AWS enables customers to accelerate deployments using an AWS Quick Start guide, reference architectures, customer examples, prescriptive benchmarks, and cloud managed services for Ad Tech companies running Aerospike on Amazon EC2 instances.</p><p>\"Real-time data use is the lifeblood of digital advertising. Our real-time bidding (RTB) system has millions of ad requests per second, and we need low-latency access to lots of data to accurately respond to each one in milliseconds. If the platform fails to perform, scale or stall, advertisers instantly start losing opportunities and revenue,\" said Ram Kumar Rengaswamy, SVP of Engineering at FreeWheel, a Comcast company. \"The combination of Aerospike and AWS allowed us to build and optimize for the cloud, delivering an elastic, low-latency, automated and highly reliable real-time data platform that's managed by just a single engineer.\"</p><p>Earlier this year, Aerospike unveiled the industry's first petabyte scale database benchmark. Done in collaboration with AWS and Intel, the benchmark illustrates Aerospike's sub-millisecond performance at petabyte scale on a remarkably small 20-node cluster-hundreds of nodes less than other databases for a savings of up to $10 million per application.</p><p>\"Advertising technology businesses continue to see request volumes and throughput requirements soar, challenging infrastructure performance, maintenance and costs,\" said Amit Shah, Principal – Product Management, Amazon EC2 at AWS. \"As Ad Tech continues to push the limits of petabyte scale and millisecond latency workloads, customers can use this solution for Aerospike on AWS to reduce capital expenditures, innovate faster, and accelerate deployments to get to market faster.\"</p><p>Customers can subscribe to the Aerospike real-time data platform from the AWS Marketplace, and as part of the AWS ISV Accelerate Program. Amazon's global field sales will co-sell and support both Aerospike Cloud Managed Services and customer managed environments.</p><p>\"Real-time and reliable access to data is table stakes in Ad Tech and many other industries. In addition to the scale, speed and reliability of the combined Aerospike and AWS platform, organizations also get the business advantage of being able to use even more data, from the core to the edge, for better real-time decisioning,\" said Srini V. Srinivasan, Chief Product Officer and Founder, Aerospike. \"As real-time data platforms continue to permeate more industries, companies that select Aerospike and AWS early in their lifecycle can confidently grow their infrastructure with linear performance at any scale without the need for replatforming down the line.\"</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}