{"date": "2022-02-09 09:53:08+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>United Arab Emirates  - Bespin Global, a leading cloud consultancy and management company, today announced it has achieved the Amazon Web Services (AWS) Managed Service Provider (MSP) Partner Program designation. By passing the audit with the rigorous requirements the AWS Partner Network (APN) consultants must satisfy, the Bespin – Middle East team has once again demonstrated its local expertise in providing full lifecycle solutions to customers and reinforced Bespin Global’s position at the forefront of the Middle East market.</p>\n<p>The AWS MSP Partner Program recognizes leading AWS Partner Network (APN) Consulting Partners highly skilled at providing full lifecycle solutions to customers. Next-generation AWS MSPs enable organizations to invent tomorrow, solve business problems and support initiatives by driving key outcomes. Their expertise, guidance and services help companies through each stage of the cloud adoption journey. Bespin’s team of professional cloud services experts support clients in executing ambitious initiatives by allowing them to focus on their core business.</p>\n<p>Mouteih Chaghlil, CEO, Middle East &amp; Africa, said: “We are delighted to have successfully accomplished the AWS Managed Service Provider audited requirements. Being part of the program is a fundamental component for our managed services solutions offered to our clients. This demonstrates that we have the validated local expertise and tools to support businesses in their digital journey driven by national vision and ICT goals to transform the Middle East into a powerhouse of innovation.”</p>\n<p>The news follows Bespin winning AWS DevOps Partner of the Year in the Middle East and North Africa (MENA) for the second year in a row, along with other competencies including AWS Public Sector Authorized Solution provider. </p>\n<p>The AWS MSP Program validation process consists of a rigorous multi-day onsite audit. It aims to confirm the partner’s ability to bring next-generation managed services and capabilities in cloud architecture, automation, optimization, and management to clients’ AWS environments. The audit enables customers to confidently identify qualified AWS MSP Partners. Successfully completing it exhibits the partners broad capability across a broad and diverse suite of services and activities on AWS cloud services portfolio, that their business processes are acknowledged by and satisfy AWS high standards as well as that that they’re capable of delivering a high level of customer focus.</p>\n<p>-Ends-</p>\n<p><strong>ABOUT Bespin Global</strong></p>\n<p><span>Enabling domain-wide digital transformation, Bespin Global helps businesses accelerate cloud adoption with industry leading solutions and consulting expertise, delivering service-level-driven outcomes. Recognized since 2016 as a “Leader” in Gartner’s Magic Quadrant for Public Cloud Infrastructure Professional and Managed Services, Worldwide, and as a “Niche Player” in Gartner’s 2021 Magic Quadrant for IT Transformation Services, Bespin’s services include cloud strategy, migration, implementation, Big Data, DevOps, and FinOps. Supporting a customer-centric, multi-cloud approach, Bespin’s team provides in-depth expertise and global experience to help navigate the maze of services, solutions, and technologies on offer from various CSPs — including AWS. Bespin’s automated, end-to-end cloud management platform, OpsNow, helps customers consolidate, visualize, manage, and optimize distributed, multi-cloud assets, reducing costs by 30 per cent or more.</span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}