{"date": "2021-11-08 14:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Ben Klayman</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">DETROIT, Nov 8 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A union-affiliated pension fund advisor pressing Rivian on human rights and environment concerns in the electric vehicle startup's battery supply chain ahead of a blockbuster initial public offering said on Monday the company's response fell short of expectations.</p><p>SOC Investment Group Executive Director Dieter Waizenegger said he was disappointed in the lack of substance in the Irvine, California-based company's Oct. 29 response to earlier concerns the fund manager raised. SOC provided a copy of the letter to Reuters.</p><p>\"They sent us a lot of words, but it's really raising a lot of questions and we expect more substance than aspirations,\" Waizenegger said in an interview. \"It's particularly lacking on firm commitments to address critical environmental and human rights risks.\"     </p><p>As issues of environmental, social and corporate governance take on growing importance with investors, automakers have come under pressure to prove that such minerals as lithium and cobalt for their EV batteries are sourced without human rights abuses.            </p><p>Rivian, backed by Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Ford Motor Co <a href=\"reuters://REALTIME/Verb=FullQuote/ric=F.N\" data-type=\"ric\" data-ric=\"F.N\" translate=\"no\" dir=\"ltr\">F.N</a>, on Friday raised the offer price for the shares in its IPO, aiming for a valuation of as much as $65 billion. It now expects to raise nearly $10 billion on Tuesday. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2RW3XR\" data-type=\"storyId\" data-story-id=\"nL4N2RW3XR\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>In an Oct. 29 response to SOC, board member Rose Marcario said Rivian was committed to ethical and sustainable growth in the EV space.</p><p>\"We have already taken extensive measures to protect the environment and human welfare in the course of our business operations; we have always understood that we must grow our policies as we grow our company; and we are intent on setting new industry standards for human rights and environmental diligence,\" she said. </p><p>Marcario cited Rivian's plan to put 1% of equity in an environmental program aimed at helping address climate change and preserving wildlands and waterways, its intent to be climate neutral by 2032 for all emissions, a promise to release a full impact report in early 2023, a commitment by its battery supplier Samsung SDI <a href=\"reuters://REALTIME/Verb=FullQuote/ric=006400.KS\" data-type=\"ric\" data-ric=\"006400.KS\" translate=\"no\" dir=\"ltr\">006400.KS</a> not to use deep seabed mining, Rivian's supplier code of conduct, and more.   </p><p>SOC in an Oct. 20 letter called on Rivian to adopt policies to identify and prevent human rights risks and environmental impacts through its supply chain based on United Nations guiding principles for businesses. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2RG2C0\" data-type=\"storyId\" data-story-id=\"nL1N2RG2C0\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>In Monday's letter, Waizenegger said Rivian's supplier code of conduct was not publicly available, its position on deep seabed mining needed to be clarified, the startup needed to commit to disclosures around its efforts, and the fund manager was concerned Rivian's board might not be able to effectively oversee efforts in these issues.</p><p>A Rivian spokesperson said the company was not commenting further during the quiet period ahead of its IPO.</p><p>SOC, formerly known as CtW Investment Group, is an advisor for union pension funds that have more than $250 billion in assets. It has taken a more activist approach with such companies as Doordash <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DASH.N\" data-type=\"ric\" data-ric=\"DASH.N\" translate=\"no\" dir=\"ltr\">DASH.N</a>, Uber <a href=\"reuters://REALTIME/Verb=FullQuote/ric=UBER.N\" data-type=\"ric\" data-ric=\"UBER.N\" translate=\"no\" dir=\"ltr\">UBER.N</a> and Lyft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=LYFT.O\" data-type=\"ric\" data-ric=\"LYFT.O\" translate=\"no\" dir=\"ltr\">LYFT.O</a>, around issues including board diversity, executive pay and company stock structure. This is the first time SOC has approached an automaker about the battery supply chain.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Ben Klayman in Detroit; Editing by Daniel Wallis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:benjamin.klayman@thomsonreuters.com\" data-type=\"email\" translate=\"no\">benjamin.klayman@thomsonreuters.com</a> ; 313-600-2277; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://benjamin.klayman.thomsonreuters.com@reuters.net\">benjamin.klayman.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: RIVIAN-BATTERIES/INVESTORS (PIX)</p></div>"}