{"date": "2022-01-10 21:59:38.935000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Accord Financial Corp. announces the relaunch of AccordExpress, providing financial support for Canadian entrepreneurs throughout the export supply chain</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Accord Financial Corp. announces the relaunch of AccordExpress, providing financial support for Canadian entrepreneurs throughout the export supply chain</p>\n<p>Canada NewsWire</p>\n<p>TORONTO, Feb. 8, 2022</p>\n<p>\n<span>TORONTO</span> , <span>Feb. 8, 2022</span> /CNW/ - <span>Accord Financial Corp.</span> (TSX: ACD)</p>\n<p>Accord Financial Corp. (\"Accord\") today announced the relaunch of AccordExpress, Accord's unique small business financing program. For 2022, AccordExpress is tailored to support companies engaged all the way along the export supply chain. Direct exporters, as well as indirect exporters (companies supporting exporters with goods and services), are invited to apply.</p>\n<p>AccordExpress was a resounding success in 2021, bridging hundreds of Canadian businesses through to recovery. This innovative program continues to offer a simple, twenty-minute online application process with a proprietary credit model to approve and fund loans within two business days. The program delivers up to <span>$250,000</span> for working capital for qualified businesses, and up to <span>$1 million</span> if backed by equipment collateral, all with flexible terms designed to spur growth in 2022. Accord can also provide up to <span>$6.25 million</span> for qualified companies under the same program, following a more detailed credit review.</p>\n<p>AccordExpress is in part supported by the Export Development Canada (EDC) Trade Recovery Guarantee (TRG). Accord has a long history of cooperation with EDC; in 2021 the Company funded more than a thousand Canadian small businesses, supported by EDC's Business Credit Availability Program (\"BCAP\") Guarantee.</p>\n<p>AccordExpress now provides financing to companies throughout the supply chain: those supplying raw materials or components for export products, a wide range of service providers, transportation and logistics, and exporters directly. \"AccordExpress reflects our company's resolve to support economic recovery from coast to coast. Canadian entrepreneurs can lead <span>Canada</span> back to the forefront of global trade, they just need fast, flexible funding to get the job done,\" said <span>Simon Hitzig</span> , President and CEO.</p>\n<p>\"Entrepreneurs are the engine of the Canadian economy, creating employment and driving economic growth at home and abroad. AccordExpress fuels the supply chain and helps restore <span>Canada's</span> place in the global economy,\" states <span>James Jang</span> , President of Accord's small business division.</p>\n<p>\"Accord's commitment to Canadian entrepreneurs remains as strong as ever; we never stop developing simple, unique and innovative programs to keep our economy moving forward,\" adds Jang.</p>\n<p>For more details on how to become an Accord Financial client, companies are invited to visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3436554-1&amp;h=333862541&amp;u=https%3A%2F%2Faccordfinancial.com%2F&amp;a=accordfinancial.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">accordfinancial.com</a> or by emailing <a href=\"mailto:AccordExpress@accordfinancial.com\" data-type=\"email\" translate=\"no\">AccordExpress@accordfinancial.com</a> or calling 1 844 982 3010.</p>\n<p>\n<span>\n<span>About Accord Financial Corp.</span>\n</span>\n</p>\n<p>Accord Financial is <span>North America's</span> most dynamic commercial finance company providing fast, versatile financing solutions for companies in transition including asset-based lending, factoring, inventory finance, equipment leasing, trade finance and film/media finance. By leveraging our unique combination of financial strength, deep experience and independent thinking, we craft winning financial solutions for small and medium-sized businesses, simply delivered, so our clients can thrive.</p>\n<p>SOURCE Accord Financial Corp.</p>\n<p>View original content: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/08/c7808.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/08/c7808.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}