{"date": "2021-11-04 01:38:34.195000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Canada's main stock index retreated on Friday, as miners lost their footing on weaker bullion prices, while technology stocks tracked weakness in the U.S. tech-heavy Nasdaq. Uranium stocks were also under pressure after Cameco reported a quarterly loss that was worse than the Street expected.</p><p>At 9:33 a.m. ET, the Toronto Stock Exchange's S&amp;P/TSX composite index was down 105.62 points, or 0.5%, at 21,091.91.</p></div><div class=\"tr-npp-body\"><p>U.S. major indexes were mixed at the open, with the Dow slightly higher but the S&amp;P 500 and Nasdaq in negative territory.</p><p>Amazon and Apple earnings, released after the bell on Thursday, took the froth out of U.S. stock futures and world equities on Friday.</p><p>Apple slipped 3.5% in premarket trading after the iPhone maker warned the impact of supply chain disruptions will be even worse during the current holiday sales quarter, after supply woes cost $6 billion in sales in the last quarter.</p><p><a href=\"http://amazon.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com</a> Inc dropped 4.8% after the world's largest online retailer forecast downbeat holiday-quarter sales, as higher pay to attract workers and other operational disruptions diminish the company's windfall from online shopping.</p><p>\"Amazon and Apple are suggesting demand is strong but wage pressure is there, they won't be able to deliver what they want for Christmas,\" said Sebastien Galy, senior macro strategist at Nordea Asset Management.</p><p>\"That's affecting equities somewhat negatively.\"</p><p>The Toronto Stock Exchange's S&amp;P/TSX composite index ended 1.16% higher at 21,197.53 on Thursday, its biggest gain since June 1.</p><p>In economic news this morning, Statistics Canada said the economy was most likely flat in September, following a gain of 0.4% in August, with third quarter annualized GDP likely rising 1.9%.</p><p>As of September, Canada's GDP remains about 1% below pre-pandemic levels, Statistics Canada data showed. The August gain of 0.4% was behind analyst estimates of 0.7%.</p><p>The Bank of Canada on Wednesday forecast the Canadian economy would expand by 5.5% on a annualized basis in the third quarter, up from a 1.1% contraction in the second quarter.</p><p>Meanwhile, in U.S. economic data this morning, American consumers were found to have slowed their spending to a gain of just 0.6% in September, a cautionary sign for an economy that remains in the grip of a pandemic and a prolonged bout of high inflation.</p><p>At the same time, a key inflation barometer that is closely followed by the Federal Reserve surged 4.4% last month from a year earlier.</p><p>Friday's report from the Commerce Department also showed that personal incomes, which provide the fuel for spending, fell 1% in September, the biggest decline in four months. Wages have been rising in many sectors of the job market as employers struggle to find enough workers to fill jobs. But the expiration of emergency federal programs has subtracted from the nation's overall income.</p><p>Market participants have been closely watching how the corporate world navigates through these challenges along with concerns about rising inflation, after largely upbeat earnings reports so far helped investors look past a mixed batch of macro-economic data.</p><p>U.S. President Joe Biden was dealt a setback on Thursday as the House of Representatives abandoned plans for a vote on an infrastructure bill with progressives seeking more time to consider his call for a separate $1.75 trillion plan for social initiatives.</p><p>Analysts expects profits for S&amp;P 500 companies to grow 38.6% year-on-year in the third quarter, up from an expected 29.4% rise at the start of the earnings season, according to data from Refinitiv.</p><p>The tech gloom hit European stocks, which were down 0.42%.</p><p>The MSCI world equities index dipped 0.22% to 745.36, but broader optimism about economic recovery has put it on course for gains of 5% in October, within sight of record highs of 749.16 set last month.</p><p>Chinese blue chips bucked the trend and were up 0.92%, but an index of Chinese real estate firms lost 3.5%, and was down nearly 12% on the week, the most since February 2018.</p><p>Chinese developers are struggling with liquidity problems, and proposals to trial a property tax is not helping sentiment even as regulators seek to contain the fallout centered around embattled China Evergrande Group.</p><p>Evergrande's shares lost 3.7% on Friday despite news it had met its second dollar-bond repayment obligation this month.</p><p>Japan's Nikkei rose 0.25% ahead of Sunday's lower house election in which the ruling party is expected to lose seats but the coalition government should remain safe.</p><p><span>Equities</span> </p><p><span>Commodities</span> </p><p>Oil prices have erased earlier gains and are now trading lower. Rising U.S. inventories and the prospect of more Iranian exports are countering expectations that OPEC and its allies will keep supply tight.</p><p>Gold dipped as the U.S. dollar ticked higher, and investors looked for further guidance from the Federal Reserve's upcoming policy meet on tapering of economic support as inflation expectations rise.</p><p><span>Currencies and bonds</span> </p><p>The Canadian dollar has a softer tone this morning. The loonie spiked on the Bank of Canada's suggestion on Wednesday that it could start hiking interest rates as soon as April, but has since been consolidating near the 81 cents US level.</p><p><span>\"</span> The lack of follow-through demand since the mid-week BoC policy decision looks somewhat concerning from the CAD-bullish perspective; failing to react to an obviously positive impulse might suggest the CAD is over-stretched,\" forex strategists at Scotiabank said this morning. \"But, on the contrary, we still think there are ample reasons for the CAD to appreciate. Spreads remain very CAD-supportive as does the broader tone in commodity prices. Weakness in Canadian heavy crude prices this week are a marginal check against the CAD only at this point.\"</p><p>The yield on the benchmark 10-year U.S. Treasury yield is up slightly this morning, hovering near 1.6%. Economic reports released at 830 am ET had little impact, suggesting market participants weren't terribly surprised by the data.</p><p><span>Other corporate news</span> </p><p>Cameco Corp <a href=\"reuters://screen/verb=Open/url=cpurl%3A%2F%2Fapps.cp.%2FApps%2Fquotewebapi%3FRIC%3DCCO.TO\" data-type=\"cpurl\" data-cpurl=\"cpurl://apps.cp./Apps/quotewebapi?RIC=CCO.TO\" translate=\"no\">\\</a> reported a quarterly adjusted loss of 14 cents per share for the quarter ended in September. The mean expectation of eight analysts for the quarter was for a loss of 4 cents per share. Revenue fell 4.7% to C$361.00 million from a year ago; analysts expected C$389.83 million. Shares are down more than 5% in early trading.</p><p>Exxon Mobil on Friday reported its strongest quarterly results in four years, in line with analysts' profit estimates, as oil and gas prices more than doubled in the past year. A strong cash flow outlook will allow the company to increase shareholder distributions by up to $10 billion through a share repurchase program over 12-24 months, beginning in 2022, Exxon said in a filing. Shares are up about 1% in premarket trading.</p><p>Chevron Corp rose 1.9% after the oil major posted its highest quarterly profit in eight years. Adjusted earnings per share of $2.96 handily exceeded Wall Street's estimate of $2.21, according to Refinitiv IBES data.</p><p>Canada's Imperial Oil Ltd said its third-quarter profit more than doubled from the prior quarter on Friday, boosted by a rally in global crude prices. Imperial, which is majority-owned by Exxon Mobil Corp, said its net income rose to C$908 million, or C$1.29 per share, in the quarter ended Sept. 30, from C$366 million, or 50 Canadian cents per share, in the second quarter.</p><p>Starbucks Corp fell 4.7% after the coffee chain expects fiscal 2022 operating margin to be about 17%, below its long-term target, due to inflation and investments.</p><p>Exchange operator Cboe Global Markets Inc on Friday reported a 9% jump in third-quarter profit, bolstered by strong performance across business segments and robust demand for its data and access products.</p><p>Western Digital Corp tumbled 11.1% after the storage hardware maker forecast downbeat second-quarter profit and revenue.</p><p><span>Other earnings today include:</span> AbbVie Inc.; Alibaba ADR; Berkshire Hathaway Inc.; Cameco Corp.; Fortis Inc.; Imperial Oil Ltd.; Orocobre Ltd.; Shaw Communications Inc.; SNC-Lavalin Group Inc.; Westshore Terminals Investment Corp.</p><p><span>Economic news</span> </p><p>The Canadian economy was most likely flat in September, following a gain of 0.4% in August, with third quarter annualized GDP likely rising 1.9%, data showed on Friday. As of September, Canada's GDP remains about 1% below pre-pandemic levels, Statistics Canada data showed. The August gain of 0.4% was behind analyst estimates of 0.7%. Overall, 15 of 20 industrial sectors posted increases, with services-producing industries up by 0.6% while goods-producing industries declined 0.1%.</p><p>The Commerce Department said on Friday that U.S. consumer spending rose 0.6% last month. Data for August was revised higher to show spending rebounding 1.0% instead of 0.8% as previously reported. Economists polled by Reuters had forecast consumer spending increasing 0.5%.</p><p>The U.S. personal consumption expenditures (PCE) price index, excluding the volatile food and energy components, climbed 0.2% in September after gaining 0.3% in August. In the 12 months through September, the so-called core PCE price index increased 3.6% after a similar gain in August.</p><p>(10 a.m. ET) U.S. University of Michigan consumer sentiment for October.</p><p><span>With files from Reuters</span> </p><p>Follow this link to view this story on globeandmail.com: <a href=\"https://www.theglobeandmail.com/investing/markets/inside-the-market/article-before-the-bell-what-every-canadian-investor-needs-to-know-today-721/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">What every Canadian investor needs to know today</a> The viewing of this article is only available to Globe Unlimited subscribers.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Globe and Mail Inc. and its licensors. All rights reserved.</p></div>"}