{"date": "2021-12-09 01:15:25.197000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Aspen Technology, Inc, a global leader in asset optimization software, announced that it has achieved Amazon Web Services, Inc. (AWS) Energy Competency status. This designation recognizes that AspenTech has demonstrated deep expertise helping customers leverage AWS cloud technology to transform complex systems and accelerate the transition to a sustainable energy future. AspenTech also holds the AWS IoT Competency, having demonstrated success in providing specialized edge-to-cloud IoT solutions.</p><p>?Market volatility, Industry 4.0 and meeting sustainability goals have accelerated the need for digital transformation in the industrial sector,? said Bill Scudder, Senior Vice President and General Manager, AIoT Solutions at AspenTech. ?Our AWS Energy and IoT Competencies allow us to work closely with AWS to help our customers meet these demands with digital and cloud technologies.?</p></div><div class=\"tr-npp-body\"><p>Achieving the AWS Energy Competency differentiates AspenTech as an AWS Partner with deep expertise and technical proficiency within the energy industry, including proven customer success developing solutions across the value chain. To receive the designation, AWS Partners underwent a rigorous technical validation process, including a customer reference audit. The AWS Energy Competency Program provides energy customers with the ability to easily select highly specialized AWS Partners to help accelerate their digital transformation.</p><p>The Aspen AIoT Hub?, which is the basis for the AWS IoT Competency, is the cloud-ready environment for AspenTech?s Industrial AI solutions, allowing organizations to unlock hidden value from their industrial data. The Aspen AIoT Hub combined with AWS cloud technology provides customers with flexibility and scalability benefits to achieve greater automation, improve resource efficiencies and drive overall operational excellence that supports a carbon neutral future.</p><p>?With 2,400 customers worldwide and 40 years of experience in supporting the energy industry, we look forward to continuing our work as an AWS Partner by helping companies gain a competitive edge from their industrial data in the cloud, while accelerating the energy transition for a more sustainable future,? concluded Scudder.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}