{"date": "2021-11-22 06:31:05.367000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>More than 137 200 people have already signed a petition calling on the South African government to withdraw approval of Shell seismic surveys</p><p>SEISMIC SURVEY</p></div><div class=\"tr-npp-body\"><p>TWO people staged a protest outside a Shell garage in Newlands against the Amazon Warrior ship set to arrive in Cape Town tomorrow morning.</p><p>Shell announced that it would be conducting a seismic survey in search of oil and gas deposits between Morgan's Bay and Port St Johns off the Wild Coast, starting on December 1.</p><p>More than 137 200 people have already signed a petition calling on the South African government to withdraw approval of this Shell company initiative.</p><p>The protesters said the ship would be firing air guns every 10 seconds and, as a result, marine life on the sensitive Wild Coast would panic and even be damaged.</p><p>\"If you come to the Waterfront tomorrow with your cameras you will see the ship arriving. And we will be there with these signs (placards), telling it to get lost,\" said Aaron Rielly, a protester.</p><p>\"We are citizens that care about our oceans and about the animals in the ocean and about the future of our children,\" he said.</p><p>\"There was a consulting company that sent out an email to ask if anyone had objections and that has been accepted and approved by the South African government. But they have not let the public know,\" said another protester, Mikyla Pearson.</p><p>Petrol attendants at the Shell garage complained that the protesters were affecting their work and customers who were filling up their vehicles at the garage.</p><p>\"They are stopping cars from entering the garage, which they are not supposed to do on the site, but at the head offices,\" said a petrol attendant.</p><p>\"They started (the protest) during the week. It was schoolchildren at first ... We are running a business here and that affects our work,\" said another petrol attendant.</p><p>Weekend Argus © 1999 - 2021 Independent Newspapers (Pty) Limited. All rights strictly reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}