{"date": "2022-01-17 07:47:35.058000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 17 -- Amazon Great Republic Day Sale can get 70% off on electronics and accessories like laptops, headphones, cameras, smartwatch and much more from top brands like HP, LG, Lenovo, Mi, JBL, boAt, Sony, Samsung, Amazfit, Canon, Fujifilm and many more. Customers can enjoy up to 10% instant discount with SBI Credit cards and EMI transactions; No-cost EMI using Bajaj Finserv EMI card, Amazon Pay ICICI Credit card, Amazon Pay Later and select Debit &amp; Credit Cards.</p><p>Here are some of the electronics that you can choose from:</p></div><div class=\"tr-npp-body\"><p>ASUS TUF Gaming F15 Laptop</p><p>The TUF Gaming F15 is a fully-loaded Windows 10 gaming laptop powered by the latest 10th Gen Intel Core CPU and GeForce GTX GPU, 144Hz refresh rate. This gaming laptop also features a 48Wh lithium-polymer battery, self-cleaning cooling combines with TUF's signature military-grade durability. This laptop is at Rs.57,990.</p><p>boAt Airdopes 441</p><p>The TWS Airdopes 441 come equipped with 6mm drivers. It offers a user experience via its capacitive touch controls. The stereo calling feature lets smooth and clear chats over calls. Its latest Bluetooth v5.0 offers seamless instant connectivity. It is available at Rs.1,699.</p><p>Apple Watch SE</p><p>Starting at Rs.28,900, Apple Watch SE is water resistant to 50 metres. It offers the S5 chip, an optical heart rate sensor, an always-on altimeter, and fall detection.</p><p>boAt Xtend Smartwatch</p><p>The boAt Xtend comes with a built-in Alexa. It has a 1.69 inch capacitive LCD display and comes with features like stress monitor, and sleep and SPO2 monitoring along with 50 watch faces. The boAt Xtend is selling at Rs.2,199.</p><p>GoPro HERO9</p><p>A new, larger rear touch screen with touch zoom on HERO9 Black comes with a new front display that makes for easy framing and camera control. It can shoot video with up to 5K resolution with a new 23.6MP sensor. Get this for Rs.36,990.</p><p>Lenevo Tab M10 FHD</p><p>Lenovo Tab M10 Plus tablet comes with a 10.3 inch FHD screen and dual speakers for entertainment. It has 4GB RAM, 128GB internal memory which is expandable up to 128GB. This tab is priced at at Rs.12,999. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}