{"date": "2022-01-31 19:02:18+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are her own. Refiles to spell out full company name, remove inverted commas, and add hyphen.</p><p class=\"tr-by\">By Karen Kwok</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, Jan 31 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>Daniel Ek is having his first Facebook moment. By <a href=\"https://newsroom.spotify.com/2022-01-30/spotifys-platform-rules-and-approach-to-covid-19\" data-type=\"url\" class=\"tr-link\" translate=\"no\">sticking warning labels</a> on podcasts about Covid-19 and encouraging hosts to balance out medical views, the Spotify Technology <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SPOT.N\" data-type=\"ric\" data-ric=\"SPOT.N\" translate=\"no\" dir=\"ltr\">SPOT.N</a> boss has probably prevented an exodus among his 170 million music-streaming subscribers. But blunting the edgy appeal of his podcasts could crimp their growth.</p><p>     The $39 billion group’s misinformation mishap is akin to one confronting Meta Platforms <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> boss Mark Zuckerberg's social networks. Joe Rogan, a popular U.S. podcast host, courted controversy by giving airtime to his own and others’ anti-vaccine views. In response, high-profile musicians such as Neil Young pulled their songs from the platform, wiping more than $2 billion off Spotify’s market value.</p><p>Rogan’s apology on Sunday and promise to balance out controversial content is the sensible compromise. First and foremost, Ek gets to neutralise the outrage of Young and others, thereby keeping Spotify’s subscriber base intact. With music subscriptions accounting for more than 85% of Spotify’s $9.6 billion of revenue last year, according to Refinitiv estimates, that’s important. A far more powerful artist, say, <a href=\"https://newsroom.spotify.com/2021-12-01/what-the-world-streamed-most-in-2021\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Taylor Swift</a>, taking up the cause could have caused serious damage.</p><p>Importantly, the patch-up also avoids Ek being labelled an out-and-out enemy of free speech, one of Zuckerberg’s big fears. But he needs to tread carefully given the centrality of podcasts to his ambitions. Spotify’s monthly U.S. podcast audience is expected to overtake Apple’s <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a>, growing from about 28 million last year to 44 million in 2025, according to <a href=\"https://www.emarketer.com/content/spotify-poised-overtake-apple-podcasts-this-year\" data-type=\"url\" class=\"tr-link\" translate=\"no\">market research firm eMarketer</a>. Compared to music subscriptions, that’s still small. But, unlike with music, which incurs royalty payments with every download, Spotify owns the podcast content outright. After the up-front costs, that means fatter long-term margins.</p><p>As a medium, podcasts are also a clever way to differentiate Spotify from rivals Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Apple that offer broadly the same library of songs. That explains Spotify’s multi-billion-dollar shopping spree over the last few years. Besides spending hundreds of millions scooping up Megaphone and pop-culture podcasting outfit The Ringer in 2020, it is <a href=\"https://www.breakingviews.com/considered-view/spotifys-2-5-bln-joe-rogan-bump-has-sound-logic\" data-type=\"url\" class=\"tr-link\" translate=\"no\">paying Rogan</a> $100 million for exclusive rights to his shows. </p><p>Slapping the audio equivalent of parental advisory on such content is unlikely to enhance its appeal to listeners. Like Meta, it will also fail to silence critics who say Spotify is hosting socially damaging content. Then again, the alternatives for Ek were probably far worse.</p><p>Follow <a href=\"https://twitter.com/karenkkwok\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@karenkkwok</a> on Twitter</p><p><br/></p><p>CONTEXT NEWS</p><p>- U.S. podcaster Joe Rogan on Jan. 30 apologised and pledged more balance on his show, broadcast by streaming service Spotify Technology, amid a backlash against Covid-19 misinformation.</p><p>- \"If I pissed you off, I'm sorry,\" Rogan said. \"I will do my best to try to balance out these more controversial viewpoints with other people's perspectives so we can maybe find a better point of view.\"</p><p>- Spotify Chief Executive Daniel Ek said on Jan. 30 that he might disagree with some views on the platform but that it was \"important to me that we don't take on the position of being content censor”.</p><p>- Spotify said it would add an advisory to any episode featuring discussions about the pandemic in order to direct listeners to a Covid-19 hub containing information from medical and health experts, as well as links to authoritative sources.</p><p>- Singer-songwriters Neil Young and Joni Mitchell are among prominent figures who have asked for their music to be removed from Spotify in a backlash against Covid-19 misinformation on Rogan’s show.</p><p>- Spotify shares were up 10.2% at $190.27 by 1000 EST on Jan. 31.</p><p><br/></p><p class=\"tr-signoff\"> (Editing by Ed Cropley and Sharon Lam)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=KWOK/\" data-type=\"newsExpression\" data-expression=\"KWOK/\" translate=\"no\" dir=\"ltr\">KWOK/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:karen.kwok@thomsonreuters.com\" data-type=\"email\" translate=\"no\">karen.kwok@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://karen.kwok.thomsonreuters.com@reuters.net\">karen.kwok.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SPOTIFY TECH-ROGAN/BREAKINGVIEWS</p></div>"}