{"date": "2021-11-17 16:24:48.561000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p></p><pre>\n\n \nLONDON (AP) ? Amazon says it will stop accepting Visa credit cards issued in\nthe United Kingdom because of a dispute over fees, marking growing tensions\nbetween the companies.\n\nThe online retail giant said in a message Wednesday to customers that they\nwon't be able to use the payment company's U.K. credit cards starting Jan. 19,\nblaming \"the high fees Visa charges for processing credit card transactions.\"\n\nShoppers will still be able to use Visa debit cards and other credit cards\nincluding Mastercard and American Express, Amazon said. The notice suggests\nVisa credit cards issued in other countries will still be accepted.\n\nAmazon said it would give shoppers 20 pounds ($27) off their next purchase the\nfirst time they set up a debit or non-Visa credit card as their default card.\n\nVisa said it was \"very disappointed that Amazon is threatening to restrict\nconsumer choice in the future.\"\n\nThe payment company said in a statement that it has \"a long-standing\nrelationship with Amazon and we continue to work toward a resolution.\"\n\nAmazon said in a press statement that \"the cost of accepting card payments\ncontinues to be an obstacle.\"\n\n\"These costs should be going down over time with technological advancements,\nbut instead they continue to stay high or even rise,\" it said, without\nproviding figures.\n\nFees have been a growing source of tension between Amazon and Visa. Earlier\nthis year, Amazon started charging customers in Australia and Singapore who\nuse Visa credit cards a 0.5% surcharge.\n\nIn any credit card transaction, there are a number of fees involved, such as\nan \"interchange fee\" that the shopper's bank pays to the retailer's bank and\nother costs like service and technology charges. It's not clear which fee is\nthe focus of the U.K. dispute.\n \n \n    Copyright ? 2021 The Associated Press. All rights reserved. \nThis material may not be published, broadcast, rewritten or \nredistributed without permission.Copyright ? 2021 The \nAssociated Press. All rights reserved. This material may not \nbe published, broadcast, rewritten or redistributed without \npermission. \n\n      \n      \n    </pre>\n\n<p></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) 2021 Refinitiv. All rights reserved.</p></div>"}