{"date": "2021-12-02 10:01:26.218000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">AJAC names Best New Automotive Innovations for 2022</p>\n<p>TORONTO, Feb. 3, 2022</p>\n<p>\n<span>\n<span>TORONTO</span>\n</span> , <span>\n<span>Feb. 3, 2022</span>\n</span> /CNW/ - The Automobile Journalists Association of <span>Canada</span> (AJAC) has once again awarded a trio of technologies with its Automotive Innovation Awards for 2022. Nominations for the innovation awards were made by AJAC members and finalists were selected in each of the three categories. Each automaker selected as a finalist presented its technology virtually to a panel of 10 judges, comprised of some of the most knowledgeable and respected journalists in <span>Canada</span> who regularly cover automotive technologies.</p>\n<p>\"AJAC's Innovation Awards represent some of the most important modern advancements in automotive technology,\" said <span>Stephanie Wallcraft</span> , AJAC President. \"Our jurors assess the nominated technologies through a comprehensive assessment and analysis process and submit their selections by secret ballot to ensure complete objectivity. Canadians can be assured that the vehicles featuring the winning technologies integrate some of the most significant innovations on today's automotive market.\"</p>\n<p>The winners for the 2022 Automotive Innovation Awards are:</p>\n<p>\n<span>Best Safety Innovation - 2022 Genesis GV70 - Radar-based Rear Occupant Alert</span>\n</p>\n<p>Genesis captures the award in the safety category for its radar-based rear seat occupant alert, providing an alert to make sure that those most vulnerable to being forgotten in vehicle are protected</p>\n<p>More accurate than weight or logic-based systems, the radar embedded in the headliner can detect very small movements such as a sleeping child or pet's breathing. The driver is notified with a warning message and audible alert upon exiting the vehicle. If the warning is ignored, the vehicle's horn and lights provide another alert, and smartphone notifications are delivered via Genesis Connected Services.</p>\n<p>Speed of detection is key to reducing risk, which is why the Genesis radar-based rear occupant alert system is AJAC's Best Safety Innovation for 2022.</p>\n<p>\n<span>Best Green Innovation - 2022 Toyota Mirai Fuel-Cell Powertrain</span> In the current push towards alternative fuels, the 2022 Toyota Mirai was found to be a standout with its hydrogen powertrain. Converting hydrogen into electricity is a process that Toyota is counting on to move us into the next generation of vehicles, and for 2022 the Mirai's powertrain has been refined. The car now carries a smaller, more powerful fuel cell with improved storage capacity, providing increased interior space for its 5 occupants.</p>\n<p>A 647-kilometre range on a single tank of hydrogen and the ability to refuel in just minutes means that hydrogen is not tied down with the same burdens that traditional battery electric vehicles are, leaving them with a distinct advantage in this area.</p>\n<p>Hydrogen fuel presents an alternate solution for reducing carbon emissions, which is why the 2022</p>\n<p>Toyota Mirai's fuel-cell electric powertrain is AJAC's Best Green Innovation for 2022.</p>\n<p>\n<span>Best Technical Innovation - 2022 Genesis GV70 In-Vehicle Fingerprint Reader</span>\n</p>\n<p>Personalization has never been more built-in to our vehicles and Genesis ensures that your vehicle can recognize you with is new in-vehicle fingerprint reader. Like many of our modern cellphones, a simple scan of the driver's finger will unlock certain features, while adjustments like seat position, climate and entertainment preferences will be taken care of for you, based on saved settings.</p>\n<p>Valet mode is also enabled by the sensor, allowing the driver to lock his or her data away when necessary. AJAC jurors recognized this new technology for its usefulness and future potential, such as keyless vehicle start-up and in-car payments for fuel, charging stations or even the fast food drive through. For these reasons, the Genesis in-vehicle fingerprint reader is AJAC's Best New Innovation for 2022.</p>\n<p>\n<span>About the Automobile Journalists Association of <span>Canada</span> (AJAC)</span> The Automobile Journalists Association of <span>Canada</span> (AJAC) is an association of professional journalists, writers, photographers, and corporate members whose focus is the automobile and the Canadian automotive industry. Collectively, our primary objectives are to promote, encourage, support, and facilitate professionalism in Canadian automotive journalism and to ensure factual and ethical reporting about the automobile and automotive issues to Canadian consumers. This is achieved through the work of our members and AJAC's annual vehicle testing and evaluation events, the Canadian Car of the Year and Utility Vehicle of the Year Awards (CCOTY and CUVOTY), Innovation Awards, and EcoRun.</p>\n<p>SOURCE Automobile Journalists Association of <span>Canada</span>\n</p>\n<p>View original content: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/03/c9112.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/03/c9112.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}