{"date": "2021-12-15 16:07:21.846000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3381.83, "close": 3377.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon's plastic packaging waste soared by almost a third, to 270,000 tonnes, during the pandemic last year, according <a href=\"https://oceana.org/AmazonReport2021\" data-type=\"url\" class=\"tr-link\" translate=\"no\">to a report</a> from marine conservation group Oceana.</p><p>Oceana estimates up to 10,700 tonnes of this plastic, including air pillows, bubble wrap and plastic-lined paper envelopes, equivalent to a delivery van's worth every 67 minutes, is likely to end up in the sea.</p></div><div class=\"tr-npp-body\"><p>Amazon, the <a href=\"https://www.nytimes.com/2021/08/17/technology/amazon-walmart.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">western world's largest retailer</a> , rejected Oceana's figures and said it had overestimated the plastic waste by 300%. It also questioned the model used to estimate the percentage likely to enter the sea. It did not provide alternative figures.</p><p>The retailer saw a boom in sales of 38%, to $386bn (£290bn) in 2020, when much of the world was in lockdown and online sales increased.</p><p>Oceana's report challenges the company's recycling pledges, using interviews with local municipal waste officials, stores linked to by Amazon's <a href=\"https://www.amazon.co.uk/amsc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Second Chance recycling website</a> and surveys of Amazon Prime customers. It concluded that the company's recycling efforts \"will not significantly reduce its enormous (and growing) plastic footprint\".</p><p>Matt Littlejohn, Oceana's senior vice-president, said: \"We are using the best data available to us. If Amazon was transparent, we would gladly use their data. Yes, they are using more non-plastic packaging, but they are also selling a ton more product.</p><p>\"We understand people need Amazon. And so we're hoping Amazon can fix this problem and become a leader in reducing plastic, which is really important for the oceans.\"</p><p>Plastic film used by Amazon in its packaging has little or no value to the recycling market and is not generally accepted by municipal recycling schemes in the US, UK and Canada, the report said.</p><p>Oceana found that nearly 75% of Amazon Prime customers surveyed in 25 cities in the UK and US sent the plastic, knowingly or not, to landfill. Almost 40% put it in recycling bins, where the presence of plastic film would result in it going to the dump, and 35% disposed of the plastic in the bin. A little under 20% of 1,400 customers said they reused the plastic, while 5% said they placed the packaging in drop-off bins in stores on Amazon's customer-driven recycling programme on the company's Second Chance website.</p><p>Further, representatives at more than 40% of the stores that Amazon suggests as alternative recycling drop-offs for plastic film told secret shoppers that Amazon's plastic film was not accepted.</p><p>Only <a href=\"https://www.unep.org/interactive/beat-plastic-pollution\" data-type=\"url\" class=\"tr-link\" translate=\"no\">9% of all plastic waste has ever been recycled</a> . Almost all goes to landfill, is burned, or enters and pollutes the environment, including waterways and oceans.</p><p>Rachel Johnson Greer, a former programme manager at Amazon, who worked for the company for eight years, said the company would only take action on plastics if governments or a <a href=\"https://oceana.org/blog/amazon-would-have-no-problem-switching-plastic-free-packaging-says-former-amazon-executive/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">majority of customers</a> demanded it.</p><p>In May, more than a third of <a href=\"https://www.theguardian.com/environment/2021/may/26/amazon-shareholders-to-vote-on-revealing-retailers-plastic-footprint\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon shareholders voted for a resolution calling on it to quantify its single-use plastic</a> and provide recommendations on how to reduce its plastic footprint by the end of the year.</p><p>Oceana has highlighted the action taken by the retailer in India, where it has eliminated single-use plastic packaging by using paper alternatives, after India's prime minister, Narendra Modi, and its central government pledged to ban single-use plastics by 2022. The ban was delayed, but a tribunal ruled that packaging was the responsibility of producers, importers and brand owners.</p><p>Amazon also announced it would move away from <a href=\"https://www.dw.com/en/germany-amazon-pledges-to-cut-use-of-plastic-packaging/a-59904175\" data-type=\"url\" class=\"tr-link\" translate=\"no\">single-use plastic packaging in Germany</a> .</p><p>\"If the company can do this in India and Germany, they can move away from single-use plastic packaging on a worldwide basis,\" Littlejohn said.</p><p>An Amazon spokesperson said: \"Amazon shares Oceana's ambition to protect the world's oceans and respects their work but, for a second year, their calculations are seriously flawed. They have overestimated our plastics usage by more than 300%, and use outdated assumptions about the sources of plastic waste entering our oceans.\"</p><p>\"Amazon is making rapid progress in reducing or removing single-use plastics from packaging materials in the UK and around the world.\"</p><p>Among its initiatives to reduce plastic waste, Amazon is looking to double fully recyclable cushioned plastic in North America, replace single-use pillows in Australia with fully recyclable paper ones, and expand its packaging-free initiative to 100 cities across India, it said.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 theguardian.com-NonSyndicated</p></div>"}