{"date": "2022-02-04 14:05:41.214000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_tp0hcvcj&amp;referenceId=tag:reuters.com,2022:newsml_OVFX9KHVV_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_tp0hcvcj&amp;referenceId=tag:reuters.com,2022:newsml_OVFX9KHVV_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: From a very bad day for Mark Zuckerberg, to a very good day for Jeff Bezos, we round up the big numbers in business and finance over the week to February 4. Francesca Lynagh reports.<br/>Short Link: <a href=\"https://refini.tv/3glcP5C\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3glcP5C</a><br/><br/>Video Transcript:<br/><br/>From a bad day for Mark Zuckerberg, to a very good one for Jeff Bezos, this is the Week in Numbers. 26% was the plunge in shares for Facebook-owner Meta Platforms on Thursday, after a dismal outlook for growth. The plunge wiped $200 billion off Meta's market value - the biggest-ever single day slide for a U.S. firm. Boss Mark Zuckerberg saw $29 billion wiped off his own net worth. But about $20 billion was added to the fortune of Amazon chief Jeff Bezos. Shares in the e-commerce titan soared after blockbuster holiday-season sales, and a plan to hike prices for Prime subscriptions in the U.S. The week also saw record numbers from Google-owner Alphabet, making it a top week for big tech except Facebook. $6.4 billion was the latest quarterly profit at Shell, its best in eight years. Days earlier Exxon Mobil reported its best numbers in seven years. The energy giants are raking it in as oil and gas prices soar. 0.5% is the benchmark interest rate in the UK now, after a second hike in three months. Bank of England Governor, Andrew Bailey said he had to act to head off a surge in consumer prices.<br/><br/>An increase in bank rate is necessary because it is unlikely that inflation will return to target without it.<br/><br/>And $1.7 billion is Spider-Man's net worth or at least it's the ticket sales so far for the latest movie. That helped drive producer Sony to estimate smashing profit numbers this week. Shares in the Japanese giant still slid later in the week, with investors wondering if it can compete in online gaming.<br/></span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}