{"date": "2022-01-06 12:13:11.825000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Dunzo, the Google-backed quick commerce player, has raised $240 million in its latest round of funding. The investment was led by Reliance Retail Ventures Limited, with participation from existing investors Lightbox, Lightrock, 3L Capital and Alteria Capital. With an investment of $200 million, Reliance Retail will own 25.8 per cent stake on a fully diluted basis. According to the sources, Dunzo\u0092s valuation has crossed $800 million in this funding round. The company was valued at $300 million in March 2021, according to an Entrackr report.</p><p>Reliance said this funding round is a reinstatement of confidence of existing and new investors in Dunzo\u0092s potential and success in creating an exceptional user experience. The capital will be used to further Dunzo\u0092s vision to be the largest quick commerce business in the country, enabling instant delivery of essentials from a network of micro warehouses while also expanding its B2B (business-to-business vertical to enable logistics for local merchants in the Indian cities.</p></div><div class=\"tr-npp-body\"><p>The funding would also help Dunzo compete with players such as Amazon, Walmart-owned Flipkart, Swiggy, Zomato, Tata-backed Bigbasket and quick grocery delivery platform Zepto.</p><p>\u0093Since our inception, we have been razor-focused on providing an unmatched customer experience and this funding round is a resounding validation of our approach. I am proud of the team for tirelessly building this category over the past three years and grateful to our investors for their continued support,\u0094 said Kabeer Biswas, CEO and co-founder, Dunzo. \u0093With this investment from Reliance Retail, we will have a long-term partner with whom we can accelerate growth and redefine how Indians shop for their daily and weekly essentials. We\u0092re excited by the traction and velocity that Dunzo Daily has achieved and over the next 3 years, we aim to establish ourselves as one of the most reliable quick commerce providers in the country.\u0094</p><p>Dunzo has established itself as the market leader in the quick commerce category in India, which has an addressable market opportunity of over $50 billion. Currently Dunzo is available across 7 metro cities in India and the additional capital will be used to expand the quick commerce business to 15 cities. Dunzo launched its instant delivery model \u0091Dunzo Daily\u0092 in Bengaluru earlier last year, which is seeing over 20 per cent week on week growth. The Dunzo Daily model delivers daily and weekly essentials within 15-20 minutes, with a focus on providing high-quality fruits and vegetables.</p><p>\u0093We are seeing a shift in consumption patterns to online and have been highly impressed with how Dunzo has disrupted the space. Dunzo is the pioneer of Quick Commerce in India and we want to support them in furthering their ambitions of becoming a prominent local commerce enabler in the country,\u0094 said Isha Ambani, Director, Reliance Retail Ventures Limited. \u0093Through our partnership with Dunzo, we will be able to provide increased convenience to Reliance Retail\u0092s consumers and differentiated customer experience through rapid delivery of products from Reliance Retail stores. Our merchants will get access to the hyperlocal delivery network of Dunzo to support their growth as they move their business online through Jio Mart.\u0094</p><p>In addition to the funding, Dunzo and Reliance Retail will also enter into certain business partnerships. Dunzo will enable hyperlocal logistics for the retail stores operated by Reliance Retail, further adding onto Reliance Retail\u0092s omni-channel capabilities. Dunzo will also facilitate last mile deliveries for JioMart\u0092s merchant network.</p><p>Morgan Stanley acted as exclusive financial advisor and Cyril Amarchand Mangaldas acted as legal counsel to Dunzo, PwC India provided financial due diligence services and Khaitan &amp; Co provided legal diligence services. AZB &amp; Partners acted as legal counsel to RRVL and Deloitte, Haskins &amp; Sells LLP provided financial due diligence services.</p><p>Kabeer Biswas, who has an engineering degree from the University of Mumbai and an MBA from Narsee Monjee Institute of Management Studies, co-founded Dunzo with Ankur Aggarwal, Dalvir Suri, and Mukund Jha in 2015. The company, which started over a small WhatsApp group to fulfil random tasks like laundry pick-ups and drops for a small fee, has evolved into a full-fledged local-commerce firm where it sees tapping the offline businesses as a massive opportunity. According to the sources, Dunzo also has ambitions to go global and tap dense locations such as Singapore, Dhaka and New York and enable 15-minute delivery.</p><p>Dunzo was also leading a Med-Air consortium along with industry experts to conduct experimental BVLOS (Below Visual Line of Sight) drone delivery flights for the 'Medicine from the Sky Project'. The aim is to help improve access to healthcare during the Covid-19 pandemic.</p><p>According to an industry report by Redseer, the addressable market for quick commerce is projected to be over $75 billion by 2025, creating a multi-billion dollar opportunity for Dunzo.</p><p>Last year in August, Dunzo said it has scaled revenue of about 1.6x in FY21 while serving as an essential service during an ongoing pandemic. Dunzo had seen its revenue from operations grow 35X to Rs 27.5 crore during FY20.</p><p>Dunzo had also reduced cash burn by 43 per cent and used its distinct first-mover advantage to establish its dominance as a Q-commerce platform in the Indian market.</p><p>Dunzo had scaled its GMV (gross merchandise value) by about 65 per cent in FY21, on the back of organic demand, with more than 90 per cent of users signing up to the platform organically over the last year.</p><p>Dunzo\u0092s gross merchandise value (GMV), the total value of transactions through the platform including delivery fees, stood at Rs 590 crore in FY21 compared to Rs 360 crore in FY20.</p><p>The firm\u0092s net loss was Rs 338.3 crore in FY20.</p><p>Continuing its growth story in FY22, Dunzo in August last year had said it expected growth to be fuelled by its Quick Commerce segment --in the last quarter alone (Q1FY22), Dunzo witnessed nearly 2x quarter-on-quarter growth. The GMV for the first quarter of FY22 was reported as Rs 267 crore compared to Rs 142 crore in the first quarter of FY21.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}