{"date": "2021-11-03 06:50:56.636000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce retailer Amazon has opened its new advanced sort centre in Coteau-du-Lac, Quebec, which will help it to better serve its customers in Eastern Canada.</p><p>Known as YUL9, the 720,000ft2 facility will implement Amazon Robotics' mobile fulfilment systems next year. It will be the company's first facility in Canada to integrate robotics.The centre will increase the speed and efficiency of its services and improve working condition for its associates.Amazon Canada will hire 500 people for full-time jobs at the new facility.The recruitment will be part of the company's recent commitment to create 15,000 new full and part-time employees across Canada.Amazon Canada site leader Anamaria Zammit said: \"The entire Amazon team is proud to continue investing in Quebec and Coteau-du-Lac.\"With training and skill development programs, a full range of benefits and competitive salaries, Amazon continues its mission to be the best employer on Earth by helping its employees reach their career goals. We are proud to call Coteau-du-Lac home to our most advanced robotics facility in the country.\"Located in the centre of the ALTA industrial park, the Coteau-du-Lac sort centre strengthens Vaudreuil-Soulanges' position as transportation and logistics hub.The facility opened in the presence of Coteau-du-Lac Mayor Andrée Brosseau, Vaudreuil-Soulanges RCM Prefect Patrick Bousez, DEV Vaudreuil-Soulanges general manager Joanne Brunet and employment organisation Réseaux general manager Francine St-Denis, as well as members from the Vaudreuil-Soulanges regional county municipality.Coteau-du-Lac Mayor Andrée Brosseau said: \"The opening of the sort centre in Coteau-du-Lac is a testament to the competitiveness and strategic location of our city. As we enter the post-Covid recovery period, the centre's opening will play a significant role in the entire regional, and even Quebec's, economic ecosystem.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}