{"date": "2021-11-19 20:19:08.859000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3696.06, "close": 3572.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ID GLOBAL CORP (\"IDGC-0\")\n- Upgrades to Existing Noveda Software\n\n   IDGlobal Corp. is pleased to announce various upgrades to Noveda's\npatented monitoring software solution that integrates consumption and\ngeneration data to provide actionable real-time intelligence for owners,\noperators, and users as well as utilities. Noveda's patented technology\nhelps reduce energy and water usage, optimize performance of renewable\nenergy systems, and reduce the carbon footprint for customers world-wide,\nacross commercial/retail, industrial, government, education, and utility\nsectors.\n\n   The software upgrades include upgrading to PHP version 8.0, providing\nfull-fledged source code documentation and being compatible with AWS\ninfrastructure. The transition this year to Software-as-a-Service (SaaS)\nwhich is a software licensing model, allows access to software on a\nsubscription basis using external servers has been instrumental in driving\ndown corporate costs and substantially increasing profit margins. SaaS\nallows each user to access programs via the Internet, instead of installing\nand maintaining software, you simply access it via the Internet, freeing\nclients from complex software and hardware management the on the user's\ncomputer systems.\n\n   The Company CFO, Sebastien C. DuFort stated \"We are extremely excited\nabout our new-found focus to be a pure play Software as a Service (SaaS)\nprovider, have submitted the registration application to fully-service\nlocal, state, and federal agencies and IDGC will also have a full corporate\nupdate the first half of next week.\"\n\n   ABOUT NOVEDA\n\n   Noveda Technologies is an innovative leader in real-time, web-based\nenergy and water monitoring. The company's patented software solutions help\nreduce energy and water usage, optimize performance of renewable energy\nsystems, and reduce the carbon footprint for customers across commercial,\nretail, government, education, and utility sectors. Currently,\nheadquartered in White Plains, New York.\n\n   IDGC's Plan of Operations.\n\n   IDGC is an emerging growth company under the JOBS Act of 2012 and, as a\ndiversified holding company, will focus on emerging and middle-market\ninternational investment opportunities through its subsidiaries. IDGlobal\nCorp. is an organization engaged in the business of fostering early-stage\ncompanies through the different developmental phases until the companies\nhave sufficient financial, human, and physical resources to function on\ntheir own.\n\n   Safe Harbor Statement under the Private Securities Litigation Reform Act\nof 1995: The statements contained herein are forward-looking statements\nthat are subject to risks and uncertainties that could cause actual results\nto differ materially from those expressed in the forward-looking\nstatements, including, but not limited to, certain delays beyond the\nCompany's control with respect to market acceptance of new technologies or\nproducts, delays in testing and evaluation of products, and other risks\ndetailed from time to time in the Company's filings with the Securities and\nExchange Commission. Please read the full disclaimer at\nwww.idglobalcorp.io.\n\nContact: idglobalinfo@gmail.com\nIR Contact: 855-464-2535, press 1\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132200416.MNPRE2132201767-12164520211119</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}