{"date": "2021-12-13 13:07:04.835000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"fr\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">La popularité des services de visionnement en ligne a dépassé celle des services de télévision par câble ou fibre optique dans les foyers québécois</p>\n<p>QUÉBEC, le 26 janv. 2022</p>\n<p>\n<span>QUÉBEC</span> , <span>le 26 janv. 2022</span> /CNW Telbec/ - Selon une enquête NETendances rendue publique aujourd'hui par l'Académie de la transformation numérique ( <span>ATN) de</span> l'Université <span>Laval</span> , la popularité des services payants de visionnement en ligne a dépassé pour une première fois celle des services de télévision par câble ou fibre optique dans les foyers québécois. L'enquête intitulée <a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3423808-1&amp;h=1201059488&amp;u=https%3A%2F%2Fatnulaval.link%2Fhn1&amp;a=Portrait+num%C3%A9rique+des+foyers+qu%C3%A9b%C3%A9cois\">\n<span>Portrait numérique des foyers québécois</span>\n</a> révèle en effet que 71 % des adultes québécois sont abonnés à au moins un service payant de visionnement en ligne tel Netflix, Amazon Prime ou Disney+ alors que 66 % sont abonnés à un service de télévision par câble ou fibre optique. L'enquête rapporte que le taux d'abonnement à un service de télévision par câble ou fibre optique a diminué de 6 points de pourcentage au cours de la dernière année et de 13 points de pourcentage depuis 2018.</p>\n<p>\n<span>La progression des plateformes Netflix, Amazon Prime et Disney+</span> La plateforme de visionnement en ligne Netflix demeure la plus populaire auprès des internautes québécois avec un taux d'abonnement de 57 %, en hausse de 5 points de pourcentage en un an. Viennent ensuite la plateforme Amazon Prime, passée d'un taux d'abonnement de 19 % à 29 % au cours de la dernière année, et la plateforme Disney+, qui a connu une croissance de 4 points de pourcentage pour atteindre un taux d'abonnement de 18 % en 2021. Les proportions d'internautes québécois abonnés aux plateformes Club Illico (16 %), <span>ICI TOU</span> .TV Extra (9 %) et Crave (8 %) sont demeurées stables par rapport à l'an dernier.</p>\n<p>« Les adultes québécois âgés de 18 à 54 ans sont encore les plus nombreux à être abonnés à au moins un service payant pour visionner des films ou des séries sur Internet tandis que l'abonnement à un service de télévision par câble ou fibre optique est plus populaire chez les adultes âgés de 55 ans et plus », précise le porte-parole des enquêtes NETendances à l'ATN, <span>Bruno Guglielminetti</span> .</p>\n<p>\n<span>Les appareils de divertissement à la maison en hausse</span> Près des trois quarts des adultes québécois (74 %) possèdent au moins un appareil de divertissement à la maison (console de jeu vidéo, télévision intelligente ou lecteur multimédia en continu), soit une hausse de 8 points de pourcentage en un an. La télévision intelligente (60 %) a dépassé en popularité la console de jeu vidéo (41 %) et le lecteur multimédia en continu (30 %) par rapport à l'année précédente. C'est d'ailleurs la télévision intelligente qui a connu la plus forte croissance au cours de la dernière année avec une augmentation de 21 points de pourcentage.</p>\n<p>« Les intentions d'achat au cours des 12 prochains mois pour les appareils de divertissement nous laissent croire que les taux d'adoption devraient continuer de progresser puisque 11 % des adultes québécois envisagent d'acquérir soit une télévision intelligente, un lecteur multimédia en continu ou une console de jeu vidéo », précise la directrice intelligence d'affaires et recherche marketing à l'ATN, <span>Claire Bourget</span> .</p>\n<p>\n<span>Le temps passé devant les écrans a augmenté</span> Près de 6 adultes québécois sur 10 (58 %) mentionnent avoir passé plus de temps devant les écrans à la maison au cours des 12 derniers mois (télévision, ordinateur, téléphone intelligent ou tablette électronique). Les adultes âgés de 18 à 24 ans (70 %), de 25 à 34 ans (72 %) et de 34 à 44 ans (71 %) ainsi que les diplômés d'études collégiales (63 %) et universitaires (67 %) sont les plus nombreux à avoir passé plus de temps devant les écrans.</p>\n<p>\n<span>Le téléphone intelligent plus populaire pour accéder à Internet</span> La popularité du téléphone intelligent (47 %) a dépassé en 2021 celle de l'ordinateur portable ou de table (35 %) pour accéder à Internet à la maison ou ailleurs. Les internautes québécois âgés de 18 à 54 ans privilégient le téléphone intelligent pour accéder à Internet à la maison ou ailleurs alors que l'ordinateur portable ou de table est encore privilégié chez les internautes âgés de 55 ans et plus.</p>\n<p>Consultez les résultats détaillés et les infographies de l'enquête : <a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3423808-1&amp;h=849594162&amp;u=http%3A%2F%2Fwww.atn.ulaval.ca%2Fnetendances&amp;a=www.atn.ulaval.ca%2Fenquetes-et-mesures%2Fnetendances\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.atn.ulaval.ca/enquetes-et-mesures/netendances</a> .</p>\n<p>\n<span>À propos de NETendances 2021</span> L'enquête NETendances dresse depuis plus de 20 ans un portrait intégré et actualisé des grandes tendances en matière d'utilisation du Web et du numérique au Québec. NETendances 2021 est réalisé grâce au soutien financier du Mouvement des caisses Desjardins, d'Hydro-Québec, de Services Québec, ainsi qu'avec la collaboration de BIP Recherche.</p>\n<p>\n<span>À propos de l'Académie de la transformation numérique (ATN)</span> L'Académie de la transformation numérique (ATN) a été créé dans le but de répondre aux besoins criants des ministères, des organisations publiques et des municipalités en matière de transformation numérique. Née d'un partenariat entre l'Université <span>Laval</span> et le gouvernement du Québec, l'ATN permet à ces organisations d'assumer un véritable rôle de leader du numérique et de soutenir leurs employés dans l'acquisition de connaissances et le développement de compétences et de savoir-être pour relever les défis de cette grande transformation. Par son adéquation unique entre l'emploi, la recherche et la formation, l'ATN positionne l'humain au cœur de sa démarche et est engagée dans le développement d'une culture durable du numérique et en exerçant un rôle de premier plan dans l'évolution des talents et plus globalement, de la société.</p>\n<p>SOURCE Université <span>Laval</span>\n</p>\n<p>Consulter le contenu original : <a href=\"http://www.newswire.ca/fr/releases/archive/January2022/26/c9186.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/fr/releases/archive/January2022/26/c9186.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}