{"date": "2021-10-14 06:06:10.814000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3474.0, "close": 3645.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, United Arab Emirates –</strong> AVEVA, a global leader in industrial software, driving digital transformation and sustainability, today announced the successful deployment of AVEVA Schedule AI Assistant at Hokkaido Refinery, operated by Japanese energy company Idemitsu Kosan Co., Ltd.</p>\n<p>AVEVA Schedule AI Assistant, part of AVEVA Unified Supply Chain, is an optimization and artificial intelligence (AI)-infused cloud-based solution. Designed to empower crude oil operational schedulers at refineries to explore and rank possible scenarios for efficiency, profitability and emissions, the solution helps to accomplish days’ worth of work in seconds, enhancing business agility and optimizing decision-making. Analytics automatically generate and evaluate multiple schedules and anticipated events within the complete supply chain. The AI-powered solution then recommends the crude scheduling strategy that best fits the organization’s safety, sustainability and economic value chain objectives.                                                          </p>\n<p>Petrochemical refineries aim to optimize their planning and scheduling processes to achieve greater productivity and stabilize production flows. Through schedule optimization, management teams can take charge and prepare for changing environments: A production scheduler plans  the flow of crude oil throughout a refinery – unloading it from vessels, transferring to storage tanks, preparing the charging schedule for different crude oil distillation units, considering restrictions on units’ capacity, flow and compositions, carrying out tank maintenances, and managing the production of end-product to maximize profitability on the spot market. As such, efficiency is limited by human fallibility and time constraints. The multi-step process and numerous variables can lead to errors, making it challenging to overall optimization.</p>\n<p>By leveraging the predictive and prescriptive artificial intelligence in AVEVA Unified Supply Chain, customers can seamlessly drive scheduling decisions, capitalize on economic opportunities and unlock more value with AVEVA Schedule AI Assistant.</p>\n<p>Idemitsu Kosan had already transformed its refinery operations by implementing AVEVA Unified Supply Chain to optimize its enterprise value chain and standardize its combined downstream operations. The company had introduced AVEVA Unified Supply Chain  to develop planning and scheduling models for enhancing decision-making process for higher refinery margins, optimizing refinery operations and minimizing cost of crude oil and transportation. Having realized significant benefits from their existing AVEVA solution, deploying AVEVA Schedule AI Assistant at their Hokkaido refinery was the natural next step for Idemitsu Kosan in their digitalization program using AVEVA Value Chain Optimization.   </p>\n<p>“With the Schedule AI Assistant, AVEVA Unified Supply Chain solution is transforming operational schedulers into value chain strategists by presenting many possible solutions and placing them at the center of a cloud and AI-assisted supply chain decision support system that recommends the most efficient course of action, saving teams time and enabling them to exceed their objectives. AVEVA’s comprehensive software portfolio gives our clients the highest levels of efficiency and enables true value chain optimization,” said <strong>Harpreet Gulati, Senior Vice President, Planning, Simulation and Optimization Business.</strong></p>\n<p>The Schedule AI Assistant elevates AVEVA Unified Supply Chain solution to the next level to further extend its capability of addressing each component of the value chain, right from feedstock data management, trading, production planning and network optimization, to scheduling and performance monitoring.</p>\n<p><strong>Seiji Yoshii, Manager, System Development</strong><strong>＆</strong> <strong>Maintenance Section No2 Information Systems Department, Idemitsu Kosan</strong> <strong>said,</strong> “Initially, we felt very difficult to execute this project technically. However, we developed the software for practical use and put it into operation for actual inspection in a year.  We are confident that this achievement will result in a new generation of schedulers that will significantly change the traditional concept of try-and-error simulation-based scheduling. we look forward to initiating further developments and lead to great results.”</p>\n<p><strong>About AVEVA</strong></p>\n<p>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a>. </p>\n<p>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}