{"date": "2021-11-23 20:42:16.009000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>QUANTUM COMPUTING INC (\"QUBT-Q\")\n- To Present at the Benchmark Discovery 1x1 Investor Conference,\n- December 2, 2021\n\n   Quantum Computing Inc., a quantum software leader in bridging the power\nof classical and quantum computing, has been invited to present at the\nBenchmark Discovery 1x1 Investor Conference being held virtually on\nDecember 2, 2021.\n\n   QCI CEO Robert Liscouski and CFO Chris Roberts will participate in\none-on-one meetings with institutional analysts and investors.\n\n   They will discuss the company's Qatalyst(TM) ready-to-run quantum\nsoftware which was recently selected for the final round of the BMW Group\nand Amazon Web Services (AWS) Quantum Computing Challenge in the vehicle\nsensor placement category.\n\n   Earlier this year, QCI entered a technology collaboration with AWS which\nenabled Qatalyst users to access quantum computers via AWS Braket,\nincluding those offered by D-Wave, Ion-Q and Rigetti. This has positioned\nQCI in the middle of the global value chain for AWS business users looking\nto solve complex computational problems.\n\n   QCI has also entered a three-year cooperative research and development\nagreement with Los Alamos National Laboratory, a U.S. Department of Energy\nmultidisciplinary research institution and renowned computing pioneer. QCI\nis collaborating with Los Alamos scientists on key components of\nlarge-scale simulations essential to a range of high-value, real-world\napplications, including national security.\n\nThe company has also established academic partnerships with Purdue\nUniversity, Indiana University and Notre Dame.\n\n   To schedule a one-on-one meeting with QCI, you may submit your request\nonline via the link provided upon registration. For more information about\nthe event or questions about registration, please contact your Benchmark\nrepresentative.\n\n   For any questions about QCI, please contact Ron Both or Justin Lumley of\nCMA at (949) 432-7566 or submit your request here.\n\n   About Quantum Computing Inc.\nQuantum Computing Inc. (QCI) (Nasdaq: QUBT) is focused on accelerating the\nvalue of quantum computing for real-world business solutions. The company's\nflagship product, Qatalyst, is the first software to bridge the power of\nclassical and quantum computing, minimizing complexity and empowering SMEs\nto solve complex computational problems today. QCI's expert team in\nfinance, computing, security, mathematics and physics has over a century of\nexperience with complex technologies; from leading edge supercomputing\ninnovations, to massively parallel programming, to the security that\nprotects nations. Connect with QCI on LinkedIn and @QciQuantum on Twitter.\nFor more information about QCI, visit www.quantumcomputinginc.com.\n\nRobert Liscouski, CEO\nQuantum Computing, Inc.\n+1 (703) 436-2161\nEmail Contact\n\nInvestor Relations Contact:\nRon Both or Justin Lumley\nCMA Investor Relations\n+1 (949) 432-7566\nEmail Contact\n\nMedia Relations Contact:\nBob Geller\nFusion Public Relations\n+1 (917) 816-0562\nqci@fusionpr.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132600484.MNPRE2132602408-12114420211123</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}