{"date": "2021-11-03 15:55:34.844000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Tech giants Apple and Amazon warned Thursday that the global supply-chain crunch and a domestic labor shortage are likely to wallop their bottom lines this holiday season, a sign that the head winds battering the U.S. economy will persist for some time to come.</p><p>To address the challenges, Amazon plans to spend an extra $4 billion to lure seasonal workers with richer paychecks and benefits, and to ensure that packages arrive at its warehouses and on customer's doorsteps, in part by shipping goods via less-crowded ports, said finance chief Brian Olsavsky.</p></div><div class=\"tr-npp-body\"><p>\"We're doing everything we can,\" said Olsavsky, whose company previously announced plans to hire 150,000 temporary workers this holiday season. \"The issue is, it's costly.\"</p><p>(Amazon founder Jeff Bezos owns The Washington Post.)</p><p>Apple CEO Tim Cook, speaking on a conference call with analysts, blamed silicon shortages and manufacturing issues related to the coronavirus pandemic for his company's revenue failing to meet expectations in its fiscal fourth quarter. Though Apple's overall revenue was up 29 percent, Cook said the company lost an estimated $6 billion to shortages and pandemic disruptions — a figure that could be even higher next quarter if the troubles affect crucial holiday-season sales.</p><p>\"While we are still living through unprecedented times, we are encouraged by progress around the world,\" he told analysts. \"We are optimistic about the future.\"</p><p>Investors soured on Amazon in after-hours trading, pushing shares down more than 4 percent. Apple shares were down 3.5 percent, nearly wiping out the gains it made this week.</p><p>Both companies are powerhouses in the global economy, and both have the financial wherewithal to weather the continuing, pandemic-related storm. Amazon chief executive Andy Jassy, who replaced Bezos in that role in July, highlighted that capacity in the company's earnings release, arguing that Amazon has the ability to spend on wages and warehouses and withstand losses to expand its market.</p><p>\"We've always said that when confronted with the choice between optimizing for short-term profits versus what's best for customers over the long term, we will choose the latter — and you can see that during every phase of this pandemic,\" Jassy said in a statement.</p><p>When the tech giants warn of economic challenges, however, it suggests that companies without their leverage could face even more severe head winds. Cook, for instance, pointed out that the worst chip shortages have not occurred in the smaller, faster \"leading-edge\" chips that Apple puts in its new smartphones, iPads and laptops. Instead, he said, the worst shortages have affected older \"legacy\" chips — the kind used by automakers, for example.</p><p>Companies like Apple can also leverage their manufacturing prowess and relationships with suppliers to lessen the blow of the chip-related turmoil. Cook said the company's operations teams have been reducing Apple's \"yield times,\" effectively shortening the time it takes to make a product so that any chip-related delays are less likely to irk customers.</p><p>\"When you get a chip off a [fabrication facility], it's as quickly as possible [put] in a product we ship,\" Cook said, referring to facilities that make the company's semiconductors, or chips.</p><p>Cook said Apple also has coordinated with manufacturing partners to help increase their yields, or the amount of product they can produce and ship to Apple. \"We're working with our partners in making sure they have supply that we need,\" Cook said.</p><p>Meanwhile, Amazon's economic difficulties are so brutal that it might not turn an operating profit in the fourth quarter. It said Thursday it expects to earn between $0 and $3 billion in operating income for the period, compared to $6.9 billion a year ago.</p><p>Even as consumers aggressively filled their pandemic shopping carts, Amazon's profits fell by nearly half to $3.2 billion in the third quarter as it hired workers, wrestled with supply-chain challenges and built out its warehouse operations. The company now employs 1.47 million workers — up from 1.34 million workers just three months ago — making it the nation's second-largest private employer after Walmart.</p><p>To add those workers, Amazon has raised wages and doled out sign-on incentives, Olsavsky said. The company's average starting pay for warehouse jobs is now $18 an hour, and new employees can expect signing bonuses of up to $3,000 — expenses that added about $1 billion in unexpected costs in the third quarter.</p><p>Amazon incurred another $1 billion in lost productivity costs tied to challenges getting goods to its warehouses. And the company spent more money redirecting inventory to warehouses \"that had labor to receive the product,\" Olsavsky said, adding that both categories of expenses are likely to double during the holiday period.</p><p>The struggle to hire comes as Amazon continues to battle unions trying to organize its warehouse workforce. On Monday, warehouse workers at an Amazon facility in New York filed a petition to hold a unionization vote.</p><p>In April, Amazon fended off an organizing drive at a Bessemer, Ala., warehouse, where workers rejected unionization by a more than 2-to-1 margin, though a National Labor Relations Board hearing officer recommended in August that the results be scrapped because of alleged improprieties, and a new election held. The agency has yet to rule on those recommendations.</p><p>Apple's executives didn't get any questions about worker shortages at its retail stores. Cook said on the call that the company recently opened three stores in China, Turkey and the Bronx, giving it at least one store in all of New York City's five boroughs.</p><p>Apple was affected by coronavirus-related manufacturing hiccups, he said, particularly in Southeast Asia, where the company has increased its manufacturing footprint, though Cook said the manufacturing disruptions were few and far between in October.</p><p>\"I'm not going to predict where it goes, but I can tell you that ensure we're in a materially better position than we were,\" he said.</p><p>Cook said Apple has seen a significant increase in the cost of shipping its products, which could eat into its margins. \"I would assume that is pretty consistent across different companies, so we're seeing some inflation there,\" he said.</p><p>But unlike Apple, most companies do not have nearly $200 billion in cash reserves to cover the higher costs.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Washington Post</p></div>"}