{"date": "2021-12-01 15:19:21.427000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON.COM INC. (\"AMZN-Q\")\n- Accelerates Development of the Aurora Driver with AWS\n\n  Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company announced\nthat Aurora, a leader in self-driving vehicle technology, has selected AWS\nas its preferred cloud provider for machine learning training and\ncloud-based simulation workloads. Aurora uses AWS's proven infrastructure\nand unparalleled portfolio of capabilities to safely accelerate the\ndevelopment of the Aurora Driver, its scalable self-driving vehicle\ntechnology. The Aurora Driver consists of sensors that perceive the world,\nsoftware that plans a safe path through it, and a computer that powers and\nintegrates Aurora's hardware and software with any vehicle platform. For\nits machine learning training and cloud-based simulation workloads, Aurora\nis all-in on AWS, and it uses the cloud to process trillions of data points\neach day. Now, the company is scaling its training workloads in the cloud\nto complete up to 12 million physics-based driving simulations per day by\nthe end of the year, building on the petabytes of data it collects during\nreal-world road tests.\n\n  Autonomous driving is an immensely complex technological challenge that\nrelies heavily on cloud computing to enable breakthroughs in perception,\nembedded computing, machine learning, motion planning, decision making, and\nadvanced sensor technologies. With AWS's capabilities in high-performance\ncomputing, machine learning, storage, and security, Aurora optimizes and\nscales its virtual testing efforts to expand the capabilities of the Aurora\nDriver safely and quickly.\n\n  \"Aurora's advanced machine learning and simulation at scale are\nfoundational to developing our technology safely and quickly, and AWS\ndelivers the high performance we need to maintain our progress,\" said Chris\nUrmson, CEO of Aurora. \"With its virtually unlimited scale, AWS supports\nmillions of virtual tests to validate the capabilities of the Aurora Driver\nso that it can safely navigate the countless edge cases of real-world\ndriving.\"\n\n  Aurora's AWS-powered Virtual Testing Suite is a unique accelerator for\nthe development of the Aurora Driver. Aurora can use data from just one\ntesting situation it observes in the real world to inspire hundreds of\npermutations in the Virtual Testing Suite. That virtual testing helps train\nthe Aurora Driver to more quickly and safely navigate complex situations,\nsuch as road construction, jaywalkers, and unprotected left-hand turns. For\nexample, before the Aurora Driver ever attempted an unprotected left-hand\nturn on a physical road, it completed nearly 2.3 million turns in\nsimulation--estimated to be roughly equal to 20,000 hours of real-world\ndriving practice. Aurora has been running simulations at scale on AWS since\n2019, and plans to triple the volume of simulations it runs on AWS to more\nthan 12 million per day by the end of 2021.\n\n  The offline components of the Aurora Driver software stack all run on\nAWS, including the Virtual Testing Suite, high-definition road maps (the\nAurora \"Atlas\"), machine learning models, and software development tools.\nFor example, Aurora uses Amazon SageMaker (an AWS service that helps\ndevelopers and data scientists build, train, and deploy machine learning\nmodels quickly) to create, run, and continuously refine the machine\nlearning models that enable its driving simulations. With that service,\nAurora accesses Amazon Elastic Compute Cloud (Amazon EC2) instance types\nlike P4d, which deliver the highest performance for machine learning\ntraining in the cloud.\n\n  Before developing simulations, Aurora uses AWS to securely store and\nprocess the petabytes of data it logs during real-world testing, and then\ntrain its machine learning models on that data. The pre-processing\nworkloads run on Amazon Elastic Kubernetes Service (Amazon EKS) and Amazon\nEMR, AWS's service for processing vast amounts of data in the cloud using\nopen-source tools. Aurora's machine learning training workloads then rely\non AWS-optimized deep learning frameworks, such as TensorFlow and PyTorch.\nFinally, Aurora orchestrates and auto-scales its simulation workflows over\nhundreds of thousands of concurrent vCPUs and thousands of concurrent GPUs\nwith Amazon EKS and Amazon EC2, which provides accelerated computing\ninstance types like G4dn.\n\n  \"AWS's highly scalable compute, machine learning, and analytics services\nare helping Aurora move self-driving vehicle technology forward, toward\nbroad real-world use,\" said Swami Sivasubramanian, Vice President of\nMachine Learning at Amazon Web Services, Inc. \"Our reliable infrastructure\nand comprehensive set of cloud services, including industry-leading machine\nlearning services like Amazon SageMaker, provide the ideal foundation for\nAurora to gain insights from the trillions of data points it generates\nevery day to continuously enhance its technology. We are proud to support\nthe acceleration of autonomous vehicle innovation, and look forward to the\nimproved safety and efficiency the transformation of trucking, delivery,\nand mobility will allow.\"\n\n  About Amazon Web Services\n\n  For over 15 years, Amazon Web Services has been the world's most\ncomprehensive and broadly adopted cloud offering. AWS has been continually\nexpanding its services to support virtually any cloud workload, and it now\nhas more than 200 fully featured services for compute, storage, databases,\nnetworking, analytics, machine learning and artificial intelligence (AI),\nInternet of Things (IoT), mobile, security, hybrid, virtual and augmented\nreality (VR and AR), media, and application development, deployment, and\nmanagement from 81 Availability Zones within 25 geographic regions, with\nannounced plans for 27 more Availability Zones and nine more AWS Regions in\nAustralia, Canada, India, Indonesia, Israel, New Zealand, Spain,\nSwitzerland, and the United Arab Emirates. Millions of customers--including\nthe fastest-growing startups, largest enterprises, and leading government\nagencies--trust AWS to power their infrastructure, become more agile, and\nlower costs. To learn more about AWS, visit aws.amazon.com.\n\n  About Amazon\n\n  Amazon is guided by four principles: customer obsession rather than\ncompetitor focus, passion for invention, commitment to operational\nexcellence, and long-term thinking. Amazon strives to be Earth's Most\nCustomer-Centric Company, Earth's Best Employer, and Earth's Safest Place\nto Work. Customer reviews, 1-Click shopping, personalized recommendations,\nPrime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career\nChoice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out\ntechnology, Amazon Studios, and The Climate Pledge are some of the things\npioneered by Amazon. For more information, visit amazon.com/about and\nfollow @AmazonNews.\n\n  About Aurora\n\n  Founded in 2017 by experts in the self-driving industry, Aurora is on a\nmission to deliver the benefits of self-driving technology safely, quickly,\nand broadly. To move both people and goods, the company is building the\nAurora Driver, a platform that brings together software, hardware and data\nservices to autonomously operate passenger vehicles, light commercial\nvehicles, and heavy-duty trucks. Aurora is backed by Sequoia Capital,\nBaillie Gifford, funds and accounts advised by T. Rowe Price Associates,\namong others, and is partnered with industry leaders including Toyota,\nUber, Volvo, and PACCAR. Aurora tests its vehicles in the Bay Area,\nPittsburgh, and Dallas. The company has offices in those areas as well as\nin Bozeman, MT; Seattle, WA; Louisville, CO; and Wixom, MI. To learn more,\nvisit www.aurora.tech.\n\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133400434.MNPRE2133401976-06450620211201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}