{"date": "2021-12-09 16:07:21.981000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_bjr95u6z&amp;referenceId=tag:reuters.com,2021:newsml_OVF7BMQVF_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_bjr95u6z&amp;referenceId=tag:reuters.com,2021:newsml_OVF7BMQVF_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Italy's antitrust said on Thursday it had fined e-commerce giant Amazon 1.13 billion euros ($1.28 billion) for alleged abuse of market dominance. Francis Maguire reports.<br/>Short Link: <a href=\"https://refini.tv/31H7r8S\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/31H7r8S</a><br/><br/>Video Transcript:<br/><br/>Italy has fined Amazon $1.28 billion for alleged abuse of its market dominance. It's one of the biggest ever penalties imposed on a US tech giant in Europe. The country's antitrust watchdog said Amazon had hurt competing operators in the e-commerce logistics market. It accused the firm of abusing its dominant position in the Italian market to help sellers using its logistics service over other rivals. The US giant was alleged to have given those sellers priority when customers searched for a product. The competition authority said it would also impose corrective steps on Amazon that will be subject to review by a monitoring trustee. Amazon said it strongly disagreed with the decision and called it unjustified and disproportionate. It is not the first time Italy has punished Amazon this year. In November, it and Apple were hit with a $225 million fine for alleged anti-competitive cooperation in the sale of Apple and Beats products. The Italian watchdog said the companies allowed only selected resellers to sell the products on Italy's Amazon site.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}