{"date": "2022-01-14 22:37:52.106000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3224.28, "close": 3178.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>mumbai</p></div><div class=\"tr-npp-lead\"><p>mumbai, Jan. 15 -- Amazon.com Inc. is planning to counter Future Group's contention that the Kishore Biyani-led group is bound to choose Reliance Industries Ltd as an acquirer instead of Amazon as an investor because of restrictions on foreign investments in India.</p><p>According to two people familiar with Amazon's plans, the American e-commerce giant plans to show that the Rs.24,713 crore RIL-Future deal also entails foreign money flow into Future Retail Ltd (FRL) as overseas investors hold a substantial stake in RIL and its unit Reliance Retail Ventures Ltd.</p></div><div class=\"tr-npp-body\"><p>\"If RIL can bring in money, Amazon can bring in more for Future Group if needed. The structure proposed by RIL can be easily created with another player to help Future with enough capital. Samara Capital's name was proposed for this purpose only but Future had denied. There are other large investors who can be roped in. Amazon is still willing to help. Future needs just about $800 million as immediate capital,\" said one of the two people mentioned above. The person was referring to the Indian conglomerate's Reliance Retail Ventures unit raising Rs.47,265 crore by selling a 10% stake to foreign investors. Foreign portfolio investors also own shares in parent RIL.</p><p>Private equity firm Samara and Amazon had in 2018 jointly bought Aditya Birla group's food and grocery retail chain, More. The acquisition was through Witzig Advisory Services, a unit of Samara in which Amazon owns a minority stake.</p><p>Amazon may submit its argument on the fund flows to the Supreme Court next week.</p><p>Future Group's counsel has been arguing that it was compelled to choose RIL because Amazon could not bail out Future given the foreign investment curbs on multi-brand retail. Amazon plans to tell the court that even under the existing laws, money can be routed to help struggling FRL, similar to how RIL has structured its Rs.24,713 crore purchase of retail and other assets of Future Group. Amazon invested Rs.1,431 crore in Future Coupons Pvt. Ltd in December 2019, which went straight to FRL as per the agreement between the Future Group and Amazon. Amazon holds 49% in Future Coupons, which, in turn, owns 9.82% in FRL. The Biyani family owns 43.58% in FRL as promoters.</p><p>As per the proposal by RIL, multiple Future entities (including FRL) will merge into Future Enterprises Ltd, post which retail and wholesale undertaking will be transferred to Reliance Retail arm. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}