{"date": "2021-12-08 16:41:46.246000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ZSCALER INC (\"ZS-Q\")\n- Extends its Proven Zero Trust Exchange Platform to Deliver Zero\n- Trust for Workloads\n\n     Zscaler, Inc. a leader in cloud security, announced the general\navailability of its new Workload Communications solution, part of the\nZscaler Zero Trust Exchange(TM), which extends Zero Trust security to\nworkloads and applications hosted in public clouds. Zscaler's cloud-native\nplatform eliminates attack surfaces, prevents lateral threat movement,\ninhibits compromise of workloads, and stops data loss. It also helps IT\nteams simplify multi-cloud workload connectivity by moving away from\ntraditional IP-based routing and VPNs between cloud environments to\nexpedite enterprises' cloud transformation initiatives.\n\n     With the deployment of enterprise workloads in multiple regions and\ncloud providers, legacy mesh networks are becoming costly, hard to\nimplement, scale, and manage. Attempts by legacy vendors to adapt\nantiquated, castle-and-moat VPN and firewall architectures to the public\ncloud have allowed an unprecedented number of cybersecurity attacks, in\naddition to networking and application performance challenges for\nenterprises. As a result, organizations must rethink their approach to\nsecuring and connecting cloud-based applications and consider adopting new\narchitecture able to simplify multi-cloud connectivity, elevate application\nperformance, and provide comprehensive protection. Recent findings from the\nZscaler ThreatLabZ research team underscore these challenges and outline\nthe growing threat from unsecured workloads in the cloud and the need for\ninspection of all content including encrypted traffic.\n\n     To meet these needs, Zscaler has extended its Zero Trust Exchange to\ndeliver the industry's first Zero Trust for cloud workloads solution that\nsecures cloud-to-internet, cloud-to-cloud, cloud-to-data center, and\nintra-cloud communications. Acting as an intelligent switchboard, traffic\nis routed to the Zscaler platform where connections are brokered using\nbusiness policies based on identity and context to connect workloads\ndirectly to other workloads, without accessing the corporate network.\nZscaler's approach eliminates the attack surface by making workloads\ninvisible to the internet, simplifies application connectivity by removing\nnetworking bottlenecks, and delivers superior application performance by\nreducing app-to-app latency. Collaborating with major cloud providers, such\nas Amazon Web Service (AWS), Zscaler delivers a network-agnostic Zero Trust\nfabric to secure cloud workloads and accelerate migration to the cloud.\n\n     Today's general availability of Workload Communications extends the\nproven capabilities of the Zscaler Internet Access(TM) (ZIA(TM)) and\nZscaler Private Access(TM) (ZPA(TM)) services to cloud workloads, allowing\nenterprises to secure all workload communications over any network,\nincluding internet, direct connect, express route and others. With these\ninnovations, Zscaler enables customers to implement the following use\ncases:\n\n     *  Application-to-Internet Communications - Cloud Applications require\naccess to the internet for a variety of reasons, from communicating with\nthird-party Application Programming Interface (API) services to receiving\nsoftware updates. Using the Zero Trust Exchange, internet access is secured\nwith ZIA policies that now include DLP and threat prevention while making\nworkloads completely invisible to potential cyberthreats.\n\n     *  Multi-Cloud Application-to-Application Communications - Multi-cloud\nnetworking allows organizations to secure connectivity across heterogeneous\ncloud environments. ZPA policies secure workload communications across\ncloud providers, regions, and virtual private clouds (VPCs) in the same\npublic cloud for seamless and secure application communication without the\ncomplexities and performance bottlenecks that legacy technologies create.\n\n     *  Intra-Cloud Application-to-Application Communications - To enable\nsecure workload-to-workload communications inside a cloud, VPC/VNet, or\ndata center, Zscaler uses a combination of macro and micro-segmentation to\nverify software identity. This includes microsegmentation of\nbusiness-critical environments to prevent unauthorized communication\nbetween applications.\n\n     \"To properly secure cloud workloads, three critical areas - security,\nconnectivity, and performance - need to be addressed, which legacy\napproaches have not been able to solve,\" said Amit Sinha, President, CTO,\nZscaler. \"Zscaler has solved all three challenges with a new architecture\nthat extends our Zero Trust Exchange, already trusted by thousands of\nenterprises to secure millions of users, to cloud workloads for stronger\nsecurity, simpler connectivity, and better performance. Zscaler's new\narchitecture eliminates the need for organizations to extend their\ncorporate network to the cloud, which results in a bigger attack surface,\noperational complexity and performance bottlenecks.\"\n\n     Customer and Partner Quotes:\n\n     \"As we move more applications to the public cloud, we must ensure a\nhigh level of compliance with internal and external requirements, avoid\nsecurity risks from inconsistently applied controls, and reduce legacy\ninfrastructure costs,\" said Rui Cabeco, IT Service Group Manager &amp; Global\nOutbound Connectivity Lead at Siemens. \"With Zscaler's Workload\nCommunications, we can easily standardize security policies for both users\nand applications regardless of where they are located. We gain visibility\ninto the public cloud, achieve compliance, and lower costs by not\nbackhauling traffic, and simultaneously reduce data center resource\nconsumption.\"\n\n     \"While we share the responsibility of cloud security with our\nenterprise customers, we are customer obsessed in helping our customers\naccelerate secure workload migration to AWS to achieve scalability and\nagility,\" said Mona Chadha, Director of Category Management, AWS. \"Zscaler\nprovides customers with a Zero Trust security model that simplifies cloud\nnetworking and security while eliminating the need for virtual firewalls\nand mesh or site-to-site networks. Having Zscaler solutions available in\nAWS Marketplace allows customers to easily subscribe, accelerate time to\nmarket while meeting compliance and security requirements.\"\n\n     About Zscaler\nZscaler (NASDAQ: ZS) accelerates digital transformation so customers can be\nmore agile, efficient, resilient, and secure. The Zscaler Zero Trust\nExchange protects thousands of customers from cyberattacks and data loss by\nsecurely connecting users, devices, and applications in any location.\nDistributed across more than 150 data centers globally, the SASE-based Zero\nTrust Exchange is one of the world's largest in-line cloud security\nplatforms.\n\n     Zscaler(TM) and the other trademarks listed at\n<a href=\"https://www.zscaler.com/legal/trademarks\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.zscaler.com/legal/trademarks</a> are either (i) registered\ntrademarks or service marks or (ii) trademarks or service marks of Zscaler,\nInc. in the United States and/or other countries. Any other trademarks are\nthe properties of their respective owners.\n\n     Media Relations\n\n Contact Information:\n\nContact:\nNatalia Wodecki\npress@zscaler.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134100892.MNPRE2134102580-08175020211208</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}