{"date": "2021-12-21 14:28:07.921000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SIDUS SPACE INC (\"SIDU-Q\")\n- And KSAT Join Forces to Enable End-to-End Mission Operations\n- Solutions to Support LizzieSat(TM) Constellation of 100\n- Satellites\n\n     Sidus Space, Space-as-a-Service satellite company has selected\nKongsberg Satellite (KSAT), the world's largest provider of ground station\nservices, to be the sole provider of ground station services for their\nLizzieSat(TM) satellite constellation. The Sidus constellation, slated to\nlaunch the first of a planned fleet of 100 satellites in late 2022, will\nconsist of small satellites capable of hosting a variety of custom payloads\nfor any customer mission and collecting space-based data for multiple\nindustries.\n\n     Sidus Space delivers a complete solution for customers, including\nsatellite design and build, integration of technologies, launch vehicle\nrideshares, and ground segment support leveraging an existing global\nnetwork of ground stations. Unlike constellations planned or launched by\ncompanies such as OneWeb, SpaceX (Starlink) and Amazon (Project Kuiper),\ndesigned to provide broadband connectivity, the LizzieSat(TM) constellation\nwill enable rapid delivery of high impact data for commercial and\ngovernment customers.\n\n     KSAT's KSATlite ground network is designed and optimized for small\nsatellite systems, providing streamlined access, through standardized\nAPI-driven interfaces, and scalable support that grows to meet mission\nneeds.Through close collaboration, Sidus and KSAT now provides critical\nlaunch to operations ground segment support for LizzieSat(TM) customers.\nKSATlite has become the dominant SmallSat Ground Network solution,\ncurrently supporting more than 35 000 passes per month, including support\nfor all leading SmallSat operators.\n\n     \"We are incredibly pleased to announce our partnership with KSAT to\nsupport the LizzieSat(TM) constellation. Thanks to our integration with\nKSAT, a well-established and reliable ground station services provider,\nhigh-speed data transmission will dramatically reduce the delivery time of\ngeolocation data to our customers by a factor of three. The services of\nKSATlite will significantly enhance collection and intelligent analysis by\nreturning richer, more precise data down-to-Earth in much less time,\" said\nCarol Craig, CEO of Sidus Space.\n\n     \"We are very happy about this agreement with Sidus Space, a company\nfrom the booming commercial aerospace community in Florida, and we look\nforward to supporting their LizzieSat(TM) constellation. With their future\nfleet of 100 smallsats they will be able to take advantage of the\nscalability and flexibility that the KSATlite network provides to meet the\ndemands in an increasingly interconnected, cloud-based, and data-driven\nworld,\" said Marte Indregard, CCO of KSAT.\n\n     About Sidus Space\n\n     Sidus Space (NASDAQ:SIDU) located in Cape Canaveral, Florida, operates\nfrom a 35,000-square-foot manufacturing, assembly, integration, and testing\nfacility. Sidus Space focuses on commercial satellite design, manufacture,\nlaunch, and data collection, with a mission of Bringing Space Down to\nEarth(TM) and a vision of enabling space flight heritage status for new\ntechnologies while delivering data and predictive analytics to domestic and\nglobal customers. Sidus Space makes it easy for any corporation, industry,\nor vertical to start their journey off-planet with our rapidly scalable,\nlow-cost satellite services, space-based solutions, and testing\nalternatives. More than just a \"Satellite-as-a-Service\" provider, we become\nyour trusted Mission Partner from concept to Low Earth Orbit and beyond.\n\n     Sidus is ISO 9001:2015, AS9100 Rev. D certified, and ITAR registered.\n\n     About KSAT\n\n     KSAT, Kongsberg Satellite Services, is the market leader in providing\nground communication services for spacecraft and launch vehicles to the\ncommercial and institutional space sector. Supporting more than of 70,000\nsatellite ground communication links a month, their extensive network of\nmore than 200 antennas across the globe is constantly expanding. KSAT has\ndeveloped and deployed a modern software-defined ground station\narchitecture and is positioned to support any mission in LEO, MEO, GEO and\nHEO, as well as Lunar missions.\n\n     For investor and media inquiries, please contact:\nJames Carbonara\nHayden IR\n(646)-755-7412\njames@haydenir.com\n<a href=\"https://www.sidusspace.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.sidusspace.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135400241.MNPRE2135401215-06264620211221</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}