{"date": "2022-01-05 10:30:10.216000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_98xm2um8&amp;referenceId=1_98xm2um8&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_98xm2um8&amp;referenceId=1_98xm2um8&amp;pageId=RefinitivNewscasts</a></pre>Source: Thomson Reuters<br/><br/>Description: This year’s Breakingviews book of predictions and prescriptions examines the extraordinary shifts shaping finance, business and economies across the globe. Rob Cox walks through some of the highlights, including winners we expect to emerge and deals we’d like to see happen.<br/>Short Link: <a href=\"https://refini.tv/3EN9m9T\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3EN9m9T</a><br/><br/>Video Transcript:<br/><br/>This video is sponsored by Refinitiv, a London Stock Exchange Group business, powering financial markets around the world. <br/><br/>The biggest breakup is going to be the breakup of the letters E,S, and G. They have to be looked at separately.<br/><br/>Welcome to a Breakout with Breakingviews. Iâ\u0080\u0099m Swaha Pattanaik, a Global Economics Editor. Today, I'm talking to our Editor-in-Chief, Rob Cox about Breakingviews Annual Predictions Project. Hello, Rob. <br/>Hi, how are you?<br/>Good. Thank you. Predictions are hard. Predicting what's going to happen in the coming year is usually very difficult. COVID has made things even more complicated. That said, there are some themes that are emerging, and you've got an overarching idea for this year. What is it?<br/>Basically, everything is in transition, so when we were thinking about the themes this year, it occurred to us that it's not so much that things are happening and changing and then going back to normal but that we're going from one state or condition to another which is the textbook dictionary definition of a transition. So, we basically come up with a few of the big transitions. You want to know what they are? Okay, so you know about the ecological transition. This is the big one where the world is having to shift away from hydrocarbons to something else, to something that doesn't emit carbon dioxide in the atmosphere. And so, while this is something that's going to take many years to get there, I mean, it's going to take, you know, until 2050 for most of the world to get to carbon neutral, a lot of the decisions and a lot of the big investments that companies in particular need to make, will be made now and in the coming year and the next couple of years. So, this is sort of make-or-break time. And so we've got a few really interesting views that are related to the ecological transition in the book. Some of them in fact, I think, Swaha, you may have edited one or two, one of them was just about the extraordinary reengineering project that we call German, a country that is hugely focused on manufacturing and particularly the internal combustion engine. And with an energy supply that comes from whether it's Russian gas or even coal, so things like this are going to be huge, huge transitional moments in the coming year.<br/><br/>Absolutely. I mean, the other thing that's going on, though, with all the other transitions that are going on with money, even sort of what sorts of money we use, let alone the price of money. You mentioned that there is one transition that's not a transition in fact that has to be managed to change about social inclusion. What are your thoughts on that? <br/><br/>Well, I think sort of over overhanging all of these transitions, the ecological transition, whether it's the transition to digitalization, that's been happening of course for many years, but the COVID-19 pandemic, the lockdowns around the world, they really accelerated this transition. And so, companies, some companies that are kind of winning it extraordinarily, Amazon and others, and then smaller companies or small businesses, middle-sized businesses are really having a hard time. So, this is a year that we're going to see some of that shakeout, and we'll see some government response to it. But the as you say, there's this question around all of these almost equity and fairness. And so, if you want the world to move forward, you want people to move forward with the extraordinary decisions that are going to be needed to be taken, whether it's, you know, getting rid of your gas boiler and putting some electric thing in or getting rid of your gas guzzler and buy an electric vehicle. All of these things are going to require people to be involved. I mean, we saw what happened just a few years ago when the French government tried to impose a higher price on diesel engines or reduce speed limits on highways. They had the -- Revolution. So what you see is, if you don't have a just transition for all of these things, then it will fail. We will have social unrest, and we really won't get to any of the ambitions that governments and companies around the world have pledged themselves to.<br/>And you started, of all the transitions, you started by talking about the ecological one. And one of the things that's increasingly emerging in the finance world, is that everything is being done at the same time, in the sense you can't take ESG and put it separately as a different lens. You have to look at it at the same time when you're looking at returns. So how does that play as you look to the predictions, what's coming up for different regions? Is that true that everything has ESG running through it?<br/><br/>And well actually one of our predictions written by yours truly is that we have, the biggest breakup is going to be the breakup of the letters: E, S, and G, they have to be looked at separately. Environmental is huge, the E, right? This is the ecological transition. We have an entire, by the way, another chapter which is sort of I considered a subchapter, but we had so many pieces that it's just about the end of the internal combustion engine and the shift to electric vehicles. The other is S, the S for society. I mean, we talked about that, the just transition, the need to think about a company. I mean, it's quite funny, if you think about a company that might have a big coal business, and if they decide to shut down their coal factory or their coal production somewhere and in a country with 6,000 workers, say. Now they might get a thumbs up on the east side, but they've just laid off 6,000 people in some country in the world where those people are reliant upon that business. That's a ding on the S side, right? So you have to start to, you really do have to start to look at these things on their own basis, and the same with governance, of course. So that's in fact one of our predictions. The other is that this whole move towards the E in particular is actually going to fuel M&amp;A. So a lot of what we see in terms of mergers and acquisitions in the coming year will be associated. And not just with the sort of what some people call greenwashing or green virtue signaling, but actual companies who are trying to figure out, they realize they need to meet these extraordinary ambitions they set themselves up for and that their shareholders expect. And so they're going to use M&amp;A to get there. <br/><br/>Right. Well it sounds like it's going to be a meaty book, I look forward to reading it. Having said that, as part of the Breakingviews family, I have to admit, however smart my columnist friends are, or we are together, we donâ\u0080\u0099t always get everything right, but what we do guarantee is a very provocative read about some of our not just predictions but prescriptions. Could you pick up perhaps one or two of the most provocative ones that are coming up in peopleâ\u0080\u0099s inboxes in this year. <br/><br/>Yeah, Okay. So some very simple ones where we try to stick our necks out. As you said, we'd go out on a limb because what's the point? Otherwise, it's not interesting. We're not fortune tellers, we can't tell you exactly what's going to happen, but we can give some really interesting ideas. So some of them, for instance, are that Microsoft is going to be the big winner out of the extraordinary digitalization that's happening. Which is kind of funny because if you say Microsoft, they've been around since people wearing bell-bottom jeans in the 1970s. We see them winning out even against Facebook, which is of course has changed its name to Meta, in Metaverse. We also see them winning in many respects on the shift to working from home, the shift to remote working in general has been great for them. And they don't have the same issues around antitrust, they had them many years ago of course, but you don't have the same questions around them that you have with Facebook or even Amazon. Another one we're looking at in geopolitics is the question of Saudi Arabia. Over the past few years, foreign direct investment has been pretty low. That's in part because of the killing of Jamal Khashoggi, the dissident journalist. But now we have this view that actually bankers and companies are going to start to use Riyadh as their base, perhaps of their regional headquarters rather than places like Dubai. So it goes from a no-go to FOMO. George Hay wrote that particular piece, it would be interesting to watch the reaction to it. We also have a view that Morgan Stanley, which has been really one of the, perhaps the most successful apart from JPMorgan, company on Wall Street or Wall Street Bank over the past few years. We may start to see the end of the James Gorman era, not necessarily that he's going to leave next year but weâ\u0080\u0099ll have a very clear indication of who his successor will be. And then out in China, we've got a view about this sort of emerging tech giants there. Everything has been shifted of course by government fiat and government changes. But we have a view that actually Jack Maâ\u0080\u0099s Ant, the financial services business that he founded alongside Alibaba, is going to be a standout in 2022. <br/><br/>Great, looking forward to reading those. Thanks Rob, great to have a bit of an overview on what's coming up. This was a Breakout from Breakingviews with Rob Cox and Swaha Pattanaik. Thank you.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}