{"date": "2021-11-10 14:00:00.437000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Under Armour Selects AWS as Its Preferred Cloud Provider for SAP Environments</b>\n</p><p class=\"bwalignc\">\n<span>One of the world’s leading athletic performance brands moves business-critical SAP workloads to AWS to increase reliability and scalability, and accelerate digital transformation</span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced that Under Armour, Inc. (NYSE: UA, UAA) has selected AWS as its preferred cloud provider for SAP to increase resilience, enhance security, and provide more significant insights across its business. The athletic performance brand completed the migration of its SAP environments to AWS earlier this year, providing the foundation for improving performance and visibility across its design, merchandising, planning, manufacturing, supply chain, and sales distribution channels. Under Armour will now integrate its SAP environments with AWS’s broad and deep set of technologies, including analytics, machine learning, compute, and storage. Powered by the world’s leading cloud, this modernization brings a range of AWS capabilities to fuel innovation in areas like 3D apparel and footwear design, digitally connected footwear and apparel, resource-efficient production, direct-to-consumer sales, and global wholesale distribution.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211110005192/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211110005192/en/</a></p><p>\n“AWS is a critical element of our digital transformation, and we look forward to harnessing its industry-leading cloud capabilities as we enter our next stage of growth,” said Under Armour Chief Technology Officer Danny Miles. “With SAP in the cloud, we can now apply deep analytics and machine learning capabilities to drive greater efficiency across our business. With AWS, we are optimizing our product innovation processes to deliver premium consumer experiences wherever and whenever our customers choose to engage our brand.”\n</p><p>\nUnder Armour accelerated its SAP migration with the help of the AWS Professional Services team, shifting its SAP landscape to the cloud in less than six months. As part of the migration, Under Armour moved its enterprise resource planning (ERP), supply network collaboration, global trade services, enterprise reporting (BI, BOBJ), integration (PI/PO, data services), SAP Fiori, and solution manager workloads to AWS. Following the migration, the company implemented CloudEndure Disaster Recovery, AWS’s service for scalable, cost-effective business continuity for physical, virtual, and cloud servers. With this move, Under Armour can maintain optimum system performance and minimize downtime and data loss with a cross-Region disaster recovery solution that includes 65 servers replicating from one AWS Region to another.\n</p><p>\n“Under Armour set out to find the best cloud environment for its most crucial applications and achieved that with AWS. We’re helping Under Armour improve its responsiveness and scalability companywide, while operating more securely,” said Greg Pearson, Vice President of Worldwide Commercial Sales at Amazon Web Services, Inc. “As the operational backbone of Under Armour's business, maintaining a resilient SAP landscape is essential to empowering operational efficiency and speed to market. Like thousands of organizations that choose to run their SAP workloads on AWS, Under Armour did so because of our reliable and scalable infrastructure and breadth of services that help them get the most value out of their data.”\n</p><p>\nBacked by its unmatched experience in running SAP workloads, AWS helps customers get the best performance and most value from their mission-critical SAP platforms. Running SAP on AWS gives customers the control and confidence to securely run their business, leveraging the most reliable and scalable infrastructure, the broadest set of cloud capabilities, and the largest community of technology partners to help with SAP migration and modernization.\n</p><p>\n<strong>About Amazon Web Services</strong>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52525517&amp;newsitemid=20211110005192&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=1&amp;md5=e7fec3538651bc76165da5f28ce458a3\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<strong>About Amazon</strong>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Famazon.com%2Fabout&amp;esheet=52525517&amp;newsitemid=20211110005192&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=2&amp;md5=5a3969d7ef96399d8762f09a82e5539d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p>\n<strong>About Under Armour</strong>\n</p><p>\nUnder Armour, Inc., headquartered in Baltimore, Maryland, is a leading inventor, marketer and distributor of branded athletic performance apparel, footwear and accessories. Designed to empower human performance, Under Armour’s innovative products and experiences are engineered to make athletes better. For further information, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fc212.net%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D3232520-1%26h%3D1737715340%26u%3Dhttp%253A%252F%252Fabout.underarmour.com%252F%26a%3Dhttp%253A%252F%252Fabout.underarmour.com&amp;esheet=52525517&amp;newsitemid=20211110005192&amp;lan=en-US&amp;anchor=http%3A%2F%2Fabout.underarmour.com&amp;index=3&amp;md5=95444f1272ac550998cad90e245515bc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://about.underarmour.com</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211110005192r1&amp;sid=ny6r1&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTEwMDA1MTkycjEmc2lkPW55NnIxJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=6e6e539ebe668dc747982f6cc521859762bdd924c431bf3e608e203dd43b5e2eb555c55daa318545637229e4d2adfab93e118263bdb4402426fcb17fdce244db\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211110005192/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211110005192/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52525517&amp;newsitemid=20211110005192&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=4&amp;md5=f633b950e1374db61bc7d5373a93ecb6\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON/UNDER-ARMOUR</p></div>"}