{"date": "2021-12-10 01:31:00.163000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n<b>Mike Grella Joins Gotspace Data Partners As Chief Operating Officer</b>\n</p><p>\n<span>Former Amazon Director of Economic Development to Support New England’s Transformation into the next US data center corridor.</span>\n</p><p>\nGotspace Data Partners, a Boston based data technology development company, today announces the exciting addition of former Amazon Director of Economic Development Mike Grella, as the company’s new Chief Operating Officer. In what is being touted as the largest data center development start-up in the northeastern United States, Grella will help guide Gotspace in their master development of a new digital infrastructure corridor between New York and Boston.\n</p><p>\nGrella's guidance and oversight of the company's regional plan is strategically designed to meet the critical IT needs of 35 million users across almost 60,000 square miles through seven states using existing national multiple fiber providers. Gotspace has secured at least 1,500 acres of land in Wallingford, Groton, Griswold, and Bozrah, Connecticut for its data hubs, providing the best location for inter-connectivity of the region’s growth plans for data center and other technology intensive infrastructure.\n</p><p>\nWith seven campuses that can accommodate 25+ hyperscale data centers in its pipeline, Grella is confident the company's campuses will be highly attractive to Fortune 500 US and multi-national companies for their cloud computing and data storage needs. The region is home to 10% of the country’s population and the center of gravity for more than 100 major insurance companies, large medical technology, and pharmaceutical, gaming, financial institutions, defense contractors, and other technology companies.\n</p><p>\nIn his roles as Legal Director, Director of Public Policy, Director of Infrastructure, and Director of Economic Development for Amazon from 2012 to 2019, Grella was responsible for many public-private partnerships and was instrumental in facilitating the expansion of Amazon’s e-commerce logistics and last mile delivery network. Grella also collaborated with hundreds of federal, state, regional and local officials to support Amazon’s construction of tens of millions of square feet of new development.\n</p><p>\nGrella was also responsible for the economic development function for Amazon Web Services, the company’s fastest growing and most profitable global data center business segment supporting billions of dollars in infrastructure investment, and the strategic planning of large -scale data center hub projects and critical data center deployments around the world.\n</p><p>\n“At Amazon, Mike Grella played an important role in the e-commerce and data center boom over the past decade,” says Nicholas Fiorillo, President, Gotspace Data Partners. “He has guided large scale digital infrastructure developments worth billions of dollars across the United States and around the world. We expect that Mike Grella will bring the leadership skills that made him historically effective at Amazon to the master planning and development roll out of the region’s data center corridor expansion as well as other industrial uses including e-commerce &amp; advanced manufacturing, and we are proud that Gotspace can continue to play its role helping the state of Connecticut and the entire New England Data Corridor become an immediate reality heading in 2022.”\n</p><p>\n“The New England region is home to nearly 15 million people including the most affluent, educated, connected data users and consumers in the country. With that said, the availability and scalability, and of infrastructure-ready, connected sites is limited,” says Grella. “With our reliance on e-commerce, remote work, streaming, internet and connected devices, in addition to the proliferation of 5G networks and autonomous vehicles, and the world's insatiable need for low latency connectivity and cloud computing infrastructure from hyper-scale to last-mile edge computing, New Englanders are under served and Gotspace stands ready to address growing market demand.”\n</p><p>\n“With Mike Grella now at the controls, the Gotspace team has all the right stuff to become the brightest star to shoot out of the Boston tech-startup world in recent memory. We are on course to attract digital visionaries, tech leaders and disruptors of all things digital, within the e-commerce and data center development, operations and app services under Gotspace digital brands, explore strategic partnerships with the nation’s biggest content providers and leverage the company's 6.5m digital infrastructure pipeline into all e-commerce sectors, to serve the New England market,” Fiorillo adds. “Gotspace is also consulting with Nabeel Mahmood, whom he considers the <span>Tony Stark</span> of the Digital World and is hopeful that he can continue to bring together what he considers the Guardians of the digital galaxy onto the Gotspace team. We are thrilled to work with Mahmood, world renowned technologist, futurist, his data insight driven technology firm, and team of Industry 4.0, big data innovators, engineers, power and technology experts to support Gotspace as we are at the tip of the spear building out the New England Data Center &amp; Technology Infrastructure Corridor.”\n</p><p>\nGotspace Data Partners played an integral role in bringing one of the US’s best data tax incentive bills to reality in March 2021, then Connecticut governor Ned Lamont signed into law this past summer, this new law is a best-in-class data tax incentive program (State of Connecticut HB 6514). These incentives include a 20-30 year sales, use and property tax exemption with an investment of $200-$400 million and maybe just what Big Tech and Big Data has been searching for. The 30,000 members of the Connecticut State Building Trade Counsel have raised support and voiced their excitement for the potential building boom that would come along with this large -scale master development project.\n</p><p>\n“At the beginning of the year, Gotspace entered into a project labor “PLA” with the Connecticut State Buildings Trade Counsel “CSBTC” and continues to pledge to local unions and our state based tradespeople and technological businesses, the company is hopeful that Connecticut could see eventually thousands of jobs and some immediate and desperately needed construction jobs and are hopeful that many more industry specific high paying e-commerce jobs will be created in the near term for the great State of Connecticut,” Fiorillo says.\n</p><p>\nGotspace is continuing its critical path to break ground on multiple-data centers on more than 1,500 acres of land controlled by the company in the state of Connecticut.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211209006147r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjA5MDA2MTQ3cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=68b53f9cedf0ac3f1f725547c68555cb662e2650c0f7d4c25e155f860d0784ba658703611f77e4e07f19724a1135c97ffc7478ab12a86716ded1a88505b518e1\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211209006147/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211209006147/en/</a></span></p><p>\nCasey Sherman\n<br/><a href=\"mailto:csherman@regancomm.com\" data-type=\"email\" translate=\"no\">csherman@regancomm.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: MA-GOTSPACE-DATA</p></div>"}