{"date": "2021-11-02 12:48:11.082000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BARISTAS COFFEE CO INC (\"BCCI-0\")\n- Opens for Business\n\n   Baristas Coffee Company/Munchie Magic dba Thai Dah announced that its\nrevenues in October from its Munchie Magic virtual restaurants delivering\nBen &amp; Jerry's ice cream, beer, wine, hard alcohol, and other snacks have\nreached another all-time high. In addition, its Thai delivery restaurant\n\"Thai Dah\" began taking orders further contributing to October's revenues.\n\n(figure class=\"image\")(/figure)(figure class=\"image image_resized\"\nstyle=\"width:648px;\")(/figure)(figure class=\"image image_resized\"\nstyle=\"width:256px;\")(/figure)     October revenues more than tripled from\nthe same period in 2020. Alcohol sales continue to increase, yet ice cream\nremains the No. 1 selling product.\n\n   During the Month of October Munchie Magic opened 6 additional locations\nand one Thai Dah location and expects to open more during November.\n\n   Barry Henthorn, CEO, stated: \"The continued expansion of Munchie Magic\nis very encouraging. Furthermore, now that we have been able to begin\nreceiving revenues from Thai Dah as well, we expect that overall revenues\nwill continue to increase month over month.\"\n\n   Thai Dah is led by international Thai superstar Front Montgomery. Named\n\"The Most Beautiful Woman of All Time\"\nwww.mostbeautifulwomenintheworld.com, Front Montgomery became one of Asia's\ntop all-time supermodels in the 80s emerging into one of the most\nrecognized and beloved actresses and spokeswomen. Front is a Thai American\ninternational supermodel, businesswoman, and 'A List' actress with\ncountless roles in television, theater, and movies. She has also been the\nface and body for worldwide brands such as Coca-Cola, Wimbledon, Ponds,\nWacoal, and Benetton, among others. She has appeared in over 100 Television\nseries and specials as an actress or celebrity over the past 20 years.\nFront has been featured on the cover of countless magazines, profile\npublications and theatrical release films.\n\n   Thai Dah provides Thai cuisine prepared and packaged by our Thai\nrestaurant partners, delivered to our customers by our delivery partners\nUber Eats, Grub Hub, and Door Dash. Thai Dah provides all the technology,\nmarketing, advertising, and industry knowledge. Restaurant partners use\nonly one integrated tablet for all our delivery partners as well as for all\ntheir existing or future delivery partners at no additional cost. We\nprovide the tablet and training; all restaurant partners need to do is be\nready to sell what they already prepare in their restaurant!\n\n   Baristas recently expanded its technology/software license and\ndevelopment agreement with its primary technology and media partner\nReelTime Media (OTC PINK:RLTR) beyond Munchie Magic/MiniBar Magic to\nfeature Thai Dah, a virtual restaurant platform for Thai restaurants. The\nlicensing agreement allows Thai Dah to have rights to utilize the global\nperpetual technology license and methodologies developed by ReelTime that\nallow the virtual restaurants to integrate with its partners, onboarding,\nmarketing, and administrative functions.\n\n   Baristas \"Munchie Magic\" has opened more than 50 locations in the past\ntwelve months in 10 states delivering Ben &amp; Jerry's ice cream, snacks,\nbeer, wine, hard alcohol, and hot foods to customers via delivery partners\nDoorDash, GrubHub, and Uber Eats. www.baristas.tv www.munchiemagic.com.\n\n   In exchange for the global perpetual exclusive license from ReelTime for\nthe Munchie Magic/MiniBar Magic, and Thai Dah concepts and derivative\nVirtual Restaurants, ReelTime receives a per transaction license fee of\n$.35 in perpetuity in conjunction with the terms of the agreement beginning\non August 11th, 2021.\n\n   ReelTime maintains all rights and derivative works for non-Munchie\nMagic, MiniBar Magic, and Thai Dah applications.\n\n   The media buys, integration, technology development, IP, and other\ncutting edge marketing for the virtual restaurants are made possible and\nare being created via digital media/technology frontrunner ReelTime Media\n(OTC PINK:RLTR) www.reeltime.com. The integration consolidates and analyses\ndata from the delivery partners DoorDash, Uber Eats, and GrubHub along with\nsales, cost information, and pertinent demographics from Munchie Magic/Thai\nDah' Pick up Partners. ReelTime Media's capabilities are redefining how\ncompanies are evaluating and purchasing their TV, radio, print, and other\nnew digital media.\n\n   About ReelTime Rentals, Inc. d/b/a ReelTime Media: www.reeltime.com, is\na publicly-traded company based in Seattle, WA (OTC PINK:RLTR). ReelTime\nMedia provides end-to-end production capabilities and discount media\npurchasing that is redefining how companies are evaluating and purchasing\ntheir TV, radio, print, and other new media. ReelTime is also is in the\nbusiness of developing, producing, and distributing Virtual Reality Content\nand technologies. We have an end-to-end production, editing, and\ndistribution capabilities for internal and external projects. ReelTime\ncurrently produces three ongoing series for the Samsung Gear VR platform\nand distributes them over numerous VR delivery portals including Gear VR,\nOculus, Veer VR, HTC Vive, YouTube 360, Facebook, and others. ReelTime\nMedia also publishes the book \"It Was Always Me Edward Edwards the Most\nProlific Serial Killer of All Time\" which has been the subject of a cover\nstory on People Magazine, Rolling Stone, In Touch, and a six-part series on\nParamount network, www.itwasalwaysme.com.\n\n   About Baristas Coffee Company/Munchie Magic: Baristas is a\npublicly-traded national Coffee Company that is recognized throughout the\nUS. It is the majority shareholder of Munchie Magic, Inc. which manages the\nvirtual restaurant which delivers Ben &amp; Jerry's ice cream, Baristas Coffee,\nand other snack foods via third-party delivery partners. Baristas also owns\nand operates the virtual restaurant Thai Dah which delivers Thai cuisine\nthrough its delivery partners. Baristas currently produces and sells\ncoffee-related products under the Baristas brand. The Baristas White Coffee\nsingle-serve cups compatible with the Keurig 2.0 brewing system is the\nbestselling product in its category. Baristas also markets other\ncoffee-related products. Baristas gained mainstream exposure when it became\nthe subject of \"Grounded in Seattle\" the reality show special feature which\naired on WE tv. It has been featured nationally including during Shark Tank\non CNBC with Front Montgomery, CNN, ESPN, Food Network, Cosmopolitan\nMagazine, Forbes Magazine, Modern Living with Kathy Ireland, Sports\nIllustrated, NFL Monday and Thursday Night Football with Megs McLean, at\nNASCAR Races, The Grammys, NBA TV, and other notable media.\n\n(figure class=\"media\")(/figure)     In Other News:\n\n   Baristas \"Munchie Magic\" Revenues Reach Record Highs in August and 6\nMore Locations Open Furthering Expansion\nBaristas \"Thai Dah\" Signs Superstar Front Montgomery as Spokesperson for\nthe National Virtual Thai Restaurant\n\n   Baristas Revenues Surpass 2020 Sales on Amazon of White Coffee in Just 5\nMonths - On Track to More than Double as Amazon Continues Increased\nInventory Allocation to Meet Demand\nBaristas Munchie Magic Hits Record Sales Resulting from Surge in Hard\nAlcohol, Beer, and Wine Delivery Along with Ice Cream, Snacks, and Hot\nFoods to Customers Where Permitted Across the Country\nBaristas Munchie Magic to Open Tenth State North Carolina, Delivering Ice\nCream, Snacks, Hot Food, and Where Legal Beer, Wine, and Hard Alcohol to\nCustomers in The United States From More Than 50 Locations\n\nBarry Henthorn\nbarry@baristas.tv\n\nTel   : 206-579-0222    BARISTAS COFFEE CO INC\nWWW   : <a href=\"https://www.baristas.tv\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.baristas.tv</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130500407.MNPRE2130501615-05470620211102</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}