{"date": "2021-11-04 07:17:51.733000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Leaders of the world's biggest economies gathering in Rome today,</p><p>ahead of the first in person G20 Summit since the pandemic began. Mark</p></div><div class=\"tr-npp-body\"><p>Zuckerberg rebranding his social media giant with a new name. Apple and</p><p>Amazon, both warning that supply chain disruptions limited sales in the</p><p>past quarter.</p><p>&lt;Time: 09:00&gt;</p><p>&lt;End: 09:59&gt;</p><p>[09:00:31]</p><p>JULIA CHATTERLEY, CNN BUSINESS ANCHOR, FIRST MOVE: Live from New York, I'm Julia Chatterley. This is FIRST MOVE and here is what you need to know.</p><p>Political pantheon. Leaders of the G20 nations gather in person in Rome.</p><p>Supply shocker. Apple and Amazon sales take a hit so do their shares.</p><p>And Meta metamorphosis. Mark Zuckerberg moves to the Metaverse to rebrand Facebook.</p><p>It's Friday. Let's make a movie.</p><p>A war, welcome once again to FIRST MOVE this Friday where we are already talking about the weekend. Why? Well, we are still working on for the G20 leaders coming up this hour. We'll have the latest from Rome with COVID recovery and climate, all up for debate. President Biden meeting with the Pope at the Vatican just a short while ago. The President also praying, I think, for a breakthrough in D.C. where divisions remain within his own party over his signature at spending bills.</p><p>We're also on the COP 26 countdown with the climate catastrophe alarm already ringing loud and clear. We are all about finding the right solutions on this show, and to help us today, sustainability sage. The former Unilever chief, Paul Polman and author of new book \"Net Positive\" will tell us how CEOs especially can reduce their carbon footprint.</p><p>But first, of course, you need to know your shoe size, and that is where climate tech firm Persefoni comes in, helping big companies measure the damage and tackle it.</p><p>The climate on Wall Street fall like. The NASDAQ set to pull back from record highs after Halloween like earnings from the two tech giants, Apple and Amazon, both warning that supply chain disruptions limited sales in the past quarter. Shares of both firms down sharply in premarket trade. It's all relative. Remember these two have completely soared this year.</p><p>Fright night over in Europe, too, with new numbers showing Eurozone inflation at 13-year highs, prices and global inflation, another thing we'll add to the G20 agenda. It's a full one.</p><p>Let's get to the drivers because that's where we begin.</p><p>Leaders of the world's biggest economies gathering in Rome today, ahead of the first in person G20 Summit since the pandemic began. Though some of course, will be joining virtually. It's the second major overseas trip for U.S. President Biden, who will travel directly from Rome to Scotland for the COP 26 Climate Talks.</p><p>His first meeting, as I mentioned already today with Pope Francis and Ben Wedeman joins us from Rome. Ben, great to be with you, a busy morning for President Biden. An emotional, deeply religious man himself, of course, I think meeting the Pope once again will be an incredibly special moment. Many of the discussion topics though, with the Pope, similar to what he is going to be discussing with the G20 leaders whether it's climate recovery, or whether it's tackling vaccine inequity. Many things to discuss over the coming days.</p><p>BEN WEDEMAN, CNN SENIOR INTERNATIONAL CORRESPONDENT: Yes, in fact, President Biden, who is normally late for most events arrived right on time at noon for his meeting with Pope Francis. This isn't the first time the two men have met, but it is the first time they have met Biden as President of the United States.</p><p>Now, the media was not allowed to see the moment when they actually met in the Apostolic Apartment, but we understand that they discussed climate, poverty, social justice issues that the Pope has been quite outspoken about, and certainly recently, he gave a statement that was very blunt. In that, for instance, he was calling for pharmaceutical companies to share the formula to the COVID vaccines with developing countries so they could produce vaccines themselves.</p><p>He also called for the powerful countries of the world to stop using sanctions as a weapon against other countries because as we've seen so many times, sanctions are very blunt weapon that oftentimes hurts people more than those in power.</p><p>So, this, we understand was a cordial meeting between the two men. President Biden, of course, is a regular church going Catholic and so, yes, this was a meeting of great emotional value.</p><p>[09:05:06]</p><p>WEDEMAN: But also given Pope Francis's advocacy for fighting climate change, it is a good boost before he goes into the meeting tomorrow, where they might -- he might be dealing with some among the G20 leaders who aren't quite, shall we say, enthusiastic when it comes to the fight against climate change -- Julia.</p><p>CHATTERLEY: Yes. And of course stopped on the Hill and announcing the framework at least for a monster $555 billion portion of his spending plan arrangements that will tackle climate specifically.</p><p>Ben, onwards to meetings today as well. He is going to be meeting, I believe, Mario Draghi, the next leader, of course, to discuss what?</p><p>WEDEMAN: Well, first, he will be meeting with the Italian President, Sergio Mattarella and then he will be meeting with Mario Draghi. Now, Mario Draghi, prior to this meeting, has come out and said that the G20 meeting is going to be a new chapter in multilateralism after years of isolation -- isolation under Donald Trump's America First policy, but also isolation as a result of the COVID pandemic. We shall see if his wish actually comes true, however.</p><p>And then he is meeting with French President, Emmanuel Macron, and of course, there is that very touchy subject of that $60 billion French submarine deal that France had concluded with Australia, and then Australia and the United States behind France's back concluded another deal, and Australia canceled the French deal.</p><p>So there is a lot of bad blood at the moment between the United States and France over that deal, and we understand that the Americans may be offering to provide logistical assistance and other forms of support for France's counterterrorism activities in Africa -- Julia.</p><p>CHATTERLEY: Yes, so we actually have live pictures as you mentioned. Now, American President Joe Biden set to meet imminently the Italian President Sergio Mattarella at the Quirinal Palace. I believe we're seeing her live pictures of him there walking, about to make that greeting, I believe as Ben was just saying there ahead of that meeting with Prime Minister Mario Draghi, and of course, then Emmanuel Macron, the French President, too.</p><p>So a whole host of Presidents, we can see him now walking, not quite sure how close he is actually to officially greeting or being greeted by the Italian President, but we should see him momentarily.</p><p>We can stay with it for a few moments here just to see whether we get it.</p><p>A laughing and smiling Joe Biden there as you can see.</p><p>No, we'll move on. Ben, I'll thank you and we'll just keep those pictures in vision for our viewers just in case so we see that handshake there.</p><p>Ben Wedeman. Thank you so much for that.</p><p>One of the noticeable absentees from the in person Summit, as Ben was mentioning, Chinese President Xi Jinping, he decided to attend the meeting via video link.</p><p>The leaders of Russia, Japan, and Mexico are also not traveling to Rome.</p><p>David Culver, joins us with more from Shanghai as we allow Joe Biden there to walk what is an extended red carpet there, let's be clear.</p><p>David, and also, I think context with President Xi Jinping is important, too.</p><p>President Xi has not left China since early 2020, so not a surprise not to see him attend these meetings in person.</p><p>DAVID CULVER, CNN CORRESPONDENT: Well, as you're looking at those live pictures of President Biden waiting to shake hands, as you point out, there will be no handshake from President Xi.</p><p>You're right, he is not leaving China. He hasn't left since before the pandemic, and so it's not surprising that he is not going to be attending that G20. We do not expect him to attend COP 26 either. That doesn't mean there aren't contributions and there aren't dialogues and exchanges to take place. In fact, just a few moments ago, we learned that President Xi just got off the phone with Boris Johnson at the U.K., a few days ago speaking with Macron of France. He spoke in September with President Biden.</p><p>So he has been making the rounds, if you will ahead of this, because one of the most important parts of the G20 can be those side meetings where they have the one-on-one opportunities.</p><p>Now, why is he not going? That is the question. Beijing, of course, does it put up too much information, Julia, on these things. But you can say perhaps it's because there's a recent COVID outbreak, a surge in Beijing and scattered throughout the country right now. And if you compare the numbers to other countries, not all that bad, double digits daily.</p><p>But for China with this zero tolerance approach, it is an issue. And so they're clamping down once again, or perhaps it's because, why would you go to a party when everyone is talking about you? I mean, that's going to be the reality for a lot of these leaders. They are talking about how to deal with China and strategizing their coalition, because, of course, with President Trump, there really wasn't that much unity in coming up against China.</p><p>[09:10:18]</p><p>CULVER: Now, under President Biden, that's been a different approach. He has been trying to engage a lot of the other world leaders to have a solid and unified approach when it comes to dealing with the People's Republic of China.</p><p>And there is also the reality that going forward, President Xi has a lot of dealings to work out with regards to certainly climate, and trying to stabilize the domestic region here. I mean, that's the other part of this, Julia, is when you look at him, not going and not making these dealings with other leaders, well, that plays right into the nationalism that's been growing here, and it certainly shows that he is not willing to necessarily meet them on their terms, if you will, physically, and ultimately may wait for them to make visits to China.</p><p>CHATTERLEY: And perhaps that's for some, at least, the international perception, too, particularly as we head into COP 26, the lack of presence of Xi Jinping is a message to say, look, you've had all you're going to get as far as China is concerned.</p><p>How true is that in practice, David, do you think?</p><p>CULVER: I've been speaking with a lot of experts, you know, some of the folks who are even involved in some of the dealings when it comes to climate, and I think you actually may see more coming out of China.</p><p>I know, right now, they've put forward where they're not going to be investing internationally, for example, in future coal power plants. Domestically, a very different story. In fact, we did a trip two years ago, an investigation into Inner Mongolia. China had pledged at the time that they weren't going to be going forward with many more coal power plants. What we saw there were new construction, coal power plants going up, a lot of mining underway, so they clearly were still moving forward in that direction. And domestically, it's required.</p><p>I mean, they've even tried to rein back some of the emissions as the biggest polluter in the world, but they had a massive power outage. I mean, this was a crisis that they had in recent weeks, where they had folks trapped in elevators, traffic lights going dark. All the folks in those regions at the north, especially panicking as winter's cold was moving in.</p><p>And so that had to be powered back up again, and they realize, it's just a very difficult thing to move off fossil fuels. It doesn't mean though they are not moving forward rapidly with renewables. I mean, they have an incredible trajectory going forward with the production and implementation of wind and solar power, and you're seeing that here.</p><p>So I don't think necessarily, that they're done putting forward their commitments or their pledges. You may actually see a COP 26 that there are going to be some new announcements coming forward from China. And interestingly enough, when you talk about all the other issues that China is facing in the world and the contentious atmosphere between the West and China, this may be the one area -- talking about climate, battling climate change, in particular, where you find agreement, Julia, and they may come together on this and show that dialogue and cooperation is possible, if only we're talking about saving the planet.</p><p>CHATTERLEY: Yes, just one area where they can discuss. What we've been showing, as you've been talking actually is the official handshake, as you said. It may not be happening between Xi Jinping and President Joe Biden, but it's certainly happened between the President of Italy and the President of the U.S.A. there, just the President there, President Mattarella just adding his mask back given how close proximity the two gentlemen are standing in.</p><p>We've also seen the two greet members. The President of Italy there shaking hands with the likes of Treasury Secretary Janet Yellen, Antony Blinken, of course, the Secretary of State, and now, the two gentlemen walking away.</p><p>It is set to be a 20-minute meeting before President Joe Biden goes on to meet to Prime Minister Mario Draghi as we've already discussed, but you can see the two gentlemen leading out those that they've already said hi to , and moving out of that room there.</p><p>So we will move on. We will allow those two gentlemen to have their brief meeting, not quite to time, I do believe they are about 20 minutes late now -- running late, despite the on-time meeting for the Pope there, but as we said, a busy day for Joe Biden and it continues, and we won't come back to that later on in the show.</p><p>David Culver, for now, thank you for that.</p><p>Okay, let's move on. Facebook facelift. Mark Zuckerberg rebranding his social media giant with a new name.</p><p>(BEGIN VIDEO CLIP)</p><p>MARK ZUCKERBERG, CEO AND CHAIRMAN, META: To reflect who we are and what we hope to build, I am proud to announce that starting today, our company is now Meta.</p><p>Our mission remains the same, still about bringing people together.</p><p>(END VIDEO CLIP)</p><p>CHATTERLEY: Meta -- Brian Stelter joins us with all the details.</p><p>We are both wrong actually, Brian, but you were closer. I tried to work out whether that was an avatar of Mark Zuckerberg or it was him, himself. But he said he joined the Metaverse there.</p><p>BRIAN STELTER, CNN CHIEF MEDIA CORRESPONDENT: Right, right. He is smart to be demonstrating what this is. I know that the savvy response is, it's a distraction with Facebook's troubles and that is definitely true on some degree.</p><p>[09:15:06]</p><p>STELTER: But let's look at what else this is, Julia. This could be a milestone for virtual reality. He is committing tens of billions of dollars in the next years to come on building out this mixed reality between virtual and real world, augmented reality/virtual reality. They call it the Metaverse, a melding of all of it and he wants to have an operating system for the future.</p><p>I was so struck in his comments yesterday about how he feels like he is at the boot -- under the boot of Apple and Google, you know, because those companies control the phone software that Facebook uses to track all of us and then target us with ads.</p><p>Zuckerberg does not want to be under Apple and Google's control. He wants his own operating system. He wants his own platforms and that partly explains the Metaverse.</p><p>Also, he clearly wants to build something new. He is sick and tired of all the negative press about Facebook, even though all that press is totally well deserved, and he wants to change the story. He wants to change Facebook's story.</p><p>But I think it's important to say, Julia, as cool as this looks, and maybe it'll all come true someday, nothing about the new name Meta changes Facebook's current problems.</p><p>CHATTERLEY: Yes, and I couldn't agree more on that. And speaking of being a prisoner, I think to rivals' operating systems and Facebook being an app on Apple, for example. I certainly felt like a prisoner when WhatsApp went down a couple of weeks ago and couldn't call people and couldn't do things that I always do on a daily basis, and that's a critical point of this brand, we are not going to allow this to be a distraction, because this whole week really for Facebook, outside of investor interest in the business is what else? What are the externalities for Facebook, for Instagram, and for WhatsApp?</p><p>STELTER: And if you look at the Facebook stock, shares have rebounded to some degree in the weeks after those Facebook papers started to be published by \"The Wall Street Journal.\" Now, they're being shared by dozens of news outlets. We're going to continue to see as these big damning stories in the days and weeks to come. Frances Haugen will continue to speak in the U.S., the U.K., and elsewhere.</p><p>The stories are going to continue, but the share price has reacted favorably to Zuckerberg's earnings report and then this Metaverse event. And now the question is, you know, when can it get practical, right? When can all of these new ideas get practical?</p><p>' Zuckerberg didn't announce a new product yesterday that all of us can buy today. This is still a ways away. And it is raw. It is ripe for parody. I'm sure \"SNL\" will have a lot of fun with the Metaverse announcement.</p><p>But you know, I do think from the investor point of view, there is some interest in what's going on here and there is some recognition that Facebook's core ad business is performing relatively well, despite all of this bad press, despite all of this bad reality news for Facebook.</p><p>CHATTERLEY: Yes. It is performing incredibly well and that's part of the problem, isn't it, Brian? Meta is about the future and the Facebook Papers quite frankly, are about the present and that needs tackling today.</p><p>Brian Stelter, thank you for that.</p><p>Okay, still to come here on FIRST MOVE, mixing the planet and profits. The former CEO of Unilever says doing good for the climate is good for business.</p><p>And the carbon calculator, the climate tech startup helping companies measure their emissions footprint.</p><p>That's all coming up. Stay with us.</p><p>(COMMERCIAL BREAK)</p><p>[09:20:49]</p><p>CHATTERLEY: It may be Friday, but we're already gearing up for a busy weekend ahead on the world stage. As we speak, world leaders gathering in Rome ahead of the weekend's G20 Summit from Italy. Many will be traveling on directly to Scotland for the Cop 26 Climate Talks.</p><p>Speaking of which, the Cop 26 Climate Talks are a turning point for humanity, so says the British Prime Minister Boris Johnson, but with China and Russia not attending, and India rejecting calls for a net zero carbon target, many are already voicing fears that the talks will fail.</p><p>My next guest says that's a mistake in a \"Time\" Magazine op-ed. He argues against writing off the talks before they've even started.</p><p>\"We cannot afford to throw in the towel,\" he warns. And joining us now is Paul Polman. He's co-founder and chair of the consultancy, Imagine, which helps businesses become a force for social good. He is also the former CEO of Unilever and author of \"Net Positive: How Courageous Companies Thrive by Giving More than They Take.\"</p><p>Paul, fantastic to have you with us on the show. You do argue, let's not be defeatist as we head into these talks before they've even begun, and you give reasons, statistics for why the interest and the money that's being targeted towards climate change, and mitigating the effects is growing, and it is growing fast.</p><p>PAUL POLMAN, FORMER CEO, UNILEVER: Yes, Julia, and thanks for the opportunity.</p><p>In fact, a year and a half ago when we were facing the dreadful COVID attack, if I may call it the pandemic, lots of people, often the same people that are now talking at Glasgow was feeling, were saying that businesses would spring back to cost cutting and that ESG was dead, and that we would see the same behavior as we saw in the financial crisis about 10 years before.</p><p>The opposite is true. We have seen countries now in the one and a half years' time, 30 percent of global emissions making net zero commitments by 2050. Currently, we're at 80 percent of the countries having made those commitments.</p><p>We see the same with companies where we have 20 percent of the biggest companies making these commitments. And in the financial market, we have over $100 trillion, I would argue about half of the world's money making commitments to be net zero.</p><p>We've never seen that shift. Collectively, we've probably moved farther ahead than we could have thought at any time in history. Now, the problem is that, collectively, the commitments that we are making are too far out, 2050, and they are not enough versus what the world actually needs.</p><p>Collectively, they are projecting in the next 10 years, a nine percent decline in emissions. For the first time, by the way, that we are showing a decline with concrete plans, but we need a 45 percent decline.</p><p>That's why the G20 now, enrollments are important because they need to make a commitment to keep the one and a half degrees alive. They need to come with some concrete things. Like for example, not financing coal plants abroad anymore, or reducing drastically the methane emissions.</p><p>And then Glasgow itself will be key, because there, we will ask concrete commitments from the countries between now and 2030. We will form broader partnerships that are emerging to tackle these issues. And last but not least, put nature-based solutions on the agenda, which are proving to be the most effective, lowest cost, and highest job creation.</p><p>So, this is all about opportunity and we are well out of the starting blocks.</p><p>CHATTERLEY: Yes, and concrete commitment, I think was the key phrase in that as well. I mean, you say in your op-ed, if we could take our recent rate of progress and double it again over the next 18 months, then we could finally be on track.</p><p>So, for everything that we've seen, we still need to see double again what we've already achieved.</p><p>Let's talk about the business community in particular, because we have seen a huge shift, I think in the last 18 months from them in particular and the big message that I took away from your book was that profits and the planet, they can go together and actually they can be mutually reinforcing, and you did everything that you did just based strong conviction at Unilever.</p><p>[09:25:01]</p><p>CHATTERLEY: Now we've got far more proof that actually, there are benefits that can be had, and they can help businesses, too. Do you think businesses really believe that today or are they just being sort of shoved and they still see it as a cost center for the most part, even if they're being shoved by their shareholders, and they can see this?</p><p>POLMAN: Well, I think some things have changed. There are some businesses that embrace it more seriously than others, but increasingly so. We've seen that being driven by probably three factors.</p><p>One is the direct effects of climate change is coming in every P&amp;L, but 85 percent of the key business leaders are saying climate change is affecting me now and it costs money. I certainly saw that when I was running Unilever, where probably every week or every other week, we had a supply chain disruption.</p><p>The second factor is the financial market has moved, if you look at the pressure that is now coming in from the financial market on these companies, they have seen not only the risk mitigation that needed to happen, but they increasingly see opportunities for companies that actually position themselves well in the future, and value is created there.</p><p>And the third reason is actually the employees themselves. I have -- I cannot talk to any CEO anymore nearly on a daily basis who doesn't tell me that he or she gets the pressure from their employees that just expect these companies to be moving forward.</p><p>So you see the commitments, but relatively few have made commitments shorter term, and put concrete action plans behind it, and this is obviously what we now need to drive.</p><p>But major CEOs are discovering that many of these things they can do alone, and increasingly, they are joining these broader alliances like Race to Zero or Race to Zero Breakthrough, or the Methane Alliance and many other things.</p><p>CHATTERLEY: I think one of the things that I liked about the book was that it just assumed the why. We know why we have to tackle this. We have to get to the how.</p><p>And you've made really bold calls when you were at Unilever. You said, look, we're going to cut our environmental footprint by half, help a billion people improve their health. You've also said, we're going to pay all direct employees a living wage by 2020 and you did it. And you also said we also want to get our suppliers providing a living wage by 2030 as well.</p><p>I mean, these were incredibly bold calls, uncomfortable, I think announcements, perhaps at the time. And I think the message from the book is too that it's okay to be uncomfortable with what you're announcing. You just have to go all out to meet those targets.</p><p>POLMAN: Yes, that is why we say in the book, \"Net Positive: How Courageous Companies Thrive by Giving More than They Take,\" you know, it takes courage to set targets that you know are needed versus targets you can just achieve, minimal targets you can get away with.</p><p>It takes courage to take responsibility of your total handprint in society, all consequences, intended or not.</p><p>I just heard your discussions on Facebook. It actually takes courage to work together with others in partnership to tackle these broader issues. When you're not totally in charge or might deal with some inconvenience tools. So this book talks about just notes of personal transformation of the CEOs as a company and ultimately, a systems transformation.</p><p>And then it doesn't shy away from what we call the elephant in the room, which is making the tougher calls to be consistent. You cannot on the one hand, say I'll do very aggressively climate change activity to mitigate it, and on the other hand, financial trade association that's the opposite, or money and politics, or avoiding taxes, or corruption, or human rights in the value chain.</p><p>And what we found in Unilever, which by the way, had a 300 percent shareholder return over those 10 years and the shareholders were pretty happy in general, what we found was that when we attacked these issues, and work for optimizing the return for all of our stakeholders, that we actually also were running our company better -- more motivated employees, better talent, attraction, more resilience in the value chain, more innovative in dealing with these problems and that ultimately comes back to better business results.</p><p>And what we now see overwhelmingly, not black and white, but overwhelmingly is that companies that tackle these negative externalities proactively have actually within their own sectors, a higher valuation than companies that don't, which also means that the financial sector has woken up.</p><p>I don't think they are driven by the morality of the story. That will take a while still, in my opinion, but they're seeing the enormous opportunity now, because the cost of not acting has simply become significantly higher than the cost of acting and smart companies see that.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021</p></div>"}