{"date": "2021-11-05 12:55:49+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><span>\n              <p>By Anthony Hughes</p>\n              <p>NEW YORK, Nov 5 (IFR) - Amazon-backed electric vehicle upstart <strong>Rivian Automotive</strong> has launched the biggest US IPO in more than seven years – an US$8.4bn offering that comes with mammoth cornerstone support and just as the company is ramping up production of its pickup trucks, SUVs and delivery vans.</p>\n              <p>Shaping up as the biggest US IPO since Alibaba's US$25bn NYSE float in September 2014, the emerging rival to Elon Musk's Tesla plans to sell shares at US$57–$62 each, valuing the company at around US$60bn. The all-primary IPO will see 135m shares sold, representing about 15% of the company, with pricing after the close on November 9. </p>\n              <p>A heavy-hitting group of backers has already agreed to take US$5bn of Rivian stock, representing 60%–65% of the offering, the biggest show of upfront support ever witnessed on a US IPO.</p>\n              <p>These backers include Amazon and a who's who of institutional investors, including T Rowe Price, Coatue Management, Franklin Templeton, Capital Research Global Investors, Third Point, Blackstone Alternative Asset Management, Dragoneer Investment and Soros Fund Management.</p>\n              <p>Amazon, which already has a 20% stake in the company after leading a US$2.5bn funding round in July, is putting in US$200m of that sum.</p>\n              <p>The hefty size of this cornerstone demand left some wondering if Rivian could have raised the money privately and waited until it had ramped up production before going public.</p>\n              <p>Yet the success of Tesla, a serial issuer of equity in the past decade as its market capitalisation has exploded to more than US$1.2trn, has underscored the importance of EV companies having regular access to public capital markets.</p>\n              <p>\"We have seen that EV auto manufacturing requires an enormous amount of capital so having a public listing, being able to access the bond market, and having a proper capital structure will lower their cost of capital,\" one senior ECM banker said. </p>\n              <h3>Halo effect</h3>\n              <p>Early indications suggest Rivian's IPO is generating overflowing interest from investors looking for another avenue to cash in on EV mania, despite current headwinds in the broader auto sector caused by semiconductor and labour shortages. The \"halo effect\" of Amazon's backing is a swing factor for some.</p>\n              <p>Founded by MIT-trained mechanical engineer RJ Scaringe in 2009, Rivian has preorders for 55,400 of its R1T pickup truck and R1S SUV from US and Canadian customers that have put down US$1,000 deposits.</p>\n              <p>Rivian expects to fill this order backlog by the end of 2023, generating around US$4bn of revenue based on the roughly US$70,000 price at which the vehicles start.</p>\n              <p>The company began deliveries of the pickup in September (and has now delivered 156 of them) from its 3.3m square foot plant in Illinois, and expects to have produced 1,200 of the pickups and 25 SUVs by the end of this year.</p>\n              <p>In addition, Amazon has also ordered 100,000 electric delivery vans, the joint largest EV order ever (Hertz has just ordered 100,000 Teslas) and is largely underwriting the company's near-term production.</p>\n              <p>\"We believe the Amazon fleet is on track to become the largest centrally managed EV fleet in the world,\" Scaringe said in the online roadshow.</p>\n              <p>Rivian's ambitions extend well beyond its current range of models. The roadshow outlined plans to broaden its line-up, sell vehicles into Europe and Asia-Pacific, generate recurring revenue from digital services (such as fleet management), and expand into energy storage.</p>\n              <p>\"Our goal is to build Rivian into one of the most recognisable brands in the world, ensuring Rivian transcends segments, form factors, geographies and customer models,\" Scaringe said.</p>\n              <p>Rivian's filing outlines a US$9trn long-term market opportunity, and US$1trn over the next three years as consumers switch from internal combustion engine-based cars to EVs. </p>\n              <p>\"The pace of change needed across the mobility sector is unlike anything the developed world has ever seen,\" Scaringe said. \"EV adoption is rapidly growing and cost to manufacture EV batteries is coming down, governments are providing tax incentives and tax credits to accelerate EV sales and trucks and SUVs continue to be the fastest-growing and most profitable of all automotive segments, making up more than 70% of all new vehicle sales in the US.\"</p>\n              <p>Rivian is setting aside 7% of the offering for eligible US customers with a preorder, while online brokerage SoFi is offering a small amount of IPO stock to its user base.</p>\n              <p>(Anthony Hughes; Editing by Stephen Lacey)</p>\n              <p>((anthony.hughes@refinitiv.com; (646) 552-4852))</p>\n            </span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © Refinitiv 2021. Click For Restrictions - https://www.refinitiv.com/en/policies/copyright-notice</p></div>"}