{"date": "2022-02-18 21:54:18.695000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3093.05, "close": 3003.95}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_yfjtee4j&amp;referenceId=tag:reuters.com,2022:newsml_OVFZ7IF7V_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_yfjtee4j&amp;referenceId=tag:reuters.com,2022:newsml_OVFZ7IF7V_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Employees at many Apple stores in the United States are working to unionize, the Washington Post reported on Friday, citing people familiar with the efforts. Lisa Bernhard produced this report.<br/>Short Link: <a href=\"https://refini.tv/3LCNW3I\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3LCNW3I</a><br/><br/>Video Transcript:<br/><br/>In the latest unionization effort by a major US corporation, employees at a number of Apple stores are preparing to unionize, The Washington Post reported Friday. The paper, citing sources familiar with the matter, said that employee groups at at least two Apple stores are backed by major national unions and are preparing to file paperwork with the National Labor Relations Board in the near future, and that at least six more locations are at less advanced stages in the unionization process. The move follows unionization efforts at other large US retailers, including by Amazon warehouse workers and Starbucks staffers. Apple has 270 stores in the US and made 36% of its more than $365 billion in net sales in fiscal 2021 through its retail stores and website, according to a regulatory filing. CEO Tim Cook's pay last year was 1,447 times that of the average employee at the tech giant, fueled by stock awards that helped him earn a total of nearly $100 million. Apple and the National Labor Relations Board did not immediately respond to Reuters requests for comment.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}