{"date": "2021-11-29 16:05:34.513000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-abstract\"><p>US e-commerce giant Amazon has written to Competition Commission of India (CCI) Chairman Ashok Kumar Gupta and other top executives, asking the country\u0092s antitrust regulator to revoke its approval for Future Retail\u0092s (FRL\u0092s) $3.4-billion sale of retail assets to Reliance Industries (RIL).</p></div><div class=\"tr-npp-lead\"><p>Amazon said the CCI approval for the impugned transaction was \u0093illegally obtained\u0094 and is a \u0093nullity\u0094 in the eyes of law. The letter has also been sent to Finance Minister Nirmala Sitharaman and Rao Inderjit Singh, Minister of State, Ministry of Corporate Affairs.</p><p>In August 2019, Amazon acquired 49 per cent stake in Future Coupons (FCL), the promoter entity of FRL, for around ~1,500 crore. Amazon is now fighting a legal battle with FRL to stop the Kishore Biyani-led retailer\u0092s $3.4-billion deal with RIL. \u0093We are writing to you in respect of the emergency arbitrator (EA) order restraining FRL, FCL, and the Biyanis from taking any steps in relation to, in furtherance or in aid of, the impugned transaction,\u0094 said Amazon\u0092s letter dated Nove­mber 24. \u0093We also write to you in furtherance of the letter dated October 29, 2020, and the letter dated November 25, 2020, addre­ssed to the CCI, for taking cognizance of the EA order and recalling the CCI approval for the impugned transaction.\u0094</p></div><div class=\"tr-npp-body\"><p>On October 25, 2020, an EA consti­tuted under the Rules of the Singapore International Arbitration Centre, 2016, passed the EA order containing the directions against FRL, FCL, and the Biyanis. This included that the respondents are injuncted from taking any steps in furtherance or in aid of the board resolution made by the board of directors of FRL on August 29, 2020, in relation to the disputed transaction.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}