{"date": "2022-01-19 01:30:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Repeats from JAN 18, no changes to text</p><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Reliance asks India for tighter marketplace rules -sources</li><li class=\"tr-summaryitem\">Sign of growing rivalry between Reliance, Amazon -sources</li><li class=\"tr-summaryitem\">Indian retailers voiced concerns in closed-door meeting</li><li class=\"tr-summaryitem\">Amazon executive said U.S. company noted concerns -source</li></ul><p class=\"tr-by\">By Aditya Kalra</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Jan 18 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Indian retailer Reliance has called for tighter regulation of marketplace e-commerce platforms to ensure such websites treat all sellers equally, four sources told Reuters.</p><p>While India's biggest retailer, with more than 12,000 stores, expanded its e-commerce operations in recent years, Reliance still lags market leaders Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Walmart’s <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> Flipkart, both of which it counts as key rivals.</p><p>At a closed-door government meeting on Tuesday, Reliance told officials that India needed special regulations to ensure \"non-discriminatory\" treatment of sellers on marketplace websites, three of the sources with knowledge of the talks said.</p><p>Reliance did not name any company, the sources added, although its remarks chime with calls for greater regulatory oversight in India of ecommerce giants Amazon and Flipkart.</p><p>An Amazon executive said during the meeting that the company had taken note of concerns raised by the retail trading community, one of the sources said. </p><p>Amazon and Flipkart did not immediately respond to requests for comment.</p><p>India's small retailers have in the past alleged the U.S. platforms give preferential treatment to select big sellers in which they hold discreet financial or business interests. </p><p>The U.S. companies deny this, saying they only run marketplaces connecting customers with independent sellers.</p><p>Traditional retailers raised concerns during Tuesday's meeting, which was called by India's industry promotion department, and were supported by a senior Reliance executive.</p><p>The sources said the executive said marketplace websites must act independently and should have no relationship with their sellers, indicating officials should incorporate such provisions into policy changes for the booming sector.</p><p>A spokesperson for the industry promotion department did not respond to a request for comment.</p><p><br/></p><p>PUSHING HARD</p><p>The intervention by Reliance <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a>, which is run by one of India's richest men, billionaire Mukesh Ambani, signals its growing rivalry with U.S. ecommerce platforms in the race for supremacy in one of the world's <a href=\"https://reut.rs/3tCOUq0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">fastest growing retail markets</a>.</p><p>As a local player, Reliance is able to sell goods to consumers directly on its website or apps, something foreign platforms cannot do in light of stricter regulations designed to protect the local retailer base.</p><p>\"It appeared Reliance is pushing the government hard (on regulations) so that they succeed in ecommerce,\" one e-commerce executive who attended the meeting said.</p><p>Last year, Reuters reported that <a href=\"https://reut.rs/2OCOT2W\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon favoured select sellers in India</a> and used them to bypass foreign investment law of the nation. The U.S. company also ran a systematic campaign of <a href=\"https://reut.rs/3aBiku9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">creating knockoff goods and rigging search results</a> to boost its own product lines, Reuters reported.</p><p>Amazon says it does not give preferential treatment to any seller or manipulate searches and complies with all Indian laws.</p><p>The Confederation of All India Traders said it had urged officials to establish an e-commerce regulator to hear retailers' grievances at Tuesday's meeting. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi; Editing by Alexander Smith)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: INDIA-RETAIL/RELIANCE (REPEAT, PIX)</p></div>"}