{"date": "2021-12-09 15:41:42.964000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z;NEXCF-0\")\n- Event with Technology And Edtech Partners\n\n  Nextech AR Solutions Corp. (\"Nextech\" or the \"Company\"), a Metaverse\nCompany and leading provider of augmented reality (\"AR\") experience\ntechnologies and services, is pleased to announce it will be presenting\nwith Microsoft and Ryerson University at \"The Metaverse &amp; Augmented Reality\nLabs: The Future of Learning\" event today, December 9, 2021, followed by a\nQ&amp;A question.\n\n  Click here to register and attend the event\n\n  Last month, Nextech AR announced a major Metaverse upgrade to its events\nplatform. ARitize Events 3D is now able to showcase 3D products seamlessly\nwith the Company's existing suite of Augmented Reality solutions, creating\na first of its kind metaverse event platform. Notably, event hosts will\npresent through this upgraded metaverse events platform, and this will be\nthe first time Nextech's new product will be shown live to an audience.\n\n  The upgraded features on \"ARitize Events 3D\" bring 3D objects into the\nevents space and people's homes, creating interactivity between the\naudience and the presenters, which is not available on other platforms. The\nintegrated experience consists of human holograms, 3D Virtual Sets, 3D AR\nShowrooms, and 3D AR product visualizations.\n\n  Join Paul Duffy (President, Nextech AR Solutions); Clinton Els (Head of\nEducation, Nextech AR Solutions); David Cramb (Dean of Science, Ryerson\nUniversity) and Nancy Teodoro (Education Partner Lead: Microsoft) to\nexplore the future of learning with Augmented Reality Labs and the\nMetaverse.\n\n  The event will cover:\n\n//st\n\n* How higher education is benefiting from augmented reality in Science\n  education\n* Microsoft's view on education as it relates to augmented reality and the\n  Metaverse\n* Nextech's Augmented Lab Builder for the Metaverse\n* Use case: Walk through the Metaverse on the campus of Ryerson University\n  and in one of its augmented labs\n\n//et\n\n  In addition to the event, the company's Augmented Reality Lab Builder for\nthe Metaverse is now available in the Microsoft marketplace. The AR Lab\nbuilder will enable any higher education student to create their own\nimmersive AR labs with Nextech's online course and creator tool using a\nUnity Plugin. AR Labs are easy to use, experiment based labs in augmented\nreality that encourage students to \"learn by doing\". The labs will engage,\nsupplement, and/or replace student lab experiences which are a fraction of\nthe cost of wet labs and are accessible online any time, anywhere across\nthe globe.\n\n  Watch a video previewing the AR Lab Builder - click here\n\n  Earlier this year, Nextech AR announced its partnership with Microsoft to\npower EdTechX (recently renamed to ARitize University) and its suite of\nenhanced augmented reality solutions for education. Nextech's global higher\neducation solution combines enterprise scale video streaming, integrated\nassessments, augmented reality holograms, augmented reality labs and data\nanalytics. Higher education institutes such as Ryerson University and\nCarnegie Mellon University have successfully implemented ARitize University\nin their daily operating businesses. Additionally, in June Nextech's\nARitize University, built on Microsoft Azure - had achieved Co-sell Ready\nstatus, becoming an approved Microsoft Co-sell Partner and allowing the\nCompany to work with Microsoft sales teams to actively fulfill customer\nneeds across a global marketplace.\n\n  ARitize University is currently on Azure marketplace and discoverable to\nmillions of customers across 141 geographies and provides access to\nMicrosoft's existing procurement relationships.\n\n  ARitize UniversityARitize University is an online education platform that\nenables educational institutions to transform traditional learning and\nevent formats into valuable, immersive digital experiences that higher\neducation students are seeking. Through ARitize University, students can\naccess course materials, learning objectives, and ARitize labs.\n\n  ARitize LabsWith \"ARitize Labs\" higher education institutions can bring\nclassrooms to life with immersive and engaging augmented learning labs.\nUsing the ARitize Play app, students are welcomed into a virtual learning\nlab, where they are able to interact and learn in 3D, mimicking a\ntraditional lab environment. Learn more\n<a href=\"https://www.nextechar.com/augmented-learning\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.nextechar.com/augmented-learning</a>\n\n  To learn more, please follow us on Twitter, YouTube, Instagram, LinkedIn,\nand Facebook, or visit our website: <a href=\"https://www.Nextechar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.Nextechar.com</a>.\n\n  About Nextech ARNextech AR Solutions is a Metaverse company that develops\nand operates augmented reality (\"AR\") platforms, transporting\nthree-dimensional (\"3D\") product visualizations, human holograms and 360\nportals to its audiences altering e-commerce, digital advertising, hybrid\nvirtual events (events held in a digital format blended with in-person\nattendance) and learning and training experiences.\n\n  Nextech focuses on developing AR solutions for the Metaverse, however\nmost of the Company's revenues are derived from three e-Commerce platforms:\nvacuumcleanermarket.com (\"VCM\"), infinitepetlife.com (\"IPL\") and\nTrulyfesupplements.com (\"TruLyfe\"). VCM and product sales of residential\nvacuums, supplies and parts, and small home appliances sold on Amazon.\n\n  Forward-looking StatementsThe CSE and the NEO have not reviewed and do\nnot accept responsibility for the adequacy or accuracy of this release.\n\n  Certain information contained herein may constitute \"forward-looking\ninformation\" under Canadian securities legislation. Generally,\nforward-looking information can be identified by the use of forward-looking\nterminology such as, \"will be\" or variations of such words and phrases or\nstatements that certain actions, events or results \"will\" occur.\nForward-looking statements regarding the completion of the transaction are\nsubject to known and unknown risks, uncertainties and other factors. There\ncan be no assurance that such statements will prove to be accurate, as\nfuture events could differ materially from those anticipated in such\nstatements. Accordingly, readers should not place undue reliance on\nforward-looking statements and forward-looking information. Nextech will\nnot update any forward-looking statements or forward-looking information\nthat are incorporated by reference herein, except as required by applicable\nsecurities laws.\n\nInvestor Relations\nLindsay Betts\ninvestor.relations@Nextechar.com\n866-ARITIZE (274-8493) Ext 7201\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134200344.MNPRE2134201833-07114920211209</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}