{"date": "2021-11-04 02:54:16.090000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon.com Inc.  has reinstated Canadian retailers that were abruptly suspended from its platform over a contentious new shipping policy, a situation that highlights growing tensions between the e-commerce giant and the small-business community.</p><p>In recent months, Amazon has sent notices to third-party merchants that they needed to maintain a \"valid tracking rate (VTR)\" of at least 95 per cent or risk being deactivated on the platform. That meant nearly all orders shipped by merchants that list products on Amazon – rather than orders handled by Amazon – needed a tracking number that customers could reference.</p></div><div class=\"tr-npp-body\"><p>The policy went into effect Aug. 9, although as recently as September, Amazon said it was \"not currently enforced\" and there was \"no direct penalty\" for not meeting the standard.</p><p><a href=\"https://www.theglobeandmail.com/business/article-amazon-to-hire-15000-employees-across-canada-this-fall-increase-wages/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon to hire 15,000 employees across Canada this fall, increase wages</a><a href=\"https://www.theglobeandmail.com/business/article-retailers-hope-spirit-of-buy-local-visits-them-again-this-holiday/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Retailers hope spirit of 'buy local' visits them again this holiday season</a> </p><p>That's why many retailers were blindsided last week, when they received e-mails that their stores were suspended, in part or fully. (The VTR rates apply to product categories, rather than all of a company's merchandise.) A web forum for Amazon sellers, which is hosted by the company, was flooded with complaints from affected merchants.</p><p>Those retailers describe the policy change as poorly communicated. Among other things, a webpage explaining the VTR policy said it applied only to shipments from China.</p><p>The Globe and Mail on Tuesday asked Amazon about the webpage discrepancy. On Wednesday, the company acknowledged a shortfall in its communications and that it would reinstate the affected sellers to provide them with updated information and more time to comply with the policy.</p><p>\"Our investigation has shown that the notification did not communicate that VTR applies to shipments both from China and from within Canada, as it should have. This experience is not consistent with our high standards for policy changes,\" spokesperson Kristin Gable said in a statement.</p><p>The mass suspension wiped out days of sales for companies, sometimes with big repercussions. \"I cannot pay employees at the end of the week, as I have lost a significant volume of sales in the last 24 to 48 hours,\" one seller identified as JCA_Associates_Inc wrote Friday on the forum, which is restricted to posts by authorized sellers.</p><p>Despite the controversy, Amazon is pressing ahead with the shipping policy. The company says its customers expect to be able to track their orders and delivery times.</p><p>But the incoming rules are panned by many retailers, who accuse Amazon of hindering their competitiveness and putting pressure on them to hand over inventory to the company.</p><p>Chad Silva, the owner of Flashbacks in Hamilton, which largely sells music and movies, was suspended in the video game category last week, but was reinstated on Wednesday.</p><p>Next to each of his deactivated items was an icon that said \"convert to FBA.\" That stands for fulfilled by Amazon, which means the e-commerce giant would handle orders. But in choosing that option, sellers like Mr. Silva would have to send their inventory to Amazon. Some retailers bristle at doing that, because those items would then be available exclusively through Amazon, rather than multiple sales channels.</p><p>\"I really don't want to dilute my inventory to where I have half my good stuff in a warehouse with Amazon, and half my good stuff in my actual store,\" Mr. Silva said.</p><p>For many sellers, a big concern is pricing competitively under the new rules. Sellers of small, low-priced merchandise – say, $10 books – often ship items through letter mail, bypassing more expensive options that include tracking to keep costs low for customers.</p><p>Under the VTR policy, small orders of $10 or less are exempt from tracking. However, that pertains to the total value, shipping included. As an example, Mr. Silva said a $7 DVD could be shipped to Toronto from Hamilton – just a 45-minute drive – for $3.99 via letter mail. With tracking, the same parcel would cost $13, although the delivery would be expedited.</p><p>\"I would say maybe one person, out of the hundreds and hundreds of orders I get a month, chooses to get it tracked when it doesn't need to be,\" he said.</p><p>Despite giving buyers a tracking code, a Montreal-based retailer was suspended last week. (The Globe is not identifying the company because it is concerned about straining its relationship with Amazon.)</p><p>Many shipping carriers, such as Canada Post and Purolator, are \"integrated\" with Amazon – meaning, customers can track their orders from within the e-commerce site.</p><p>But some carriers are not recognized. That includes Canpar Express, which the Montreal merchant uses for what it says are cheaper rates. So while its customers get a tracking code that's usable on Canpar's website, the company was still suspended for several days because Canpar is not an approved carrier.</p><p>The Montreal retailer sells its products through various channels, with Amazon accounting for a sizable portion, $100,000, in revenue in a typical month. (Amazon takes a 15-per-cent cut of the company's total sales on the platform, taxes included.)</p><p>On the forum, Amazon encouraged companies to submit suggestions on which carriers to add.</p><p>Mr. Silva is disappointed with how things are changing. He opened his store just before the COVID-19 pandemic, and selling through Amazon was the \"greatest saving grace\" to keep the business afloat through multiple lockdowns that shuttered retailers to walk-in buyers.</p><p>Still, he struggles to envision a viable future on Amazon as the tracking policy comes into effect.</p><p>\"My plan right now is to stay on Amazon until they kick me off.\"</p><p><span>Your time is valuable. Have the Top Business Headlines newsletter conveniently delivered to your inbox in the morning or evening.</span><a href=\"https://www.theglobeandmail.com/newsletters/?utm_source=Arcnewsletter&amp;utm_medium=onsite&amp;utm_campaign=fixed_positions&amp;utm_term=signuppage&amp;utm_content=topbusiness_promo#newsletter-group-2\"><span>Sign up today</span> </a><span>.</span> </p><p>Follow this link to view this story on globeandmail.com: <a href=\"https://www.theglobeandmail.com/business/article-amazon-reinstates-canadian-retailers-after-mass-suspension-tied-to-new/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon reinstates Canadian retailers after mass suspension tied to new shipping policy</a> The viewing of this article is only available to Globe Unlimited subscribers.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Globe and Mail Inc. and its licensors. All rights reserved.</p></div>"}