{"date": "2021-12-13 07:10:51.544000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 3521VFeedback PLC13 December 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>Prior to publication, the information contained within this announcement was deemed by the Company to constitute inside information as stipulated under the Market Abuse Regulations (EU) No. 596/2014 (\"MAR\"). With the publication of this announcement, this information is now considered to be in the public domain.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Feedback plc</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Feedback receives funding from Amazon Web Services in support of its cloud-based tuberculosis screening programme for rural communities in India</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>AWS provides non-equity funding to support the initial hosting costs of a pilot for Feedback's cloud-based tuberculosis (\"TB\") screening solution to rural communities in India</span>\n</p>\n<p>\n<span>·</span>\n<span>The TB screening solution will see X-ray images acquired in rural communities pushed by Feedback's Bleepa Box straight to the cloud to be processed by clinical and artificial intelligence (\"AI\") partners</span>\n</p>\n<p>\n<span>·</span>\n<span>The TB screening pathway, hosted on Bleepa, will connect remote communities with clinical experts and the latest technologies for point of care diagnosis of TB in almost any setting and will be hosted on AWS Cloud</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>London, 13 December 2021</span>\n</span>\n<span>: Feedback plc (AIM: FDBK, \"Feedback\" or the \"Company\"), the specialist clinical communication company, announces that it has partnered with Amazon Web Services (AWS) to establish and deliver cloud-based TB screening services to rural communities in India.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Feedback <span>has been awarded funding through the</span>\n</span>\n<span>\n<a href=\"https://aws.amazon.com/government-education/nonprofits/disaster-response/diagnostic-dev-initiative/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Diagnostic Development Initiative</a>\n</span>\n<span>to deliver a revolutionary imaging pathway that will enable X-rays of patients to be acquired in rural settings without networked connectivity and be transmitted over Bleepa's cloud-hosted infrastructure for reporting. This pathway will enable TB screening to be undertaken in even the most remote setting, ensuring diagnostic input is rapidly available to screening services whilst the patient is still in the X-ray clinic. This rapid, point-of-care diagnostic service leverages the power of cloud to ensure that TB screening can be scaled to rural locations across India.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The AWS Diagnostics Development Initiative aims to help accelerate research and innovation to advance the collective understanding and detection of infectious diseases in order to mitigate current and future outbreaks. The funding is targeted at covering the initial cloud hosting costs of the TB screening service in the pilot stages,</span>\n<span>ahead of plans to scale the service across India following a successful pilot</span>\n<span>.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>TB represents a large public health issue globally with India experiencing an estimated 2.6m new cases every year. A robust screening programme, delivered locally to citizens is essential in order to identify those affected and initiate treatment for the condition. Chest X-rays are a key screening investigation for TB but require interpretation by either a specialist clinician or suitably regulated AI technology, neither of which are available in most rural settings.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Feedback's technology enables a chest X-ray image to be pushed over a mobile network to the cloud where it is shared by Bleepa either with a specialist clinician for reporting or a suitable AI tool, the results then being shared through Bleepa with the TB screening service, often within minutes of an image being acquired. Specialist TB clinicians can then advise on management, using Bleepa's patient-specific chat feature to connect directly to TB screening personnel in order to initiate treatment whilst the patient is still in the vicinity. The image and any clinical reports or discussion will then be stored in a CareLocker - a cloud</span>\n<span>container that stores medical data at an individual patient level - <span>for every patient, which could enable the creation of citizen health records in line with the National Digital Health Mission record (\"NDHM\") of the Indian government. The entire solution will be hosted on AWS cloud.</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Dr Tom Oakley, CEO of Feedback, said:</span>\n</span>\n<span>\"We are delighted to have AWS as a partner in our TB screening programme. This funding support will enable us to establish and subsequently scale the TB screening solution to citizens in rural locations across India. It is a key public health priority and a challenge of enormous proportions. To have AWS support and backing will make all the difference in getting this out to the citizens who need it.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"Cloud-powered diagnostic tools are critical in the fight against turberculosis and other infectious diseases <span>said Maggie Carter, Global Lead, Social Impact at AWS</span> . \"Over the last year, AWS has seen inspirational results from the Diagnostic Development Initiative. We look forward to helping Bleepa and other organizations worldwide use the cloud to mitigate current and future infectious disease outbreaks.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Further information on Bleepa can be found on the Company's website:</span>\n<span>\n<a href=\"https://fbkmed.com/feedback-plc/reports-and-presentations/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://fbkmed.com/feedback-plc/reports-and-presentations/</a>\n</span>\n</p>\n<p>\n<span>-Ends-</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Enquiries:</span>\n</p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Feedback plc</span>\n</p>\n<p>\n<span>Tom Oakley, CEO</span>\n</p>\n<p>\n<span>Anesh Patel, CFO</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 (0)1954 718072</span>\n</p>\n<p>\n<span>\n<a href=\"mailto:IR@fbk.com\" data-type=\"email\" translate=\"no\">IR@fbk.com</a>\n</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Panmure Gordon (UK) Limited (NOMAD and Broker)</span>\n</p>\n<p>\n<span>Emma Earl/Freddy Crossley (Corporate Finance)</span>\n</p>\n<p>\n<span>Rupert Dearden (Corporate Broking)</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 (0)20 7886 2500</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Walbrook PR Ltd</span>\n</p>\n</td>\n<td>\n<p>\n<span>Tel: 020 7933 8780 or</span>\n<span>\n<a href=\"mailto:feedbackplc@walbrookpr.com\" data-type=\"email\" translate=\"no\">feedbackplc@walbrookpr.com</a>\n</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Paul McManus/Nick Rome/Nicholas Johnson</span>\n</p>\n</td>\n<td>\n<p>\n<span>07980 541 893 or 07748 325 236 or 07884 664 686</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>Notes to Editors</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Feedback plc (AIM: FDBK) is a pioneer of regulated clinical communication products. Its core product, Bleepa, is a revolutionary medical imaging communications app, providing an easy-to-use, high quality tool to enable remote and secure communications between front-line clinicians and teams. Importantly, it is the only CE marked medical imaging communications platform on the NHSx clinical communications tools framework. Bleepa has unparalleled functionality for everyday practice and can be accessed from any internet-connected device, enabling control of patient cases when on the go.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Its highly scalable Software as a Service (\"SaaS\") based revenue model will provide increasing levels of visibility as the Company grows its customer base. With a growing distribution base and technology in place, the focus is on leveraging key relationships in order to drive sales both in the UK and internationally to all forms of care providers. As a fully certified medical device, Bleepa aims to disrupt the medical imaging communications market and, importantly, increase the accuracy and speed of clinical review.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>MSCEAEAEFLFFFAA</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}