{"date": "2021-11-29 17:41:09.360000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">JERSEY CITY, N.J., Nov. 29, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span>Delivering fast and reliable machine learning business solutions.</span></p>\n  <p><span class=\"xn-location\">JERSEY CITY, N.J.</span>, <span class=\"xn-chron\">Nov. 29, 2021</span> /PRNewswire/ -- ElectrifAi, one of the world's leading companies in practical artificial intelligence (AI) and pre-built machine learning (ML) models, today announced availability of both Machine Learning as a Service (MLaaS) and SpendAi on Amazon Web Services (AWS). ElectrifAi made the announcement at AWS re:Invent 2021 in <span class=\"xn-location\">Las Vegas</span>. </p>\n<div id=\"prni_dvprnejpgb997left\" style=\"WIDTH:100%;TEXT-ALIGN:left\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img align=\"middle\" alt=\"ElectrifAi\" border=\"0\" id=\"prnejpgb997left\" src=\"https://mma.prnewswire.com/media/1527876/ElectrifAi_Logo.jpg\" style=\"HEIGHT:72px;WIDTH:400px\" title=\"ElectrifAi\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTUyNzg3Ni9FbGVjdHJpZkFpX0xvZ28uanBn&amp;key=b05b723fc19bdc2e1ca9a8b7db0e60c1f6ca571cfc87f8c72068a7b1418f99d2aee32faacc8cdd7615bfb394ea87596ea08c146c3de5cd51b4306bb74bffa589\"/></div></div></div><p>With MLaaS, now all companies in many verticals can quickly harness the power of machine learning and turn their data into a strategic advantage to drive revenue as well as to reduce cost and risk. Clients can easily get started with machine learning and pre-built models without the expense and time-consuming efforts of installing and purchasing platforms, assembling teams, or providing their own servers. With MLaaS available through AWS, the client's data operates directly on AWS cloud servers and MLaaS increases the efficiency and convenience of machine learning on the cloud.</p>\n<p>By using MLaaS, clients can quickly achieve many benefits to improve their operations and capabilities. Some of those benefits include:</p>\n<ul type=\"disc\" class=\"bulleted-list arrowlist\"><li>lower costs, as provisioning one pre-structured model can be cheaper than the annual cost of a single data scientist; </li><li>faster time-to-deployment and lower project risk, as the average deployment of a pre-built model is between 8-12 weeks for MLaaS versus 8-12 months to build new machine learning models; and </li><li>faster time-to-value with a high return on investment (ROI). </li></ul><p>One of ElectrifAi's highly successful MLaaS offerings is SpendAi, a deep spend analytics product. Now available on AWS, SpendAi can help procurement professionals quickly solve business problems with more accurate data to help eliminate cost and risk. Some of the benefits of SpendAi include: </p>\n<ul type=\"disc\" class=\"bulleted-list arrowlist\"><li>superior visibility across multiple sources of data, </li><li>higher quality sources of spend data, </li><li>better degrees of classification, categorization and grouping, </li><li>greater flexibility, and </li><li>elimination of maverick spend. </li></ul><p>SpendAi has been proven to reduce indirect spend by 2-4% in 6-8 weeks generating substantial savings and ROI for clients.</p>\n<p>Other pre-built models offered by ElectrifAi as MLaaS include customer segmentation, product cross sell and up sell, demand forecasting, dynamic pricing, credit decisioning, computer vision and many others.</p>\n<p>\"We're pleased to introduce our MLaaS and SpendAi offerings on AWS. Today, more than ever, executives are seeking to use data to optimize their businesses. Data is the last untapped asset and companies are demanding time-to-value and high ROI to drive revenue and cost reduction. With MLaaS and SpendAi, all companies (large and small) can now easily and quickly achieve the benefits of machine learning and pre-built models. ElectrifAi is helping companies across the globe grow and become more competitive through data-driven business decisions and we are taking the friction and complexity out of machine learning and computer vision.\" – <span class=\"xn-person\">Edward Scott</span>, CEO, ElectrifAi</p>\n<p><b>About ElectrifAi</b></p>\n<p>ElectrifAi is a global leader in business-ready machine learning and computer vision models. ElectrifAi's mission is to help organizations change the way they work through machine learning and computer vision: quickly driving revenue and performance uplift, as well as cost and risk reduction. Founded in 2004, ElectrifAi boasts seasoned industry leadership, a global team of domain experts, and a proven record of transforming structured and unstructured data at scale. ElectrifAi's large library of Ai-based products reaches across business functions, data systems, and teams to drive superior results in record time. ElectrifAi has approximately 200 data scientists, software engineers and employees with a proven record of dealing with over 2,000 customer implementations, mostly for Fortune 500 companies. At the heart of ElectrifAi's mission is a commitment to making Ai, machine learning and computer vision more understandable, practical and profitable for businesses and industries across the globe. ElectrifAi is a global company with offices in <span class=\"xn-location\">Miami</span>, <span class=\"xn-location\">Jersey City</span>, <span class=\"xn-location\">Shanghai</span> and <span class=\"xn-location\">New Delhi</span>.</p>\n<p>Logo - <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3372621-1&amp;h=1167914266&amp;u=https%3A%2F%2Fmma.prnewswire.com%2Fmedia%2F1527876%2FElectrifAi_Logo.jpg&amp;a=https%3A%2F%2Fmma.prnewswire.com%2Fmedia%2F1527876%2FElectrifAi_Logo.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://mma.prnewswire.com/media/1527876/ElectrifAi_Logo.jpg</a></p>\n<p> </p>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p></div>"}