{"date": "2021-11-09 14:41:42.677000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 8239RBango PLC09 November 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>BANGO PLC</span>\n</p>\n<p>\n<span>(\"Bango\")</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Bango Resale technology supports Amazon launches across new wave of service providers</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Launches across telephony, Pay TV, broadband service providers to offer Amazon Prime as part of plans</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Cambridge, UK, 9 November 2021</span>\n</span>\n<span>- Bango (AIM: BGO), the global platform for data-driven commerce, announces it is now powering the next wave of service providers to launch Amazon Prime as a bundled offer to their customers.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>In 2021, the range of service providers using Bango technology to power Amazon Prime subscriptions bundled with their customer plans has expanded across telephony, Pay TV and broadband services. New launch partners include</span>\n<span>Dish in Mexico, Megacable in Mexico, TeleCentro in Argentina, Vodafone in Turkey, and Waoo in Denmark. In addition, existing Telco partners including Entel in Chile, WOM Mobile in Chile,</span> Mobily in Saudi Arabia <span>and Rogers in Canada have increased their use of the Bango Platform to include the distribution of Amazon bundled offers.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>\"Bango technology enables an increasingly diverse range of service providers across the world - from Telcos to Pay TV, cable and even bricks and mortar retailers - to deliver Amazon Prime via bundled offers to their customers,\"</span>\n</span>\n<span>\n<span>said Paul Larbey, CEO at Bango.</span>\n</span>\n<span>\n<span>\"This gives millions more customers the opportunity to enjoy Amazon Prime in many more parts of the world, and increases the market adoption of Bango technology\".</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>-END-</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Contact Details:</span>\n</span>\n<span>\n</span></p>\n<p>\n<span>\n<span>\n</span>\n<span>\n</span></span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>\n<span>Bango PLC</span>\n</span>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n<span>FTI Consulting</span>\n</span>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>Liberum Capital</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Tel. +1223 617387</span>\n</p>\n<p>\n<span>E. investors@bango.com</span>\n</p>\n</td>\n<td>\n<p>\n<span>Tel. +44 203 727 1000</span>\n</p>\n</td>\n<td>\n<p>\n<span>Tel.</span>\n<span>+44 20 3100 2000</span>\n</p>\n<p>\n<span>\n<span>\n</span></span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Paul Larbey, CEO</span>\n</p>\n<p>\n<span>Matt Garner, CFO</span>\n</p>\n<p>\n<span>Anil Malhotra, CMO</span>\n</p>\n<p>\n<span>Rebecca Jamieson, IR</span>\n</p>\n</td>\n<td>\n<p>\n<span>Rob Mindell</span>\n</p>\n<p>\n<span>Charlotte Stephen</span>\n</p>\n<p>\n<span>Gregory Hynes</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>Cameron Duncan</p>\n<p>James Greenwood</p>\n<p>Ed Phillips</p>\n<p>\n<span>Will King</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>About Bango</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The world's largest online merchants, including Amazon (NASDAQ: AMZN), Google (NASDAQ: GOOG) and Microsoft (NASDAQ: MSFT), use Bango technology to acquire more paying users.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Bango has developed unique purchase behavior technology that enables millions more users to buy the products and services they want, using innovative methods of payment including carrier billing, digital wallets and subscription bundling. Bango harnesses this purchase activity into valuable marketing segments, called Bango Audiences. Merchants use these audiences to target their marketing at paying customers based on their purchase behavior. Better targeting increases spend through the Bango payments business, in turn generating more data insights, creating a powerful virtuous circle that drives continuous growth. Everyone connected to the Bango Platform thrives as the virtuous circle grows.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Bango, the technology behind every payment choice. For more information, visit www.bango.com.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by Reach, the non-regulatory press release distribution service of RNS, part of the London Stock Exchange. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .Reach is a non-regulatory news service. By using this service an issuer is confirming that the information contained within this announcement is of a non-regulatory nature. Reach announcements are identified with an orange label and the word \"Reach\" in the source column of the News Explorer pages of London Stock Exchange's website so that they are distinguished from the RNS UK regulatory service. Other vendors subscribing for Reach press releases may use a different method to distinguish Reach announcements from UK regulatory news.RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>NRADZMGMZLLGMZM</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}