{"date": "2021-11-03 14:07:11.551000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3528.0, "close": 3555.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CLOUDMD SOFTWARE &amp; SERVICES INC (\"DOC-V;DOCRF-0\")\n- Partners with Apotex Latinoamerica to Drive Expansion of\n- Health Educational Resources Across the Region\n\n     CloudMD Software &amp; Services Inc. (the \"Company\" or \"CloudMD\"), a\nhealthcare technology company transforming the delivery of care, is excited\nto announce an expanded partnership with Apotex, a Canadian-based global\npharmaceutical company, to provide Apotex Latinoamerica with its flagship\nIMD Health digital education resource platform to support doctors, patients\nand individuals in Latin America and provide access to its robust database\nof trusted health educational resources. The IMD platform will be available\nin Mexico, Costa Rica, Panama and Nicaragua.\n\n     For the last 25 years, Latin America has been a key focus area for\nApotex with the goal of improving the health and well-being of patients in\nthe region by providing affordable, innovative, and high-quality solutions.\n\n     The IMD educational platform is Canada's largest digital education\nhealth database with over 5,600 medical topics (anatomy, conditions and\nprocedures) in a simple-to-use format with over 110,000 resources in a\nvariety of formats including articles, images, infographics and short\nvideos, in several languages (including Spanish). The content is customized\nby audience, so healthcare professionals or patients can learn more\nvaluable information about an illness, treatment, or other healthcare\ntopics.\n\n     Together, CloudMD and Apotex Latinoamerica have partnered to provide\nbetter access to healthcare resources for doctors and patients in Latin\nAmerica. The partnership focuses on two core platforms: (1) an integration\ninto a Apotex-operated physician web portal and, (2) integration into a\npublic facing web portal. CloudMD's educational platform will provide\naccess to trusted, peer-reviewed healthcare resources that will assist and\nsupport doctors and patients throughout their care journey. The platform\nhas developed Spanish as a core language option on the offering which\nprovides further opportunities for global expansion.\n\n     \"Over the last 25 years, we have been committed to improving the\nhealth and well-being of patients and families in Latin America. Our\nPartnership with CloudMD to adopt its IMD Health education platform\nreinforces our commitment to provide trusted healthcare resources to\nsupport and educate individuals through their health journeys. Trusted\nhealth information is essential to patient health, and we are excited to\nsupport our doctors, patients and the general public with access to this\ncredible digital health information,\" commented Americo Garcia,\nVice-President and General Manager, Apotex Latinoamerica.\n\n     Dr. Essam Hamza, CEO of CloudMD commented, \"We are excited to announce\nan expansion of our partnership with Apotex into Latin America. Our IMD\nHealth education platform has a robust database, and we feel very fortunate\nto be able to provide credible, trusted healthcare resources to\npractitioners and patients to support their health needs.\"\n\n     About Apotex Inc.\n\n     Apotex Inc. is a proudly Canadian, global pharmaceutical company that\nproduces high-quality, affordable medicines for patients around the world.\nApotex employs almost 8,000 people worldwide in manufacturing, R&amp;D, and\ncommercial operations.  Apotex Inc. exports to more than 100 countries and\nterritories and operates in more than 45 countries, with a significant\npresence in Canada, the US, Mexico, and India. Through vertical\nintegration, Apotex is comprised of multiple divisions and affiliates\nincluding Apotex Inc., focused on generics; Apotex Corp., an affiliate of\nApotex Inc. which markets and sells product in the United States;\nApobiologix, a division of Apotex Inc. focused on biosimilar development;\nAveva, an affiliate of Apotex Inc. fully integrated global developer and\nmanufacturer of complete transdermal solutions; Apotex Consumer Products, a\ndivision of Apotex Inc. focused on brand name products; and Global Active\nPharmaceutical Ingredients (GAPI), a division of Apotex Inc. focused on the\nmanufacturing of active pharmaceutical ingredients (API) for Apotex and\nthird parties. For more information visit: www.apotex.com\n\n     For more information, contact Jordan Berman, VP Global Corporate\nAffairs jberman@apotex.com\n\n     About CloudMD Software &amp; Services\n\n     CloudMD is transforming the delivery of healthcare using technology\nand by providing a patient-centric approach, with an emphasis on continuity\nof care. By leveraging healthcare technology, the Company is building one,\nconnected platform that addresses all points of a patient's healthcare\njourney and provides better access to care and improved outcomes. Through\nCloudMD's proprietary technology, the Company delivers quality healthcare\nthrough a holistic offering including hybrid primary care clinics,\nspecialist care, telemedicine, mental health support, healthcare\nnavigation, educational resources, and artificial intelligence (AI).\nCloudMD's Enterprise Health Solutions Division includes the leading Student\nAssistance Program and one of the top 4 Employee Assistance Programs in\nCanada and offers one comprehensive, digitally connected platform for\neducational institutions, corporations, insurers, and advisors to better\nmanage the health and wellness of their students, employees, and customers.\n\n     CloudMD currently services a combined ecosystem of over 7,000\npsychiatrists, approximately 4,500 therapists and counsellors,\napproximately 4,000 psychologists, over 22,000 family physicians, over\n34,000 medical specialists, over 1,500 allied health professionals, over\n500 clinics, and over 5 million individuals across North America. For more\ninformation visit: <a href=\"https://investors.cloudmd.ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://investors.cloudmd.ca</a>.\n\n     FOR ADDITIONAL INFORMATION,\n\n     Contact Information:\n\n     Julia Becker\n     VP, Investor Relations\n     julia@cloudmd.ca\n     (604) 785-0850\n\n     Forward Looking Statements\n\n     This news release contains forward-looking statements that are based\non CloudMD's expectations, estimates and projections regarding its business\nand the economic environment in which it operates, including with respect\nto its business plans. Although CloudMD believes the expectations expressed\nin such forward-looking statements are based on reasonable assumptions,\nsuch statements are not guarantees of future performance and involve risks\nand uncertainties that are difficult to control or predict. Therefore,\nactual outcomes and results may differ materially from those expressed in\nthese forward-looking statements and readers should not place undue\nreliance on such statements. These forward-looking statements speak only as\nof the date on which they are made, and CloudMD undertakes no obligation to\nupdate them publicly to reflect new information or the occurrence of future\nevents or circumstances, unless otherwise required to do so by law.\n\n     The TSX Venture Exchange does not accept responsibility for the\nadequacy or accuracy of this release.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130600322.MNPRE2130601883-07045920211103</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}