{"date": "2021-12-01 04:52:02.904000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON.COM INC (\"AMZN-Q\")\n- AWS Announces AWS IoT TwinMaker\n\n    Today, at AWS re:Invent, Amazon Web Services, Inc. (AWS), an\nAmazon.com, Inc. company announced AWS IoT TwinMaker, a new service that\nmakes it faster and easier for developers to create digital twins of\nreal-world systems like buildings, factories, industrial equipment, and\nproduction lines. Digital twins are virtual representations of physical\nsystems that are regularly updated with real-world data to mimic the\nstructure, state, and behavior of the objects they represent. AWS IoT\nTwinMaker makes it easy for developers to integrate data from multiple\nsources like equipment sensors, video cameras, and business applications,\nand combines that data to create a knowledge graph that models the\nreal-world environment. With AWS IoT TwinMaker, many more customers can use\ndigital twins to build applications that mirror real-world systems to\nimprove operational efficiency and reduce downtime. There are no up-front\ncommitments or fees to use AWS IoT TwinMaker, and customers only pay for\nthe AWS services used. To get started with AWS IoT TwinMaker, visit\naws.com/iot-twinmaker.\n\n    Industrial companies collect and process vast troves of data about\ntheir equipment and facilities from sources like equipment sensors, video\ncameras, and business applications (e.g. enterprise resource planning\nsystems or project management systems). Many customers want to combine\nthese data sources to create a virtual representation of their physical\nsystems (called a digital twin) to help them simulate and optimize\noperational performance. But building and managing digital twins is hard\neven for the most technically advanced organizations. To build digital\ntwins, customers must manually connect different types of data from diverse\nsources (e.g. time-series sensor data from equipment, video feeds from\ncameras, maintenance records from business applications, etc.). Then\ncustomers have to create a knowledge graph that provides common access to\nall the connected data and maps the relationships between the data sources\nto the physical environment. To complete the digital twin, customers have\nto build a 3D virtual representation of their physical systems (e.g.\nbuildings, factories, equipment, production lines, etc.) and overlay the\nreal-world data on to the 3D visualization. Once they have a virtual\nrepresentation of their real-world systems with real-time data, customers\ncan build applications for plant operators and maintenance engineers that\ncan leverage machine learning and analytics to extract business insights\nabout the real-time operational performance of their physical systems.\nBecause of the work required, the vast majority of organizations are unable\nto use digital twins to improve their operations.\n\n    AWS IoT TwinMaker makes it significantly faster and easier to create\ndigital twins of real-world systems. Using AWS IoT TwinMaker, developers\ncan quickly get started building digital twins of devices, equipment, and\nprocesses by connecting AWS IoT TwinMaker to data sources like equipment\nsensors, video feeds, and business applications. AWS IoT TwinMaker contains\nbuilt-in connectors for AWS IoT SiteWise, Amazon Kinesis Video Streams, and\nAmazon S3 (or customers can add their own connectors for data sources like\nAmazon Timestream or Snowflake) to make it easy to gather data from a\nvariety of sources. AWS IoT TwinMaker automatically creates a knowledge\ngraph that combines and understands the relationships of the connected data\nsources, so it can update the digital twin with real-time information from\nthe system being modeled. Customers can import existing 3D models (e.g. CAD\nand BIM files, point cloud scans, etc.), directly into AWS IoT TwinMaker to\neasily create 3D visualizations of the physical systems (e.g. buildings,\nfactories, equipment, production lines, etc.) and overlay the data from the\nknowledge graph on to the 3D visualizations to create the digital twin.\nOnce the digital twin has been created, developers can use an AWS IoT\nTwinMaker plugin for Amazon Managed Grafana to create a web-based\napplication that displays the digital twin on the devices plant operators\nand maintenance engineers use to monitor and inspect facilities and\nindustrial systems. For example, developers can create a virtual\nrepresentation of a metals processing plant by associating data from the\nplant's equipment sensors with real-time video of the various machines in\noperation and the maintenance history of those machines. Developers can\nthen set up rules to alert plant operators when anomalies in the plant's\nfurnace are detected (e.g. temperature threshold has been breached) and\ndisplay those anomalies on a 3D representation of the plant with real-time\nvideo from the furnaces, which can help operators make quick decisions on\npredictive maintenance before a furnace fails. With AWS IoT TwinMaker, many\nmore customers can use digital twins to build applications that simulate\ntheir real-world systems to improve operational efficiency and reduce\ndowntime.\n\n    \"Customers are excited about the opportunity to use digital twins to\nimprove their operations and processes, but the work involved in creating a\ndigital twin and custom applications for different use cases is\ncomplicated, expensive, and prohibitive for most,\" said Michael MacKenzie,\nGeneral Manager, AWS IoT. \"AWS IoT TwinMaker includes the built-in\ncapabilities most customers need for their digital twins, such as\nconnecting to data across disparate sources, modeling physical\nenvironments, and visualization of data with spatial context. With today's\nlaunch of AWS IoT TwinMaker, more customers can now have a holistic view of\ntheir industrial equipment, facilities, and processes to monitor and\noptimize all of their operations in real time.\"\n\n    AWS IoT TwinMaker is available today in preview in US East (N.\nVirginia), US West (Oregon), Asia Pacific (Singapore), and Europe (Ireland)\nwith availability in additional AWS Regions coming soon.\n\n    Carrier Global is a leading provider of healthy, safe, sustainable, and\nintelligent building and cold chain solutions. \"Today, our objectives\nextend beyond HVAC and refrigeration and into the development of healthy,\nsafe, and sustainable intelligent buildings. With our Abound platform, we\naggregate building performance data from a variety of systems and sensors,\noffering customers real-time insight into their connected spaces. Enhancing\nthis platform with digital twins of buildings for their owners and\noperators has been a top priority for us,\" said Dan Levine, Sr. Director of\nDigital and Cloud at Carrier. \"However, in-house development of that\ncapability threatened to be difficult, costly, and slow. With AWS IoT\nTwinMaker, we see a key enabler for us to significantly accelerate the\ntechnology strategy of our Abound platform. AWS IoT TwinMaker will help our\ndevelopment team focus on rapidly creating differentiated customer outcomes\nrather than the heavy lifting of digital twin data abstraction and adding\n3D visualization to our solutions.\"\n\n    Siemens is a leader in providing software to create comprehensive\ndigital twins for design, manufacturing, and service. \"We are excited to\nwork with AWS and expand connections between our Xcelerator portfolio and\nAWS services including the new AWS IoT TwinMaker service. Through this\ncollaboration, developers will be able to create digital twin solutions\nthat can scale from the simplest to the most complex use cases by combining\nour rich application services for low-code, visualization, simulation, and\nindustrial IoT with AWS IoT TwinMaker and other AWS services,\" said Brenda\nDischer, Senior Vice President for Industry Marketing &amp; Strategy at Siemens\nDigital Industries Software. \"As part of our open ecosystem, this expanded\ncollaboration between AWS and Siemens will increase the breadth of services\nwe offer so together we can deliver new digital twin solutions that help\nour customers accelerate their digital transformation.\"\n\n    Accenture is a global professional services company with leading\ncapabilities in digital, cloud, and security. \"Digital transformation of\nmanufacturing is a huge opportunity for our clients who often face\nchallenges with fragmented, siloed, and unstructured industrial data,\nleaving many proofs of concept unscalable,\" said Maikel van Verseveld,\nGlobal Technology Lead for Digital Manufacturing &amp; Operations, Industry X,\nat Accenture. \"As our clients look to start and scale their digital\nmanufacturing journey, having tools that can quickly address these\nchallenges is vital. With AWS IoT TwinMaker, they can now easily create\ndigital twins for a more contextualized, data-driven, and real-time view of\ntheir manufacturing operations from disparate IT and OT systems, allowing\nend users to make better decisions and optimize operations. Through the\nAccenture AWS Business Group, we have been able to start leveraging AWS IoT\nTwinMaker and we are excited for the value it can bring our customers.\"\n\n    INVISTA, a subsidiary of Koch industries, is a leading global\nmanufacturer of fiber, resins, and chemical intermediates. \"Working closely\nwith AWS over many years, we have been building a strong analytics and data\nscience capability to support our manufacturing operations and find new and\nbetter ways to improve our products and processes,\" said Jerry Grunewald,\nVice President of Operations Innovations at INVISTA. \"Our field personnel\nneed to efficiently address operational notifications and alerts from the\nplant floor, however, equipment information is distributed across different\nsystems. Using AWS IoT TwinMaker, we can now build a digital twin of our\nmanufacturing operations into a Connected Worker application that brings\nthis disparate information into a consolidated view that represents our\nreal environment. This has improved productivity and efficiency in field\noperations, supports environmental health and safety performance, and\nprovides further opportunities to leverage employee expertise in finding\nnew and better ways to create value for our customers.\"\n\n    About Amazon Web Services\n\n    For over 15 years, Amazon Web Services has been the world's most\ncomprehensive and broadly adopted cloud offering. AWS has been continually\nexpanding its services to support virtually any cloud workload, and it now\nhas more than 200 fully featured services for compute, storage, databases,\nnetworking, analytics, machine learning and artificial intelligence (AI),\nInternet of Things (IoT), mobile, security, hybrid, virtual and augmented\nreality (VR and AR), media, and application development, deployment, and\nmanagement from 81 Availability Zones within 25 geographic regions, with\nannounced plans for 27 more Availability Zones and nine more AWS Regions in\nAustralia, Canada, India, Indonesia, Israel, New Zealand, Spain,\nSwitzerland, and the United Arab Emirates. Millions of customers--including\nthe fastest-growing startups, largest enterprises, and leading government\nagencies--trust AWS to power their infrastructure, become more agile, and\nlower costs. To learn more about AWS, visit aws.amazon.com.\n\n    About Amazon\n\n    Amazon is guided by four principles: customer obsession rather than\ncompetitor focus, passion for invention, commitment to operational\nexcellence, and long-term thinking. Amazon strives to be Earth's Most\nCustomer-Centric Company, Earth's Best Employer, and Earth's Safest Place\nto Work. Customer reviews, 1-Click shopping, personalized recommendations,\nPrime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career\nChoice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out\ntechnology, Amazon Studios, and The Climate Pledge are some of the things\npioneered by Amazon. For more information, visit amazon.com/about and\nfollow @AmazonNews.\n Contact Information:\n\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300571.MNPRE2133302996-10485520211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}