{"date": "2022-02-03 19:58:10.762000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_kpb27mry&amp;referenceId=tag:reuters.com,2022:newsml_OVFX4L8Y3_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_kpb27mry&amp;referenceId=tag:reuters.com,2022:newsml_OVFX4L8Y3_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: U.S. shares fell on Thursday, with the Nasdaq diving more than 2%, as Facebook-owner Meta Platforms' dour forecast jolted the broader tech sector and threatened to upend a nascent recovery in stock markets. This report produced by Chris Dignam.<br/>Short Link: <a href=\"https://refini.tv/3gnLkIw\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3gnLkIw</a><br/><br/>Video Transcript:<br/><br/>Facebook owner Meta Platforms found itself in an alternate reality Thursday, as shares of the company fell as much 26%, dragging down the entire US stock market and spilling over into Europe, where tech stocks posted some of the steepest declines and sent a ripple effect across global financial markets. Meta was set to lose a fifth of its market value, erasing about $200 billion, which would shave off nearly a full percent from the NASDAQ Composite index's market value and about 0.5% from the S&amp;P 500. The huge drop followed a dismal forecast from Meta, which blamed Apple's privacy changes and increased competition from rivals like TikTok. The company formerly known as Facebook also reported a decline in daily active users from the previous quarter for the first time ever.<br/><br/>Facebook was an unmitigated disaster.<br/><br/>Wedbush Securities Managing Director Daniel Ives.<br/><br/>I think Facebook has a Mount Everest-like battle, an uphill climb to get back to growth, and because what we're seeing on the digital advertising side, the privacy issues, TikTok competition. You know, this is a company, they change their name, but the strategy and the motivation continues to be social media. And this is a dark phase in terms of what we saw from the quarter.<br/><br/>The so-called FAANG stocks including Facebook, Amazon, Apple, Netflix and Google's Alphabet has seen around $400 billion in market value disappear in the opening weeks of this year, as investors expect policy tightening from the Federal Reserve to erode the industry's sky-high valuations. The disappointment over Meta's earnings and the subsequent stock drop called to mind the bursting tech bubble of 2000. If Thursday's losses hold, the decline would mark the social media giant's worst one-day loss since it went public in 2012.<br/></span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}