{"date": "2021-11-29 23:41:53.508000+00:00", "ticker": "III", "mrkt_info": {"open": 1388.0, "close": 1433.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-T\")\n- Responds to Canada Energy Regulator Decision to Deny Mainline\n- Contracting\n\n     Enbridge Inc. (Enbridge or the Company) responded to the Canada Energy\nRegulator's (CER) November 26, 2021 decision to deny the implementation of\ncontracting for firm service on the Enbridge Canadian Mainline system.\n\n     Enbridge has completed its review of the decision and identified next\nsteps that include re-engaging all stakeholders, including shippers and\nnon-shippers on the Mainline system.\n\n     The Enbridge Mainline is a critical conduit connecting western\nCanadian crude oil and product supply with Canadian and U.S. Midwest\nmarkets, and ultimately the U.S. Gulf Coast. For decades, the system has\nprovided its customers with unparalleled market access, crude oil quality\nmanagement, system reliability and long-term expansion potential at the\nmost competitive toll. Since inception of the Enbridge system in 1950, the\ncommercial underpinning of the Mainline has evolved, from a contested\ncost-of-service (COS) framework to incentive rate making. Enbridge\npioneered the first incentive tolling agreement with our customers in 1995,\nwhich aligned industry and Enbridge interests, and supported significant\ninvestment and expansion of the Mainline.\n\n     The most recent incentive agreement, called the Competitive Tolling\nSettlement (CTS Agreement), expired in June 2021; therefore, the Mainline\nis currently under interim tolls (subject to refund) and which will stay in\neffect until new tolls are approved by the CER. In 2018, in preparation for\nthe upcoming expiry of the CTS Agreement, Enbridge initiated consultations\nwith industry participants to determine their goals for the next Mainline\ntolling arrangement. Among other feedback, the Company heard significant\nconcerns from industry over continuing Mainline apportionment, due to\ngrowing western Canadian production and lack of sufficient egress. A large\nportion of existing shippers expressed desire for continued toll certainty,\nand to contract for firm service to ensure access to the system.\n\n     However, it was also evident from extensive industry input that there\nwas no consensus on what a new commercial structure should look like - some\nfavoured contracting, while others opposed it altogether, preferring to\nmaintain the status-quo, a monthly nominations process and a fixed toll.\nAfter significant negotiation with industry on a comprehensive set of\nterms, Enbridge applied to the CER to contract the Canadian Mainline.\n\n     In reaching its decision, the CER determined that providing firm\nservice on the Canadian Mainline is not contrary to the CER Act. The CER\nalso found that elements of the application provided strong justification\nfor some proportion of firm service on the Canadian Mainline. However, the\nCER denied the application on the basis that, among other things,\ncontracting as proposed would result in a significant change to access the\nCanadian Mainline and potentially inequitable outcomes to some shippers and\nnon-shippers without a compelling justification. The CER confirmed\nEnbridge's existing process for downstream verification and that interim\ntolls would stay in effect.\n\n     Based on its review of the CER decision, Enbridge will initiate, in\nconsultation with its stakeholders, a process to negotiate toward a\ngo-forward Mainline commercial framework. Elements of the process will\ninclude:\n\n//st\n\n  * Enbridge will re-engage with stakeholders, to receive input on key\n    objectives and variables that are important in considering the future\n    commercial framework, the current industry outlook and desire for\n    future expansion of the Mainline; and\n  * Enbridge will explore, with stakeholders, alternatives that may\n    include:\n    a modified and extended CTS agreement, a new incentive rate-making\n    agreement, or a COS rate-making structure. Any negotiated settlement\n    would require CER approval before implementation.\n\n//et\n\n     In parallel with negotiations of a potential negotiated settlement,\nEnbridge will prepare a COS application for the Canadian Mainline, which\nwill be filed with the CER if Enbridge, after consultation with\nstakeholders, concludes that an agreement to continue with incentive rate\nmaking is not achievable.\n\n     Enbridge expects the preceding steps to begin in the coming weeks,\nalthough the negotiating process may take through 2022. We expect the\nsubsequent CER review and decision process to conclude in 2023.\n\n     From a financial perspective, Mainline throughput is expected to be\nstrong over the next several years and the Company's outlook is positive.\nBased on our review of the CER decision and other factors, the Company\nanticipates that the range of financial outcomes associated with an\nalternative commercial model will be manageable and is not expected to\nmaterially impact Enbridge's financial results.\n\n     Enbridge will provide its 2022 guidance, longer term outlook and\nstrategic priorities at Enbridge Day on December 7th, 2021, in Toronto.\n\n     FORWARD-LOOKING INFORMATION\n\n     Forward-looking information, or forward-looking statements, have been\nincluded in this news release to provide information about Enbridge and its\nsubsidiaries and affiliates, including management's assessment of Enbridge\nand its subsidiaries' future plans and operations. This information may not\nbe appropriate for other purposes. Forward-looking statements are typically\nidentified by words such as \"anticipate\", \"expect\", \"project\", \"estimate\",\n\"forecast\", \"plan\", \"intend\", \"target\", \"believe\", \"likely\" and similar\nwords suggesting future outcomes or statements regarding an outlook.\nForward-looking information or statements included in this news release\ninclude, but are not limited to, statements with respect to the following:\nMainline commercial framework, including potential alternatives and\nEnbridge's planned next steps, proposed filings with the Canada Energy\nRegulator and expected timelines; Mainline throughput; corporate outlook;\nand financial outcomes associated with an alternative commercial model.\n\n     Although Enbridge believes these forward-looking statements are\nreasonable based on the information available on the date such statements\nare made and processes used to prepare the information, such statements are\nnot guarantees of future performance and readers are cautioned against\nplacing undue reliance on forward-looking statements. By their nature,\nthese statements involve a variety of assumptions, known and unknown risks\nand uncertainties and other factors, which may cause actual results, levels\nof activity and achievements to differ materially from those expressed or\nimplied by such statements. Material assumptions include assumptions about\nthe following: customer and regulatory approvals; the expected supply of\nand demand for crude oil, natural gas, natural gas liquids (NGL) and\nrenewable energy; prices of crude oil, natural gas, NGL and renewable\nenergy; anticipated utilization of our existing assets; exchange rates;\ninflation; interest rates; availability and price of labour and\nconstruction materials; operational reliability; maintenance of support and\nregulatory approvals for the Company's projects; anticipated in-service\ndates; weather; the timing and closing of acquisitions and dispositions;\nthe realization of anticipated benefits and synergies of transactions;\ngovernmental legislation; litigation; impact of the Company's dividend\npolicy on its future cash flows; credit ratings; capital project funding;\nhedging program; expect earnings before interest, income taxes,\ndepreciation and amortization (EBITDA) and expected adjusted EBITDA;\nexpected earnings/(loss) and adjusted earnings/(loss); expected\nearnings/(loss) and adjusted earnings/(loss) per share; expected future\ncash flows and expected future distributable cash flow (DCF) and DCF per\nshare; and estimated future dividends. Assumptions regarding the expected\nsupply of and demand for crude oil, natural gas, NGL and renewable energy,\nand the prices of these commodities, are material to and underlie all\nforward-looking statements, as they may impact current and future levels of\ndemand for the Company's services. Similarly, energy transition, including\nthe drivers and pace thereof, the COVID-19 pandemic, exchange rates,\ninflation and interest rates impact the economies and business environments\nin which the Company operates and may impact levels of demand for the\nCompany's services and cost of inputs, and are therefore inherent in all\nforward-looking statements. Due to the interdependencies and correlation of\nthese macroeconomic factors, the impact of any one assumption on a\nforward-looking statement cannot be determined with certainty.\n\n     Enbridge's forward-looking statements are subject to risks and\nuncertainties pertaining to the successful execution of our strategic\npriorities, operating performance, regulatory parameters and decisions,\nchanges in regulations applicable to the Company's business, litigation,\nacquisitions and dispositions and other transactions, project approval and\nsupport, renewals of rights-of-way, weather, economic and competitive\nconditions, public opinion, changes in tax laws and tax rates, changes in\ntrade agreements, political decisions, exchange rates, interest rates,\ncommodity prices, supply of and demand for commodities, energy transition\nand the COVID-19 pandemic, including but not limited to those risks and\nuncertainties discussed in this news release and in the Company's other\nfilings with Canadian and U.S. securities regulators. The impact of any one\nrisk, uncertainty or factor on a particular forward-looking statement is\nnot determinable with certainty as these are interdependent and Enbridge's\nfuture course of action depends on management's assessment of all\ninformation available at the relevant time. Except to the extent required\nby applicable law, Enbridge assumes no obligation to publicly update or\nrevise any forward-looking statements made in this news release or\notherwise, whether as a result of new information, future events or\notherwise. All forward-looking statements, whether written or oral,\nattributable to Enbridge or persons acting on the Company's behalf, are\nexpressly qualified in their entirety by these cautionary statements.\n\n     About Enbridge Inc.\n\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which owns approximately 1,766\nmegawatts (net) in renewable power generation capacity in North America and\nEurope. The Company's common shares trade on the Toronto and New York stock\nexchanges under the symbol ENB. For more information, visit\nwww.enbridge.com.\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n\n     Media Toll Free: (888) 992-0997 Email: media@enbridge.com\n\n     Investment Community Toll Free: (800) 481-2804 Email:\ninvestor.relations@enbridge.com\n\n     View original\ncontent:https://www.prnewswire.com/news-releases/enbridge-responds-to-canad\na-energy-regulator-decision-to-deny-mainline-contracting-301432604.html\n\nTel   : 403-231-3900    ENBRIDGE INC CUM REDEEMABLE PR SHARES SERIES L\nFax   : 403-231-5929\nEmail : CorporateSecretary@enbridge.com\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133200026.MNPRE2133200472-04211720211129</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}