{"date": "2022-01-06 21:05:00.151000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3287.14, "close": 3251.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n<b>Grid Dynamics Recognized as AWS Advanced Consulting Partner</b>\n</p><p>\n<b>What's the news:</b> Grid Dynamics has been named an Amazon Web Services (AWS) Advanced Consulting Partner.\n</p><p>\n<b>Why it matters:</b> Customers of AWS can best serve their end customers by working with an AWS Advanced Consulting Partner with proven, advanced expertise in AWS and cloud-native technologies.\n</p><p>\n<b>Who's it for:</b> Digital natives and growth-oriented enterprises looking to leverage AWS technologies.\n</p><p>\nGrid Dynamics Holdings, Inc. (NASDAQ:GDYN) (Grid Dynamics), a leader in enterprise-level digital transformation services and solutions, announced that it has been recognized as an (Amazon Web Services) AWS Advanced Consulting Partner. This designation is awarded to companies with a strong team of trained and certified technical individuals and have proven customer experience in helping customers architect, design, build and deploy solutions on AWS. Working with an AWS Advanced Consulting Partner like Grid Dynamics gives AWS customers confidence they are aligned with pre-vetted, proven engineering teams which can quickly and efficiently deliver solutions with the advanced capabilities and benefits of AWS.\n</p><p>\nGrid Dynamics’ team of experts provides access to cloud-first solutions powered by the AWS platform — including customer experience, application modernization, data analytics, machine learning, business intelligence tools, and more. The Grid Dynamics Analytical Data Platform, an accelerator for analytics and insights, is available in AWS Marketplace and has been leveraged successfully by several top-tier enterprise companies.\n</p><p>\n\"We're proud about the progress made in enhancing our technical capabilities, as recognized by AWS as an Advanced Consulting Partner. It is an acknowledgement of our skills and a result of several successful cloud transformation projects for our joint customers. We will continue to invest in building our competencies and accelerators, for enterprises to leverage AWS for positive business outcomes,” said Rahul Bindlish, Vice President, Strategic Business Development at Grid Dynamics.\n</p><p>\nExplore the full range of our offerings on our <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.griddynamics.com%2F&amp;esheet=52558937&amp;newsitemid=20220106005532&amp;lan=en-US&amp;anchor=website&amp;index=1&amp;md5=713c40252e4e876a3529bf024c6c8549\" data-type=\"url\" class=\"tr-link\" translate=\"no\">website</a>, and please visit our <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fpartners.amazonaws.com%2Fpartners%2F001E000001dADZdIAO%2FGrid%2520Dynamics&amp;esheet=52558937&amp;newsitemid=20220106005532&amp;lan=en-US&amp;anchor=AWS+Partner+listing&amp;index=2&amp;md5=388928491e45d0ef7d7b85818af9b69f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Partner listing</a> for case studies and more information on how Grid Dynamics leverages the power of AWS to help companies grow.\n</p><p>\n<b>About Grid Dynamics</b>\n</p><p>\nGrid Dynamics (Nasdaq: GDYN) is a digital-native technology services provider that accelerates growth and bolsters competitive advantage for Fortune 1000 companies. Grid Dynamics provides digital transformation consulting and implementation services in omnichannel customer experience, big data analytics, search, artificial intelligence, cloud migration, and application modernization. Grid Dynamics achieves high speed-to-market, quality, and efficiency by using technology accelerators, an agile delivery culture, and its pool of global engineering talent. Founded in 2006, Grid Dynamics is headquartered in Silicon Valley with offices across the US, UK, Netherlands, Mexico, and Central and Eastern Europe.\n</p><p>\nTo learn more about Grid Dynamics, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.griddynamics.com&amp;esheet=52558937&amp;newsitemid=20220106005532&amp;lan=en-US&amp;anchor=www.griddynamics.com&amp;index=3&amp;md5=869fdebb017033f02293cf37ad817409\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.griddynamics.com</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220106005532r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMTA2MDA1NTMycjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=74cb2941b07f81a55c702a2e99667c50359183d7cdac4d4410ac122f9756dee8df252cad5362bc4fd6de8b321f9e32b83386c8471188b3abd15175e5124f2700\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220106005532/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220106005532/en/</a></span></p><p>\nGrid Dynamics Investor Relations:\n<br/><a href=\"mailto:investorrelations@griddynamics.com\" data-type=\"email\" translate=\"no\">investorrelations@griddynamics.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CA-GRID-DYNAMICS</p></div>"}