{"date": "2021-11-28 06:47:15.203000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3504.56, "close": 3507.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Visakhapatnam (Andhra Pradesh) [India], November 28 (ANI): Special Enforcement Bureau (SEB) officials and Andhra Pradesh Police on Saturday arrested five persons involved in case of peddling Marijuana through the e-commerce website Amazon.</p><p>Visakhapatnam (Andhra Pradesh) [India], November 28 (ANI): Special Enforcement Bureau (SEB) officials and Andhra Pradesh Police on Saturday arrested five persons involved in the case of peddling Marijuana through the e-commerce website Amazon.</p></div><div class=\"tr-npp-body\"><p>SEB Joint Director JD Satish Kumar said, \"One of the accused named Chilakapati Srinivasa Rao was arrested from his house in the Kancharapalem area of Visakhapatnam city with 48 kilograms of dry marijuana. Certain Amazon packaging materials like covers, cardboard boxes, tapes etc and an electronic weighing machine were also found from his residence.\"</p><p>During the interrogation, Rao confessed his acquaintance with Suraj and Mukul, two other accused in the case. \"Three of them transport Dry Ganja from Visakhapatnam to Madhya Pradesh and Rajasthan under the guise of selling supernatural Stevia leaves over Amazon online platform,\" added Kumar.</p><p>The two pick-up associates and one van driver belonging to the Amazon Kancharapalem First Mile station who have aided the accused have also been arrested.</p><p>With the joint operation of SEB, Rural police, other revenue departments destroyed 5500 acres of cannabis cultivation in part of 'Operation Parivarthan' in the Visakhapatnam Rural Agency area.</p><p>So far, eight arrests have been made in connection with the case.</p><p>In a new revelation in the Amazon drug peddling case, ten dealers had been found registered at the same address from where the marijuana was being smuggled in Madhya Pradesh's Bhind, informed the Police.</p><p>Recently, Madhya Pradesh Police busted an alleged racket of the sale of marijuana in the name of 'Kadi Patta' through Amazon and arrested three accused.</p><p>A fake Gujarat-based textile company named Babu Tex was involved in the sale of drugs at Madhya Pradesh in the drug peddling case.</p><p>Amazon has been asked to provide information on sellers, transport and warehouse.Bhind SP Manoj Kumar had appealed to cooperate in the investigation on Amazon company, after which on Friday, a team of four members including Amazon company's legal head Swati Agarwal and lawyer Sumant Narang reached Bhind and met the SP, who had a conversation with the team of Amazon.</p><p>Further investigations are underway. (ANI)</p><p>Copyright © 2021 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}