{"date": "2022-01-17 19:30:02.592000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\"><p class=\"xn-distributor\">Canada NewsWire</p><p class=\"xn-dateline\">CAMBRIDGE, ON, Jan. 17, 2022</p></div><div class=\"xn-content\"><p><span class=\"xn-location\">CAMBRIDGE, ON</span>, <span class=\"xn-chron\">Jan. 17, 2022</span> /CNW/ - Kinetic GPO, a cooperative purchasing organization that services Canadian public sector and nonprofit organizations, announced today it has entered into a three-year contract with Amazon Business Canada as of <span class=\"xn-chron\">July 1, 2021</span>.</p><p>This agreement allows Kinetic GPO's members across Canada to experience fast, efficient and convenient shipping options on hundreds of millions of products across categories like office, IT, janitorial, food service and professional medical supplies. In addition, Amazon Business helps public entities achieve their goal of allocating more of their spending to small, diverse and local sellers.</p><p>\"We're excited to be working with Kinetic GPO,\" said <span class=\"xn-person\">Nick Georgijev</span>, country manager for Amazon Business Canada. \"Making online procurement easier for broader public sector customers of all sizes is among our top priorities and one we share with Kinetic GPO.\" </p><p>\"Amazon Business delivers the buying experience Kinetic GPO members want, and we are pleased to provide a contract vehicle for this extensive nationwide online marketplace. Public entities and non-profits will be able to benefit from the product offering, convenience and value you expect from Amazon. Customers also have access to a variety of business-tailored features and benefits, including a curated site experience, Business Prime, business-only pricing and selection, single or multiuser business accounts, approvals workflow, purchasing system integrations, payment solutions, tax exemptions, dedicated customer support, and more. In essence, this contract will help participating members manage their supply chain in a compliant and efficient manner,\" said <span class=\"xn-person\">Chris Penny</span>, CEO of Kinetic GPO.</p><p>Kinetic GPO conducts procurement in a fair, open and transparent manner compliant with the International and Regional Trade Agreements. A membership is also free with no volume commitments. </p><p><b>About Kinetic GPO </b><br/>Kinetic GPO is a national broader public sector collaborative purchasing organization, established in 2017, whose contracts have been competitively bid in a fair, open, and transparent manner to vendors for commonly purchased products and services including, technology, fleet, office supplies, maintenance, HVAC, roofing, groundskeeping, playground, operations, furniture, managed print services, and construction consistent with the regional and national trade agreement requirements. Entities that must comply with regional and national trade agreements, such as municipalities, higher education, schools, healthcare, non-profit, and all other public sector entities, use Kinetic GPO contracts to increase their efficiency and economy when procuring goods and services. As a national purchasing cooperative, Kinetic GPO leverages a large pool of purchasing potential and allows entities to receive a combined buying power regardless of the entity's size. For more information about Kinetic GPO or to become a member, please visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3415196-1&amp;h=2590422850&amp;u=http%3A%2F%2Fwww.kineticgpo.ca%2F&amp;a=www.kineticgpo.ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.kineticgpo.ca</a>.</p><p><b>About Amazon Business </b><br/>Amazon Business combines the selection, convenience and value customers have come to know and love from Amazon, with new features and unique benefits tailored to the needs of businesses. Amazon Business provides easy access to hundreds of millions of products and a variety of benefits, including business-only pricing and selection, single or multi user business accounts, Business Prime, approval workflow, purchasing system integrations, payment solutions, tax exemptions, dedicated customer support and more. Amazon Business is currently available for <span class=\"xn-location\">the United States</span>, <span class=\"xn-location\">Canada</span>, <span class=\"xn-location\">United Kingdom</span>, <span class=\"xn-location\">Germany</span>, <span class=\"xn-location\">France</span>, <span class=\"xn-location\">Italy</span>, <span class=\"xn-location\">Spain</span>, <span class=\"xn-location\">Japan</span> and <span class=\"xn-location\">India</span>. To register for a free Amazon Business account, visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3415196-1&amp;h=642473105&amp;u=http%3A%2F%2Fwww.amazon.com%2Fbusiness&amp;a=www.amazon.com%2Fbusiness\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/business</a>.</p><p>SOURCE  Amazon Canada</p><div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p></p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=C7934&amp;sd=2022-01-17\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1DNzkzNCZzZD0yMDIyLTAxLTE3&amp;key=f654b184e9ebf177c5ecf98af3827525cfc7f5b691da7bd724465e8dba934b83754a8672cd5b614b4585e6df8cb81e257043cc431fc317c5c4e12d57944c8af3\"/></div></div> View original content: <a href=\"http://www.newswire.ca/en/releases/archive/January2022/17/c7934.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/January2022/17/c7934.html</a><p></p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright CNW Group Ltd. 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon-Kinetic-GPO</p></div>"}