{"date": "2022-02-22 08:11:25.333000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_qnd8ryaz&amp;referenceId=6298084607001_B35&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_qnd8ryaz&amp;referenceId=6298084607001_B35&amp;pageId=RefinitivNewscasts</a></pre>Source: Real Vision<br/><br/>Description: We’re still in the Netscape phase of crypto, according to Marshall Hayner, founder and CEO of Metal Payments, and the future is bright. Hayner sees regulation and user interface as the two pivotal factors affecting mass adoption. While 2021 saw a rapid acceleration of lobbying efforts as well as public-awareness initiatives, most governments still just don’t seem to get it and people are still using clunky software like Metamask. Hayner and his team at Metal are currently working to create browser-based and seamless crypto payment systems. In the very near future, though, the cumbersome tasks we assume are just part of the process will slowly ease as they are abstracted away by developers. The implications of what is a relatively simple shift are immense, according to Hayner, and he remains highly optimistic on the next decade in this space. Interviewed by Ash Bennington on February 3, 2022.<br/>Short Link: <a href=\"https://refini.tv/3s0ymXT\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3s0ymXT</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Welcome to Real Vision Crypto. I'm Ash Bennington. I'm joined today by Marshall Hayner, CEO and co-founder of Metal. Today we're talking about DeFi, Sci-Fi and the future of finance. Marshall, Welcome to Real Vision Crypto. &gt;&gt; Thanks for having me on, Ash. It's a pleasure. &gt;&gt; But it's a pleasure to have you. I had been excited to have this conversation. Before we get started talking about what you guys are doing at Metal right now, tell us a little bit about your background. You've been a Bitcoiner for a very long time. You've been in this space for a very long time. Tell us how you got into crypto and how do you made your progression to co-founding Metal? &gt;&gt; Yeah, So my background in crypto goes way back over 10 years ago. Started as a hobbyist. When I went off to school in early 2000s, went to college, I was obsessed with decentralized networks, cryptography. I grew up, I was a teenager when Napster became popular and the founder went to the same alma mater as myself, Northeastern. We're both college dropouts, and I thought file-sharing was really cool. I thought decentralized networks were really cool and it was around 2002 or 2003 that I discovered BitTorrent and I started getting involved in decentralized networks and researching how this stuff works, and I got really excited. I became very active in BitTorrent communities, decentralized networks and I really felt that that was part of the future of the web because I watched that grow from this tiny little app that the founder brand made in his basement to 70 percent of all web traffic. By 2009, I discovered Bitcoin because of BitTorrent, somebody in a forum that I was on brought up a topic of conversation. He was an artist that was self-published, and wanted to publish his records on a now defunct website called What.CD and he couldn't monetize that and people had all types of ideas and somebody brought up the idea of Bitcoin. Since I was obsessed with BitTorrent at the time and this vision for a decentralized web, I immediately googled that and that began the journey. It took me a few weeks, about two weeks in late 2009, like December, November, December 2009. Took me about two weeks to figure it out. I had the original Bitcoin-Qt software, my 2008 MacBook Pro, and I was trying to figure out where in the docs, where in the RPC it connects to some banking API or something. I just couldn't figure it out and then I realized it doesn't and that's where I got really excited. I started buying Bitcoin. I started mining Bitcoin when you could GPU mine Bitcoin. That laptop, that 2008 MacBook Pro I brought into the Apple Store, the bar completely warped. They asked, what do you do to this thing? I said I've been mining Bitcoins and they said what? Now, Apple knows what that is. But at the time it was very niche. I became obsessed with this. I was on Bitcoin Talk, I was on P2P Foundation, all the early read it all the early forums and IRC. And by 2012, I realized after a few years that there was just no good software. We had Venmo, we have iPhones now, we have PayPal, we have all these things. Why am I going to boot up my laptop and wait 20 minutes for Bitcoin-Qt to load, to send you this transaction where there's nowhere to cash it out. There needs to be a banking service or like a PayPal for crypto and that's where I got this idea of starting to build a PayPal for crypto. By 2013, I launched an app called QuickCoin and it was an easy to use Bitcoin wallet. At the time I would set up family and friends with paper wallets and the old Schildbach Wallet and for the most part it was very like an IT thing and nerdy developer thing, hobbyists thing just like BitTorrent was for me. Then I started to watch it grow and by 2013 I came up with this idea, launched an app that makes it easy for people to use. So everybody has a Facebook account. I figured if I could secure people's Bitcoin with a Facebook account, and they could send it to each other over wall posts and messenger that might work, and it did. In about four weeks we got a million users that blew up and then I was approached by Jed McCaleb from Stellar and asked me If I would go and join Stellar to help them launch the Stellar project. I did in 2014 at the same time and at 2013 as I was just launching QuickCoin, this thing appeared called Dogecoin and a lot of people asked me, what is this? Is it a joke? It was, and I started researching that and I reached out to the founder and we became friends and I became very active and involved in the Dogecoin space because what was once a hobby for me had become less of a hobby where everyone stopped asking me. How does it work and started asking you, what's the price going to be next week or next month? For us as developers and engineers and people building, we want to talk about all the cool fun stuff in Dogecoin was a place where we could go and have fun, and with anyone asks what the price of one Dogecoin is. We would say one Doge equals one Doge. That was fun for me. Because of that and Stellar I got really excited about this idea of building this viral community, decentralized organization around this PayPal and Metal Pay was born. The idea was, let's make the PayPal for crypto. I was on the right path because now in 2022, not only does PayPal have crypto, but they've added it to Venmo. They're completely overhauling their stack to add blockchain and crypto and it was the right move. From 2016 to now, the company has grown pretty significantly. Started with myself and my co-founder, who was Glenn Marion, our CTO, who actually created the original Dogecoin wallet, Doge Wallet. I'm sorry, not Doge Wallet. That was the first wallet that actually ended up being a scam. The real wallet was dogechain.info. Back in the day before Bitcoin, blockchain.com was actually called blockchain.info. All the Bitcoiners would go to blockchain.info. When Dogecoin appeared, we had our dogechain.info and that was created by Glenn. I met him while working with a company called block.io. We hit it off and we started Metal Pay in 2016. Flash forward to 2022, the vision was to make something that everybody could use. Everybody could download this app. Everybody could have this crypto experience and beyond just Bitcoin or just buying and selling, what do these networks enable you to do: NFTs, smart contracts, financial transactions. It's not just speculating on crypto. That was the vision, and as we grow, we are pursuing a US bank charter, a de novo bank charter. And we really took a different route than a lot of the other startups. Because as I started to build this PayPal for crypto I realized, I have to do everything 10 times better than the traditional fintech walking into a Visa or MasterCard or a bank partner. Because when I mentioned the word Bitcoin, I'm usually kicked out of the room and I wasn't the very beginning. As I built a compliance program, as I built a team and brought in executives from Visa and MasterCard and from Bank of America and BNY Mellon and top financial institutions, we built the right programs and we really built a compliant operating system and that has allowed us to survive and grow, and I think that now what's happening, it's really interesting. The crypto landscape is becoming regulated and that is going to completely shift to the way that we interact with these things. In one way, it's going to eliminate some of the riskier things that you see out there and definitely kill a lot of what I believed to be scams or just the reiteration of the high yield investment program. But for crypto or something, I like to see that go away, and we're going to see all the top banks integrating crypto. This year alone, I think New York digs bring you on something like 200 banks. So this is becoming a mainstream thing. &gt;&gt; Marshall, I've seen you give the presentation the long-form version of what you guys are doing at Metal. Give us the short-form version. What's the thesis at Metal and why are you so passionate about it? &gt;&gt; Yeah. So our vision is to build a global crypto bank. We believe that in the future, cryptocurrency will become mainstream. People will use it in their everyday lives, whether they know they're using it or not. These technologies will connect every app, every financial institution. And our vision is that, in order to do this, we need to achieve two things. We need to achieve regulatory compliance in a new space that's really blue ocean that does have very little regulations, but they're forming right now. And part of that is actively lobbying and being thought leaders and speaking out about this stuff while building our own internal programs. The second part is creating something for the users that can delight people from the consumers to the enterprise, is creating an experience that makes sense. So spending $15 to send $15 doesn't work. &gt;&gt; The vision that we had of pure to pure digital cash with no fees and all that, we have to create that. So that's why I founded and built a blockchain called proton chain where we eliminated gas fees and we allowed for these things to happen. We also recognize that in the future, bank accounts and crypto accounts will become synonymous. And this vision that visa had 60 years ago or so. I guess, because it was in the '60s and '70s, late '60s. &gt;&gt; Yeah. &gt;&gt; That vision for what the charge card became, crypto is going to integrate into banks. But in order for it to do that, we need to have the Reg Tech and the compliance on chain, the identity on chain. This is something that we started with proton, but I don't think that it ends there. I think that my big prediction is over the next few years, every blockchain will have decentralized identity tooling. And so that's our vision, is to build the bridge between the banks and traditional financial networks to blockchain and while we're also building a bank. When I look at Citibank, it's amazing. My wife is from China and she has a Citibank account. And when we go to Hong Kong or she goes to mainland China, or here in Los Angeles or San Francisco or New York, she can just go to any Citibank. And the same thing should be true for crypto. You really should be able to have that global capability. But in the future we may not need the brick and mortars anymore. So that's the vision, purely decentralize the bank of the future. &gt;&gt; You've just said a phrase that I've just heard for the first time and a phrase that I think, has immediate utility, which is Reg Tech. I've never heard this before. Tell us what that means. Obviously, it's about the regulation of technology and building these abstraction layers to integrate with regulatory infrastructure. Where are we? What's the current state of play in Reg Tech? I'm going to say it like it's something I've been using for a decade because it's such a great phrase. &gt;&gt; It rolls right off your tongue. &gt;&gt; Exactly. &gt;&gt; I think that where we're going is that banking and financial services are becoming commodified. And you pick the brands that you want to work with. You want to have an Apple card or you want to have a Bank of America card? Do you want to have a Metal pay card or Coinbase card? People are picking the brands that they want to work with. And in offering all these complex financial services, especially with crypto, there's a lot of compliance stuff happening behind the scenes. And every different geographic area around the world has different requirements for businesses, for individuals, and for what they call VASP, the virtual assets service providers, this is same thing goes for financial custodians, money transmitters, securities, brokers, things like that. We have these licenses. But when it comes to Fintech, there's so much that needs to be done. Even in the US alone, if you want to operate in all 50 states and you're doing money transmission, that's an individual license for every single state we accept for one state that doesn't require it. So it's very difficult and you have to go through all of all these hoops. What's happened is this technology behind the scenes and Fintech, what we're calling Reg Tech or regulation technology, are building the automations and APIs that we can build faster. So instead of spending, maybe- &gt;&gt; So we just say for people who don't have computer science backgrounds, APIs, application programming interface. It's the open standards by which software can communicate with other software. The idea here being that you could have protocols communicating directly with the regulatory layer through these open standards architectures. &gt;&gt; Well, that was perfect. That's exactly right. And essentially these application program interfaces, these APIs that these services sell allow us to move faster. So there's great companies out there. There's blockchain, transaction analytics monitoring and they're really growing. You've got Chain analysis, Elliptic, you've got TLM labs. I'm trying to think of a Cipher Trace. There's so many of them, they're growing. And then you have companies like Unit 21 who are handling information on the backend about the customer. For a small Fintech to build all of this stuff internally, it's like building your own startup. &gt;&gt; Okay. &gt;&gt; So as this Reg Tech grows, we're going to have more and more automations that the innovations are going to happen faster and they're going to happen at the really big level. Because once we can get compliant, you can have larger banks, larger payment processors, and other FIs enter. And that's really the goal. That's what we're seeing. And I think over the next few years, Reg Tech is going to enable crypto to expand into every major financial institution in the world. &gt;&gt; That's such a compelling vision, Marshall, in many ways that mirrors the history of what happened in software development. More generally, when you talk to computer scientists or people who aren't com psi majors, you often hear about these frameworks called services or protocol stacks where you basically are building or stacking up different layers of services that can do different things. So what you're doing is you're effectively making it easier for people to build end-user applications by building a stack on which it can sit, like a foundation so that it's progressively easier to build applications for end-users. We've seen this in Web 2.0 with all of these services and protocol stacks and frameworks that makes software development much easier. What it sounds like you're talking about is building that for the regulatory side as well so that you can effectively have compliant architectures build by small, innovative, creative teams who have interesting ideas about what they want to do, but are not then burden by these excessive, very cost intensive structures that it takes to become a compliant, regulated entity. &gt;&gt; Exactly. Complying with, for example, GDPR banks created whole wings, divisions inside their bank to deal with GDPR certain regulation. Our vision with building proton chain, for example, was that you've got all these different assets. &gt;&gt; This is the European privacy standard, general data protection regulations in the EU, it's the standard that all websites have to be able to comply with. &gt;&gt; Yeah. And that's also coming to the US too, California enacted the CCPA, the California Consumer Protection Act. And it's hard to comply with all of these things. One of the things that we also noticed was that for example, if you're Fintech and you're integrating DeFi lending for example, you now maybe have to integrate your stack with a theorem. You have to figure out some way to obscure gas costs. Maybe certain assets like Dogecoin are not supported in a DeFi, lending environment. So we built a lending market on the proton blockchain called proton loan. And the idea was that a lot of FIs want to interact with this stuff. It's not only the ragtag, but also all the nodes. And your Robin Hoods running into this problem right now they want to offer me net crypto. What about the nodes? Same thing with PayPal. They want to offer me net crypto. So they bought curve, a custodian who runs the nodes and who handles the custody. So we built a DeFi lending market where we could have multiple cryptos. But then we're also building the ragtag around that. So that's really important because if you have money coming in or going out, or if you're borrowing money, how do you know who you're borrowing from? And we're seeing this now with for example, launching compound Pro and Ave. I forgot the name of it. The Ave, pro offering. It's coming. And I think that the tooling just wasn't built there a few years ago because it wasn't something that we really thought about. But now it's something that we really do need. And also too, one of the things I discovered over time was that one of the biggest problems in crypto is losing keys in securing the crypto, right? &gt;&gt; Right. &gt;&gt; And also the pain of the compliance when your account gets frozen. And they say, send me a selfie or send me a bank statement. Usually those are to protect the user, we're worried that someone is accessing your account that shouldn't be. So we want to make sure it's really you. And so people get hung up on that. If you could just one tap through that selfie verification like an Apple Pay, wouldn't it be great? And that's the vision with some of the stuff we're doing with proton, put the identity on it, give people multiple different types of digital assets and obscure it and make it simpler. Because if you have to do all of this ragtag and you have to run all these nodes and everything yourself, you might as well be a node or a ragtag company, right? &gt;&gt; Yeah, very well said. You talked about the two things that need to happen for this technology to go mainstream. Becoming compliant with the regulation and building products that delight people. Part of it, as you said at the outset, was the challenge with fees. Obviously, transaction fee is extremely high if you're paying $100 to do in a transaction on a theorem that has a $10 transaction. Obviously it doesn't make any sense, that's a huge challenge. And the second point was something that you just alluded to here, which is the UI UX, the user interface, user experience component about this. And I've heard you speak very eloquently about how ultimately wallets and all of the technology that we use to interact right now with digital assets is going to recede into the background and become almost transparent based on the browser in a way that doesn't encumber users to do things that are complex and complicated and otherwise difficult? Give us a little bit of a sense of the current state of play where you think we are today. And user interface and user experience, I've long argued that were incredibly early. And this is going to look like the AOL or even the CompuServe version of what digital assets are going to be in the future. &gt;&gt; Absolutely. &gt;&gt; We are at the AOL CompuServe stage. I, as a kid, I grew up in the 90s with AOL and CompuServe and on those networks. So that was very much a part of my childhood and growing up. And it was great. Wasn't it awesome? And then all of a sudden we realized, wait, this whole keyword thing is basically Netscape Navigator, isn't it? Or Internet Explorer at the time. And then we got out onto the worldwide web and it was kind of like America forgot about AOL. The only places that its still being used were places that you need to dial up access where there were beating other ISPs on price. When you look at where we are today in crypto, it's identical. You've got MetaMask in the browser. It reminds me of AOL keywords. I have to go to this thing. It's not exactly what I want, but it should be in the browser. It should be in the browser. I shouldn't have to have a Chrome plug-in. When I first got into crypto, Chrome was around and one of the first things people would tell you in the early days was don't install any weird applications or Chrome plugins and people will still tell you this, but this was before Tracer, before ledger, before hardware wallets. People would say go offline, put it on a piece of paper, don't install Chrome plugins, and nowadays you have to have the Chrome plugin. You have to have the Chrome plugin. And people say, don't interact with a malicious contract. But as a regular user, what's a malicious contract? You're probably not going to know until you're like, Yeah, that's a malicious contract. All my money's gone. Two things. One, we have to become native in the browser. When I go to log in to a website or make a payment, I use Apple ID. I love that Apple checkout, Apple Pay checkout or the GPA checkout. Great experience. And so we're very UX and UI focused at Metal. You can see when you open our apps like WebAuth.com and Metal Pay, they're really clean UI UX. And something that we did recently though, I'm really proud of is we built an implementation of WebAuth and which is essentially a cryptography signing kit that can be used in the browser and you don't have to leave or have any download. Now what we have with a program we call a web app, we call WebAuth.com, we can do crypto transactions in the browser without a download. And I think that that's really important because that's the key. I don't want to have to move from Safari or Chrome on my mobile device to another device. Or while I'm on my desktop click MetaMask, I want to sign it in the browser with my face and almost every piece of hardware out there has a face ID or a touch ID scanner, bio-metric scanner, and that's great security. Now going a step further, we can attach that to an identity, and we can even create signers that can attest authorization, so want to make a really large withdrawal or want to share your KYC information with a Coinbase or Metal Pay? you can do that and another provider can even verify that adding another level of attestation, so I think to short answer is basically when the web browser starts to interact with crypto natively, and we've seen companies like Brave and Opera doing this, but it is only a matter of time and it is my prediction that you will see Google Chrome and you will see Apple Safari integrate this stuff. I recently talked with Apple and showed them the WebAuth.com web signing and said, Hey look, I made use of your WebAuthn kit. And they said, Wow, never seen anyone do anything cryptocurrency related with that. That's where it's going. So you won't feel it, you really won't feel it, and you won't really even know that you're doing it unless you really want to. And I think that that's probably five years away. &gt;&gt; Yeah, by the way, a little bit of context for the non-comp-sci folks, WebAuthn and is one of these APIs that allows you to basically interact with a protocol stack so that you can do precisely the things we've been talking about here today. &gt;&gt; Yeah, it's a really cool standard that wasn't really used. And basically what you'll see when you use it, if you go to WebAuth.com, you create an account. It uses the key chain on your device, and when you need to sign a transaction, it's no longer saying, hey, let's use wallet connect. Hey, let's open up Trust Wallet or MetaMask. It just says Apple Face ID and signed. That's the experience that I think users are really going to get behind. And also the other thing I'll say too is it has to be rewarding, it has to be good. Metal Pay when it started, started with this vision of proof of process payment and the Metal token as a way for people to earn crypto in a way that they knew. You can't really mine it as an average consumer. For the past three years, Metal has given away essentially metal through the Metal app, and that's transformed a whole generation of crypto users who started in 2017 and said, Oh, crypto is a fad, crypto is not real money. Well, here's some crypto, play with it, trade it, sell it to cash and buy dinner with it if you want. And we used to have a saying it's real if you can eat it. When people feel that it's real enough that they can eat it, it starts to become real and I think it is really getting there because with the advent of NFTs and seeing mainstream companies like Nike and Apple, Microsoft, so many companies doing the blockchain and crypto thing, they're dabbling right now. They're trying to find their footing and figure out what makes sense for them and where can they harness this technology and give them a year or two, and it will start to become really authentic. It may not feel authentic right now. It may feel like they're chasing trends and maybe they are, but they will find their niche. And I know it, I can see it. &gt;&gt; Yeah, I was just chuckling. I think Jack Dorsey the other day I was up on Twitter talking about how he had a mining rig, and he was able to sell some of the bitcoin that he'd mined and buy a taco with it. So that's how you know it's real. Exactly. To see Jack go from just Web2 guy to full-on Web3, I guess we can call him Web3 because he's a pure Bitcoin guy, but I do think that that is going to grow, and after he left Ethereum NFTs appeared on the profile photos. That's a signal that even with Jack out, and now he's going to Square where he's gonna really focus on Bitcoin, Twitter is doubling down on the multi-currency world on Ethereum. So I pretty much can guarantee that you're going to see other chains probably supported it there as well because people aren't going to pay $200 in gas fees per NFT forever. But this was just probably like the first test to see how many people would do it and what would happen. I think that the whole idea, the other funny thing too is this concept of the metaverse. I've watched as Facebook has become a crypto company and a lot of people don't realize this, that Facebook is becoming a crypto company. It is. The metaverse is purely a crypto concepts. It's the idea of virtual world where you can have these avatars, you can interact and there's commerce. And there are financial transactions and a lot of this is based around the idea of some decentralized ledger, it started with SAND and essentially MANA and some other different metaverse crypto place, these who have been around for years. Now, all of a sudden it is taking off and I got the opportunity to sit down with David Marcus at the very beginning of Facebook Libra when they started, and they were just trying to figure it out. I could see that the direction of the company was going into the way of crypto, and even though the Stablecoin stopped because I don't think it was done the right way for what they needed to do. Obviously, it got shut-down by Congress. They're coming back in different ways. Now they're focusing on digital assets, and this concept of the metaverse doesn't have to be this 3D thing. It's actually who you are on the blockchain. That's what I truly believe. You could be just PFPs, it could be 2D personal profile pictures, and that is the metaverse, and our identity is going to start to become connected to these different ledgers in different ways. And I don't think that it's all anonymous, at the same time, I also don't think that you have to be Marshall.Hayner on the blockchain either. &gt;&gt; One of the things when people who are just stringing the space asked me what does this really fundamentally about? I usually reply that, forget all the buzzwords. This is about re-architecting in a decentralized way, the way that the Internet handles value, trust, and identity. &gt;&gt; Absolutely. It's completely reshaping the way that we think about it where we rely in Web 2 on one, facebook.com or gmail.com. And now, our identity, our data is more secure where we can own it on our device and platforms can share value together and can communicate. In the past, everything was what we call the APIs. Everybody had to talk to everybody's private centralized API. In the future, we're talking to ledgers, decentralized data file storage, attestation of KYC, KYB credentials, transfer of money, transfer of NFTs. The NFT thing is really interesting because I think that not a lot of people realize that art is actually just the door opening a crack to what is the future, which will be deeds of estate, legal transactions. NFTs could represent pending payments, for example, on the Visa network, all types of things. &gt;&gt; Give us your view of what NFTs are. I've often actually talked about this as well. How the digital collectable seems like exactly what you just said, the very opening gambit here, literally version 0.0.1. What do you see the potential for NFT as being? And we should save her people who aren't really invested in the technology that heavily what an NFT really is, is ultimately it's a digital asset that has a unique digital fingerprints. So unlike Bitcoin, where anyone Bitcoin is like any other, like $100 bill. An NFT is something that's unique. What do you see some of the most powerful use cases being for NFTs? &gt;&gt; I've always thought that the NFTs are access tokens. Think of it like a digital key. And I think that people got confused about this because they saw art and they said, well, I could just right-click that and copy that. What's the point, do I really own it? But what you have to understand is it's an access key. It is a key to prove ownership. And so in the future, the first iteration of this was something that we could all understand and could reach consumers and people could participate in, which is art and music and the creation of that. But really what it becomes, later on, is an access key. And what I mean by that is it could be a ticket, it could allow you entry into a virtual arena and this is going to take place in the metaverse. It could prove that you own something, not just a piece of art, but like I mentioned, a deed of estate, a legal contract, in the future your car title will be an NFT. That's what this is. And so it's really the providence of ownership of a unique object that's not necessarily fungible in the sense the way that Bitcoin is. But I will say that it's funny because the term non-fungible token might not be exactly accurate. They are now fungible. You can buy and sell them on OpenSea, you can go to protonmint.com, you can buy some NFTs. But the idea, I think originally for the NFT was really this access token, individual proof of ownership. And into the future, these NFTs will be in your wallet and they will represent all types of things. Recently Uniswap change their LP token into NFTs. So you no longer receive an LP token, you get an NFT. It's really cool and it has a little visual show. It shows you what your liquidity pool allocation is or what you put into Uniswap. That's going to continue and I think in the future, when you buy garments, when you buy things like that, your receipt at Lululemon or an Apple Store, it's going to be an NFT. And that can be gamified into the future, into loyalty points, programs, rewards, credit cards, all types of things. And this is really what Metal as a company is banking on. No pun intended. Or maybe so that's really where we think this is going to go. It's going to be just ubiquitous. You're going to want to collect these NFTs and you can see it now because I would say over the past week, I have just seen the explosion on Twitter from large brands announcing their NFTs from Budweiser, etc. This is really going to grow. And the first part is just what we're seeing now is testing the waters. Would you like a Budweiser NFT? What would you do with it? I don't know. We'll figure that out later, but pretty soon, you'll probably find there will be value for it. There will be value in these networks. So that's where it's going. And what I mean by you don't know that you're using it, you really won't know that you're using it. And right now everybody has.eth in their profile or.xpr. In the future that's going to become even more streamlined and just simple. You won't know that you're using it at all. &gt;&gt; One of the other interesting things that I find about NFTs is this the ability to create these novel economic relationships that we've never been able to do before. This traditional story about the starving artist like someone like Vincent van Gogh, who painted and never actually sold a painting for very much money. And then after his death, obviously they're worth hundreds of millions of dollars. The idea that an artist can sell their art and then five years later when it becomes incredibly valuable, they can then retain a residual economic interest in the piece of art that they created when they were starving artist and own it in perpetuity. Another example of this, you mentioned the digital ticketing scenario. I think this one is a fascinating one as well because the idea of scalping suddenly disappears if the team or the venue can retain a residual economic ownership every time that ticket changes hands, you can structure those contracts in such a way that those people retain that economic interests. So if it sells five times, the team gets five different percentages of that taken. And if it goes up in value, they can realize those gains. That's a really fascinating idea and something we've never been able to do before because the technology never existed. &gt;&gt; It's incredible. And I want to give a little short story of what I've seen how the NFTs space is grown. As ethereum grew, those transaction fees got expensive. So you're smaller artists that wants to charge $50 for a painting is now priced out. They have to sell for at least $200 to break even. So then other L1s emerged like Polygon and Tezos building NFTs , there's still a fee. It's still difficult and so when we built NFTs on Proton, we did something different where we set the base pricing in dollars instead of units of Proton. So first-time users can get more comfortable with something that's more familiar. So we set the base pricing and something that's more familiar, which is dollars. And we eliminated the gas fees. And what ended up happening was we saw users come over to mint NFTs on Proton. And I've gotten so many messages over the past year of people who said, thank you for building this because I was a small artist. I really wanted to get into NFT, but I was always priced out. And then I came here and I started selling NFTs for $50. I get the full $50. I can have the recurring revenue in perpetuity and then also a community, the community in crypto, not just in Proton, but all these other communities are supporting each other. That's really powerful. I think one of the most powerful elements of cryptocurrency, I've said this many times is community. People coming together and having this shared vision. And that's really what's driven Metal as a company in the Proton blockchain. That shared vision is when you look at Dogecoin, you can see how basically a community can create more than what was traditionally there just a blockchain network that's purely focused on technology. Community can sponsor a well in Africa, can send Josh Wise to NASCAR with Kabosu Dogecoin on his hood and can cause more awareness for crypto than any crypto has ever caused before, just through community. And so I think that is just incredibly powerful. And NFTs have allowed people to create real community and form real bonds. And I'll take one example, one artist on Proton, he goes by the name Hunter Axis created a series of NFTs called Crypto Phoenix, which is like this cartoon bird. And it is created a real community. Each one of these birds is usually about a story of someone inside of the community, their personal story. And it becomes this NFT. And it's become 25% of all the volume on Proton NFTs. And it's really interesting because people are telling me, I'm getting involved in this and making NFTs, I got involved with this kryptonics group and then I started making my own NFTs. And now this is my part-time job or this is my full-time job. I'm really excited to see crypto, especially through play to earn NFTs and different economic incentives start to find work in this new space. One of the things I frequently say the real advent of crypto is when we stop working for money and money starts working for us because we're always trying to build more wealth throughout our life. But many people never really get to that point where the money can start working for them. We're always chasing it. And so I think that that's why DeFi has become so popular and why NFTs are really growing because it gives people that economic opportunity. And there's community there. That community is maybe not there on Facebook. Maybe Facebook divides us but Proton Mint and OpenSea can pull us together. I also want to say too that the concept of blockchains destroying the environment, that's really something I think the mainstream, especially the gaming community is latching onto. That's a false narrative because early on and you do have this PoW or proof of work networks that do consume a lot of energy. But you have networks now like Proton and Tezos and multiple other networks that are proof-of-stake Cosmos, for example, that are low-energy consumption, where you can mint NFTs, where you can do transactions. So that narrative is going to change pretty soon too, I think. But it's just a matter of time. We're still very early, as you said. &gt;&gt; Also, I think some of the resistance in the gaming community around the proof of work aspect of it, it's just there's just a frustration with NFT because it's perceived as being another component of this play to win aspect of gaming where people feel that games have become incredibly extractive. &gt;&gt; And I think that was the way the gaming industry was going, was the \"play to win\", and so the emergence of things like Axi with \"play to earn\", I think there's a pushback because developers are nervous about something that might make the gaming industry look bad or wastefully spending energy consumption, and stuff like that. But I think at the end of the day, there's a real potential here. I read an article the other night about how NFTs are being front-run, and there's lots of scamming, and issues, those will be resolved with digital identity, I strongly believe that. &gt;&gt; You're talking about the ability to, for example, monitor things like wash training where people are selling the NFT bags themselves, running it up in value, and then dumping it on the open market. &gt;&gt; I won't call out any names, probably everyone who's watching this knows the other competitor, often see them talking about the incentivises this, but that's one of those ragtag compliant things that's probably going to go away over time, wash trading is not okay, and so that's going to go away. But also the ability to have that Twitter style blue checkmark on your name as an artist, and this is already available on Proton, this is already happening, this is one of the reasons it's really taking off with NFT community, but being able to see that checkmark like Twitter, it's really valuable because there's so many fakes and so many copies of artwork, and it's very easy for someone to see an NFT, and say, \"Oh wow, that's 90% off.\" And it's just a clone. So having that identity is going to be really powerful in the future as an artist where you can say, \"Come to my page, I'm Banksy,\" with the checkmark. &gt;&gt; It's so interesting because the blue check-marks obviously get marked a lot for political reasons than other causes, but if I send someone a message on Twitter with an account that's verified, no one says to me, \"Hey, is that really you, how do I know this is really you?\" &gt;&gt; Exactly. You never really question that, and I think that, we've also seen with Twitter, some of these accounts get hacked. We've seen that happen, and that's the fault of Web2. In Web3, yes, you could still get hacked, but as we build better systems like in Proton, where we can have different levels of key permission, you could even lose your key, and a company could reset your private key for you, how crazy is that? But that's coming, and that's being built on Proton. [OVERLAPPING] &gt;&gt; The power of these things no longer being inside corporate entities, but open-source, peer-review, built on code libraries that have been verified and validated, and security checked for years. This is something that really is a revolution, and I'm not sure that the mainstream people who are involved in software development understand just how big a change that could be. &gt;&gt; Exactly, imagine in the future, all of your banking, your information, all of your points, your NFTs, your identity, your Meta identity is portable, and it goes with you wherever you want. You want to switch to this bank. It is literally the tap of one button. You're no longer having to go into the branch, [LAUGHTER] sign all these documents, do a card signature, no, that's gone. The idea of even the signature on a piece of paper could identify me Is completely wrong in 2022. We need biometrics with your face attested with licensed entities that can contest that information on chain. So in the future, all this stuff is going to move really quick, and if you want to go sign up somewhere, you just tap a button, and all of your information is there, and you can see too, our President, Biden recently spoke out about portability in banking, that's totally coming, and I think this is why you see a lot of banks latching onto. At first there was a nervousness, and a pushback, we don't like crypto, that's because it could change a lot of the business models, and now you see crypto banks emerging. My another big prediction this year is the year of crypto bank stable coins, and ragtag crypto regulation, it's really happening this year. &gt;&gt; I've also heard you compare this to like certification authorities, SSL, TSL, the ability to have, when you go up to your bank's website, you can click on the certificate, and see that it's valid. This is the idea that you could have these authorities with verification that can be done through the properties of math and physics. &gt;&gt; Exactly. You should be able to, in the same way that when you go to a website, you look for that SSL, that little lock that I see in my window right now while we're using this conferencing software, you want that with your identity. Before you ever enter your credit card online, what they've been saying for the past 25 years, almost 30 years, don't enter your credit card online unless you see the green bar, the check mark. Same thing could be said for going back to the MetaMask tobacco, how do you know what smart contracts you connect to, how do you know what you're interacting with has that checkmark? And so that was something that we're building on Proton again with the PNS, the Proton Naming Service is that, when I go to interact with the smart contract or an app, I want to see coinbase.com checkmark, I want to see metalpay.com checkmark or a pple.com. And if that checkmark is there, it should really be like red alert, there's something wrong, this entity is not verified, and you shouldn't interact with it. It would be just like opening up any random application on your phone or your computer, it's dangerous. So I think in the future all this stuff is going to become, we're going from the AOL MetaMask days to this rough transition time where there's a lot of different networks competing for the market. And then I'd say in about five years, it's going to be really established, the players are going to be really established, and when it comes to interacting with DeFi, it's going to be a few taps away, and you will never interact with anything unless it has that checkmark. And the stories of people getting hacked are going to start to drop down dramatically. &gt;&gt; By the way, I'm not a developer, so I don't want to get too far over my skis here, but the history of what we're talking about is fascinating. This wasn't something that just got created by one company, it didn't get built in a day or a month or a year. There's this history of SSL and TLS, and the underlying technologies, PKI, Diffie-Hellman key exchange, it took decades for all of this infrastructure to get built up, implemented, and to become effectively really seamless for the end-user to know that they were using a valid website. &gt;&gt; Exactly. And going back to the credit card example, the 16 digit BIN or what's known as the bank identification number, which is the raised numbers on your card, that is a concept that goes back to the 60s, beginning of visa, and seers charge cards where that raised lettering is really like a vestigial organ of the payment processing industry, because so many decades ago, before the web, they actually would take a piece of paper, and run it over the card, and the raised letters would come off on this piece of paper, and then somebody would physically take it to the bank, and somebody would process it. Now, if your payment processor, your bank saw you with a photocopier, [LAUGHTER] and putting a credit card on it, they would probably shut off your account or tell you to stop doing that. But that's what we're still doing, essentially it's the equivalent of saying, oh, you want some of my Proton or my Bitcoin, here's my private key, just some out, and put it back in, and please don't take out more than I asked for. And if you did, then I'll go to the bank, and I'll say, I didn't authorize this, and hopefully you're insured, and you get it back. But in the future you'll still have that insurance except for now, what was used to be spent on anti-fraud, and payment processing fees will be returned to the user in benefits, more UX, more features, more rewards, and I'm no longer going to wake up, and have a charge in Kissimmee, Florida, even though I live in Los Angeles, California. That's not going to happen anymore, because I'm going to approve all the charges that I want on my account using that technology, using something like proton, and then those charges can come through with my permission. Ones that do not, either will not go through or are limited in some way. And so I think we didn't have that technology, we didn't have the Diffie-Hellman implementation yet in the 60s, I forgot when that came out was it 70s or 80s, Diffie-Hellman. Flash forward 30 years, more than 30 years, like 50 years, you still don't have that really used in the payment processing industry, crypto is going to enable that. &gt;&gt; I trust this way of exchanging keys, and the technology, and the math behind it is a little bit complex, but the idea is that you're able to basically exchange keys in a trustless format. But you're so right when you talk about how vestigial this industry is, there's so many things that we still have, that are vestiges of decades earlier. If you're wondering, for example, the numbers you're talking about, those ways numbers on a check. One of the reasons why they look so funky that's because there's something called MICR, I think it was Magnetic Ink Character Recognition, they would use magnetic ink and you could scan with magnets, and verify the numbers. I mean, this stuff is just so incredibly antiquated, and yet that's still what the numbers on your check look like today in 2022, If you go to write a check to someone. This idea of just decades, and decades of all of this old technology, the crushing weight, the slowness, the lack of security, all of these things are just so overwhelming the current system. &gt;&gt; Exactly. &gt;&gt; They even tell you your bank will even tell you don't use checks. Avoid using checks because it's dangerous. Your account number and routing number is on that check. And for the right hacker or the wrong institution, that account routing number can pull money right out of your account. So in the future, I think that checks of the future, if that still exists and cards of the future, there's no longer going to be that 16 digit pin, it's just going to be @ashbennington @marshallrainer, and that's it and if I lose that, if that drops out of my pocket, it's no different than me losing a business card. And the same thing with checks and I believe the whole ACH network, Sepah network, Visa, and MasterCard are going to be completely overhauled by cryptography crypto networks and are going to move away. &gt;&gt; Yeah, these are the money transfer systems protocols that exist underneath the hood in the US, we have two initiation we ACH and Fedwire ones, sells net, one settles gross. Again, just what we were talking about, this is just incredibly antiquated architecture for financial services. &gt;&gt; Definitely, it's happening so quickly, and like I said, when that card shows up in the mail that says @ashbennington, we wonder what blockchain is under it. Well, we probably will as crypto guys, but the people in five years, they won't, they will just say, wow, this thing is so much better. It's so much faster. When I push money to my card, I no longer have to pay a 2% or 1% fee to get a same-day transfer, it's instant and I get a reward to do it. That's coming and I bet that financial institutions are going to change. We used to go to one bank for everything. Now you're going to have lots of different apps that are really specialized in those areas; niche banks, niche technologies, and crypto is going to be really the underpinning to all of that and I think that's just incredible. It's what I've bet my career on and what I've been working on for about 10 years and I love it. I think that this is the most world-changing technology I've seen next to AI and biotech. &gt;&gt; Marshall, I've made the same bet. I'm curious one of the things that makes you so interesting in the way that you talk about this is this middle path. Typically you hear crypto skeptics. I'm not sure that there are a lot of them still out there, but I guess they still exist. Who claim bitcoin is going to zero. This is technology that's never going to catch on. Then on the other extreme, you hear people who are incredibly passionate about the space, who say banks are going away in five years, in 10 years, there's not going to be a traditional financial services architecture is just going to be digital assets. It's just going to be blockchain, it's just going to be bitcoin. You have this very interesting middle perspective on this for how banks and the digital asset architecture continue to co-exist. Tell us a little bit about that vision because I think it is so rare to hear someone in this space. &gt;&gt; Yeah, thanks. I think that it's funny because a few years ago people thought it was really crazy, that'll never happen. Banks are never going to allow crypto and I was probably like the loan weird guy saying, every bank is going to have crypto, every company is going to integrate crypto. I think some people believe that, but the bank thing people didn't believe because the early crypto ethos was very anti-bank, was very anti- Central Bank, very anti-bank and yes, there are flaws in the banking system, but we can improve them. My vision was basically that when you look at this really old and antiquated technology like you mentioned, it's about to completely overhaul. When I first got involved in crypto, that was the part that really, I've struggled with. How does it interact with the banks? I realized that it didn't and that was the big opportunity that it could connect everyone because it's not the centralized system. Into the future we, are going to have all these capabilities, but we need the regulation. It wasn't that long ago that there was more than one United States dollar. &gt;&gt; Right. &gt;&gt; Multiple banks had their own versions of what they called Wildcat dollars. It was in the beginning of, before the Federal Reserve. Then the Federal Reserve was established and we have one United States dollar and then I think it was the '60s or '70s we moved off of the silver and the gold I think the '30s, and then silver in the '70s and moved away from precious metals standards. So money is evolving in the same way that crypto is evolving. And then we go back to that where all of a sudden now there's new stable coins, they're being privately issued because the government and regulation couldn't keep up with the innovation of technology. So now the question is coming back to, do we just have one centralized currency like what China is doing with their digital R&amp;B, what they call a CBTC or Central Bank? Digital currency is like a stable coin issued by a sovereign government. That is legal tender. That's really the key distinction. &gt;&gt; Exactly. And then you have governments like Japan that are saying that cryptocurrency is or El Salvador they are saying cryptocurrency is money and they put it into the uniform commercial code. I think what's going to happen is we're going to take, a lot of regulators are going to look at the old way or how we regulated dollars and things like that and start to try to apply them to stable coins. But the tricky part is that they are so different than the predecessor because they are permissionless, they are borderless. So there are so many different things that have to come into place. So we really have to rethink that ragtag and financial services layer. And I think that, that over the next year is really going to evolve and what's happening as that evolves and I think the US is taking the right steps. Basically, we're going to see a renaissance in Silicon Valley and we're already seeing that with crypto. I saw an article, I think it was SF Gate crypto was mentioned five times. The article wasn't even about crypto. It really is eating Fintech and I can tell you, I go every year to an awesome conference in Las Vegas called Money 2020. And I've been going since 2016. It's crazy because when I first showed up to that conference is a really big Fintech conference all banks and payment processors and stuff. And I remember telling one of the founders, you just wait in a few years is going to be all crypto. And I was joking. I didn't think it would actually be all crypto. And last year it was all crypto. It was everything crypto from a giant Bitcoin sign for my walked in to everybody every single FI talking about their blockchain play, their distributed ledger play so this is really big. It's not a passing fad there is a lot of things that are hot air or I think they do get inflated because this market is so hot. But there's real technology here, there's real innovation here and it's a lot like the dot com era. Your pets.com may go away, but your Amazon.com will become life. Everything you shop. I don't even really go to the store anymore, everything's on Amazon. So you think about that blockchain the other day I went to pay for a valley. They said cash only. I said I can't believe that I can't just send you five x us DC instantly. And we don't touch this dirty paper cash, I have to go to an ATM or something like that. So it's going to change and when it does, I think that business will move 100 times faster. And the technology and the innovations things that we couldn't do before are going to be possible. I often say traditional finance had maybe 10 experiments in 100 years. Cryptocurrency has had probably 100 experiments in a day. Crypto really is this autonomous entity that is growing and new chains are emerging and people are voting, which change they subscribe to, which networks they use, and ultimately this will fall into place where it's ubiquitous. Everything is instantaneous and I can't imagine not having Amazon or DoorDash or all of my on-demand things, Netflix. It makes life so much more enjoyable when you think about and I don't think people really think about this, but when your savings is auto compounding interest and you're earning NFT assets from a company that you spend a lot of money with and now it's translating to real-world value, it's just going to explode. And we're just seeing the very tip of this iceberg where companies are saying, ''I want to do an NFT.'' &gt;&gt; And is just the way we live now. Marshall, obviously a fascinating and wide-ranging conversation here today. Key thoughts, final takeaways that you'd like to leave our audience with. &gt;&gt; Yeah. I would say that people always ask me about crypto prices. They always ask me about where's the opportunity in crypto? And my opus, my mission is to empower people through decentralized finance, through cryptocurrency and the blockchain. So people always ask, what should I buy or is the market going to go up or go down? And I want to share with you today the real value of crypto. It is community and knowledge. Join the community, become involved, talk and learn, and soak up that knowledge, learn to become a dev. It's more valuable than any coin that you could ever earn as being a part of that community and having that knowledge. Because with that community and knowledge and that time invested, the return can be incredible. Stop chasing gains and start chasing knowledge and start chasing community. &gt;&gt; Yeah. Very well said Marshall, obviously so much more to talk about only one solution. We're going to have to have you back on Real Vision crypto again. Thank you so much for joining us. &gt;&gt; Thank you Ash, it's my pleasure. Cheers. &gt;&gt; Thanks for watching everyone. &gt;&gt; Welcome to the end of the video. We know that on average, 85% of you who started with Real Vision finish it. That's extraordinary. On Facebook, it would just be 4%. And that's because Real Vision creates the most engaging content in the entire media world. Let us help you grow your business by making video content that really engages your customers. Email us at customvideo@realvision.com.<br/></span></div></div></div></div>"}