{"date": "2021-11-03 10:00:00.349000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}.storyContent .bwuline{text-decoration:underline;text-decoration-color:inherit;}</style><p class=\"bwalignc\">\n<b>Amazon Launches FamilyFlex to Give Front-line Employees Flexibility and Support and to Help Parents Transition Back to the Workplace</b>\n</p><p class=\"bwalignc\">\n<span>Employee program gives parents across the company’s U.S. fulfillment and delivery network greater flexibility and benefits</span>\n</p><p class=\"bwalignc\">\n<span>Under Amazon FamilyFlex, new and existing hourly employees have access to care options, and financial resources for their families</span>\n</p><p>\nToday Amazon (NASDAQ: AMZN) announced the launch of Amazon FamilyFlex, a program that provides new and current employees flexibility and expansive benefits for themselves and their families. Amazon FamilyFlex gives employees, which may differ by business and employment type, the resources to create the right balance between home life and work life, including pregnancy and parental leave, adoption assistance, and in select roles, the ability to swap shifts and create custom schedules. The program is a result of feedback from employees on the most effective ways to provide flexibility and support in managing their work and personal lives.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211103005363/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211103005363/en/</a></p><p>\n“Millions of women have left the workforce as a result of the caregiving crisis created by COVID-19, and women's workforce participation has hit its lowest rate since the 1980s,” said Tami Forman, CEO of Path Forward, a nonprofit dedicated to helping professionals return to the workforce. “Women—and many parents in general—will not be able to return to the workforce and thrive there, without policies like flexible schedules and family support resources. Programs like Amazon FamilyFlex are another step toward meaningful change as employees seek better balance between work and caregiving responsibilities.”\n</p><p>\n“Work-life balance is something that's very important to me. Being able to choose my own schedule allows me to spend time with my daughter,” said Brittany Hartso, an hourly employee at Amazon’s Springfield, Virginia fulfillment center. “A lot of people can't take their kids to school and pick them up as well. I'm able to do that every day and I love it.”\n</p><p>\n<b>Flexible scheduling for employees</b>\n</p><p>\nThrough FamilyFlex, Amazon offers employees in select roles a variety of ways to choose and change their schedule, whether they prefer keeping the same, reliable schedule week-after-week, or swapping shifts at the last minute to accommodate family duties. Some of the options, which can differ based on an individual’s role, include:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<span class=\"bwuline\">Swap shifts ahead of time or at the last minute:</span><b> </b>Employees shared that they want the flexibility to manage life events by switching shifts rather than using time off. Eligible employees can now swap shifts easily using Amazon’s internal mobile app or desktop site. With just a few clicks, employees can swap shifts with a co-worker or exchange a current shift for a future one that they have scheduled for themselves, letting them easily choose to work a different day that week. The program is currently available to nearly 500,000 employees in Amazon’s fulfillment and delivery network across the U.S. with more expansion on the horizon.\n</li>\n<li>\n<span class=\"bwuline\">Create your own schedule with “Anytime Shifts”:</span><b> </b>Anytime Shifts is a flexible option that gives employees in select roles the opportunity to pick the time and type of shift that works best for them. Employees who opt for this type of role can pick up shifts on Amazon’s internal app to create their own preferred schedule. They can also use the app to cancel a shift in as little as 16 hours before the shift begins. The company currently has over 23,000 open roles that qualify for Anytime Shifts across its U.S. operations network, and more than 100,000 employees have utilized the benefit.\n</li>\n</ul><p>\n<b>Flexible pay options</b>\n</p><p>\nEmployees have shared there are times when they would like the option to access their earnings without waiting for payday. With “Anytime Pay,” a free, fast pay program, select U.S. employees can transfer the majority of their earnings since their last paycheck to a paycard. The card can be used anywhere that Visa is accepted, like neighborhood grocery stores, and employees can also withdraw cash at participating ATMs and transfer money from their paycard to a regular bank account—all at no cost. The company has tens of thousands of open roles that qualify for Anytime Pay across its U.S. operations network, and more than 150,000 current employees have access to the benefit.\n</p><p>\n<b>Supporting families with care options and resources</b>\n</p><p>\nEmployees have said that they appreciate support throughout all stages of their lives. All U.S. regular full-time employees receive comprehensive benefits, including health, vision, and dental insurance; a 401(k) plan with company match; and free mental health resources and support. Benefits can vary by location, the number of regularly scheduled hours worked, length of employment, and job status, such as seasonal or temporary employment. For employees who have or are planning to have a family, Amazon FamilyFlex offers access to:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<span class=\"bwuline\">Pregnancy and parental leave:</span> Amazon offers a range of fully paid pregnancy and leave options for eligible new parents, including up to 20 weeks of paid pregnancy and parental leave for birthing parents. The company also has an industry-unique “Leave Share” option and a flexible return-to-work program known as “Ramp Back.” The Leave Share program gives new parents the option to give up to six weeks of paid parental leave to a spouse or partner who isn’t eligible for parental leave from their employer. The Ramp Back program offers parents eight consecutive weeks of flexibility and partial work hours after the birth or adoption of a child as they readjust to work schedules as new parents.\n</li>\n</ul><ul class=\"bulleted-list arrowlist\">\n<li>\n<span class=\"bwuline\">Child care, elder care, and referral services:</span> Employees have free access to a network of more than 2 million caregivers, including nannies, babysitters, and special-needs caretakers. Amazon provides free access to UrbanSitter, Sittercity, and Years Ahead, which connect employees to child, elder, and pet care providers. Amazon pays for the memberships to find care, while employees pay for care services. Amazon employees can also receive preferred enrollment for full-service care at Bright Horizons child care centers with waived registration fees up to $250, tuition discounts for full-service care at participating non-Bright Horizons network partner centers, and discounted tutoring and test prep services for students.\n</li>\n<li>\n<span class=\"bwuline\">Rethink:</span> Employees have access to a variety of free resources for parents of children with autism, ADHD, and other developmental disabilities. This benefit includes ongoing remote consultations with a dedicated behavior expert to answer specific questions and other resources to assist children with skills like socialization, self-help, and academics. Rethink also offers free consultations, training videos, and a library of online resources to help support children of employees.\n</li>\n</ul><ul class=\"bulleted-list arrowlist\">\n<li>\n<span class=\"bwuline\">Mental health resources:</span> Resources for Living, a free single place to start for personalized, convenient, and confidential mental health and daily life support, is available 24/7 to all employees, their families, and anyone in their household. Free one-on-one counseling sessions—three sessions per person, per topic—are included and can be used by anyone in the employee’s household.\n</li>\n<li>\n<span class=\"bwuline\">Adoption Assistance:</span><b> </b>The company offers up to six weeks of paid leave for parents who adopt. Amazon also reimburses employees for qualified expenses such as adoption and attorney fees, court costs, and travel, up to $5,000 per child.\n</li>\n</ul><p>\n“The pandemic has put a spotlight on, and even exacerbated, the challenges faced by families who care for young children,” said Alicia Boler Davis, Senior Vice President of Global Customer Fulfillment at Amazon. “Giving employees ways to balance work and home commitments is important to us, which is why we go beyond providing an average starting wage of $18 per hour and comprehensive benefits, and also offer a variety of opportunities with flexible scheduling options to ensure each employee can do what works best for them.”\n</p><p>\nTo learn more about Amazon’s FamilyFlex, visit: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Foperations%2Famazon-familyflex-helps-bring-more-parents-back-to-the-workplace&amp;esheet=52520724&amp;newsitemid=20211103005363&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Foperations%2Famazon-familyflex-helps-bring-more-parents-back-to-the-workplace&amp;index=1&amp;md5=46b2a95679d8f87e4b025171355e30fe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.aboutamazon.com/news/operations/amazon-familyflex-helps-bring-more-parents-back-to-the-workplace</a>.\n</p><p>\nAmazon continues to provide opportunities for full-time and part-time jobs in logistics as it expands its footprint to better serve customers in communities where they live. Roles in fulfillment and transportation offer an average starting wage of more than $18 per hour—and up to $22.50 per hour in some locations. The company also provides full-time employees with comprehensive benefits from day one, worth an additional $3.50 per hour. Interested candidates can visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fapply&amp;esheet=52520724&amp;newsitemid=20211103005363&amp;lan=en-US&amp;anchor=http%3A%2F%2Fwww.amazon.com%2Fapply&amp;index=2&amp;md5=c6536c47d59bd1442225053902da6ee8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.amazon.com/apply</a> to learn more and apply.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211103005363r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTAzMDA1MzYzcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=2eee6c8fbe7226cca9aee5bb539649f75301cb517cc365c264da47cea0fff2360fb817bc3775ae071f212369175d89c9506dcef9d9f24644ba8474b613e6d8dc\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211103005363/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211103005363/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52520724&amp;newsitemid=20211103005363&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=3&amp;md5=d5c2d274797e70323f30f45b85a81183\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON</p></div>"}