{"date": "2022-01-05 10:54:27.037000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p> <br/>   By Ujjwal Narayan<br/>NewsRise<br/>   NEW DELHI (Jan 5) -- The Delhi High Court today refused to restrain the Enforcement Directorate after the local unit of Amazon challenged the federal financial-crime probe agency’s investigation into the U.S. e-commerce major’s 2019 investment in Future Group.<br/><br/>The court adjourned next hearing in the case to Jan. 12, said one of the lawyers representing Future Group. <br/><br/>Amazon Wholesale India, a unit of the U.S. e-commerce firm, had last month filed a petition with the Delhi High Court, challenging ED’s jurisdiction to investigate matters beyond the scope of Foreign Exchange Management Act. <br/><br/>The plea sought reprieve for Amazon India after ED summoned its employees to quiz them on matters pertaining to a dispute between Amazon NV, the holding company, and Future Group. The court deferred the hearing after the counsel for ED gave an oral assurance that it will not insist on physical appearance in view of the rising Covid cases. “Hold your hands in not calling them (Amazon staff),\" the judge told the counsel for ED.<br/><br/>The two companies fell out after debt-laden Future Group agreed to sell its retail, wholesale, warehousing, and logistics businesses in August 2020 to billionaire Mukesh Ambani’s Reliance Industries in a $3.4 billion deal. The deal with Reliance is crucial to Future Group, which is on the brink of liquidation. Future Group’s sell out to Reliance threatens the U.S. company’s dominance in India.<br/><br/>Amazon tried to block the deal by getting a freeze order from Singapore arbitration court.  <br/><br/>Last month, the Competition Commission of India kept its approval for the 2019 deal between Amazon and Future Group on hold, accusing the U.S. company of hiding information while seeking regulatory approval.<br/><br/>The Delhi High Court yesterday dismissed Future Group’s plea seeking directions to terminate ongoing arbitration proceedings at Singapore court. A hearing of an appeal against the order is still underway.<br/>   - By Ujjwal Narayan; Ujjwal.Narayan@newsrise.org; 01166767700<br/>- Edited by Dhanya Ann Thoppil<br/>- Send Feedback to feedback@NewsRise.org<br/>- Copyright (c) 2022 NewsRise Financial Research &amp; Information Services Pvt. Ltd.<br/>    </p></div>"}