{"date": "2021-11-30 15:40:48.843000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Newly Designed Tests Are Now Ready for the Launch Into the Retail Marketplace and is Ready to Start the Sales to the Online Companies Approved as Stated in the 8K Filing 08/03/2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>GLOBAL WHOLEHEALTH PARTNERS CORP (\"GWHP-0\")\n- Newly Designed Tests Are Now Ready for the Launch Into the\n- Retail Marketplace and is Ready to Start the Sales to the\n- Online Companies Approved as Stated in the 8K Filing 08/03/2021\n\n     Global is planning on selling the Pregnancy, Ovulation, Drug Tests,\nGlucose, and Colorectal Cancer Tests to start the retail marketing. Global\nknows that it only gets one chance to show well, so it has spent several\nweeks with graphic artists and marketing designers to make sure Global's\nfirst impression is amazing.\n\n     In September 2020, Walmart.com had 385.5 million visits, up from 294.5\nmillion visits in February 2020. This jump in website traffic is due to the\nglobal coronavirus epidemic, which has caused millions of people to stay at\nhome and not visit stores in order to avoid infection.\n\n     Web visitor traffic to Walmart.com 2020 | Statista\n\n     Walmart will invest about $14 billion in 2021 on things like supply\nchain and automation, up from the $10.3 billion it spent on capital\nexpenditures in the year that just ended.\n\n     Walmart Inc.'s online sales grew 79% for its fiscal year 2021, which\nended Jan. 29. Its online sales also grew 69% in its Q4, the retail giant\nreported.\n\n     Walmart's online sales grow 79% in its just-ended fiscal year\n(digitalcommerce360.com)\n\n     With 300 million active users, the Amazon Seller Marketplace provides\nGlobal WholeHealth Partners Corporation a potentially massive audience of\nbuyers and substantial visibility for its line of over-the-counter tests,\nincluding pregnancy, ovulation, drug, colorectal cancer, and glucose.\n\n     Amazon receives more than 213 million unique US visitors every month\naccording to a recent article by Tech Jury.\n\n     47 Amazon Statistics Everyone Must Know In 2021 | Techjury\n\n     \"These latest deals (with Walmart online and Amazon Sellers\nMarketplace) could easily become one of our largest points of\ndistribution,\" said Charles Strongo, CEO of Global WholeHealth Partners\nCorp. (OTC: GWHP).\n\n     Global WholeHealth Partners Corp. (OTC: GWHP), through the EMC2\nagreement, is funded for growth, sales, and expansion. Per the terms of the\nEMC2 Purchase Agreement, we may direct EMC2 to purchase up to $100,000,000\nworth of shares of our common stock under our agreement over a 36-month\nperiod, generally in amounts up to 100,000 shares of our common stock,\nwhich may be increased to up to 2,000,000 shares of our common stock\ndepending on the market price of our common stock at the time of sale and\nsubject to a maximum commitment by EMC2 of $500,000 per regular purchase\nper day. The total amount of shares to be sold through the EMC2 agreement\nis up to 8,578,177 shares of common stock.\n\n     Global WholeHealth Partners Corp. (OTC:GWHP) provides cutting edge\ntechnology using In-vitro Diagnostic (IVD) Real-Time PCR Machines for\ndetection of SARS-CoV-2 IgM/IgG antibodies in human serum, plasma, or whole\nblood. It has led the fight against vector borne terminal diseases such as\nEbola, ZIKA, Dengue, Malaria, Influenza and Tuberculosis, Corona Viruses,\nand among other vector borne diseases with an FDA Certificate of\nExportability (2260-11-2019). The company was founded on March 7, 2013, and\nis headquartered in San Clemente, CA.\n\n     GWHP develops, manufactures, and markets in vitro diagnostic (IVD)\ntests for OTC, or consumer-use as well as professional rapid diagnostic\npoint-of-care (POC) test kits for hospitals, physicians' offices, and\nmedical clinics in the US and abroad. Currently, the Company has 70\nproducts FDA approved and many are approved for OTC use, and 29 POC\nproducts approved by the FDA CLIA WAIVED.\n     Call or email about special prices for this announcement on all the\ntests.\n\n     Disclaimer:\n\n     The Company is not making any express or implied claims that its\nproduct has the ability to eliminate, cure or contain the Covid-19 (or\nSARS-2 Coronavirus) at this time.\n\nContact:\n\n     Name: Charles Strongo,\n\n     CEO, Global WholeHealth Partners Corp.\n\n     Email: Sales@gwhpcorp.com Phone for Sales: 877-568-4947\n\n     www.gwhpcorp.com\n\n     Forward-Looking Statements\n\n     This press release contains \"forward-looking statements.\"  Such\nstatements may be preceded by the words \"intends,\" \"may,\" \"will,\" \"plans,\"\n\"expects,\" \"anticipates,\" \"projects,\" \"predicts,\" \"estimates,\" \"aims,\"\n\"believes,\" \"hopes,\" \"potential\" or similar words. Forward-looking\nstatements are not guarantees of future performance, are based on certain\nassumptions and are subject to various known and unknown risks and\nuncertainties, many of which are beyond the Company's control, and cannot\nbe predicted or quantified and consequently, actual results may differ\nmaterially from those expressed or implied by such forward-looking\nstatements. Such risks and uncertainties include, without limitation, risks\nand uncertainties associated with (i) market acceptance of our existing and\nnew products, (ii) negative clinical trial results or lengthy product\ndelays in key markets, (iii) an inability to secure regulatory approvals\nfor the sale of our products, (iv) intense competition in the medical\ndevice industry from much larger, multinational companies, (v) product\nliability claims, (vi) product malfunctions, (vii) our limited\nmanufacturing capabilities and reliance on subcontractors for assistance,\n(viii) insufficient or inadequate reimbursement by governmental and other\nthird party payers for our products, (ix) our efforts to successfully\nobtain and maintain intellectual property protection covering our products,\nwhich may not be successful, (x) legislative or regulatory reform of the\nhealthcare system in both the U.S. and foreign jurisdictions, (xi) our\nreliance on single suppliers for certain product components, (xii) the fact\nthat we will need to raise additional capital to meet our business\nrequirements in the future and that such capital raising may be costly,\ndilutive or difficult to obtain and (xiii) the fact that we conduct\nbusiness in multiple foreign jurisdictions, exposing us to foreign currency\nexchange rate fluctuations, logistical and communications challenges,\nburdens and costs of compliance with foreign laws and political and\neconomic instability in each jurisdiction. More detailed information about\nthe Company and the risk factors that may affect the realization of\nforward-looking statements is set forth in the Company's filings with the\nSecurities and Exchange Commission (SEC), including the Company's Annual\nReport on Form 10-K and its Quarterly Reports on Form 10-Q. Investors and\nsecurity holders are urged to read these documents free of charge on the\nSEC's website at <a href=\"http://www.sec.gov\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.sec.gov</a>. The Company assumes no obligation to\npublicly update or revise its forward-looking statements as a result of new\ninformation, future events or otherwise.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300323.MNPRE2133302193-07155220211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}