{"date": "2021-12-07 14:00:01.511000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3199.0, "close": 3306.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\nPowerRunner and AVEVA Sign Reseller Agreement to Provide Real-Time Situational Awareness with Advanced Metering Infrastructure-Grid Analytics\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.powerrunner.com%2F&amp;esheet=52546350&amp;newsitemid=20211207005675&amp;lan=en-US&amp;anchor=PowerRunner&amp;index=1&amp;md5=b7a6b6b90497b2515f12863244abdd38\" data-type=\"url\" class=\"tr-link\" translate=\"no\">PowerRunner</a>, a leading energy IIoT analytics software provider, and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aveva.com%2F&amp;esheet=52546350&amp;newsitemid=20211207005675&amp;lan=en-US&amp;anchor=AVEVA&amp;index=2&amp;md5=5e6c83471c08637bee94f9525b3ee8ee\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AVEVA</a>, a global leader a global leader in industrial software, driving digital transformation and sustainability, have combined technologies to deliver a proven and scalable operational data solution to provide utilities with real-time situational awareness through Advanced Metering Infrastructure (AMI)-grid analytics.\n</p><p>\nThe agreement allows AVEVA to resell PowerRunner software along with the PI System, providing customers with a proven and scalable operational data management system that operates on millions of sensors, including AMI data, in near real-time. Addressing assets from transmission to behind-the-meter, the PowerRunner on PI System solution provides the utility industry with the granular, temporal, and locational situational awareness needed to support the growing complexities facing utilities.\n</p><p>\nThe PowerRunner solution will extend the value of data and context managed by the PI System for the growing distribution network. PowerRunner’s patent-pending streaming data engine and integrated prediction layer, along with configurable data management and governance, virtually joins operational data from the PI System with other internal and external data sources across the enterprise, providing utilities with real-time visibility, analysis and predictions needed to manage the evolving bidirectional grid. The PowerRunner solution analyzes and predicts the “electron traffic” coordination needed to integrate the ever-increasing number of distribution system assets, thereby supporting global net-zero initiatives by enabling the adoption of renewable distributed energy resources.\n</p><p>\nAccording to <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.bloomberg.com%2Fnews%2Farticles%2F2021-01-19%2Fspending-on-global-energy-transition-hits-record-500-billion&amp;esheet=52546350&amp;newsitemid=20211207005675&amp;lan=en-US&amp;anchor=Bloomberg+Energy&amp;index=3&amp;md5=418174cf2dec1734fe15a92acecad411\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Bloomberg Energy</a>, “The world spent a record $501.3 billion in 2020 on renewable power, electric vehicles and other technologies to cut the global energy system’s dependence on fossil fuels.” In the years to come, the electrification and decarbonization of the grid will continue to put operational constraints on a century-old system that was designed to be one-directional. The powerful combination of PI System and PowerRunner’s solution gives customers a scalable data infrastructure and energy IIoT solution that ingests, joins and operates on data from millions of sensors across the grid to provide utilities with the actional information needed to safely and reliably operate the grid.\n</p><p>\n“The PI System has been the leading time-series data infrastructure for utility operations and many other industrial verticals for over 40 years,” said Jason Iacobucci, PowerRunner President. “We are excited about the opportunity to work with an industry leader such as AVEVA and even more excited about our role in enabling the safe and reliable transition to the<sup> </sup>twenty-first-century distribution grid. We view this partnership as transformative both in terms of PowerRunner’s trajectory and the role that PowerRunner and AVEVA will play in enabling global decarbonization.”\n</p><p>\n“The PowerRunner on PI System solution will further extend the value of PI System data for our clients,” said Rónán de Hooge, EVP of Information at AVEVA. “Global decarbonization initiatives have spurred investments in new technologies that are changing the way in which energy is created and consumed and enabling our utility clients to ensure the safe and reliable operation of the grid.”\n</p><p>\nThe PowerRunner and AVEVA Reseller Agreement provides utilities with a PI System-based solution that supports the complex and evolving requirements of the bi-directional distribution grid with a scalable data infrastructure that can be configured and re-configured by subject matter experts to meet the rapidly changing business requirements of an industry in transition.\n</p><p>\n<b>About PowerRunner</b>\n</p><p>\nPowerRunner, a leading energy IIoT analytics software provider, provides innovative, scalable and extendable solutions that extract business value from disparate Operational Technology and Information Technology data sources. Our system of systems platform joins data from disparate utilities systems such as, SCADA, OMS, GIS and CIS with data from the growing number of downstream IoT sensors, such as AMI and behind-the-meter sensor data, to create a virtual data layer. PowerRunner is headquartered in Brentwood, New Hampshire delivering software products and consulting solutions since 2007 that help to analyze key levers of revenue and cost streams to drive operational efficiency and revenue optimization.\n</p><p>\n<b>About AVEVA</b>\n</p><p>\nAVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence. AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.aveva.com%2F&amp;esheet=52546350&amp;newsitemid=20211207005675&amp;lan=en-US&amp;anchor=www.aveva.com&amp;index=4&amp;md5=4aae4d0adb3998cff7100b871d392b9e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211207005675r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjA3MDA1Njc1cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=f17b22b4a30f0da7e9877b2d62954ac51298c217380f9816480c5b9c9c851b6c1db093cfbd01e3b11c188673ccdfea69f07d9797a9de903f4bac31fb8a9da63c\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211207005675/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211207005675/en/</a></span></p><p>\nMedia Contact:\n<br/>Dan Garvey\n<br/>Director, Sales &amp; Marketing\n<br/>E: <a href=\"mailto:dan.garvey@powerrunner.com\" data-type=\"email\" translate=\"no\">dan.garvey@powerrunner.com</a><br/>P:401-339-0374\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NH-POWERRUNNER</p></div>"}