{"date": "2021-11-08 14:45:00.283000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>GTOR Growth is Explosive; Over 120 Events This Year Alone, 29,899 Registered Players, 14,175 Discord Users, and 127,531 Twitch Unique Viewers</strong></p><p>THOMASVILLE, GA, Nov.  08, 2021  (GLOBE NEWSWIRE) -- via<a href=\"https://www.globenewswire.com/Tracker?data=eNh0jh_XAcTfoaQFMHgS8xtut8m_f-vBpsmCpV-ywIRAzp95g0QMyeSoy5P5aBi_6EL7emrQCywqwYYVifHaGA==\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> NewMediaWire</a> – GGTOOR, Inc., (OTCMKTS:GTOR) (“GGTOOR, Inc.,”, “GTOR”, or the “Company”), an emerging leader in the eSports markets, announces this month, the Company is expanding the roster of Tournament Organizers we work with to bring on new key personnel for certain games we have run before, such as Magic: The Gathering Arena, Super Smash Brothers Ultimate, and others, with the goal of expanding awareness of our events with larger segments of the Communities for these games. We drew a combined total of 800 player registrations and crowned winners in four different tournaments this weekend!</p><p>With over a dozen more events planned in November, we expect our tournament division will continue to post impressive numbers monthly - and, having just added a new salesperson to our team, those metrics should help him hit the ground running as we move to expand the Company's revenue base. This weekend's Yu-Gi-Oh! Duel Links event drew nearly 400 registrations and brought countless memorable moments with nonstop action throughout the day! When the dust settled, a sizable number of the Top 64 decks seemed to fall in line with expectations of the current meta, with Harpies being well represented, along with Melodious, Magnets, Water Xyz, Yosenju, Gaia, and the winner of the last GGToor x DLE: Destiny HERO. </p><p>Some rogue decks also made it into the Top Cut! The stream and viewers alike rooted for a defeat of the infamous Darklords archetype, but that was not enough to stop the deck from making it into the Top 16. Blue-Eyes, another deck that was extremely strong in prior metas, climbed to Top 4 before being defeated. D/D/D, the new deck that were optimistic but had no results in our last event, had a respectable showing and made it into the Top 8. In the end, Mihawk won it all with Destiny HERO, setting a new record as it became the first deck to win two GGToor x DLE tournaments in a row!</p><p>Also, at this weekend's Minion Masters Knights Duel tournament we saw both Coax the Diplomancer and Hypnotise banned, causing some players to rethink their strategies coming into the event. One of the most memorable events in the early rounds was when we saw Lazur get just what he needed from Apep's Perk 3 - a free Ghost that did work against Nataraja’s Fanriel Mordar build! Throughout the event, SeT dominated with R3-KT, which caused a vast majority of players to ban the master. With R3-KT taken off the table, SeT began to dominate with his Diona + Brother of the Burning Fist deck, playing it frequently throughout the event. </p><p>Much like Lazur, lady luck smiled upon SeT’s Apep in the Winner's bracket finals as well, with Perk 3 giving him a Chisma Boomstick, absolutely demolishing DeathShoott’s tiny King Puff build. Undeterred, DeathShoott came back and secured his spot in the Grand Final when his Rock Rivals Volco deck proved to be a perfect counter to SeT’s Morellia / Wrekinator deck. In the Redemption Bracket Final, SeT bested Lazur and force a rematch against DeathShoott in the Grand Finals. SeT was able to score wins with his Diona and Apep decks, but fell short against Deathshoot, unable to find a third deck able to take a win and close out the match in the Best-of-5 Grand finals. Congrats to Deathshoott, adding another GGToor championship to his resume!</p><p>In the beginning, before Covid, our company was getting ready to find a place to build the Sport Venues dream that John Whitman, our CEO envisioned. A complex of different venues to accommodate the ever-growing youth sports craze in the US and the world. A place where sports leagues can travel and compete in a safe place. In this place, you were going to find Baseball, Basketball, Soccer, Volleyball, and many popular sports venues along with hotels and entertainment.</p><p>But as you all know the world changed in an instant, no more in-person anything, no games, and no gatherings of any kind. Then, in a stroke of genius, John called and asked me what I thought of eSports and I replied, “great idea is perfect” and went on to explain his vision. Shadow Gaming was launched officially in April 2020 since then we have built a virtual platform for event competitions. With a small crew and a lot of passion, we went along with John’s new direction carving a niche in the eSports industry. We jumped with both feet, always believing this was the right move. Management has spent a lot of time learning and creating the plan that will take the Company to the next level.</p><p>Now that we are close to the end of 2021, we have had tremendous growth in the last year and a half. I can say all the arduous work and sacrifice is paying off. With over 120 events this year alone, 29,899 registered players, 14,175 Discord users, and 127,531 Twitch unique viewers. You can buy GGToor merchandise, earn credits, be a Tournament Organizer and participate in our events all from one place. In 2022 we are looking to expand to in-person venues, our cryptocurrency “GGcoin” and grow our business by increasing our events, participant registrations thus growing our database. </p><p><b>GGToor Portal and what it does</b></p><p>GGToor, portal was planned to offer gamers a complete platform with all necessary tools to compete, enjoy, and make it the preferred platform to meet and play with more people around the world.</p><p> What the Company’s GGToor Portal offers:</p><p><b> GAMERS</b></p><p>Profile Creation: They can provide very basic information enough to us to keep a reliable communication, and include an avatar as the main image, and also show themselves to the world with their gamer’s name (fantasy name), or they can fill this up too with very extensive information that allows them to share all social media and other gaming platforms as well. The profile allows the user to manage all types of communications with GGToor, like newsletters, alerts, or promotions. Cancel, or sleep their account, and their very own digital wallet, where they keep an accounting of their earned credits, and receipts of purchases.</p><p>Login and Data: All access is secured, and protected against hacking, using hash encryption with more than 20 characters that vary on the dependency of many internal options.</p><p>Logged in: When a user connects with us, new pages appear exclusively for him, like “Win Credits.” This special page allows the user to COPY and PASTE a personalized code, that he can share on social media, websites, or as a simple link, creating a referral promotion generating awards in credits automatically earned into his digital wallet.</p><p>Home page: Offers a very quick display of all upcoming tournaments, feature games, images of the last event’s winners, our very last video, short news about the industry, and links to all our social media. Plus, when the user is registered for a tournament, the home page alerts the player about the event.</p><p>Tournaments Page: Here, the user can find all the tournaments to register or to follow up the progress, including all passed tournaments, where the entire data about rules, times, and winners still forever as a recap and affidavit of our accomplished work.</p><p>Each tournament has an exclusive page with automatic meta-data generated by itself, which helps to propagate the page organically around the web for easy to be discovered by any search engine. Also, we provide the entire information about the event, like date, rules, schedule, brackets, and structure of the event, and registration form. Time-zone with an interactive tool, where the user easily can switch hours from the event to his personal time-zone. And participants, where not only do we show avatar, name, and country of the player, we also show the stats of the player during the event, and the lifetime stats for this specific game inside our GGToor planet.</p><p>On this page, same as the home page, when the user was registered for the tournament, here all alerts about the event will appear, including the “ARENA.”</p><p><b>But what is ARENA?</b></p><p>Is the page where the user accesses the tournament’s day. Here the player has a chat tool one-one with the Tournament Organizer, and all the information about where, and who is the opponent in each match during the event. If he is playing inside a team, the chat communication is expanded over the entire team.</p><p>Our site, built with a very responsive frame, capable of adapting its form to any possible device, offers very easy and classic navigation for other many inside pages like “Games”, where users can find the preferred game just by name, and explore all the tournaments available or passed in our GGToor history.</p><p>“Join”, here we offer preferable package plans for tournaments that require payment for registration and win cash money. “GGworld,” here we show the best players of the year, awards, and you can find all players inside our network, and check their stats in all games. Also, you can select which of them are favorites for you, and it's easy to find them at any time!</p><p>“Shop,” of course, our amazing GGstore, full of amazing products like hats, caps, hoodies, shirts, bags, blankets, towels, all with our brand, and the system offers to users and visitors to buy products using money or credits from their digital wallets, or credit cards.</p><p>And informative pages like about us, Contact us, Terms of use, Private Policy, ECOC, and much more. As well, GGToor previewing the good worldwide acceptance, already offers 2 languages, English, and Spanish, and the platform strategically manages individual pages with all the scripts, where very fast we can provide a translation to any language.</p><p><b>TOURNAMENT ORGANIZERS</b></p><p>One of the tabs is a link to “Organizers”, a magnificent sub-world inside the main site. This is a very exclusive area, only allowed for the administrators, and creators of the events. The platform allows the organizer to manage his profile, not for public exhibition, but extremely important for GGToor for reliable communication and certification about the integrity and quality of the administrator.</p><p>The organizer can check their old events, and control or make new ones.</p><p>Each Event module, as an independent element, gets the organizers all necessary tools for the tournament. Initially, he must create the event, then, he can select the game from a vast list of games, name the event, date, how many players, time, format, write down the rules, details, schedule, contact, etc.</p><p>One of the tabs, called \"Banner\", will provide a generic banner for promotions and a banner creation tool just in case you want to create your own banner style, or just load your banner created from another software like photoshop.</p><p>The registration time and expiration could be adjusted manually or automatically, so the system will assist you at closing times.</p><p>The Structure tab allows you to create tournaments with all quantity of stages you want and mix all types of systems like “Swiss System,” “Single Elimination,” “Double Elimination,” “Bracket Groups”, and others. As well the structure makes easy the way to auto-seed all players before starting the tournament, or simply you can manually seed some strategic players to make more competitive or amusing your event. </p><p>The participant's tab provides to the organizer, a detailed view of the participants, and helps to approve, reject, or communicate with a player or an entire team. The system provides a chat one-one, direct email, and manipulation of all data, names, or avatars of players, and teams, to avoid non-legal, or offensive images to morality, showing around the event.</p><p>The main operation tab helps the organizer to delete the event or duplicate the event to easily make a similar event at any time. As well as a button to “Contact Us” that goes directly to our IT Department and receives assistance over a bug or issue discovered in the “Organizer” area.</p><p>Finally, a tab for “Close the Tournament,” where at the end of the event, the organizer upload or create a memorial banner, and insert the ranking position and names of the winners of the event.</p><p>In the event, after all players were seeded, and time for registration was up, the system opens a window for “tournament Controller.” In this window the organizer sends to ARENA of the players the order to execute a match – The players, after finishing the competition, inside the ARENA fill out a report of the match including a screenshot of the results – then the organizer checks the information, and he approves the match results. Here the organizer can mark as forfeit a player, edit a match result, and disqualify a participant for bad behavior or illegal play. All this will be live, updating data, and followed by players, and visitors live from each event page on GGToor.</p><p><b>ADMIN</b></p><p>This part of the platform is located over another area, due to the sensitivity of the power. From here the executives of the company can manage everything with no exceptions. All pages, one by one, including administration of passwords and full data of users, organizers, and administrators as well. Here they have access to all images, numbers, and texts. Power to explore, change, approve or disapprove inside the platform as any of the users or organizers. They can print all reports of sales, from the shop, events, or ads. They can make promotions for the shop, with all types of discounts, or promotional codes. Administrators have direct contact in multiple choices with any of the users, and organizers. Finally, all stats about visitors, registrations, signups around the web will be here ready to print out or save as pdf or excel file.</p><p>Want to participate? Find the plan that best suits you! You can choose between the Bronze Plan, Gold Plan, and Diamond Plan: <a href=\"https://www.globenewswire.com/Tracker?data=-Zl8jBnYXSCqyC6MniPxyyv_11lRlp1wb_0zg7HflSavtUW16w96_oZb6lYhmidMf1W9sc3wsNTZFC-1vkbfsSHK7lc08jdKNZReLixVFyU=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://GGToor.com/join.php</a> .  If you want to bring your team or friends to GGToor.com, or be a Tournament Organizer, we can support you and help you grow; you can reach a worldwide audience of similar-minded individuals that like to compete and have fun! You can be sure that GGToor.com is here to grow with you. Just follow the link to sign up as an organizer <a href=\"https://www.globenewswire.com/Tracker?data=-Zl8jBnYXSCqyC6MniPxy2L32vyZO8hsEg0OC0eNyXkVFngg-y2nDT5npc6GHRU0mAYIhLuUF1kEGOMUKc91eAwBJd60jinNBwggDUHNw9R1h005Bo10eiR6Q33h2zTp0rPwKQldLZQHfCJ-oLKc3w==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://GGToor.com/organizerlogin.php</a> If you have any questions about our events visit our socials; Discord <a href=\"https://www.globenewswire.com/Tracker?data=-Zl8jBnYXSCqyC6MniPxy0xDy9cN3z0lCXWmw-d0BjHdu64OWXPkETYRx3c5EnHnX5xgH_bbkycPOtI7Ly-AwyI5PDaOy75bVPsCgX8OWK0X_3ihtvPmhcYz4ifi0Swd\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://discord.gg/GUhyZxFH8Q</a>, twitter <a href=\"https://www.globenewswire.com/Tracker?data=-Zl8jBnYXSCqyC6MniPxy50eRH8rYhJyuK4hzTNyi4v-D892KgH0avQWg3noEJLN2Xwhg9dmJvXhv5Cku3r8acgUSsaNCAIS3awL4hNUUoU=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/GGToor/</a> , twitch <a href=\"https://www.globenewswire.com/Tracker?data=-Zl8jBnYXSCqyC6MniPxy22rZm09B_j_yJ6QnS76JxtY7yZtXI7Pt7ZN2qiBSFjD05kPCBJyBtNkNPmSbTvDBSIciA_r3PLZjyw8TljDv5c=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.twitch.tv/GGToor</a>, and Facebook <a href=\"https://www.globenewswire.com/Tracker?data=-Zl8jBnYXSCqyC6MniPxy2iuoGof8zuST6nKxDuv9LTFhrfZjTu5NYJR-T_Ijaf5wnujkipgr3KXw6Uq21gxzm348VkQ7mKt8jia1WItDFU46OTiNx6zlmVilBklNOvZuLv3JMUT-mYjDLF-tk8Kzg==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/eShadowGaming</a></p><p>If your organization would like to be part of this growth and work with Shadow Gaming, contact us at <a href=\"https://www.globenewswire.com/Tracker?data=T6aOTIDdWB7Qp89fUxPFUvFlcu_NiQoso8oxQb10TiXJuNczgpi6V3PaPvr3Tc-TinVJqJ2Up48II-H65eVmM75BbT7anPFrCKKR1Rvo5_4=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">luis@shadowgamingtv.com</a></p><p>About GTOR</p><p>GGTOOR, Inc., is a developmental stage company engaged in the business of eSports. The company, through its wholly owned subsidiary, Shadow Gaming, Inc., has aggressively entered the eSports market. Shadow Gaming’s portal GGToor.com is continually being customized and upgraded, with the goal of becoming one of the most comprehensive gaming portals in the world. The Company is now accepting subscriptions from players, gamers, and tournament organizers. To register logon to <a href=\"https://www.globenewswire.com/Tracker?data=-Zl8jBnYXSCqyC6MniPxy-fs85GCJMT6BKYFsyPoEPtcu-pX7Rf4DvXOLroLa6sT2UHnjUkfriZ9iQ6TUfLfT4NFwmI0TyvHLUgIwJiSxBw=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://GGToor.com/home.php</a>. In addition, the company plans to operate a few subsidiary companies from high tech data management businesses to product and support businesses. Finally, the Company is actively looking for locations to build indoor eSports arenas that will host major international gaming tournaments.</p><p>Forward-Looking Statements. This press release may contain “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. We intend all forward-looking statements to be covered by the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements generally can be identified by the fact that they do not relate strictly to historical or current facts and by the use of forward-looking words such as “expect,” “expectation,” “believe,” “anticipate,” “may,” “could,” “intend,” “belief,” “plan,” “estimate,” “target,” “predict,” “likely,” “seek,” “project,” “model,” “ongoing,” “will,” “should,” “forecast,” “outlook” or similar terminology. These statements are based on and reflect our current expectations, estimates, assumptions and/ or projections as well as our perception of historical trends and current conditions, as well as other factors that we believe are appropriate and reasonable under the circumstances. Forward-looking statements are neither predictions nor guarantees of future events, circumstances or performance and are inherently subject to known and unknown risks, uncertainties and assumptions that could cause our actual results to differ materially from those indicated by those statements. There can be no assurance that our expectations, estimates, assumptions and/or projections, including with respect to the future earnings and performance or capital structure of GGTOOR, Inc.</p><p>For Additional Information Contact:<br/>John V Whitman Jr.,<br/><a href=\"https://www.globenewswire.com/Tracker?data=pIRW8MsJkhaTaZhvuXsTByavZV3B03vb_qrQjc-Wz6nvBj5DyCBj3QsQKD_uPkdo_VBvz8k0grjmNS3znfwBCOnlzKn76WaGwmPMjasBFZw=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">John@GGToorcorp.com</a><br/><a href=\"https://www.globenewswire.com/Tracker?data=-Zl8jBnYXSCqyC6MniPxy8hJ_oySyOEANJ5RQjy9_WFETg7At3P6AdWRVObmfIR04r8SfSq8aEpuSVKKDPYw0twp6gPhk5Vy2tfBNtKMG-c=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://GGToorcorp.com/</a><br/><a href=\"https://www.globenewswire.com/Tracker?data=-Zl8jBnYXSCqyC6MniPxy-fs85GCJMT6BKYFsyPoEPvEbeYTJBDgupSxvmvF0FpAsejsANzzFwQngArx73da37VY_mhDhegzX4-avNup8Vw=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://GGToor.com/home.php</a></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODM4ODQ5MiM0NTM4MjA2IzUwMDA2NzIyNQ==\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RNNE9EUTVNaU0wTlRNNE1qQTJJelV3TURBMk56SXlOUT09&amp;key=3145250a1b283604b7ddaf8391732e5f3900ddcbeddb5ba31b336f59c798d890fc83aa69e5ddd872c3f73781abace37365f77eb4517fc2ba7a241f1a86bd3398\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/MzhkMTM0YjItNWRiNS00ZDBkLWIzNzEtZTlhZTVmNDZkZWU3LTUwMDA2NzIyNQ==/tiny/GGToor-Inc-.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9NemhrTVRNMFlqSXROV1JpTlMwMFpEQmtMV0l6TnpFdFpUbGhaVFZtTkRaa1pXVTNMVFV3TURBMk56SXlOUT09L3RpbnkvR0dUb29yLUluYy0ucG5n&amp;key=db25dd53514c3d50f02c57afedb0d7699e0753cfc94fde1cc8548daa374c28f584a1a706504dc11c2ad5391efd58df55f4fe81243237177514609b9eef747154\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/5e8f1f18-2401-4717-8343-9cd6691e5cb2\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/5e8f1f18-2401-4717-8343-9cd6691e5cb2/small/1625664401982-5d0bb4ec1e7a830004e3728b-logo-jpg.jpg\" style=\"max-height:96px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS81ZThmMWYxOC0yNDAxLTQ3MTctODM0My05Y2Q2NjkxZTVjYjIvc21hbGwvMTYyNTY2NDQwMTk4Mi01ZDBiYjRlYzFlN2E4MzAwMDRlMzcyOGItbG9nby1qcGcuanBn&amp;key=6f5dd6593323fc4714ba8a1f8895ce16686eee0d184f5c9d1155b4dfcbfe704934dceae2f525038c46c83df09f7e3e37a1748f4640397973fa3c939a50501d18\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}