{"date": "2021-11-25 20:33:23.026000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.41, "close": 3561.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>US e-commerce giant Amazon has written to Ajay Tyagi, chairman of market regulator Securities and Exchange Board of India (Sebi) and other top executives, to withdraw its conditional approval granted to Future Retail Limited (FRL) related to the $3.4-billion merger deal between Future Group and Reliance. The letter has also been sent to other top officials at stock exchanges such as BSE Limited and the National Stock Exchange of India Limited (NSE).</p><p>In Aug 2019, Amazon acquired a 49 per cent stake in Future Coupons, the promoter entity of Future Retail, for about Rs 1,500 crore. Amazon is now fighting a legal battle with FRL to stop the Kishore Biyani-led retailer\u0092s $3.4 billion deal with Reliance Industries Limited (RIL).</p></div><div class=\"tr-npp-body\"><p>Amazon has requested Sebi and the stock exchanges to act in aid of the binding injunctions operating against FRL, FCPL (Future Coupons Pvt Ltd) and the Biyanis, in terms of the EA Order and the Order on Vacate Application and recall the Observation Letters forthwith.</p><p>\u0093We refer to our earlier correspondence including the October 30, 2021 Letter. We wish to reiterate that the EA Order was passed by the Emergency Arbitrator restraining FRL, FCPL and the Biyanis from taking any steps in relation to, in furtherance or in aid of, the Impugned Transaction,\u0094 said Amazon\u0092s letter dated November 24 and seen by Business Standard.</p><p>Future Group and Amazon didn\u0092t respond to the query related to this issue.</p><p>In the letter, Amazon said it reiterates that FRL precipitated the Observation Letters from the SEBI and the Indian Stock Exchanges in violation of the binding directions contained in the EA Order. Consequently, it said the Observation Letters are in violation of the EA Order, have no legal basis and constitute a nullity.</p><p>\u0093We wish to reiterate subsequent developments in respect of the EA Order which reaffirm the position that the Observation Letters were obtained in violation of binding injunctions operating against FRL, FCPL and the Biyanis, and thus are null and void,\u0094 said the letter.</p><p>On October 25, 2020, an emergency arbitrator constituted under the Rules of the Singapore International Arbitration Centre, 2016, passed the EA Order containing the directions against FRL, FCPL and the Biyanis. This included that the respondents are injuncted from taking any steps in furtherance or in aid of the Board Resolution made by the Board of Directors of FRL on 29 August 2020 in relation to the Disputed Transaction. It said without prejudice to the rights of any current Promoter Lenders, the Respondents are injuncted from directly or indirectly taking any steps to transfer/dispose/alienate/encumber FRL\u0092s Retail Assets.</p><p>In spite of the binding directions contained in the EA Order, Amazon said FRL continued to pursue the approval for the Impugned Transaction by terming the EA Order a \u0093nullity\u0094.</p><p>\u0093FRL issued various communications to SEBI and the Indian Stock Exchanges in this regard, which were issued in direct contravention of the EA Order, in a brazen attempt to subvert the rule of law. Pursuant to such contumacious conduct, FRL misled SEBI and the Indian Stock Exchanges, and precipitated the Observation Letters,\u0094 alleged the letter.</p><p>Aggrieved by the violations of the EA Order, Amazon said it was constrained to initiate Enforcement Proceedings before the Hon\u0092ble Delhi High Court to enforce the EA Order. On March 18, 2021, the Hon\u0092ble Delhi High Court passed the Enforcement Judgment.</p><p>FRL, FCPL and the Biyanis challenged the Enforcement Judgment on the ground that the EA Order, being a \u0093nullity\u0094, could not be enforced. On August 6, 2021, the Hon\u0092ble Supreme Court upheld the legality and enforceability of the EA Order.</p><p>\u0093The Supreme Court Judgment constitutes the law of the land under Article 141 of the Constitution of India and must be obeyed,\u0094 said the letter.</p><p>Amazon alleged that although FRL had termed the EA Order as a \u0093nullity\u0094 and had continued to act in violation of the directions contained therein, it approached the Arbitral Tribunal for vacating the EA Order. FRL filed an application (\u0093Vacate Application\u0094) in this regard on March 11, 2021, along with an application challenging jurisdiction of the Arbitral Tribunal (\u0093Jurisdictional Objections\u0094).</p><p>On September 9, 2021, the Hon\u0092ble Supreme Court stayed the Enforcement Proceedings initiated by Amazon before the Hon\u0092ble Delhi High Court in anticipation of orders to be passed by the Arbitral Tribunal on FRL\u0092s Vacate Application. The Hon\u0092ble Supreme Court did not stay the Enforcement Judgment or any of the directions contained in the EA Order.</p><p>On 20 October 2021, the Arbitral Tribunal passed the Partial Award on Jurisdiction dismissing FRL\u0092s Jurisdictional Objections. The dispositive directions contained in the Partial Award on Jurisdiction, included that it has jurisdiction over FRL in this Arbitration in view of its determination that each of the Parties is bound by the FCPL SHA (Future Coupons Pvt Ltd) Arbitration Agreement, including FRL notwithstanding its non-signatory status.</p><p>On October 21, 2021, the Arbitral Tribunal passed the Order on Vacate Application dismissing FRL\u0092s Vacate Application and re-affirming the directions contained in the EA Order, said Amazon\u0092s letter. On October 29, 2021, the Hon\u0092ble Delhi High Court dismissed FRL\u0092s application seeking an ad-interim stay of the Order on Vacate Application.</p><p>\u0093The directions contained in the EA Order have thus continued to bind and operate against FRL from October 25, 2020, and have now been re-affirmed by the Arbitral Tribunal,\u0094 said the letter. \u0093FRL\u0092s pursuit of the approval for the Impugned Transaction before SEBI and the Indian Stock Exchanges was in clear breach of the directions in the EA Order. The Observation Letters were thus illegally obtained and are a nullity in the eyes of law.\u0094</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}