{"date": "2021-11-30 16:11:17.008000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>RACKSPACE TECHNOLOGY INC (\"RXT-Q\")\n- Receives 2021 AWS Migration Partner of the Year Award\n\n     Rackspace Technology(R) a leading end-to-end multicloud technology\nsolutions company, announced it has been named 2021 Amazon Web Services\n(AWS) Migration Partner of the Year (NSI) - US.\n\n     The AWS Partner Awards recognize a wide range of born-in-the-cloud,\nand traditional AWS Consulting and Technology Partners, whose business\nmodels have embraced specialization and collaboration over the past year.\nThe 2021 AWS Migration Partner of the Year (NSI) - US winners are channel\nleaders playing a key role in helping US customers drive innovation and\nbuild solutions on AWS.\n\n     \"We are proud to be recognized by AWS as the AWS Migration Partner of\nthe Year for our deep expertise in helping customers embark on a digital\ntransformation by elevating their important workloads in the cloud,\" said\nJeff DeVerter, CTO, Solutions at Rackspace Technology.\n\n     With 15 AWS competencies and more than 2,700 certifications, Onica by\nRackspace Technology is a dedicated AWS business group at the company. As a\ntop strategic Partner, Rackspace Technology works with the AWS Migration\nAcceleration Program team to grow and accelerate customer migrations in the\nUS. In 2021, Rackspace Technology had a phenomenal year reaching its goals\nand worked on notable projects with significant social impact.\n\n     In addition to the 2021 AWS Migration Partner of the Year (NSI) - US,\nRackspace Technology received the 2021 AWS Partner Network (APN) Migration\nPartner of the Year award for Canada and APN Migration Partner of the Year\n2020 in the UK and Ireland in November 2020.\n\n     About Rackspace Technology\n\n     Rackspace Technology is a leading end-to-end multicloud technology\nservices company. We can design, build and operate our customers' cloud\nenvironments across all major technology platforms, irrespective of\ntechnology stack or deployment model. We partner with our customers at\nevery stage of their cloud journey, enabling them to modernize\napplications, build new products and adopt innovative technologies.\n\n Contact Information:\n\nContact:Natalie Silva\nRackspace Technology Corporate Communications\npublicrelations@rackspace.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300406.MNPRE2133302350-07442620211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}