{"date": "2021-12-06 17:42:30.428000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AURORA INNOVATION INC (\"AUR-Q\")\n- Now Publicly Traded, Self-Driving Company Aurora Expands Finance\n- Team\n\n    The self-driving company Aurora, which recently went public and is now\nlisted on the NASDAQ under the ticker $AUR, is expanding its finance team,\nstrengthening its ability to deliver its self-driving technology at\ncommercial scale. Today, the company is announcing the appointment of\nRichard Tame as the company's Chief Financial Officer (CFO). Tame, who most\nrecently served as Aurora's VP of Finance, brings more than two decades of\nexperience in public accounting and leading finance teams at high-growth\ncompanies including Lyft, Facebook, Microsoft, and Amazon.\n\n    \"Over the last year, Richard's leadership and financial expertise has\nhelped shepherd the company through several acquisitions, expansion, and\nour path to being a public company. Naming Richard as CFO recognizes the\nincredibly important role he and his team have played in our growth and\nwill continue to play as we commercialize our products,\" said Aurora CEO\nChris Urmson.\n\n    Following its successful public listing, Aurora expects to grow its\nteam and operations in order to deliver commercially viable self-driving\ntrucks and an autonomous ride-hailing product. In addition to Tame's\nappointment as CFO, Aurora has hired several key finance leaders who will\nhelp lead Aurora as a public company and deliver on its product.\n\n    Stacy Feit, VP of Investor Relations, leads Aurora's investor relations\nprogram, establishing strategic priorities and engaging with the investment\ncommunity. She brings over 20 years of investor relations and capital\nmarkets experience to Aurora. Most recently, she served as Vice President\nof Investor Relations at Cheesecake Factory Inc., following nearly a decade\nat a leading investor relations consulting firm.\n\n    Helen Chue, Senior Director of Business Risk and Insurance, leads\nAurora's risk management and insurance strategy. She was most recently at\nFacebook where she created the risk management and insurance function,\naddressing data center construction supply chain risks.\n\n    Katherine Jong, Senior Director, Financial Planning and Analysis\n(FP&amp;A), brings 15 years of global finance experience building and scaling\nFP&amp;A functions, advising business strategy, and partnering with executive\nleaders through high growth and large-scale transformation. Most recently,\nshe was at Lyft where she led the FP&amp;A team that supported Technology,\nAutonomous, and New Ventures.\n\n    In addition to expanding its finance team, Aurora most recently\nannounced bringing on a group of Pixar veterans to accelerate the company's\nsimulation work.\n\n    About Aurora\n\n    Aurora (Nasdaq: AUR) is delivering the benefits of self-driving\ntechnology safely, quickly, and broadly. Founded in 2017 by experts in the\nself-driving industry, Aurora is revolutionizing transportation - making it\nsafer, increasingly accessible, and more reliable and efficient than ever\nbefore. Its flagship product, the Aurora Driver, is a platform that brings\ntogether software, hardware, and data services, to autonomously operate\npassenger vehicles, light commercial vehicles, and heavy-duty trucks.\nAurora is partnered with industry leaders across the transportation\necosystem including Toyota, Uber, Volvo, FedEx, and PACCAR. Aurora tests\nits vehicles in the Bay Area, Pittsburgh, and Texas and has offices in\nthose areas as well as in Bozeman, MT; Seattle, WA; Louisville, CO; and\nWixom, MI. To learn more, visit www.aurora.tech.\n\n    Aurora Overview Aurora Press Kit\n\n    Cautionary Statement Regarding Forward-Looking Statements\n\n    This Press Release contains certain forward-looking statements within\nthe meaning of the federal securities laws. All statements contained in\nthis press release that do not relate to matters of historical fact should\nbe considered forward-looking statements. These statements are based on\nmanagement's current assumptions and are neither promises nor guarantees,\nbut involve known and unknown risks, uncertainties and other important\nfactors that may cause our actual results, performance or achievements to\nbe materially different from any future results, performance or\nachievements expressed or implied by the forward-looking statements. For\nfactors that could cause actual results to differ materially from the\nforward-looking statements in this press release, please see the risks and\nuncertainties identified under the heading \"Risk Factors\" section of the\nCompany's definitive Registration Statement on Form S-1 filed with the SEC\non November 12, 2021 and other documents filed by the Company from time to\ntime with the SEC, which are accessible on the SEC website at www.sec.gov.\nAll forward-looking statements reflect our beliefs and assumptions only as\nof the date of this press release. The Company undertakes no obligation to\nupdate forward-looking statements to reflect future events or\ncircumstances.\n\n Contact Information:\n\nKhobi Brooklyn\npress@aurora.tech\n(415) 699-3657\n\nTel   : 888-583-9506    AURORA INNOVATION INC\nWWW   : <a href=\"https://www.aurora.tech\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.aurora.tech</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133900552.MNPRE2133902146-09282320211206</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}