{"date": "2021-10-28 07:24:12+00:00", "ticker": "AAF", "mrkt_info": {"open": 99.0, "close": 110.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        AIRTEL AFRICA PLC\n      </p>\n                <p>\n        53-54 Grosvenor Street, London, W1K 3HU\n      </p>\n                <p>\n        United Kingdom\n      </p>\n                <p>\n        Airtel Africa plc\n      </p>\n                <p>\n        (\"Airtel Africa\", or \"Company\")\n      </p>\n                <p>\n        Airtel Africa launches its long-term sustainability strategy,\n      </p>\n                <p>\n        building on its corporate purpose to transform lives\n      </p>\n                <p>\n        Strategy sets out the Company's commitments and establishes medium and long-term goals\n      </p>\n                <p>\n                  <span>Nairobi, 28 October 2021:</span> Airtel Africa, a leading provider of telecommunications and mobile money services, with a presence in 14 countries across Africa, today launched a comprehensive sustainability strategy (<span><a href=\"http://www.airtel.africa/investors\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.airtel.africa/investors</a></span>) which sets out its detailed plans to improve the lives of millions of people across Africa through digital and financial inclusion and access to education. The strategy also includes specific goals around environmental protection and the ongoing development of a rewarding, diverse and inclusive workplace.\n      </p>\n                <p>\n        We have worked hard to identify the technical programmes needed to respond to all our material topics and to have a genuine and positive impact on people and communities across Africa. Our strategy sets specific goals and commitments, and for each of these, we have identified exactly how we will achieve them and the milestones along the way. Our Board and Executive Committee have been integral to developing this strategy which is fully aligned with the Company's corporate strategy and plans. We have engaged with our stakeholders throughout the development of the strategy and undertook a detailed stakeholder consultation ahead of this launch.\n      </p>\n                <p>\n        Our strategy is delivered through four sustainability pillars: 'Our business' which reflects our operations and the expansion of our network, 'Our people' which sets commitments around employee engagement, development, diversity and inclusion, 'Our community' which details our dedication to improving access to education, and 'Our environment' which is focused on reducing the environmental impact of our operations. We have identified six of the United Nations Sustainable Development Goals to which we believe our work will make a genuine and tangible contribution- they are SDG 4: Quality education, SDG 5: Gender equality, SDG 8: Decent work and economic growth, SDG 9: Industry, innovation and infrastructure, SDG 10: Reduced inequalities, and SDG 12: Responsible consumption and production.\n      </p>\n                <p>\n                  <span>Segun Ogunsanya, CEO, Airtel Africa</span>, said: \"Today is a significant milestone in Airtel Africa's journey. Our new strategy provides a solid foundation for us to accelerate change for the communities we serve and the environment in which we operate. We have worked closely with our stakeholders to ensure that this strategy is ambitious, robust and credible. This partnership approach underpins all the work we will deliver through our strategy. We will look to collaborate across the industry, recognising that by working together, we will be able to drive a more significant impact for the people who need it most. We are more committed than ever to ensuring open and honest communication on our progress as Airtel Africa embarks on its long journey towards a more sustainable future.\n      </p>\n                <p>\n        Registered Office: 53-54 Grosvenor Street, London, W1K 3HU, United Kingdom Registered in England and Wales | Company Number: 11462215 | Telephone: +44 207 493 9315\n      </p>\n              </div>\n              <div>\n                <p>\n        Goals and commitments\n      </p>\n                <p>\n        The sustainability strategy includes nine goals and commitments, with corresponding programmes that address the business' material topics (identified through an extensive consultation at the beginning of the year) and enable the Group to continue delivering sustainable growth and uphold the best governance standards:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <span>Data security goal</span>: Establish industry-leading data security for our customers through investments in technology and expertise, updated processes and consumer awareness - with focus areas around confidentiality, integrity and availability.\n        </li>\n                  <li>\n                    <span>Service quality goal</span>: Provide underserved communities with access to reliable networks and connectivity through the rollout of new infrastructure and technology, improved fibre connectivity and capacity - with focus areas on service accessibility, delivery and reliability.\n        </li>\n                  <li>\n                    <span>Supply chain goal</span>: Ensure all our suppliers are aligned with our sustainability agenda through programmes to increase supplier disclosure and audit ESG performance - with focus areas on enhanced supplier due diligence and ongoing ESG compliance.\n        </li>\n                  <li>\n                    <span>Commitments to our people</span>: with our ongoing commitment to provide rewarding employment opportunities and to achieve genuine diversity and inclusion at all levels across the business through:<br/><span>o</span> Delivering equality in our workforce through recruitment and programmes to provide training and advancement for everyone regardless of gender, nationality or disability;<br/><span>o</span> Providing best practice training and development through upskilling and reskilling initiatives to ensure they can succeed in their future careers. And through supporting female entrepreneurs through training and increasing women's participation in the technology and engineering sectors;<br/><span>o</span> Providing the highest standards of health and safety for our employees and contractors through the introduction of a best practice social and health and safety management system, improved policies and full compliance with all legislation and regulation; and,<br/><span>o</span> Maintaining the highest levels of employee engagement through the introduction of additional channels that provide every one of our people with a voice.\n        </li>\n                  <li>\n                    <span>Digital inclusion goal</span>: significantly improve digital Inclusion across Africa by driving the penetration of mobile, smartphones and home broadband in rural areas through the provision of retail and support services.\n        </li>\n                  <li>\n                    <span>Financial inclusion goal</span>: significantly increase financial inclusion in Africa, with particular support for women through the development of affordable financial products to meet the needs of the un- and under-banked, a reliable service and financial confidence and literacy.\n        </li>\n                  <li>\n                    <span>Access to education goal</span>: helping transform the lives of over one million children through improving access to education - with programmes around connectivity, the provision of zero-rated education content under a five-year UNICEF partnership, connecting 1,400 schools to the internet by 2027, and the adoption and support of schools in all our markets.\n        </li>\n                  <li>\n                    <span>Greenhouse gas emissions reduction goal</span>: Our ambition is to achieve net zero greenhouse gas (GHG) emissions ahead of the 2050 deadline set out in the Paris Agreement. To do this we must fully identify, measure and reduce our GHG emissions which can only be achieved in partnership with our peers and the wider industry. We will establish and launch a sector leading and credible decarbonisation pathway in 2022, ahead of the publication of our first Sustainability Report.\n        </li>\n                  <li>\n                    <span>Environmental stewardship</span>: Eliminate hazardous waste from our operations, significantly reduce our non-hazardous waste and minimise our water consumption with programmes to replace damaging materials, expand recycling schemes and build employees' awareness around the protection of our natural resources.\n        </li>\n                </ul>\n                <p>\n        Registered Office: 53-54 Grosvenor Street, London, W1K 3HU, United Kingdom Registered in England and Wales | Company Number: 11462215 | Telephone: +44 207 493 9315\n      </p>\n              </div>\n              <div>\n                <p>\n        -ENDS-\n      </p>\n                <div class=\"story-table-container\"><table class=\"story-basic-table\">\n                  <tr>\n                    <td>\n                      <p>\n              Enquiries\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              Hudson Sandler\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              +44 207 796 4133\n            </p>\n                    </td>\n                  </tr>\n                </table></div>\n                <p>\n        Nick Lyon Bertie Berger <span><a href=\"mailto:airtelafrica@hudsonsandler.com\" data-type=\"email\" translate=\"no\">airtelafrica@hudsonsandler.com</a></span></p>\n                <p>\n        About Airtel Africa\n      </p>\n                <p>\n        Airtel Africa is a leading provider of telecommunications and mobile money services, with a presence in 14 countries in Africa, primarily in East Africa and Central and West Africa.\n      </p>\n                <p>\n        Airtel Africa offers an integrated suite of telecommunications solutions to its subscribers, including mobile voice and data services as well as mobile money services both nationally and internationally.\n      </p>\n                <p>\n        The Group aims to continue providing a simple and intuitive customer experience through streamlined customer journeys.\n      </p>\n                <p>\n                  <a href=\"http://www.airtel.africa/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.airtel.africa</a>\n                </p>\n                <p>\n        Simon O'Hara\n      </p>\n                <p>\n        Group Company Secretary\n      </p>\n                <p>\n        Registered Office: 53-54 Grosvenor Street, London, W1K 3HU, United Kingdom Registered in England and Wales | Company Number: 11462215 | Telephone: +44 207 493 9315\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://doclib.ngxgroup.com/Financial_NewsDocs/34375_AIRTEL_AFRICA_PLC LAUNCH_OF_SUSTAINABILITY_STRATEGY__C.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Airtel Africa plc</strong> published this content on <strong>28 October 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>28 October 2021 07:24:12 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Airtel Africa plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Airtel-Africa-plc</p></div>"}