{"date": "2021-04-07 12:04:07+00:00", "ticker": "AVV", "mrkt_info": {"open": 3550.0, "close": 3775.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n      Based on its recent analysis of the global manufacturing execution system (MES) market for the food and beverage industry, <a href=\"https://ww2.frost.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Frost &amp; Sullivan</a> recognizes <a href=\"https://www.aveva.com/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AVEVA Group plc</a> with the 2020 Global Product Leadership Award. AVEVA's model-driven MES solution combines the traditional benefits of an MES with a new digital workflow management approach to integrate people, processes, and businesses. The solution supports the integration with process control applications, device-agnostic automation hardware, and workflow management applications, helping users achieve significant efficiencies.\n    </p>\n              <p>\n      'Instead of offering conventional standalone MES software, AVEVA supports its MES capability with a platform-neutral user experience, mobile apps, and human-machine interface (HMI) integration,' said Ramasamy Muthuraman Research Analyst. 'Its customer-centric approach enables users to achieve the maximum level of automation, consistency of operational tasks, and collaboration across diverse teams. While competing MES solutions provide only a manual setup on a single mobile device, AVEVA's MES provides an automatic and active layout adoption and creates previews for multiple mobile and desktop devices.'\n    </p>\n              <p>\n      AVEVA's MES stands out for its out-of-the-box connectors for both plant and enterprise applications, providing greater flexibility to customers in terms of integrating the MES into their entire business. The company's technologies help it uniquely respond to events arising in the MS SQL server, XML messages, and web services. Furthermore, the ability to connect with automated manufacturing processes by integrating with asset performance management software or third-party applications allows customers to achieve end-to-end process management and standardize processes across the enterprise.\n    </p>\n              <p>\n      With the AVEVA System Platform, the company offers an industry-first responsive Operations Management Interface (AVEVA OMI) that customers can access across different platforms. AVEVA's definable asset model that binds content and unstructured data logically to enhance an operator's situational awareness is a valuable differentiator. Moreover, developers do not have to learn complex scripting or programming language because the solution is easily deployable. AVEVA has further enhanced the development experience by offering a pre-built automation library that includes a device object library, faceplates, trends, and symbols.\n    </p>\n              <p>\n      'AVEVA has been accelerating its cloud deployment while increasingly investing in cloud development to give customers greater flexibility in the way they use the software,' noted Muthuraman. 'It extended its MES capabilities with its cloud platform called AVEVA Connect, which delivers an end-to-end integrated solution for an organization's design, engineering, supply chain, and production teams. Its adaptable solutions and customer-focused strategy ensure it maintains its position as a leading MES provider to the food and beverage industry.'\n    </p>\n              <p>\n      Each year, Frost &amp; Sullivan presents this award to the company that has developed a product with innovative features and functionality that is gaining rapid market acceptance. The award recognizes the quality of the solution and the customer value enhancements it enables.\n    </p>\n              <p>\n      Frost &amp; Sullivan Best Practices Awards recognize companies in a variety of regional and global markets for demonstrating outstanding achievement and superior performance in areas such as leadership, technological innovation, customer service, and strategic product development. Industry analysts compare market participants and measure performance through in-depth interviews, analyses, and extensive secondary research to identify best practices in the industry.\n    </p>\n              <p>\n                <strong>About Frost &amp; Sullivan<br/></strong> For six decades, Frost &amp; Sullivan has been world-renowned for its role in helping investors, corporate leaders, and governments navigate economic changes and identify disruptive technologies, Mega Trends, new business models, and companies to action, resulting in a continuous flow of growth opportunities to drive future success. Contact us: Start the discussion. <a href=\"https://ww2.frost.com/contact-us/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Contact us: Start the discussion</a>.\n    </p>\n              <p>\n      Contact:<br/>\n       Kristen Moore<br/>\n       P: 210.247.3823<br/>\n       E: <a href=\"mailto:kristen.moore@frost.com\" data-type=\"email\" translate=\"no\">kristen.moore@frost.com</a></p>\n              <p>\n      About Kristen Moore\n    </p>\n              <p>\n      Kristen Moore<br/>\n       Marketing Coordinator - Best Practices Recognition<br/>\n       kristen.moore@frost.com<br/>\n       Phone: +1 (210) 247-3823\n    </p>\n              <p>\n                <a href=\"https://ww2.frost.com/author/kmoore/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">View all posts by Kristen Moore</a>\n              </p>\n              <span>\n                <a href=\"https://ww2.frost.com/news/press-releases/birdz-commended-by-frost-sullivan-for-its-smart-city-focused-intelligent-water-solutions-and-services/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">←</a>\n              </span>\n              <a href=\"https://ww2.frost.com/news/press-releases/birdz-commended-by-frost-sullivan-for-its-smart-city-focused-intelligent-water-solutions-and-services/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Previous Post</a>\n              <p>\n                <span>\n                  <a href=\"https://ww2.frost.com/author/kmoore/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kristen Moore</a>\n                </span>\n              </p>\n              <p>\n      Kristen Moore<br/>\n       Marketing Coordinator - Best Practices Recognition<br/>\n       kristen.moore@frost.com<br/>\n       Phone: +1 (210) 247-3823\n    </p>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://ww2.frost.com/news/press-releases/aveva-applauded-by-frost-sullivan-for-integrating-people-processes-and-businesses-with-its-new-digital-workflow-management-model/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Frost &amp; Sullivan</strong> published this content on <strong>07 April 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>07 April 2021 12:04:07 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Frost & Sullivan</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Frost-&amp;-Sullivan</p></div>"}