{"date": "2022-01-21 20:37:34.744000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3033.35, "close": 2890.88}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Baby boy Valentine's Day outfits and baby girl Valentine's Day outfits for their first Valentine's Day and beyond, including pieces by Target and Amazon.</p><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p></div><div class=\"tr-npp-body\"><p>It's that time of the year when love takes center stage. Nothing is more lovable than cute kids in festive Valentine's Day ensembles that are perfect for snuggling or a quick photo sesh. These heart-centric outfits, onesies and pajamas are so sweet they'll be sure to have you sighing, \"Awww,\" at the sight of your little one. You may find yourself wanting to celebrate Valentine's Day all year long.</p><p><span><span>Get deals and shopping advice delivered straight to your phone</span> . Sign up for text message alerts from the experts at Reviewed.</span> </p><p class=\"tr-npp-section-title\">1. A sweet little 3-piece set with matching headband</p><p><span>Sizes:</span> NB to 18mos</p><p>This fun and frilly little three-piece is perfect for a Valentine's Day debut, or for toddling around. Made from breathable, stretchy and oh-so-comfy 100% cotton, this set is great for playing, lounging or napping. A sweet little headband pulls the whole look together.</p><p><span>Get the Baby Girl's 3-piece Frill Long Sleeve Romper and Pant Set at Amazon for $18.99</span> </p><p class=\"tr-npp-section-title\">2. A suspender set for your little man</p><p><span>Sizes:</span> Newborn to 24mos</p><p>A totally spiffy Valentine's Day getup for your most dapper guy. This one includes a bright red bowtie, a heart-printed button-down shirt and some stylish denim. We ask you: Is there anything cuter than a toddler in suspenders? The answer is no.</p><p><span>Get the Baby Boys' V-Day Denim Top &amp; Bottom Suspender Set at Target for $17.99</span> </p><p class=\"tr-npp-section-title\">3. A swingy skater dress</p><p><span>Sizes:</span> 2T to 12</p><p>This adorable dress comes in two shades that are both so cute you're going to want to get both! Comfy and swingy yet warm enough to wear on a winter day with some smart leggings, this classic skater dress is filled with style. It's also made from 100% GOTS-certified cotton for a sustainable option. </p><p><span>Get the Valentine's Print Skater Dress at Hanna Andersson for $41.60</span> </p><p class=\"tr-npp-section-title\">4. A smart shirt </p><p><span>Sizes:</span> 18mos to 10 years</p><p>This pullover, collared shirt oozes style, for your fashionable little dude. The funky print will look great in family photos, out for a Valentine's Day dinner or for charming the ladies on the playground. </p><p><span>Get the Valentine's Day XOX Print Polo Pullover Shirt at Amazon starting at $23.99</span> </p><p class=\"tr-npp-section-title\">5. A cozy knit body suit for a first Valentine's Day</p><p><span>Sizes:</span> 0 to 24mos</p><p>Adorned with pretty little pompoms, this may be the sweetest one-piece around. Super warm for a chilly Valentine's Day, it's made from a soft knit cotton blend that not only soft and breathable, but it's super cozy. Available in two colors, you can either go with sweet pink or sophisticated rose. </p><p><span>Newborn Sweater Romper Long Sleeve Knitted Bodysuit at Amazon for $25.99</span> </p><p class=\"tr-npp-section-title\">6. A snuggly sweatshirt for your little loverboy</p><p><span>Sizes:</span> 6mos to adult</p><p>You'll just want to love them up in this sweatshirt that says it all. For the little loverboy who is ready for hugs and kisses, this sweatshirt is the ultimate. And for your not-so-little loverboy? This sweatshirt goes all the way up to adult sizes! You can get this as a sweatshirt or as a t-shirt for a summery top or a wintery one. </p><p><span>Get the Loverboy Valentine's Sweatshirt at Etsy for $16.99</span> </p><p class=\"tr-npp-section-title\">7. A swoon-worthy sweater one-piece </p><p><span>Sizes:</span> 0 to 24mos</p><p>They'll look so classy in navy in this pretty little one-piece. The allover heart print will make it hard to hold back from a cascade of kisses, as will the super soft knit of this romper. Bottom snaps make for easy-peasy diaper changes.</p><p><span>Get the Baby Heart Print Sweater One-Piece at Gap for $35</span> </p><p class=\"tr-npp-section-title\">8. A gender neutral two-piece that will get tons of wear</p><p><span>Sizes:</span> NB to 4T</p><p>Not traditional pink or red, but still on trend for the holiday. This gender neutral two-piece set is made from organic, breathable cotton and its easy on and off design ups the comfort quotient. This cuddly outfit, with its cascading hearts, will have them looking lovey all winter long.</p><p><span>Get the Two-Piece Valentine's Day Set at Amazon for $14.99</span> </p><p class=\"tr-npp-section-title\">9. A french bateau for your petite amour</p><p><span>Sizes:</span> 2T to 14</p><p>They'll look trés chic in this Parisienne-inspired boatneck tee that's adorned with a little bit of love. Completely machine washable, it will look sweet paired with a flouncy skirt on Valentine's day, but it'll clean up great after a day at play. </p><p><span>Get the Girls' Big Heart Boatneck Tee at J.Crew for $22.50</span> </p><p class=\"tr-npp-section-title\">10. A first tuxedo for your dapper dude</p><p><span>Sizes:</span> NB to 18mos</p><p>Who says comfort and style can't go hand-in-hand? He'll look so smart in this all-in-one tuxedo-style getup that is made from organic cotton. It also comes in a long-sleeved and full-pant version, if you need something extra warm. </p><p><span>Get the Bilson Baby Boy Valentine's Day Outfit at Amazon starting at $16.97</span> </p><p class=\"tr-npp-section-title\">11. A raspberry heart dress</p><p><span>Sizes:</span> 2 to 12</p><p>If you're searching for something as sweet as summery fruit, this raspberry-colored dress is just the thing. The heart-shaped patches make it perfect for Valentine's Day, while the floral appliqué says you can wear this right through Easter. We love the relaxed shape and breezy skirt, which makes this comfortable enough to wear any day of the year.</p><p><span>Get the Raspberry Pink Hearts Pocket Dress at Boden for $32.90</span> </p><p class=\"tr-npp-section-title\">12. A lovable dragon tee for the big kid</p><p><span>Sizes:</span> Kids' XS to XXL</p><p>For the child you love ferociously, this t-shirt is perfect layered over a thermal for loads of love-day style. Dragons are having a popularity moment and this t-shirt is right on trend. Plus, it's perfect for convincing reluctant valentines that it's still fun to dress up. </p><p><span>Get the Boys' Valentines Dragons Short Sleeve Graphic T-Shirt at Target for $6</span> </p><p class=\"tr-npp-section-title\">13. A swing dress with cascading hearts</p><p><span>Sizes:</span> 2 to 12</p><p>They'll be loaded with love in this gorgeous cascading heart dress. The skater style gives it just a little extra swing. Made from soft jersey this design is stretchy and comfortable and has a total of three pockets (We love pockets!) for keeping hands warm or for carrying important essentials.</p><p><span>Get the Multi Rainbow Hearts dress at Mini Boden for $44</span> </p><p class=\"tr-npp-section-title\">14. A sweatshirt with a self-love statement</p><p><span>Sizes: </span> 18mos to 12</p><p>Crafted to be loved! This super soft sweatshirt declares a statement of self-love that we are swooning over. The sweetest embroidery on the softest French terry knit, this gender-neutral sweatshirt sends the sweetest message for Valentines of all kinds. </p><p><span>Get the Be Loved French terry sweatshirt at Hanna Andersson for $44.80</span> </p><p class=\"tr-npp-section-title\">15. The cutest cords </p><p><span>Sizes:</span> NB to 4T</p><p>These adorable cords in a \"sweet tart\" design are just the thing for your little sweetheart. This cotton dungaree two-piece is comfortable, cute and made for crawlers. The polka-dot trousers feature heart-shaped appliqué patches on the knees, which pass the crawling test with flying colors. The coordinating floral-print top looks adorable with its contrasting frilly detailing around the neck</p><p><span>Get the Strawberry Tart Overalls Set at Mini Boden for $59</span> </p><p class=\"tr-npp-section-title\">16. A long-sleeved tee that's a virtual bear hug</p><p><span>Sizes:</span> 2 to 12</p><p>You really just want to hug them all day; this bear hug tee is the next best thing. Made from GOTS-certified cotton and emblazoned with a cute message, this is a lovable snuggle in long-sleeved t-shirt form. Bear hugs for miles!</p><p><span>Get the Valentine's Graphic Longsleeved Tee in Bear Hug for $36 at Hanna Andersson</span> </p><p class=\"tr-npp-section-title\">17. The prettiest dress in pink tulle</p><p><span>Sizes:</span>  19mos to 12</p><p>She will be so pretty in pink in this elegant dress that will make her the belle of the Valentine's Day ball—or simply a beloved date for dancing duet in the kitchen. Fully-lined for comfort, the scallop-edged cap sleeves, pearlescent buttons and double layers of tulle make this the most memorable dress for any holiday occasion. </p><p><span>Get the Lace and Tulle Dress at H&amp;M for $34.99</span> </p><p class=\"tr-npp-section-title\">18. For a dino-mite Valentine's Day</p><p><span>Sizes:</span> 6mos to 10</p><p>Any future paleontologist will love this dino-themed raglan t-shirt. Made in the USA by a two-mom crew in Tacoma, Washington, this t-shirt gets high marks for its high-quality image that's guaranteed not to crack or peel. </p><p><span>Get the Dinosaur Happy Valentine's Day Raglan Tee at Amazon for $20.47</span> </p><p class=\"tr-npp-section-title\">19. A cuddly onesie that speaks the truth</p><p><span>Sizes:</span> NB to 24 mos</p><p>Really, all you need is love. This long sleeved romper tells it like it is. Since we all have Beatlemania on the brain again, this is a perfect choice for a kid that wants to send a strong message. </p><p><span>Get the Baby Crewneck Longsleeve Romper at Amazon starting at $8.99</span> </p><p class=\"tr-npp-section-title\">20. For your fur-ever valentine</p><p><span>Sizes:</span> Preemie to adult</p><p>They'll furever be your Valentine in this zip-up. Our reviewers love the Little Sleepies line of pajamas, and you will too. Made with cool-in-the-summer and warm-in-the-winter bamboo viscose, this is a perfect entry piece into the Little Sleepies line, and it will have them looking so lovable until the next growth spurt. An added bonus? This actually comes in family sizes. </p><p><span>Get the Gray Furever Valentines Bamboo Viscose Zippy At Little Sleepies for $32</span> </p><p class=\"tr-npp-section-title\">21. Burt's Bees</p><p><span>Sizes:</span> Preemie to 14</p><p>Burt's Bees is one of our favorite affordable GOTS-certified brands of organic kids' clothes. Our love for this award-winning brand only grows with their adorable holiday pajama sets, including this cute little number that goes from preemie to teen. </p><p><span>Get the Valentine's Day Organic Cotton Pajamas at Burts Bees for $13.95</span> </p><p class=\"tr-npp-section-title\">22. A playful 3-piece set in a sweet style</p><p><span>Sizes:</span> Newborn to 24mos</p><p>This Valentine-themed three-piece set is just what they need to give their wardrobe a sweet upgrade. This cute set comes with a red-and-white striped romper and a blue skirtall in the sweetest heart shape with little ruffles for a playful style. Red Spandex leggings complete the set and allow for all sorts of movement for curious little kiddos. </p><p><span>Get the Baby Girls' Valentine Skirtall Top &amp; Bottom Set at Target for $19.99</span> </p><p class=\"tr-npp-section-title\">23. Crew Cuts Sweater</p><p><span>Sizes:</span> 2T to 14</p><p>This textured bouclé sweater is perfectly fashioned for a stylish Valentine. The oversized heart makes a big statement, while the acrylic, wool and alpaca blend make this a cozy sweater to warm them up on chilly days. </p><p><span>Get the Girls' textured knit heart sweater at J.Crew for $39.50</span> </p><p class=\"tr-npp-section-title\">24. A simply lovable t-shirt </p><p><span>Sizes:</span> 2T to 14</p><p>This simple t-shirt gets the point across. This hand-cut heart is slightly imperfect, for a heartwarming message. It comes in two colors, flamingo and lollipop!</p><p><span>Get the Kids' Heart Tee at Primary for $18</span> </p><p class=\"tr-npp-section-title\">25. A family set of Valentine's Day pajamas</p><p><span>Sizes:</span> NB to adult</p><p>PJs for the whole family! Show your love is a unified front with these coordinating Valentine's Day pajamas that come in a range of styles and sizes, from infant-footies to extra large adults.</p><p><span>Shop the family Valentine's Day pajama sets at Hanna Andersson</span> </p><p><span>There's a lot more where this came from. </span> Sign up for our twice-weekly newsletter to get all our reviews, expert advice, deals and more.</p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: 25 heart-meltingly adorable Valentine's Day outfits for kids</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}