{"date": "2022-01-04 08:20:28+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are his own.</p><p class=\"tr-by\">By Rob Cox</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">ZURICH, Jan 4 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>The dictionary defines transition as a “change from one state or condition to another.” That sums up the world as 2022 arrives. Whether it is the move away from an economic system reliant upon hydrocarbons, vanquishing the Covid-19 plague or central banks ending the free-money era, extraordinary shifts are occurring across the planet that will shape markets, corporate finance, politics and economies well beyond the coming year. These are the themes that inform Reuters Breakingviews’ annual book of predictions and prescriptions: “A World in Transition”.    </p><p><br/></p><p><a href=\"https://tmsnrt.rs/32SpSbe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read PDF</a></p><p><a href=\"https://bv-predictions2022.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read online</a> (for mobile)</p><p><br/></p><p>The extraordinary actions required to drive these epochal trends are being taken now, even if it will be years or even decades before achievements can be meaningfully measured. Inevitable transitions, like the one toward renewable energy, are better embraced than resisted. Investors and entrepreneurs who can adapt to change and its concomitant upheaval will reap the greatest rewards. But they must be prepared to make sacrifices along the way. Without social inclusion, these transformations may lead to violence. </p><p>Efforts by governments and companies to reduce carbon emissions and reach net zero by 2050 or sooner to limit planetary frying to 1.5 degrees Celsius above pre-industrial levels will continue to dominate the financial and business landscape in 2022. Switching away from coal, gas and oil is a priority. But every sector, including heavy industries like steel and cement, transportation, agriculture and banking, will soon need to make huge commitments to meet the lofty ambitions of the next generation. Our columnists explore all of these.  </p><p>At the same time, inflation is less quiescent than in the past couple of decades. Central banks will have to start pulling away the punchbowl, which has broad implications for the cost of capital (it goes up!) and the price of money. Speaking of which, money itself will go through a transformational period as the Federal Reserve, the European Central Bank and other monetary authorities try to keep up with the emerging dynamics of crypto and digital currencies. </p><p>A third year of the pandemic, with the persistent threat of new, more virulent strains, continues to dramatically accelerate the shift to digital-everything. The winners and losers of this transition will become more evident in 2022. Quasi-monopolies - like Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> in delivery and web-services; Meta <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a>, the company formerly known as Facebook, and Alphabet <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> in advertising; and Microsoft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a> in workflow – were given extraordinary boosts by state-mandated shutdowns. Governments face a make-or-break year to regulate these multi-trillion-dollar behemoths. Microsoft under Satya Nadella is our pick to manage these headwinds best. </p><p>And even as people trickle back to offices, post-pandemic dynamics in communications, training, travel and social interaction are permanently reshaping the workplace and productivity. This has implications for the nature of labour, property, urban planning and beyond. It also poses new challenges to leaders, none of whom were trained at Harvard Business School or INSEAD to run sprawling organisations of employees working individually from home. That’s why we’re predicting predicting high CEO turnover, robot investment bankers and a return to offshore jobs.  </p><p>The increasingly chilly war between the United States and China will dominate international trade and geopolitics. The kerfuffle over U.S. nuclear-submarine sales to Australia and America’s shambolic retreat from Afghanistan offered glimpses into the fractious nature of the Western alliance. With Xi Jinping set for a third term (if not life) as China’s president, U.S. President Joe Biden has a chance to reach détente of some sort to cooperate on climate change, the pandemic and other priorities. But with Biden’s own party facing a trouncing in November's congressional elections, his hands may be tied. On the plus side, European leadership will have a chance to consolidate as French President Emmanuel Macron likely wins a second term in May, Germany welcomes a new chancellor after 16 years with Angela Merkel at the helm, and Italy chooses its next president.  </p><p>Success will require extraordinary social inclusion. Governments, companies and taxpayers (especially the richest) have to proactively prepare for the sacrifices that are needed to prevent the earth from scorching, while delivering greater equity, financial inclusion and social justice. Failure to do so will lead to civil unrest or worse. In addition to being terrible for business, that would torpedo more existential goals like limiting global warming, whose deleterious effects will be disproportionately borne by the world’s poor. Here’s hoping the business world and financial markets help guide the way to a fairer, greener and more just society in the year ahead.</p><p>Follow <a href=\"https://twitter.com/rob1cox\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@rob1cox</a> on Twitter</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Editing by Swaha Pattanaik and Katrina Hamlin)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=COX/\" data-type=\"newsExpression\" data-expression=\"COX/\" translate=\"no\" dir=\"ltr\">COX/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:rob.cox@thomsonreuters.com\" data-type=\"email\" translate=\"no\">rob.cox@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://rob.cox.thomsonreuters.com@reuters.net\">rob.cox.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: GLOBAL-ECONOMY/BREAKINGVIEWS</p></div>"}