{"date": "2022-01-17 14:41:17.925000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CHECK POINT SOFTWARE TECHNOLOGIES LTD (\"CHKP-Q\")\n- DHL Replaces Microsoft as Most Imitated Brand in Phishing Attempts\n- in Q4 2021\n\n     Check Point Research (CPR), the Threat Intelligence arm of Check\nPoint(R) Software Technologies Ltd. and a leading provider of cyber\nsecurity solutions globally, has published its new Brand Phishing Report\nfor Q4 2021. The report highlights the brands which were most frequently\nimitated by criminals in their attempts to steal individuals' personal\ninformation or payment credentials during October, November and December.\n\n     For the first time, DHL took the number one spot in Q4, replacing\nMicrosoft as the brand most likely to be targeted by cybercriminals in\nphishing scams. Twenty-three percent of all brand phishing attempts were\nrelated to the global logistics and shipping company, up from just 9% in\nQ3, as threat actors sought to take advantage of vulnerable online\nconsumers during the busiest retail period of the year. Microsoft, which\nyet again led the rankings in Q3 by accounting for 29% of all phishing\nattempts, only accounted for 20% of phishing scams in Q4. FedEx also\nappeared in the top ten list for the first time in Q4 2021, no doubt the\nresult of threat actors trying to target vulnerable online shoppers in the\nrun-up to the festive season as the pandemic remained a key concern.\n\n     The Q4 report also reinforces an emerging trend from Q3, with social\nmedia seeming to solidify its position among the top three sectors imitated\nin phishing attempts. While Facebook has dropped out of the top ten brands\nmost likely to be imitated, WhatsApp has moved from 6th position to 3rd,\nnow accounting for 11% of all phishing attempts. LinkedIn has moved from\n8th position to 5th, now accounting for 8% of all phishing related attacks.\n\n     \"It's important to remember that cybercriminals are opportunists first\nand foremost. In their attempts to steal peoples' personal data or deploy\nmalware onto a user's machine, criminal groups will often take advantage of\nconsumer trends by imitating popular brands,\" said Omer Dembinsky, Data\nResearch Group Manager at Check Point Software. \"This quarter, for the\nfirst time, we've seen global logistics company DHL top the rankings as the\nmost likely brand to be imitated, presumably to capitalize on the soaring\nnumber of new and potentially vulnerable online shoppers during the year's\nbusiest retail period. Older users in particular, who are less likely to be\nas technologically savvy as younger generations, will be shopping online\nfor the first time and might not know what to look for when it comes to\nthings like delivery confirmation emails or tracking updates.\"\n\n     Omer continued, \"Q4 has also confirmed what many of us were expecting.\nThat social media would continue to be heavily targeted by bad actors\nlooking to take advantage of those leaning more heavily on channels like\nWhatsApp, Facebook and LinkedIn as a result of remote working and other\nfallouts from the pandemic. Unfortunately, there's only so much brands like\nDHL, Microsoft and WhatsApp - which represent the top 3 most imitated\nbrands in Q4 - can do to combat phishing attempts. It's all too easy for\nthe human element to overlook things like misspelt domains, typos,\nincorrect dates or other suspicious details, and that's what opens the door\nto further damage. We'd urge all users to be very mindful of these details\nwhen dealing with the likes of DHL in the coming months.\"\n\n     In a brand phishing attack, criminals try to imitate the official\nwebsite of a well-known brand by using a similar domain name or URL and\nweb-page design to the genuine site. The link to the fake website can be\nsent to targeted individuals by email or text message, a user can be\nredirected during web browsing, or it may be triggered from a fraudulent\nmobile application. The fake website often contains a form intended to\nsteal users' credentials, payment details or other personal information.\n\n     Top phishing brands in Q4 2021\n\n     Below are the top brands ranked by their overall appearance in brand\nphishing attempts:\n\n     *  DHL (related to 23% of all phishing attacks globally)\n     *  Microsoft (20%)\n     *  WhatsApp (11%)\n     *  Google (10%)\n     *  LinkedIn (8%)\n     *  Amazon (4%)\n     *  FedEx (3%)\n     *  Roblox (3%)\n     *  Paypal (2%)\n     *  Apple (2%)\n\n     PayPal Phishing Email - Account Theft Example\n\n     During November sales days, we noticed a malicious phishing email that\nwas allegedly sent by PayPal and was trying to steal users' credit\ninformation. The email which was sent from the spoofed address PayPal\nService\n(service@ec2-18-156-114-201[.]eu-central-1[.]compute[.]amazonaws[.]com) was\nactually sent by admin_emotion_dev@emotionstudios[.]rocks, contained the\nsocially engineered subject \"[Alert] Confirm your PayPal account (Case ID\n#XX XXXXXXXXXX)\" which could pressure the victim into clicking on the\nmalicious link (https://serviiceds[.]ritaspizzaportsmouth[.]com/llpy/). The\nwebsite redirects the user to a fraudulent PayPal login page that looks\nlike the real site with a few minor differences in appearance. In the\nmalicious link, the user needed to enter their PayPal account details.\n\n     Fedex Phishing Email - Malware Attached\n\n     During December, we observed a malicious phishing email that used\nFedex's branding and was trying to get the user to download SnakeKeylogger\nmalware to their machine. The email which was sent from the spoofed address\nsupport@fedex[.]com, contained the subject \"Bill of\nLading-PL/CI/BL-Documents arrival\". The content is asking to download a RAR\narchive file \"shipment docu..rar\", which contains a malicious executable\nfile that would cause the system to be infected with SnakeKeylogger and\ncould steal the user's credentials information.\n\n     DHL Phishing Email - Credentials Theft Example\n\n     In this phishing email, we see an attempt to steal users' email and\npassword. It was sent from the spoofed email address DHL Customer Support\n(info@emmc[.]ir), contained the subject \"DHL Shipment Notification :\nxxxxxxxxxx \"Out for delivery\" for 15 Dec 21\". The attacker was trying to\nlure the victim to click on a malicious link\n(http://reg[.]chaindaohang[.]com/wp-\ncontent/uploads/2021/07/dhl/index[.]php?i=i&amp;0=vegenat@vegenat[.]es) which\nredirects the user to a fraudulent DHL home page, that looks like the real\nwebsite. In the malicious link, the user was prompted to key-in their email\nand password.\n\n     As always, we encourage users to be cautious when divulging personal\ndata and credentials to business applications or websites, and to think\ntwice before opening email attachments or links, especially emails that\nclaim to be from companies such as DHL, Microsoft or Whastapp, as they are\nthe most likely to be impersonated.\n\n     Follow Check Point Research via:\nBlog: <a href=\"https://research.checkpoint.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://research.checkpoint.com</a>/\nTwitter: <a href=\"https://twitter.com/_cpresearch_\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/_cpresearch_</a>\n\n     About Check Point Research\nCheck Point Research (CPR) provides leading cyber threat intelligence to\nCheck Point Software customers and the greater intelligence community. The\nresearch team collects and analyzes global cyber-attack data stored on\nThreatCloud to keep hackers at bay, while ensuring all Check Point\nsolutions are updated with the latest protections. The research team\nconsists of over 100 analysts and researchers cooperating with other\nsecurity vendors, law enforcement and various CERTs.\n\n     About Check Point Software Technologies Ltd.\nCheck Point Software Technologies Ltd. (www.checkpoint.com) is a leading\nprovider of cyber security solutions to corporate enterprises and\ngovernments globally. Check Point Infinity's portfolio of solutions\nprotects enterprises and public organisations from 5th generation\ncyber-attacks with an industry leading catch rate of malware, ransomware\nand other threats. Infinity comprises three core pillars delivering\nuncompromised security and generation V threat prevention across enterprise\nenvironments: Check Point Harmony, for remote users; Check Point\nCloudGuard, to automatically secure clouds; and Check Point Quantum, to\nprotect network perimeters and datacenters, all controlled by the\nindustry's most comprehensive, intuitive unified security management. Check\nPoint protects over 100,000 organizations of all sizes.\n\n//st\n\n  MEDIA\n\n Contact Information:\n\nCONTACT:                      Contact:\n\n  Laura Martinez Hidalgo              Kip E. Meintzer\n\n  Check Point Software Technologies   Check Point Software Technologies\n\n  press@checkpoint.com                ir@us.checkpoint.com\n\n//et\n\nEmail : kip@checkpoint.com    CHECK POINT SOFTWARE TECHNOLOGIES LTD\nWWW   : <a href=\"https://www.checkpoint.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.checkpoint.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201600437.MNPRE2201600953-06102220220117</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}