{"date": "2021-11-23 05:01:00.166000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Richemont Selects AWS as Its Preferred Cloud Provider to Drive Product Innovation</b>\n</p><p class=\"bwalignc\">\n<span>Global luxury goods leader modernizes its infrastructure with AWS to offer exclusive customer experiences and drive efficiencies across its global operations</span>\n</p><p>\nToday, Amazon Web Services, an Amazon.com, Inc. company (NASDAQ: AMZN), announced that Compagnie Financière Richemont SA (SIX: CFR), a Swiss luxury group and owner of prestigious brands and businesses recognized for their excellence in jewelry, watches, fashion and accessories, including Cartier, Montblanc, IWC Schaffhausen, and Van Cleef &amp; Arpels, is moving its entire enterprise IT infrastructure to AWS. Richemont will close its European data centers and migrate additional data centers in Hong Kong and the U.S. to AWS by the end of 2022. As part of its digital transformation strategy, the company will move more than 5,000 virtual machines and 120 SAP instances to AWS to modernize its infrastructure, raise its security posture, and drive automation across its global operations.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211122005617/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211122005617/en/</a></p><p>\nRichemont’s cloud-first strategy includes migrating its business-critical enterprise IT applications and enterprise resource planning, accounting, supply chain management, manufacturing, product lifecycle management, and ecommerce systems to AWS. With AWS, the luxury goods company will use a wide range of advanced cloud capabilities, including machine learning, analytics, security, and database, to foster product innovation across its physical retail operations and ecommerce offerings. As part of its five-year roadmap, Richemont will develop cloud-based systems that provide engaging customer experiences via digitally optimized channels that use machine learning. Using AWS technologies, Richemont is innovating dynamic digital experiences for its ecommerce platform faster, including personalized storefronts and styling services, video chat consultations featuring fashion shows customized to the shopper’s tastes, and tailored offers for early access to new items before they hit stores.\n</p><p>\nRichemont will also increase its use of AWS Marketplace, a digital catalog that makes it easy for organizations to discover, procure, entitle, provision, and govern third-party software. Richemont can access the top-tier solutions available in AWS Marketplace to scale, curate, and further personalize the shopping experience on its mobile and online channels. Richemont will also use the AWS Skills Guild (a comprehensive skills enablement program) to provide training and certification for its IT employees to help build cloud fluency across its organization. These training opportunities will help the company further its ability to operate as a product-focused organization, drive efficiencies, and gain speed and agility in meeting business and customer needs.\n</p><p>\n“AWS is integral to our enterprise IT transformation as we look for better ways to serve our customers, streamline the way we work, and compete globally,” said Kim Hartlev, Group Chief Information Officer at Richemont. “AWS, with its proven experience and highly performant global infrastructure, will deliver the agility, security, and scalability that we need to launch new business processes and new service models. AWS’s unparalleled pace of innovation and broad portfolio of services, including analytics and machine learning, will help us gain greater insights and become an even more agile company in the cloud.”\n</p><p>\n“Richemont is using AWS to drive change within its organization, which will result in the delivery of new applications and services to create exceptional customer experiences,” said Greg Pearson, Vice President, Worldwide Commercial Sales at Amazon Web Services, Inc. “For more than 100 years, Richemont and its Maisons have had a relentless focus on quality, innovation, and premium service. AWS’s comprehensive set of capabilities will help Richemont reimagine the luxury shopping experience in the digital world, offering exclusive virtual experiences and personalized service for its global clientele.”\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52535886&amp;newsitemid=20211122005617&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=1&amp;md5=8c7984b4db2cfddd9d6bd86bbd611ef2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2F&amp;esheet=52535886&amp;newsitemid=20211122005617&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=2&amp;md5=39a1272a975bc70edb6a038cf0062116\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p>\n<b>About Richemont</b>\n</p><p>\nAt Richemont, we craft the future. Our unique portfolio includes prestigious Maisons distinguished by their craftsmanship and creativity, alongside Online Distributors that cultivate expert curation and technological innovation to deliver the highest standards of service. Richemont’s ambition is to nurture its Maisons and businesses and enable them to grow and prosper in a responsible, sustainable manner over the long term.\n</p><p>\nRichemont operates in four business areas: Jewellery Maisons with Buccellati, Cartier and Van Cleef &amp; Arpels; Specialist Watchmakers with A. Lange &amp; Söhne, Baume &amp; Mercier, IWC Schaffhausen, Jaeger-LeCoultre, Panerai, Piaget, Roger Dubuis and Vacheron Constantin; Online Distributors with Watchfinder &amp; Co., NET-A-PORTER, MR PORTER, YOOX, THE OUTNET and the OFS division; and Other, primarily Fashion &amp; Accessories Maisons with Alaïa, AZ Factory, Chloé, Delvaux, dunhill, Montblanc, Peter Millar, Purdey and Serapian. Find out more at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.richemont.com&amp;esheet=52535886&amp;newsitemid=20211122005617&amp;lan=en-US&amp;anchor=www.richemont.com&amp;index=3&amp;md5=02f16fae4cfe0ea5ad01c51ad2355612\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.richemont.com</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211122005617r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTIyMDA1NjE3cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=72628bbce704c86be8993fd4058c700532cb5a0550fc46d270af48c958840f6046604bef7a3ca541cfab3fad0b65830d05775891c6875fe1cd8fd0dd2bf9db86\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211122005617/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211122005617/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52535886&amp;newsitemid=20211122005617&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=4&amp;md5=d9b5c4f88938d73e69dbfe435f75279a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}