{"date": "2022-02-01 19:34:07.234000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Sprinklr, the unified customer experience management platform (Unified-CXM) for modern enterprises, has launched in AWS Marketplace - a digital catalog with thousands of software listings from independent software vendors that make it easy to find, test, buy, and deploy software that runs on Amazon Web Services (AWS) - further strengthening its long-standing relationship with AWS.</p><p>AWS customers can now consolidate billing, simplify procurement, and realize faster time-to-value by leveraging Sprinklr to help create insight-driven strategies and better customer experiences.Procuring Sprinklr in AWS Marketplace will also qualify against existing enterprise discount program (EDP) commitments, helping to streamline budgeting while procuring best-in-class CXM software.\"Sprinklr customers now have the option to get started even more easily with availability in the AWS Marketplace,\" said Doug Balut, Senior Vice President of Global Alliances at Sprinklr. \"We are committed to helping organizations tackle digital customer experience management challenges with a platform that offers a more unified experience that is easy to procure, deploy, and quickly creates value.\"With advanced artificial intelligence (AI) built for the enterprise, Sprinklr helps the world's most iconic brands unify all customer-facing functions and teams -- from care to marketing -- across businesses and brands, and markets globally, on more than 30 digital channels. By shifting from siloed point solutions to a unified approach, brands can create better experiences for consumers across all channels, enable cross-team collaboration across the entire enterprise, and realize significant savings.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}