{"date": "2021-10-01 20:28:09.919000+00:00", "ticker": "III", "mrkt_info": {"open": 1281.5, "close": 1252.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Sept. 28 -- HPCL Biofuels Limited has invited applications to fill 255 vacancies in various management, non-management and seasonal positions on a fixed term contract basis. The application process is underway and the last date to apply in the prescribed format is October 16 by 6 pm.</p><p>HPCL Biofuel Limited recruitment age limit: The minimum age of the candidates should be 18 years and the maximum age of the candidates applying for the management post should be 57 years and for non-management and seasonal positions is 55 years.</p></div><div class=\"tr-npp-body\"><p>HPCL Biofuel Limited recruitment selection process: For management positions, the eligible candidates fulfilling all the required criteria will be interviewed through telephonic / Skype / Video Conferencing. For Non-Management &amp; Seasonal position the eligible candidates fulfilling all the required criteria shall be selected on the basis of only merit list &amp; skill test as &amp; where applicable. Candidates can check the details on the notification given below.</p><p>HPCL Biofuel Limited recruitment: How to apply</p><p>Candidates have to submit their application and negotiation form duly filled along with CV, Self attested copies of all the relevant documents by Post to HPCL Biofuels Ltd., House No. - 9, Shree Sadan. -Patliputra Colony, Patna - 800013, so as to reach latest by 16th October 2021. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}