{"date": "2021-11-24 19:43:17.870000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.04, "close": 3504.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Cincinnati/Northern Kentucky International Airport (CVG) in the US has collaborated with process automation firm TaskWatch and AWS Panorama for deploying custom computer vision applications to boost operational efficiency.</p><p>Last year, CVG piloted the application of analytics to video feeds and integration into the TaskWatch wearable platform.CVG has now implemented TaskWatch for its various operational areas to help connected staff members give real-time responses to events identified by computer vision.TaskWatch records video streams and identifies events that are defined by the airport operations team with AWS Panorama.In case of anomalies, the system sends an alert to the employees with a TaskWatch wearable device to take action.With such tracking abilities, CVG aims to ensure smooth operations at the airport and provide up-to-date travel information to travellers.Implementation of the new automation technology is said to help CVG overcome the limited infrastructure hurdles.CVG chief innovation officer Brian Cobb said: \"CVG Airport is committed to providing a world-class travel experience through continuous innovation and strategic partnerships.\"Using TaskWatch's computer vision platform with AWS Panorama, we can bring computer vision to our existing IP cameras to automatically monitor congestion for more than 70,000ft2 of airport traffic lanes.\"Once TaskWatch detects an issue such as a disabled vehicle, TaskWatch sends real-time alerts to airport staff so they can provide assistance, keep the traffic flowing and reduce delays for our passengers.\"TaskWatch said that with the optimum usage of advancements of computer vision and artificial intelligence, it intends to reduce operational deficiencies at CVG airport.TaskWatch co-founder and operations head Vivek Saini said: \"With AWS Panorama and our new computer vision platform, TaskWatch is allowing non-technical enterprise customers to design, build and deploy custom AI applications.\"TaskWatch also connects frontline workers to CV events so business risks are mitigated right away and there are enhanced operational efficiencies across business verticals.\"In February, CVG Airport trialled an autonomous tractor for its luggage area.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}