{"date": "2022-02-08 01:21:20+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 7 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A federal judge on Monday sided with Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> in dismissing a discrimination lawsuit that workplace organizer Christian Smalls had filed against his former employer.</p><p>U.S. District Judge Rachel Kovner rejected Smalls' claim that Amazon had fired him because he is Black and had opposed discriminatory COVID-19 policies.</p><p>Smalls' <a href=\"https://www.reuters.com/article/us-health-coronavirus-amazon-com-lawsuit-idCAKBN27S34E\" data-type=\"url\" class=\"tr-link\" translate=\"no\">allegation</a> that Amazon subjected a largely non-white workforce to conditions inferior to that of its mostly white managers, by failing to provide necessary protective gear, failed on the merits as well, Kovner said.</p><p>Smalls had no immediate comment. Amazon did not immediately comment.</p><p>The online retailer terminated Smalls in March 2020, saying he joined a protest at its warehouse on New York City's Staten Island despite being on paid quarantine from close contact with a person diagnosed with COVID-19.</p><p>In the months since, Smalls has led an organizing campaign at the warehouse to create what he and peers call the Amazon Labor Union and demand safer conditions, higher wages and job security. The U.S. National Labor Relations Board <a href=\"https://www.reuters.com/business/retail-consumer/amazon-workers-meet-requirements-hold-union-election-new-york-warehouse-nlrb-2022-01-26\" data-type=\"url\" class=\"tr-link\" translate=\"no\">said last month</a> that the group could proceed with a union election.</p><p>Smalls' firing <a href=\"https://www.reuters.com/technology/new-york-accuses-amazon-backsliding-over-worker-safety-seeks-monitor-2021-11-30\" data-type=\"url\" class=\"tr-link\" translate=\"no\">has remained an issue</a> for New York state Attorney General Letitia James, who wants a court order requiring his reinstatement. Smalls has the option to file an amended complaint within 30 days, as well.</p><p>The case is Smalls v Amazon Inc, U.S. District Court, Eastern District of New York, No. 20-05492.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Jeffrey Dastin in Palo Alto, California, and Jonathan Stempel in New York; Editing by Leslie Adler)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Jeffrey.Dastin@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Jeffrey.Dastin@thomsonreuters.com</a> ; +1 424 434 7548; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-LAWSUIT/ (PIX)</p></div>"}