{"date": "2021-11-20 10:57:42+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3696.06, "close": 3572.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\">\n<li><span>With deep discounts across electronics, home, kitchen, beauty, fashion, sports, and more with top brands including</span> <span>Samsung, Bose, Moulinex, Hugo Boss, adidas, Michael Kors, and more</span></li>\n<li><span> </span><span>Amazon.sa Prime members will enjoy 24-hour early access to a range of White Friday deals,</span> <span>along with Free One-Day delivery across eligible items and areas, and free international shipping from Amazon US on orders over SAR 100</span></li>\n<li><span> </span><span>Prime members and customers can save more when shopping White Friday deals on Amazon.sa using Mastercard cards</span></li>\n</ul>\n<p><span> </span>Saudi Arabia — Today, Amazon.sa revealed some of the incredible savings that customers can expect from its biggest sale of the year, White Friday, running for eight days from November 22<sup>nd</sup> to November 29<sup>th</sup> with deep discounts of up to 70% across electronics, fashion, sports, beauty, kitchen, home, and more. Prime members on Amazon.sa will also enjoy a full 24-hour early access to the sale from midnight on November 21<sup>st</sup>. Customers can become a Prime member and sign up for the free 30-day trial on www.amazon.sa/prime to be the first to get their hands on White Friday deals, and explore the membership’s range of shopping and entertainment benefits.</p>\n<p>The White Friday sale on Amazon.sa gives customers a fun way to discover limited time finds paired with some of the most exciting discounts on a range of local and international brands such as Samsung, Bose, Moulinex, Hugo Boss, adidas, Michael Kors, and more. Amazon.sa customers using MasterCard cards will get an additional instant 10% discount off on eligible orders of up to SAR 50, when using the code 10MC on White Friday orders between November 22nd and 29<sup>th</sup> while Prime members will be eligible for an additional 5% discount, resulting in a total discount of up to 15%, when using the code 5MC, after having redeemed the discount from the 10MC code.  Prime members on Amazon.sa using their Mastercard card with code MC15, will also enjoy up to 15% off on White Friday orders during their exclusive early access to the sale on November 21st.</p>\n<p>Abdo Chlala, Director of Marketing and Prime, Amazon Middle East and North Africa (MENA), said: “Over the past few years, White Friday has become one of our most exciting shopping events for customers in Saudi Arabia as they save millions of Saudi Riyals while they enjoy thousands of deals. This year is no different - working with our selling partners, top local and international brands, local Small to Medium-sized Businesses, and banking partners, we are once again delivering some of the steepest savings of up to 70% for our customers, with deals across all product categories, ensuring there is something for everyone to enjoy during White Friday. With eight days packed with discounts, this is our longest White Friday to date in Saudi Arabia, and we hope customers and Prime members enjoy the sale as we offer new deals for them throughout the event.”</p>\n<p>More than half of what is sold on Amazon around the world comes from third-party sellers, most of which are small to medium-sized businesses, and this is no different on Amazon.ae. This White Friday, customers looking to discover and support local businesses can also visit the Amazon.sa local storefront, a curated collection that connects independent sellers and shoppers, that will be featuring White Friday deals on a growing list of Saudi-based small businesses.</p>\n<p><strong>White Friday Deals on Amazon.sa</strong></p>\n<p>The White Friday sale will feature incredible savings for customers. Here is a selection of some of the best White Friday sale deals shoppers in Saudi Arabia can expect:</p>\n<p><strong>Electronics</strong></p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Save 52% on SoundPeats and Sony headphones</li>\n<li>Save up to 26% on Samsung smartphones including the Samsung Galaxy M11, M12, S21, M52, and more</li>\n<li>Save up to 20% on Bose headphones, earbuds, TV speakers, and audio sunglasses</li>\n<li>Save up to 11% on Microsoft Surface Tablets</li>\n<li>Save up to 10% on Samsung and Sony TVs<strong> </strong></li>\n</ul>\n<p><strong>Amazon Devices</strong></p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Save up to 40% on the Kindle Paperwhite</li>\n</ul>\n<p><strong>Gaming</strong></p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Save up to 39% on Oculus Virtual Reality headsets</li>\n<li>Save up to 38% on the Xbox Series S Console</li>\n<li>Save up to 13% on gaming PCs, performance cooling fans, graphic cards, and more gaming products from Colorful, Zotac and Zord<strong> </strong></li>\n</ul>\n<p><strong>Home &amp; Kitchen</strong></p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Save up to 38% on Tefal pots and pans, pressure cookers, grills, and vacuum cleaners</li>\n<li>Save up to 34% on Black+Decker coffee machines and air fryers</li>\n<li>Save up to 28% on Nikai coffee machines, refrigerators, and washing machines</li>\n<li>Save up to 23% on Philips air purifiers, vacuum cleaners, coffee machines, air fryers, food choppers, and more</li>\n<li>Save up to 23% on Clikon washing machines and microwaves</li>\n<li>Save up to 16% on Moulinex kitchen appliances</li>\n</ul>\n<p><strong>Beauty and Personal Care</strong></p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Save up to 68% on skin and hair care essentials from L’Oreal Paris, Neutrogena, Tresemme, The Body Shop, and more</li>\n<li>Save up to 38% on Babyliss hair straighteners</li>\n<li>Save up to 33% on Philips hair straighteners and body groomers</li>\n<li>Save up to 18% on perfumes from Davidoff, Hugo Boss, and more</li>\n</ul>\n<p><strong>Fashion</strong></p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Save up to 41% on Tommy Hilfiger watches and accessories</li>\n<li>Save up to 27% on Michael Kors bags and wallets</li>\n<li>Save up to 23% on apparel from Hugo Boss, Under Armour, and more</li>\n<li>Save up to 22% on footwear from adidas, Skechers, Nike, and more</li>\n</ul>\n<p><strong>Sports &amp; Fitness</strong></p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Save up to 22% on Skyland treadmills and home workout equipment</li>\n<li>Save up to 18% on PowerMax treadmills<strong> </strong></li>\n</ul>\n<p><strong>Toys and Books</strong></p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Save up to 48% on LEGO creative bricks</li>\n<li>Save up to 42% on the Harry Potter Box Set</li>\n<li>Save up to 31% on the Percy Jackson and the Olympians box set</li>\n<li>Save up to 27% on Bird and Ninebot electric scooters and segways<strong> </strong></li>\n</ul>\n<p><strong>Enjoy Amazon US Deals on Amazon.sa via Global Store</strong></p>\n<p>Customers on Amazon.sa can also shop thousands of Amazon US deals during the White Friday sale by clicking on Global Store on the website or International Shopping on the app. Deals include:</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Baby – Save up to 35% on items from Philips Avent, Munchkin, Chicco and more</li>\n<li>Beauty – Save up to 45% on items from Cantu, Cetaphil, and more</li>\n<li>Electronics – Save up to 30% on items from Jabra, SanDisk, HyperX and more</li>\n<li>Fashion – Save up to 25% on items from Champion, Anne Klein watches, and more</li>\n</ul>\n<p><strong>Prime members on Amazon.sa</strong> can enjoy 24-hour early access to the White Friday sale from midnight on November 21<sup>st</sup> and enjoy a range of other membership benefits, including:</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Free One-Day Delivery – Order today, get items tomorrow with our free one-day delivery promise on eligible products, with no minimum purchase.</li>\n<li>Free Delivery from Amazon US via the Amazon.sa Global Store – Save on shipping with free delivery for international orders over SAR 100 on Prime-eligible products shipped via Global Store</li>\n<li>Binge-worthy entertainment – Enjoy unlimited access to Prime Video, where members can stream or download thousands of award-winning movies and TV series, including Amazon Originals<span>.</span><span> </span></li>\n</ul>\n<p>Customers can make their White Friday shopping experience even easier by downloading the Amazon shopping app to browse and shop the best White Friday sale deals or shop directly on the website at Amazon.sa. All Amazon.sa deliveries can be paid through online payment options including credit and debit cards or Amazon.sa Gift Cards, which also offer an easy, simple, and convenient gifting experience to friends and family.  </p>\n<p>-Ends-</p>\n<p><strong>About Amazon:</strong></p>\n<p><span>Amazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"http://www.amazon.com/about\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/about</a> and follow @AmazonNews.</span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}