{"date": "2021-12-28 11:35:36.608000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3393.39, "close": 3384.02}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Swadeshi Jagran Manch (SJM) alleged that Amazon gave preferential treatment to a select group of sellers, including Cloudtail and Appario, bypassing Indian FDI Regulations.</p><p>Months after RSS-affiliated magazine Panchjanya attacked Amazon for alleged corrupt practices and promoting Christianity in India, Sangh associate Swadeshi Jagran Manch (SJM) demanded that all permissions granted to Amazon and Flipkart to operate in India be withdrawn.</p></div><div class=\"tr-npp-body\"><p>In a resolution, titled 'Withdraw Permissions to Amazon, FlipKart-Walmart to Operate in Bharat', passed during its two-day Rashtriya Sabha which concluded on December 26, the SJM said, \"All the permissions given to these companies be withdrawn forthwith and all their activities be declared illegal.\"</p><p>Demanding a CBI enquiry into the affairs of the companies, SJM said, \"As soon as there is a trace of government officers, including people sitting in the high offices, gaining from these companies, directly or indirectly, they should be sent on leave to facilitate fair investigation of the whole matter; and be punished for their offenses.\"</p><p>SJM also alleged that Amazon had bribed officials in India.</p><p>In September this year, Panchjanya had carried a cover story on Amazon where the retail giant had been equated with the East India Company for its alleged corrupt practices and criticised for assaulting Hindu values through Prime Videos. The magazine had also accused the company of allegedly being involved in \"Chritianising\" India and funding two Christian organisations.</p><p>\"Multinational e-commerce companies such as Amazon and Walmart/Flipkart are blatantly contravening and operating uncontrolled in India. It's well known that Amazon and Flipkart hold 80% of online space. Discounts offered by them are adversely impacting offline markets also. They are luring customers by offering high discounts, advertising aggressively to communicate such offers to the general public. Public is attracted to them more for discounts than convenience. This trend is adversely impacting the neighbourhood shops and kirana stores,\" SJM said.</p><p>Accusing Amazon of alleged corruption, SJM said, \"Payment of bribes by way of legal and commercial fees is no new method. Amazon has hired many law firms for its legal business activities. Amazon pays huge legal fees to these law companies and after that these companies transfer that fee to some other company and after that a link is formed and finally the final legal company or lawyer or any professional withdraws the amount in cash to the concerned official.\"</p><p>\"This also proves that all licenses and permissions obtained by such companies were obtained fraudulently using unfair means,\" it added.</p><p>According to SJM, there has been a demand for a long time that e-commerce companies be compelled to audit their financial documents and make them public. \"But these companies avoided making their documents public,\" it said.</p><p>The outfit alleged that Amazon gave preferential treatment to a select group of sellers, including Cloudtail and Appario, bypassing Indian FDI Regulations and scooped up data from its own sellers to launch competitive products and brands such as Solimo and Amazon Basics.</p><p>\"Amazon in India has become so powerful that it can pick winners or losers, destroy small businesses, raise prices on consumers and put employees out of work,\" SJM said, claiming that for every job that Amazon creates it destroys ten others.</p><p>\"Amazon meets with startups with proposals to invest, then launches competing products that are highly detrimental to growth of the startups as well as the culture of entrepreneurship in the country. Amazon is on a spree to acquire brick and mortar retail outlets along with its e-commerce retail activities. Its investment in Shoppers Stop and More retail chain are some major steps in this direction,\" SJM said.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}