{"date": "2022-02-17 17:31:56+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3162.01, "close": 3052.03}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are her own.</p><p class=\"tr-by\">By Jennifer Saba</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Feb 17 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>Walmart’s <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> wheelhouse is attracting thrifty consumers by keeping prices in check. Those skills served the $375 billion retailer well in the fourth quarter, when it <a href=\"https://corporate.walmart.com/media-library/document/q4-fy22-earnings-release/_proxyDocument?id=0000017f-0521-deb8-ab7f-372d1d5a0000\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ably juggled</a> inflation and supply-chain pressures. Chief Executive Doug McMillon is now pushing into high-margin advertising and encouraging customers to pay for subscriptions. That will take him closer to Amazon.com’s <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> turf where he will find it harder to shine. </p><p>Walmart on Thursday reported better-than-expected revenue for the fourth quarter, with the top line rising nearly 1% from a year earlier to $153 billion. Despite clogged supply chains and rising employee costs related to Covid-19, costs and expenses increased by a little less than that, pushing operating income up 7%. </p><p>A surge in inflation, which hit a four-decade high <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2UL3ON\" data-type=\"storyId\" data-story-id=\"nL4N2UL3ON\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> in the United States, is making shoppers, even those in higher income brackets, keener on a bargain. Walmart expects its U.S. sales excluding fuel will increase 3% this year. On an earnings call, Walmart executives were cagey about price increases but said they were cutting prices on some items. Given the retailer faces rising costs, it will have to absorb some of the pain. At least its size and muscle with suppliers will limit the damage.</p><p>But McMillon is also moving Walmart outside its comfort zone. The company made $2 billion in advertising revenue last year and said it wants to become a top 10 player in the ad market. The ambition is understandable given margins are chunky in this business. For instance, Meta Platforms’<a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> Facebook, for all its recent woes, generated a 54% EBITDA margin last year. </p><p>And Walmart is hoping customers will sign up for a subscription plan that costs $98 a year and offers discounts on gas and prescriptions, promotions, and free shipping. The company declined to disclose how many customers have signed up to this scheme but it plans to expand home delivery to 30 million American households this year. This is bringing it closer to Amazon’s domain. The e-commerce giant’s ad revenue surpassed $30 billion last year and it raked in nearly $32 billion in sales from its subscription services, which includes over 200 million Prime memberships. McMillon’s efforts to diversify his business is understandable. But for all its talents, Walmart may find it hard to flourish in Amazon’s shadow.</p><p>Follow <a href=\"https://twitter.com/jennifersaba\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@jennifersaba</a> on Twitter</p><p>         </p><p>CONTEXT NEWS </p><p>-  Walmart said on Feb. 17 that fourth-quarter revenue rose 0.5% from a year earlier to $152.9 billion. U.S. sales excluding fuel increased 5.6% year-over-year.</p><p>- Earnings attributable to Walmart were $3.6 billion, or $1.28 per diluted share, compared with a loss of $2.1 billion during the same period a year earlier. </p><p>- Analysts had on average expected revenue of $151.5 billion, according to Refinitiv.  </p><p>- Walmart said revenue from its global advertising business reached $2.1 billion in the year.</p><p><br/></p><p class=\"tr-signoff\"> (Editing by Swaha Patttanaik and Sharon Lam)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=SABA/\" data-type=\"newsExpression\" data-expression=\"SABA/\" translate=\"no\" dir=\"ltr\">SABA/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:jennifer.saba@thomsonreuters.com\" data-type=\"email\" translate=\"no\">jennifer.saba@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://jennifer.saba.thomsonreuters.com@reuters.net\">jennifer.saba.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WALMART-RESULTS/BREAKINGVIEWS</p></div>"}