{"date": "2021-11-27 06:25:41.592000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3504.56, "close": 3507.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Ambulance callouts to <a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> warehouses across the UK tend to jump by almost half during November and December, a trade union investigation alleges.</p><p><a href=\"https://www.independent.co.uk/topic/gmb\" data-type=\"url\" class=\"tr-link\" translate=\"no\">GMB</a> , which obtained information using Freedom of Information (FoI) requests, claimed a rise of almost 50 per cent in emergency callouts coincided with the run up to Black Friday.</p></div><div class=\"tr-npp-body\"><p>Amazon said most ambulance callouts to its buildings were related to pre-existing conditions.</p><p>The union said monthly data from four NHS ambulance trusts that cover major Amazon sites in the northwest of England, the East Midlands, London, and Wales showed that, over a five-year period, November was the worst month for emergency callouts, with demand growing by 46 per cent from the previous month.</p><p>Averaged over a five year period, there were 67 callouts during the month of November and 59 in December, versus a low of 24 in April.</p><p>The union suggested the surge in ambulance callouts came as \"workers desperately race to hit their crushing targets\".</p><p>But a spokesperson for Amazon UK dismissed the figures as \"incomplete\" and said they did not capture whether or not ambulance callouts were for injuries that occurred in the workplace.</p><p>\"Once again, our critics are using incomplete information that's without context and designed to intentionally mislead,\" the spokesperson said.</p><p>\"We know we're not perfect and are continuing to get better every day, but the fact is that Amazon has 40 per cent fewer injuries on average compared to other transportation and warehousing businesses in the UK.</p><p>\"The vast majority of ambulance call outs to our buildings are related to pre-existing conditions, not work-related incidents, and as a responsible employer we will always call an ambulance if someone requires medical attention.</p><p>\"Rather than arguing with critics who aren't interested in facts or progress, we're going to keep listening to our 55,000 employees, taking their feedback, and working hard to keep investing and improving for the long run.\"</p><p>The GMB figures were revealed as the union prepared to stage protests outside Amazon sites across the UK on Friday, in Coalville, Coventry, Peterborough and London.</p><p>Mick Rix, GMB national officer, said: \"While most people enjoy their Black Friday bargains, Amazon workers are being pushed beyond the limits of human endurance.</p><p>\"Each year, ambulance call outs to Amazon sites rocket as workers desperately race to hit their crushing targets.</p><p>\"The horrific evidence is here in black and white – ambulance crews are called out to Amazon sites almost 50 per cent more in November.</p><p>\"Workers are breaking bones, being left in pain at the end of a shift and getting barred from work for raising covid complaints.\"</p><p>He added that it was \"time for Amazon [to] sit down with their workers' union GMB and make Amazon a great, safe place to work\".</p><p>Earlier this week, the <span>Daily Mirror</span> reported that there were 971 ambulance callouts to 24 Amazon warehouses between January 2018 and August 2021 – amounting to five a week.</p><p>Last year, a separate investigation found more than 600 people working in Amazon warehouses had been seriously injured or narrowly avoided an accident over the preceding three years.</p><p>The figures, also obtained by GMB, revealed a case involving a worker who was knocked unconscious and stopped breathing.</p><p>Amazon responded at the time that their facilities were safe places to work. \"Yet again, our critics seem determined to paint a false picture of what it's like to work for Amazon,\" a spokesperson for the company said.</p><p>Amazon achieved worldwide sales worth more than $4.8bn (£3.6bn) from Black Friday to Cyber Monday in 2020, an increase of more than 60 per cent over the previous year.</p><p>Data from Statista shows £9.42bn is expected to be spent over the Black Friday weekend this year in the UK alone.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/afghan-exodus-refugee-immigration-eric-holcomb-department-of-homeland-security-department-of-defense-b1963228.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Timeline extended for resettling Afghan refugees in Indiana</a> </p><p><a href=\"https://www.independent.co.uk/news/alan-shepard-blue-origin-jeff-bezos-new-york-william-shatner-b1962821.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Good Morning America's Strahan among Blue Origin crew</a> </p><p><a href=\"https://www.independent.co.uk/news/world/europe/amazon-apple-italian-european-union-beats-b1962727.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Italian competition watchdog fines Apple, Amazon $225M</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/us-politics/bezos-obama-foundation-gift-donation-b1962512.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Bezos's $100m gift to Obama Foundation will fund leadership training</a> </p><p><a href=\"https://www.independent.co.uk/news/amazon-germany-berlin-b1962395.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon to cut down plastic packaging in Germany</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/obama-john-lewis-barack-obama-valerie-jarrett-ceo-b1962265.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Bezos makes gifts to Obama foundation and NYU medical center</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}