{"date": "2021-11-24 16:11:27.980000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.04, "close": 3504.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PLUG POWER INC (\"PLUG-Q\")\n- Selects Germany's Port of Duisburg as Location of European\n- Headquarters\n\n     Plug Power Inc. a leading provider of turnkey hydrogen solutions for\nthe global green hydrogen market, announced its European headquarters will\nbe located in the Port of Duisburg, North Rhine-Westphalia, Germany.\n\n     With a significant presence in Europe for more than ten years, Plug\nPower is accelerating its investment on the continent to develop and grow\nthe green hydrogen economy through a new European headquarters. Duisburg,\nthe world's largest inland port, offers the company direct maritime supply\nchain connections to Antwerp, Belgium and Rotterdam, Netherlands.\n\n     This location will allow Plug Power to capitalize on the major assets\nof the Duisburg region's industrial area, including a large concentration\nof logistics and transport customers and a highly skilled workforce.\nDuisburg has also been elected as one of three hydrogen technology capital\ncities in Germany, giving Duisburg a decisive role in the German energy\ntransition. As such, Plug Power is establishing itself at the center of the\nEuropean hydrogen ecosystem and will be well positioned to contribute to\nthe development of future green hydrogen applications.\n\n     \"Plug Power intends to play an important role in the development of\ngreen hydrogen in Europe and to contribute significantly to the European\nhydrogen strategy,\" said Andy Marsh, Plug Power CEO. \"Our establishment of\na headquarters in the Port of Duisburg supports our ambitious objectives\nfor leading the build-out of a global green hydrogen ecosystem.\"\n\n     Markus Bangen, CEO of duisport, also emphasized the importance of the\nsettlement for the port and the region: \"Sustainability is a decisive\neconomic factor. duisport has been working for years to establish\nclimate-neutral transport structures and to actively shape the energy\ntransition in the region's transport and logistics sector. Hydrogen will\ntake on a central role in the future and is a critical element for the\nindustrial and logistics industries in the state of North Rhine-Westphalia\nand the Port of Duisburg. We are, therefore, very pleased to welcome Plug\nPower's European headquarters to the Port of Duisburg, advancing the\ndevelopment of this location as the center of hydrogen in Germany and NRW.\"\n\n     The Mayor of the City of Duisburg, Soren Link, explained: \"The\nlocation of Plug Power's European headquarters in the Port of Duisburg\nunderscores the international importance of the Rhine-Ruhr metropolitan\nregion. The city of Duisburg, one of the most important business locations\nin NRW, is setting the course for an energy transformation. Both the\nHydrogen Innovation and Technology Center and Plug Power's new European\nheadquarters will create value for the port city. We look forward to\ncontinually developing Duisburg together.\"\n\n     The initial 70,000-square-foot facility will house an innovation\ncenter with engineering labs, a monitoring, diagnostics and technical\nsupport center, an on-site electrolyzer enabling green hydrogen production,\nan inventory and logistics center, and a training space. The extensive\nlogistics areas of the Port of Duisburg can accommodate future expansions,\nenabling the company to meet its rapid growth plans in Europe.\n\n     About Plug Power Inc.\nPlug Power is building the hydrogen economy as the leading provider of\ncomprehensive hydrogen fuel cell (HFC) turnkey solutions. The Company's\ninnovative technology powers electric motors with hydrogen fuel cells amid\nan ongoing paradigm shift in the power, energy, and transportation\nindustries to address climate change and energy security, while providing\nefficiency gains and meeting sustainability goals. Plug Power created the\nfirst commercially viable market for hydrogen fuel cell (HFC) technology.\nAs a result, the Company has deployed over 50,000 fuel cell systems for\ne-mobility, more than anyone else in the world, and has become the largest\nbuyer of liquid hydrogen, having built and operated a hydrogen highway\nacross North America. Plug Power delivers a significant value proposition\nto end-customers, including meaningful environmental benefits, efficiency\ngains, fast fueling, and lower operational costs. Plug Power's\nvertically-integrated GenKey solution ties together all critical elements\nto power, fuel, and provide service to customers such as Amazon, BMW, The\nSouthern Company, Carrefour, and Walmart. The Company is now leveraging its\nknow-how, modular product architecture and foundational customers to\nrapidly expand into other key markets including zero-emission on-road\nvehicles, robotics, and data centers.\n\n     About Duisburger Hafen AG\nMORE THAN A PORT. Duisburger Hafen AG (duisport) owns and manages the Port\nof Duisburg, the world's largest inland port. For this port and logistics\nlocation, the duisport Group offers full-service packages in the area of\ninfra- and suprastructure, including relocation management. In addition,\nthe subsidiaries also provide logistics services, such as the development\nand optimization of transport and logistics chains, rail freight services,\nbuilding management, contract and packing logistics.\n\n     Plug Power Safe Harbor Statement\nThis communication contains \"forward-looking statements\" within the meaning\nof the Private Securities Litigation Reform Act of 1995 that involve\nsignificant risks and uncertainties about Plug Power Inc.(\"PLUG\"),\nincluding but not limited to statements about PLUG's expectations regarding\nits multi-year investment and growth, PLUG's clean hydrogen technology and\nfuel cell solutions playing a critical role in achieving climate and\ndecarbonization goals, deepening of relationships with key stakeholders,\nand acceleration of demand and adoption of hydrogen technology. You are\ncautioned that such statements should not be read as a guarantee of future\nperformance or results, and will not necessarily be accurate indications of\nthe times that, or by which, such performance or results will have been\nachieved. Such statements are subject to risks and uncertainties that could\ncause actual performance or results to differ materially from those\nexpressed in these statements. For a further description of the risks and\nuncertainties that could cause actual results to differ from those\nexpressed in these forward-looking statements, as well as risks relating to\nthe business of PLUG in general, see PLUG's public filings with the\nSecurities and Exchange Commission, including the \"Risk Factors\" section of\nPLUG's Annual Report on Form 10-K for the year ended December 31, 2020.\nReaders are cautioned not to place undue reliance on these forward-looking\nstatements. The forward-looking statements are made as of the date hereof,\nand PLUG undertakes no obligation to update such statements as a result of\nnew information.\n\nContact Information:\n\nDuisburger Hafen AG (duisport)\npresse@duisport.de\nAndreas Bartel +49 203 803-4465\n\nPlug Power\nplugpower@clai2.com\nValentine Serres +33 7 78 41 45 91\nAgnes Loubiere +33 6 73 16 88 53\n\nTel   : 1-518-782-7700    PLUG POWER INC\nEmail : investors@plugpower.com\nWWW   : <a href=\"https://www.plugpower.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.plugpower.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132700559.MNPRE2132701666-08024920211124</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}