{"date": "2021-11-29 17:00:27.480000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">BOSTON, Nov. 29, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span>With one single SQL query, Starburst customers can analyze data across cloud platforms including AWS</span></p>\n  <p><span><span class=\"xn-location\">BOSTON</span></span>, <span class=\"xn-chron\">Nov. 29, 2021</span> /PRNewswire/ -- <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3370235-1&amp;h=2481999943&amp;u=https%3A%2F%2Fc212.net%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D3134160-1%26h%3D1491546322%26u%3Dhttps%253A%252F%252Fwww.starburst.io%252F%26a%3DStarburst&amp;a=Today+at+AWS+re%3AInvent\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Today at AWS re:Invent</a> hosted by Amazon Web Services, Inc. (AWS), <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3370235-1&amp;h=413747285&amp;u=https%3A%2F%2Fwww.starburst.io%2F&amp;a=Starburst\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Starburst</a>, an analytics anywhere company, announced the industry's first cross-cloud analytics solution with the latest iteration of its SaaS product Starburst Galaxy. First released in <span class=\"xn-chron\">February 2021</span>, this most updated version of Starburst Galaxy now allows customers to query data across cloud platforms seamlessly without sacrificing speed or access.</p>\n<p>Our <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3370235-1&amp;h=2162291623&amp;u=https%3A%2F%2Fwww.starburst.io%2Finfo%2F2021-state-of-data%2F&amp;a=research+with+Red+Hat\" data-type=\"url\" class=\"tr-link\" translate=\"no\">research with Red Hat</a></u> showed that today's modern enterprises are demanding cross-cloud flexibility. Among survey respondents, 62% expect to have all of their data in the cloud by the end of 2021. This migration is not specific to one cloud provider: the number one criteria respondents looked for in cloud data storage was the flexibility to access data from multiple clouds (47%).</p>\n<p>\"Analyzing data across cloud providers is a growing concern for enterprises as data is increasingly generated and stored in multiple clouds, as well as on-premises data centers. Starburst is at the forefront of helping enterprises address this issue with its Starburst Galaxy managed service, which enables SQL queries to be federated across data stored in cloud object stores and data warehouses, on multiple clouds, without data movement,\" said <span class=\"xn-person\">Matt Aslett</span>, Vice President and Research Director at Ventana Research.</p>\n<p>Due to the rapid move to digitize this past year, countless organizations are now operating on multiple cloud providers. Until now, it's been inefficient to run an organization on multiple cloud providers' platforms due to data access challenges and pricing. Now with Starburst Galaxy, customers can operate efficiently on AWS and other major cloud providers, eliminating data silos and challenges of the past.</p>\n<p>\"Many vendors make their products available in each of the major cloud providers and refer to them as 'multi-cloud.'  Starburst is taking the industry to a new frontier, as the first to offer \"cross-cloud\" analytics, enabling SQL joins across tables living in different clouds. At Starburst, we believe you should own your own data and have the freedom to decide where it lives,\" said <span class=\"xn-person\">Justin Borgman</span>, Chief Executive Officer and Co-Founder of Starburst. \"With Galaxy, we're excited to bring the first cross-cloud analytics SaaS platform to market, and proud to say it includes native security features, a flexible consumption model, and a great user experience.\"</p>\n<p>\"Starburst and AWS are working together to provide a seamless, easy-to-access architecture across the cloud environment to meet customers' demands in today's modern, cloud-first workforce,\" said <span class=\"xn-person\">Sabina Joseph</span>, General Manager, Technology Partners at AWS. \"Starburst Galaxy on AWS empowers organizations across industries with a cloud-based managed service that streamlines the querying and analysis of data so companies can quickly make data-driven decisions.\"</p>\n<p>Starburst Galaxy is the cloud native and fully managed service of Starburst's massively parallel processing (MPP), high performance query engine. It allows users to query a variety of data sources, or join data across multiple data sources through a single query. In minutes, users can sign-up through AWS Marketplace, connect to Amazon Simple Storage Service (Amazon S3) buckets, their Glue meta store and MySQL/PostgreSQL RDS. Additional cross-cloud benefits of Starburst Galaxy include:</p>\n<ul type=\"disc\" class=\"bulleted-list arrowlist\"><li>Reduced architectural complexity and standardized operations across clouds </li><li>Elimination of vendor lock-in; allowing for optionality in your data ecosystem </li><li>Federated queries across cloud sources for multiple use cases</li></ul><p>Other vendors in the data analytics industry offer cloud analytics but the Starburst Galaxy offering is significantly differentiated. There is currently no other architecture available in the market that addresses the challenges of cross-cloud analytics until now.</p>\n<p>\"We're very excited about the future of Starburst Galaxy and cross-cloud analytics. The demand for an intuitive, easy to use platform where our customers can query across their cloud infrastructure is very high,\" said <span class=\"xn-person\">Michael Cesino</span>, President at Visible Systems Corporation. \"Starburst Galaxy opens the door to meet this demand and help companies gain new insights that were previously impossible in the time they were needed.\"</p>\n<p>For more information on Starburst Galaxy, visit us <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3370235-1&amp;h=1312508572&amp;u=http%3A%2F%2Fstarburst.io%2Fgalaxy&amp;a=here\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a></u>. </p>\n<p><b>About Starburst<br/></b>Starburst is the analytics engine for the data mesh. We unlock the value of distributed data by making it fast and easy to access, no matter where it lives. Starburst queries data across any database, making it instantly actionable for data-driven organizations. With Starburst, teams can lower the total cost of their infrastructure and analytics investments, prevent vendor lock-in, and use the existing tools that work for their business. Trusted by companies like Comcast, FINRA, and Condé Nast, Starburst helps companies make better decisions faster on all data.</p>\n<p><b>For more information, press only:<br/></b><span class=\"xn-person\">Jill Creelman</span><br/>Inkhouse<br/><a href=\"mailto:starburst@inkhouse.com\" data-type=\"email\" translate=\"no\">starburst@inkhouse.com</a> <br/>781-966-4100</p>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p></div>"}