{"date": "2021-12-03 19:42:17.127000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3437.36, "close": 3427.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Duality Technologies has reported that its privacy-enhanced Duality SecurePlus ML applications are now available to Amazon Web Services customers fueled by 3rd Gen Intel Xeon processors, using accelerated HE.</p><p>These applications allow AWS customers to process new ML workloads in the cloud at scale while protecting sensitive data and preserving privacy. Intel's latest Xeon Scalable processor includes the HE acceleration layer HeXL, which utilizes Intel Advanced Vector Extensions that accelerate AI workloads and come equipped with hardware-enhanced security capabilities. This is the first time that such capabilities are available at scale for large data sets and for a variety of ML models - a major step for the adoption of Privacy-Enhancing Technologies.The collaboration between Duality and Intel enables accelerated privacy-enhanced ML workloads on AWS, allowing enterprises to apply Data Science and ML computations on their sensitive data in the cloud, while the data remains encrypted at all times, even during analysis. This new capability also ensures that organizations processing sensitive data in the cloud remain compliant with data privacy regulations - as they are never directly exposed to the data being processed.Earlier this year, Duality and Intel teamed up to deliver optimized data science and AI applications for privacy-enhanced data collaboration. The collaboration focused on accelerating ML applications with HE on the new 3rd Gen Intel Xeon Scalable processors.\"Duality and Intel are working together to allow organizations across the globe to benefit from secure, AI-powered data collaboration at scale, enabling a whole new world of big data insights and privacy-protected collaboration across industries,\" said Dr. Alon Kaufman, CEO and Co-Founder, Duality Technologies. \"We are excited to bolster our relationship with Intel and allow AWS customers to use the cloud for ML workloads on sensitive data, removing a long-standing roadblock to utilizing the cloud within regulated industries. We invite enterprise customers and their ecosystem to experience this new offering in our Sandbox.\"Founded by world-renowned cryptographers and data scientists, Duality has harnessed its foremost expertise in Homomorphic Encryption (HE) and data science to develop the Duality SecurePlus® suite of secure data collaboration applications, addressing the specific business needs of organizations that seek to collaborate on sensitive data while protecting their business interests and complying with data privacy regulations. Duality SecurePlus® applications enable such collaboration on protected data and AI models by keeping them encrypted throughout computation. The collaborating parties can run computations securely in any environment - whether their own, their partners', or on a third-party cloud - without exposing sensitive data, such as Personally Identifiable Information (PII).The Intel Homomorphic Encryption (HE) toolkit, recently released as an open source project and available at the Intel Developer Zone, is the prime vehicle for the continuous delivery of this Intel HE technological innovation to users. The toolkit has been designed with usability in mind to make it easier to evaluate and deploy HE technology on Intel platforms.\"At Intel, we believe that security and privacy are critical to today's data-driven economy,\" said Nir Peled, general manager of Private AI and Analytics at Intel. \"Privacy-enhancing Homomorphic Encryption, now available at scale on AWS, will fundamentally change how data is shared and leveraged by organizations worldwide. We look forward to continuing working with Duality to make privacy, data confidentiality and data utility achievable goals for all enterprises.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}