{"date": "2021-11-22 15:11:36.832000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON INC (\"AMZN-Q\")\n- Amazon Customers Can Shop and Save on Deals During Cyber Monday\n- Weekend\n\n   Mark your calendars for a weekend of savings. Amazon today revealed a\nsneak peek of the thousands of deals customers can shop during its Cyber\nMonday Deals Weekend, which kicks off Saturday, November 27, and runs\nthrough Monday, November 29. Throughout the deals event, customers can\nscore incredible savings across every category, as well as deep discounts\non popular products and must-have items. All weekend long, customers can\nalso shop amazing deals from independent selling partners, most of which\nare small and medium-sized businesses.\n\n   All throughout the season customers can continue to shop and discover\nitems from Amazon's biggest selection of gift guides, including newly\nlaunched guides and longtime customer favourites like the Small Business\nGift Guide, Home Gift Guide, and Holiday Toy List, along with the\nElectronics, Fashion, and Beauty guides.\n\n   Cyber Monday Deals Preview Below is a sampling of top deals and products\nthat will be available at various dates and times between Saturday,\nNovember 27 and Monday, November 29, while supplies last. Customers can\nshop Cyber Monday deals at amazon.ca/cybermonday, on the Amazon shopping\napp, or by asking, \"Alexa, what are my deals?\" Prime members also can enjoy\n30 minutes of early access to select Lightning Deals on Amazon throughout\nthe holiday season--and every day.\n\n//st\n\n* Toys: Save up to 30% on select dolls, action figures, construction sets,\n  and preschool toys from Barbie, Polly Pocket, Fisher-Price, Hot Wheels,\n  LEGO, Marvel, Nerf, Star Wars, and more.\n* Seasonal Fashion: Save up to 30% on select apparel from top brands like\n  Champion, PUMA, Carhartt, Levi's and more. Save up to 22% on select\n  Orolay down jackets and parkas. Save up to 30% on select outerwear from\n  Calvin Klein, Tommy Hilfiger, DKNY, and more. Save up to 30% on select\n  Crocs. Save up to 30% on select True &amp; Co. bras and underwear. Save up to\n  30% on select Ray-Ban sunglasses. Save up to 45% on select watches from\n  Bulova and Citizen.\n* Home and Kitchen: Save up to 30% on select Ninja, NutriBullet, and\n  Vitamix blenders. Save 30% or more on select Instant Pot appliances and\n  cookware. Save on select Keurig K-Compact, K-Mini, and K-Slim Coffee\n  Makers. Save 30% on select Bissell floorcare favourites. Save up to 20%\n  on select Zinus bedroom furniture, mattresses, bed frames, and more!\n* Electronics: Save on select 4K TVs from Samsung, Sony, and LG. Save on\n  select headphones from Bose, Sony, and JBL. Save $20 on select Nintendo\n  Switch Pro controllers. Save on select Smart Home and security products.\n  Save on select PC drives from Samsung, Crucial, WD, and more. Save on\n  select LG monitors and laptops. Save on select Garmin products.\n* Beauty and Personal Care: Save up to 30% on select cosmetic brands\n  including L'Oreal Paris, NYX, COVERGIRL, and Rimmel London. Save up to\n  50% on select Oral-B and Crest Whitestrips. Save up to 30% on select\n  Neutrogena, Aveeno &amp; Neostrata. Save up to 40% on select Waterpik\n  Flossers.\n* Amazon Devices: Save up to 50% on the Echo Show 5 (1st gen). Save up to\n  41% on Kindle and up to 23% on the all-new Kindle Paperwhite. Save up to\n  50% on the Fire TV Stick 4K. Save up to 36% on Fire HD 8 tablet and up to\n  31% on the Fire 7 Kids Pro tablet. Save up to 30% on the Ring Video\n  Doorbell Wired and up to 40% off the eero WiFi 6 mesh router. Save up to\n  31% on Amazon Fire TV 50\" Omni Series 4k UHD Smart TV.\n* Smart Home: Save up to 30% on select smart lighting products from Philips\n  Hue, Leviton, and Kasa Smart.\n* Home Improvement, Tools, and Garden: Save up to 30% on select tools from\n  Bosch, Makita, Dremel, BOSTITCH, BLACK + DECKER, and DEWALT.\n* Baby: Save on the Graco 4Ever 4-in-1 Car Seat. Save up to 20% on select\n  baby gates. Save up to 30% on select baby playards, toys, and\n  accessories. Save up to 37% on select car seats and strollers. Save up to\n  15% select on Medela and Baby Brezza products.\n* Pets: Save up to 30% on select pet food from Hills, Greenies, and Blue\n  Buffalo. Save up to 30% on your first pet product delivery with Subscribe\n  &amp; Save.\n* Sports and Outdoors: Save up to 20% on select Exercise &amp; Fitness\n  equipment from Bowflex, Sunny Health and Fitness, iFit, Schwinn, and\n  more! Save on select scooters and bikes from the whole family. Save up to\n  15% on select Intex Inflatable Kayaks.\n\n//et\n\n   About Amazon Amazon is guided by four principles: customer obsession\nrather than competitor focus, passion for invention, commitment to\noperational excellence, and long-term thinking. Amazon strives to be\nEarth's Most Customer-Centric Company, Earth's Best Employer, and Earth's\nSafest Place to Work. Customer reviews, 1-Click shopping, personalized\nrecommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct\nPublishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo,\nAlexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are\nsome of the things pioneered by Amazon. For more information, visit\namazon.com/about and follow @AmazonNews.\n\nRelated Links <a href=\"http://www.amazon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.amazon.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132500236.MNPRE2132501646-07023720211122</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}