{"date": "2021-12-03 15:12:00.205000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n<b>Grupo Rede Amazonica cooperates with Fraunhofer to roll out MPEG-H Audio on their Amazon Sat broadcast channel</b>\n</p><p>\n<b>Grupo Rede Amazônica is the first broadcaster in Latin America to provide a 24/7 MPEG-H Audio service on one of their terrestrial broadcast channels using ISDB-Tb TV 2.5.</b>\n</p><p>\nIn Brazil, a major technological upgrade of the digital TV infrastructure is underway. Part of it is the TV 2.5 project lead by the Brazilian Digital Terrestrial TV System (SBTVD) Forum, which was finalized in August 2019 and includes state-of-the art media technologies such as immersive and personalized audio and HDR video.\n</p><p>\nMPEG-H Audio has been included in the TV 2.5 standard, particularly due to its capabilities to deliver immersive sound and, even more important, its advanced personalization and accessibility options, which no other audio system can currently deliver. The system enables the audience to interact with the content and to adapt the audio experience to their preferences. The option to personalize the balance of dialogue and background sounds, choose between different languages, and position the audio description at different locations in the room, makes for a highly individualized experience for everyone while at the same time ensuring an unmatched degree of accessibility for people with visual or hearing impairments\n</p><p>\n“Grupo Rede Amazônica is the largest communication group in northern Brazil and a driver of technology innovation and adoption. Amazon Sat is the first Brazilian broadcast channel to implement MPEG-H Audio into regular 24/7 broadcast services, bringing unprecedented opportunities, such as immersive audio and interactivity, to open TV,” explains Eduardo Lopes, Engineering Director of Grupo Rede Amazônica.\n</p><p>\n“It was a great experience to work with the Fraunhofer team to implement MPEG-H into our production and transmission chain,” says Luciano Jeyson, Technical Supervisor of Grupo Rede Amazônica. “We are thrilled to be part of such a historic moment. Empowered by MPEG-H, our viewers on Amazon Sat can now personalize their audio experience to meet their preferences and enjoy their daily programs in a completely new way,” he continues.\n</p><p>\nA major advantage of MPEG-H Audio is that its personalization features benefit immersive as well as 5.1 and stereo productions. In fact, a single MPEG-H production can cover all these setups. Sound producers and editors are already creating new, exciting content with MPEG-H Audio. This works particularly well as they can use their existing tools and workflows with just some minor modifications to produce stereo, 5.1, and immersive content with the full range of personalization options. A range of intuitive production tools for MPEG-H Audio can be integrated into existing tools and well-established workflows without changing routines a whole lot.\n</p><p>\n“We were delighted to support our partners at Grupo Rede Amazônica on their way to becoming the first broadcaster in Brazil that provides a personalized audio experience to their audience,\" says Stefan Meltzer, Chief Business Development Manager in the Fraunhofer IIS Audio and Media Technologies Division. “Together with our technology partners at ATEME and Showcase Pro, we have achieved a great milestone in Brazilian broadcast. Being part of such a dedicated team is an absolute pleasure and I look forward to all the exciting joint projects we have already lined up.”\n</p><p>\n<b>About Fraunhofer IIS</b>\n</p><p>\nFor over 30 years, the institute’s Audio and Media Technologies division has been shaping the globally deployed standards and technologies in the fields of audio and moving picture production. Starting with the creation of mp3 and continuing with the co-development of AAC and the Digital Cinema Initiative test plan, almost all consumer electronic devices, computers and mobile phones are equipped with systems and technologies from Erlangen today. Meanwhile, a new generation of best-in-class media technologies – such as MPEG-H Audio, xHE-AAC, EVS, LC3/LC3plus, Symphoria, Sonamic and upHear – is elevating the user experience to new heights. Always taking into account the demands of the market, Fraunhofer IIS develops technology that makes memorable moments.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211203005369r1&amp;sid=ucdp3&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjAzMDA1MzY5cjEmc2lkPXVjZHAzJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=5acac85a2f7ee22ec1b4c8927d45071d4d1396380458869681088a4483d2bfcdb834be43e7dd9c945a6b3181d97460284be77eb8dabc2f378c0e76a358d08abf\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211203005369/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211203005369/en/</a></span></p><p>\nMandy Garcia\n<br/><a href=\"mailto:mandy.garcia@iis.fraunhofer.de\" data-type=\"email\" translate=\"no\">mandy.garcia@iis.fraunhofer.de</a><br/>or visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.mpeg-h.com&amp;esheet=52544697&amp;newsitemid=20211203005369&amp;lan=en-US&amp;anchor=www.mpeg-h.com&amp;index=1&amp;md5=e1d7d8b59c483717890b705fc89ea60e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.mpeg-h.com</a>\n</p><p>\n \n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: FRAUNHOFER-IIS</p></div>"}