{"date": "2021-11-30 18:36:00.160000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Announces AWS Private 5G</b>\n</p><p class=\"bwalignc\">\n<span>New service makes it easy for enterprises to deploy and scale private 5G networks in their facilities in days instead of months</span>\n</p><p class=\"bwalignc\">\n<span>DISH, Amazon Fulfillment, and Koch Global Services among customers and partners using AWS Private 5G</span>\n</p><p>\nToday, at AWS re:Invent, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced AWS Private 5G, a new managed service that helps enterprises set up and scale private 5G mobile networks in their facilities in days instead of months. With just a few clicks in the AWS console, customers specify where they want to build a mobile network and the network capacity needed for their devices—and AWS delivers and maintains the small cell radio units, servers, 5G core and radio access network (RAN) software, and subscriber identity modules (SIM cards) required to set up a private 5G network and connect devices. AWS Private 5G automates the setup and deployment of the network and scales capacity on demand to support additional devices and increased network traffic. There are no upfront fees or per-device costs with AWS Private 5G, and customers only pay for the network capacity and throughput they request. To learn more about AWS Private 5G, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fprivate5g%2F&amp;esheet=52542181&amp;newsitemid=20211130005967&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fprivate5g%2F&amp;index=1&amp;md5=52f0456acccf6665d00b9a66d88d0fb0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/private5g/</a>.\n</p><p>\nMore and more enterprises need to collect, analyze, and transfer massive amounts of data within their operations from the large number of connected sensors and edge devices prevalent in today’s enterprises. Customers want to leverage cellular technologies like 5G for their on-premises connectivity needs because it offers long range, extended outdoor coverage, device mobility, and reliable network behavior. Cellular technologies like 5G also allow customers to connect more devices and more cost-effectively collect and transfer data with greater flexibility and reliability than current wired and wireless networking technologies. Customers would like to build their own private 5G networks to take advantage of the reliability, better coverage, lower latency, and higher bandwidth they provide and to be able to scale their networks as they add more devices. But today, most private mobile network deployments require customers to invest considerable time, money, and effort to design their network for anticipated peak capacity and to procure and integrate software and hardware components from multiple vendors. Once the network is installed, customers have to undertake another lengthy procurement process to increase network capacity if the number of connected devices or network traffic grows beyond the capacity the network can handle. Customers also have to manage different security policies and systems for each type of device connected to a private mobile network, which makes integration with IT management systems difficult. Even if customers are able to get the network running, current private mobile network pricing models charge for each connected device and make it cost prohibitive for use cases that involve thousands of connected devices. As a result of these barriers, most enterprises are unable to deploy and operate private mobile networks.\n</p><p>\nWith AWS Private 5G, enterprises can now procure, deploy, and scale their own 5G mobile network in days instead of months. With AWS Private 5G, customers log into the AWS console and with just a few clicks specify a coverage area within a geographic location where they want to deploy a private 5G network, along with the amount of traffic they expect the network to handle. AWS delivers and maintains the pre-integrated small cell radio units, servers, 5G core and RAN software, and SIM cards needed for operating the network—eliminating the need to procure, integrate, and maintain hardware and software from multiple third-party vendors. Once the equipment is installed and powered on, AWS Private 5G automatically configures and deploys the mobile network. To connect devices to the private network, customers simply plug the AWS-supplied SIM cards into their devices. AWS Private 5G integrates with AWS Identity and Access Management (IAM) enabling network administrators to directly control which resources mobile devices can access on their private mobile networks. Customers can start with small networks with fewer devices using AWS Private 5G, analyze network needs once in operation, and leverage the elasticity and pay-as-you-go pricing of AWS to scale their private mobile network as they add more devices. With AWS Private 5G, customers can quickly deploy and manage private 5G mobile networks without the challenge of procuring, scaling, and maintaining equipment or worrying about needing to add additional capacity when they want to add more devices.\n</p><p>\n“Many of our customers want to leverage the power of 5G to establish their own private networks on premises, but they tell us that the current approaches make it time-consuming, difficult, and expensive to set up and deploy private networks,” said David Brown, Vice President, EC2 at AWS. “With AWS Private 5G, we’re extending hybrid infrastructure to customers’ 5G networks to make it simple, quick, and inexpensive to set up a private 5G network. Customers can start small and scale on-demand, pay as they go, and monitor and manage their network from the AWS console.”\n</p><p>\nDISH Network Corporation is a U.S.-based connectivity company that is building the nation's first open, secure, 5G smart network. “Selecting AWS has enabled us to onboard and scale our 5G core network functions within the cloud. They are a key strategic partner in helping us deliver private enterprise networks to our customers,” said Stephen Bye, Chief Commercial Officer, DISH. “AWS's innovative platform allows us to better serve our consumer wireless customers, while unlocking new business models for enterprise customers across a wide range of industry verticals. Our ability to support dedicated, private 5G enterprise networks allows us to give customers the scale, resilience and security needed to support a wide variety of devices and services, unlocking the potential of Industry 4.0.”\n</p><p>\nWith 122,000 global employees and locations in nearly every U.S. state and 60 countries, Koch companies offer abundant opportunities to improve life’s most necessary things – like food, clothing, water, transportation, and technology. \"Koch sees great potential in private 5G networking. However, there are significant challenges in the do-it-yourself approach. It can be complex, time consuming, and expensive, both in initial setup cost as well as ongoing service charges,” said Matt Hoag, CTO at Koch Business Solutions. “In collaboration with industry software vendors like Mavenir and global communication service providers, AWS Private 5G can helps solve real challenges that enterprises face in deploying private cellular networks around the world. We believe that this combination will also encourage expansion of the cellular Industrial IoT ecosystem and accelerate the delivery of disruptive private connectivity solutions for our customers.”\n</p><p>\nAmazon Fulfillment Centers (FCs) store products for customers. Once a customer clicks “buy,” associates pick, pack, and place orders on trucks for shipment. Amazon robots, scanning machines, and computer systems in fulfillment centers can manage millions of items in a day. “We deploy technology outside of FCs to make moving tractor trailers around safer and more accurate and efficient. We have to provide network services for these systems across millions of square feet of outdoor space. Previously, to get proper Wi-Fi coverage in the parking lots around our FCs, we had to add light poles for the Wi-Fi equipment, modify our outdoor electrical systems and either trench fiber or support Mesh systems. This was expensive, disrupted productivity during installation, and had a high support burden,” said Jeff Armstrong, Director of Infrastructure Engineering at Amazon. “With AWS Private 5G, we can use two outdoor small cells mounted on the corners of our warehouses and achieve additional coverage in our parking lots, which was much quicker and cheaper to deploy. Just as important, we will be able to scale up our AWS Private 5G deployment as we expand our facilities.”\n</p><p>\n<strong>About Amazon Web Services</strong>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones (AZs) within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit aws.amazon.com.\n</p><p>\n<strong>About Amazon</strong>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211130005967r1&amp;sid=ny6r1&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTMwMDA1OTY3cjEmc2lkPW55NnIxJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=42549d57c10a839c3e00c67fd59057bb4526f0aa64a7b2aeddedff4297490f6d8615e967ff9f1f5762eb56239ff673f23aef04f27649b33b1405c135dc2306d7\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130005967/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005967/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52542181&amp;newsitemid=20211130005967&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=2&amp;md5=f2f6de637ef55fca21114a98f170a932\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON.COM</p></div>"}