{"date": "2021-11-16 05:46:20+00:00", "ticker": "AVV", "mrkt_info": {"open": 3265.0, "close": 3459.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Dubai, United Arab Emirates - AVEVA, a global leader in industrial software, driving digital transformation and sustainability, announced that it has signed a technology partnership with Helios IoT Systems, a specialized company with domain expertise in the renewables energy sector for operations and maintenance (O&amp;M). The collaboration extends AVEVA Insight with performance calculations specific to the solar energy industry.</p>\n<p>The combined benefits of Apollo’s rich content and AVEVA Insight’s scalable AI and analytics will empower solar energy providers with access to deeper, tailored and consolidated information so that they can optimize their operations.  As a result, companies using the combined solution can expect quick detection of solar farm inefficiencies through AI and physics-based predictions, faster troubleshooting and root cause analysis, more targeted maintenance, and an overall reduction in lost power. This will be achieved through increased visibility of predictions, KPIs, metrics, and performance of their assets. Through AVEVA Connect, AVEVA’s cloud platform, customers will have access to the extensive portfolio of Cloud solutions and can easily expand to meet their evolving needs.</p>\n<p>AVEVA Insight is a software-as-a-service (SaaS) solution for collecting, storing, and visualizing industrial data for faster, actionable business decisions driven by a comprehensive suite of patented self-service AI and analytics.  Apollo is a unique energy solution powered by patented domain-specific digital twin technology, health models and specialized dashboards to deliver a route to optimize a solar portfolio and its assets to streamline O&amp;M activities, benchmark asset performance, manage and improve collaboration, increase yield and improve plant performance.</p>\n<p>“Industry specific asset content combined with actionable analytics delivers a closed loop remediation that drives efficiency and safety.   With our heritage of open access to information, strong visualization and comprehensive analytics combined with the Apollo domain expertise for solar assets we can provide critical operational intelligence to deliver value. With this partnership with Apollo, solar energy customers can accelerate their digital transformation, fast-track their sustainability ambitions and derive valuable performance improvements,” said Kim Custeau, Senior Vice President, APM business, AVEVA.</p>\n<p>“Our partnership with AVEVA is a major milestone in building a long-term relationship in delivering a best of class solution to the emerging market of renewable energy enterprises. Our technology partnership with AVEVA extends our reach in global markets and expedites new technology product adoption to benefit customers. Integration of our patented digital twin solution, Apollo, with AVEVA Insight will help us deliver an innovative, next generation analytics solution to empower solar companies to optimize assets, increase yield and improve plant performance.” said Nitin Tappe, CEO, Helios.</p>\n<p>-Ends-</p>\n<p><strong>About Helios</strong></p>\n<p><span>Helios IoT Systems is a Pune (India) based technology product company co-founded by four experienced executives from energy and software sectors/industry. It develops solutions for the renewables energy sector &amp; its expertise is on improving the solar photovoltaic (PV) power plant operations and performance via next-generation data analytics products. The company is passionate and concerned about our planet Earth wellbeing and hence believes renewable energy will be the savior to the climate change and sustainable energy demands problems. Helios IoT Systems’ passion lies in solving complex business problems &amp; improving system efficiency through a data driven approach. Its patented digital twin technology based solar analytics product, Apollo enables all the solar eco-systems’ stakeholders to improve productivity in the O&amp;M &amp; asset management by helping solar IPPs, EPCs, O&amp;M and Asset Management teams to benefit from actionable closed loop insights for the decision making.</span></p>\n<p>For more information please visit: <a href=\"http://www.heliosiot.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.heliosiot.com/</a> </p>\n<p><strong>About AVEVA</strong></p>\n<p><span>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at www.aveva.com.</span></p>\n<p><span>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</span><strong> </strong></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}