{"date": "2022-01-19 23:39:14.014000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Was it <a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> or <a href=\"https://www.independent.co.uk/topic/visa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Visa</a> that blinked first to – at least temporarily – end the pair's stand-off which had looked set to result in holders of the latter's credit cards being blocked from the site if they had no alternative means of payment?</p><p>On the face of it, it looks like Amazon. The internet giant started the fight. It set a Wednesday deadline for Visa to agree to lower charges, only to step back from the breach to allow talks between the pair to continue.</p></div><div class=\"tr-npp-body\"><p>There is no replacement deadline, while Amazon has promised to give customers plenty of time should the pair's negotiations break down. The next step? Probably a face-saving announcement of some sort of deal in a couple of weeks with very little in the way of detail but lots of gushing quotes from the two sides about \"working together\".</p><p>That, however, pre-supposes that the game is over. It isn't because there is a third card player sitting at the green baize of this corporate poker table. It is the <a href=\"https://www.independent.co.uk/topic/payment-systems-regulator\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Payment Systems Regulator</a> (PSR).</p><p>Amazon's reason for disagreement has rather been obscured by the understandable fuss about the impact on its customers of not accepting Visa credit cards, many of whom faced considerable inconvenience, at least some of whom had no easy path to obtaining an alternative payment method that gave them the facility to spread the cost of their purchases.</p><p>The internet shopping giant is far from the only retailer to grouse about the fees levied by card companies like Visa.</p><p>The most widely publicised of those are probably the \"interchange\" fees, which were swiftly hiked post-Brexit (thanks, Boris Johnson). They hit Amazon if, say, a customer in France shops on its UK website and vice versa. They're capped within the EU, which the UK is obviously no longer a member of.</p><p>But this isn't solely a Brexit issue. Amazon was also vexed about other charges, notably the \"scheme fees\" all merchants have to pay to either Visa or Mastercard. It argued that these have been soaring at a time when technology ought to be bringing them down.</p><p>Amazon is often depicted as some kind of corporate death star – but on this subject it has joined the rebel alliance, although it's notable that Mastercard, with which Amazon has a close relationship, has been spared its ire. The PSR is the potential Luke Skywalker and its X-wing fighter is the inquiry it is conducting into the charges.</p><p>According to the PSR, Visa and Mastercard account for 99 per cent of all card based transactions. This duopoly confers pricing power upon them, and it would certainly appear that they have been using it. In a recent letter to the Treasury Committee, the PSR noted that interchange fees had been increased from 0.2 per cent to 0.3 per cent in the case of credit cards and from 1.15 per cent to 1.5 per cent in the case of debit cards. The scheme fees paid by businesses to card payment operators for use of their service, meanwhile, more than doubled between 2014 to 2018.</p><p>The PSR said this was a cause for concern, and so it is, especially at a time of sharply rising inflation. Those spiralling charges will inevitably find their way back to the consumer via higher prices.</p><p>In the letter, the PSR's Chris Hemsley talked of the need for detailed investigation into the reasons for their rising, as regulators always do, and for consideration of \"the range of tools available to us to protect users\".</p><p>However, he further noted that in the interim, \"shorter-term measures might be appropriate\", such as price caps.</p><p>If the PSR imposes these, and the political attention the issue is getting could help prod it into doing so, Amazon's problems with Visa would be solved. It would likely also see a cut in what it has to kick over to Mastercard. Bonus!</p><p>The lower fees would also be shared across the retail industry, including all the Amazon marketplace sellers the group says it loves, which lack the power to stare down the likes of Visa. Or Mastercard.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/business/analysis-and-features/amazon-visa-credit-card-fees-b1994750.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Analysis: Customers could end up being forgotten in any deal between Amazon and Visa</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/family-tipped-waiter-amazon-giftcard-b1990703.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Family sparks debate by tipping with Amazon gift card</a> </p><p><a href=\"https://www.independent.co.uk/independentpremium/business/remote-working-leadership-workplace-pandemic-b1993154.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Why are so many leaders dreadful?</a> </p><p><a href=\"https://www.independent.co.uk/independentpremium/business/remote-working-leadership-workplace-pandemic-b1993154.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Why are so many leaders dreadful?</a> </p><p><a href=\"https://www.independent.co.uk/independentpremium/business/apple-tv-streaming-wars-disney-plus-netflix-entertainment-b1993247.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Apple TV+ picking up more awards nods. Can it pick up subscribers at same rate?</a> </p><p><a href=\"https://www.independent.co.uk/independentpremium/business/hospitality-supermarkets-covid-omicron-profits-trading-b1992563.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Hospitality is suffering as supermarkets take a bite out of profits</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}