{"date": "2022-02-16 20:45:46+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3130.21, "close": 3093.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Jeffrey Dastin and Julia Love</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 16 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The U.S. National Labor Relations Board said Wednesday that Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and a group of New York workers have agreed tentatively on terms for a union election, and an organizer said the vote would take place late next month.</p><p>The agreement lays out the election's timing and how to vote, the NLRB said, without providing details. According to labor organizer Christian Smalls, workers at Amazon's \"JFK8\" warehouse in Staten Island will vote in person March 25-30.</p><p>The news puts Amazon on track to face two closely watched labor elections in the same week. The NLRB on March 28 plans to start counting ballots from Alabama workers who are deciding whether to unionize in a re-run of last year's failed organizing campaign with the Retail, Wholesale and Department Store Union.</p><p>A majority vote to unionize at either facility would mark Amazon's first organized warehouse in the United States and a milestone for those seeking to invigorate the American labor movement.</p><p>In a statement, Amazon spokesperson Kelly Nantel said the retailer is skeptical there are enough worker signatures in New York to justify a vote. \"But since the NLRB has decided the election will proceed, we want our employees to have their voices heard as soon as possible,\" she said.</p><p>Smalls, looking to create the Amazon Labor Union, said the election comes on the two-year anniversary of his and colleagues' protest of the company's pandemic protocols that led to his firing. Amazon has said he violated a paid COVID-19 quarantine.</p><p>The election agreement between Amazon and the New York workers still needs to be finalized, the NLRB said.</p><p><br/></p><p><br/></p><p class=\"tr-signoff\"> (Reporting By Jeffrey Dastin in Palo Alto, Calif. and Julia Love in San Francisco; Editing by Cynthia Osterman)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Jeffrey.Dastin@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Jeffrey.Dastin@thomsonreuters.com</a> ; +1 424 434 7548; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-UNION/ (PIX)</p></div>"}