{"date": "2022-01-06 22:10:35.793000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3287.14, "close": 3251.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>INDUS REALTY TRUST INC (\"INDT-Q\")\n- 2021 Fourth Quarter Leasing, Pipeline And Corporate Updates\n\n    INDUS Realty Trust, Inc. (\"INDUS\" or the \"Company\"), a U.S. based\nindustrial/logistics REIT, announced the following updates on leasing, its\nacquisition and development pipeline, dispositions and other corporate\nmatters for the three months ended December 31, 2021 (the \"2021 fourth\nquarter\"):\n\n    Highlights\n\n//st\n\n  * Developed and placed into service an approximately 141,000 square foot\nbuild-to-suit industrial/logistics building in Charlotte, North Carolina\nfor Amazon\n  * Acquired an approximately 128,000 square foot industrial/logistics\nbuilding in Charlotte, North Carolina and an approximately 197,000 square\nfoot industrial/logistics building in the Charleston, South Carolina\nmarket for a combined purchase price of $43.2 million, before transaction\ncosts\n  * Completed the acquisition of approximately 23 acres of land in\nAllentown,\nPennsylvania for a total purchase price of approximately $3.9 million, to\nsupport the planned development of a 206,000 square foot\nindustrial/logistics building\n  * Entered into three separate agreements to acquire, for a combined\npurchase price of $72.8 million, before transaction costs, one existing\nindustrial/logistics building in the Charlotte, North Carolina market and\ntwo to-be-constructed industrial/logistics buildings under forward\npurchase agreements in the Charlotte, North Carolina market and in the\nCharleston, South Carolina market, respectively\n  * Generated gross proceeds of approximately $34.5 million from real\nestate\nsales in the 2021 fourth quarter\n  * Completed an underwritten public offering of 2,443,228 shares of the\nCompany's Common Stock at a public offering price of $66.00 per share for\nnet proceeds of $152.8 million\n  * Completed two new leases of first generation space totaling\napproximately\n224,000 square feet and two renewal leases totaling approximately 256,000\nsquare feet in INDUS's existing industrial/logistics portfolio\n  * Announced the pre-leasing of approximately 147,000 square feet across\ntwo\nbuildings in INDUS's acquisition and development pipelines in the Lehigh\nValley and Nashville markets\n  * Stabilized industrial/logistics portfolio1 was 100.0% leased as of\nDecember 31, 2021\n\n//et\n\n    Industrial/Logistics Leasing Activity\n\n    During the 2021 fourth quarter, INDUS entered into two first generation\nleases totaling approximately 224,000 square feet. These leases include\napproximately 27,000 square feet in Orlando, Florida at a property that was\nrepositioned by INDUS during late 2020 and early 2021 and approximately\n197,000 square feet at a value-add property in the Charlotte market which\nwas purchased 50% vacant at the end of the 2021 second quarter. The lease\nin Orlando commenced in the 2021 fourth quarter and the lease in Charlotte\nis expected to commence by the end of the 2022 first quarter.\n\n    Also during the 2021 fourth quarter, two full-building tenants totaling\napproximately 256,000 square feet exercised their fixed renewal options for\nleases expiring in 2022. The buildings were acquired in 2021 with in-place\nleases that had near-term expirations. The buildings comprise approximately\n128,000 square feet in Charlotte, North Carolina (see Township Acquisition\nunder \"Acquisition Pipeline\" below) and approximately 128,000 square feet\nin the Lehigh Valley, Pennsylvania market. The fixed renewal options were\nfor five-year terms with no leasing costs and generated weighted average\nrent growth on a cash basis2 of 2.9%, which is significantly lower than\nwhat the Company would expect to realize if the spaces were leased to new\ntenants.\n\n    As of December 31, 2021, INDUS's 35 industrial/logistics buildings\naggregated approximately 5.2 million square feet. INDUS's\nindustrial/logistics portfolio's percentage leased and percentage leased of\nstabilized properties were as follows:\n\n//st\n\n                  Dec. 31,       Sept. 30,     June 30,      Mar. 31,\n                  2021           2021          2021          2021\n\n  Percentage Leased   98.4%          95.4%         95.3%         99.2%\n\n  Percentage          100.0%         99.4%         99.4%         99.2%\n  Leased -\n  Stabilized\n  Properties\n\n//et\n\n    As of December 31, 2021, INDUS's only industrial/logistics vacancy\nreflects approximately 84,000 square feet in a Charleston, South Carolina\nproperty acquired on November 12, 2021 (see Charleston Acquisition under\n\"Acquisition Pipeline\" below).\n\n    Acquisition Pipeline\n\n    On October 12, 2021, INDUS completed the acquisition of a fully leased,\napproximately 128,000 square foot industrial/logistics building in\nCharlotte, North Carolina (the \"Township Acquisition\"). The Company used\ncash on hand to pay the $14.6 million purchase price, before transaction\ncosts, which equates to an in-place cash capitalization rate of\napproximately 4.6%.\n\n    On November 12, 2021, INDUS completed the acquisition of a 57%-leased,\napproximately 197,000 square foot industrial/logistics building in\nCharleston, South Carolina (the \"Charleston Acquisition\"), the Company's\nfirst property in the Charleston market. The Company used cash on hand to\npay the $28.6 million purchase price, before transaction costs, and the\nCompany expects that the Charleston Acquisition will stabilize at an\napproximately 4.6% cash capitalization rate.\n\n    During the 2021 fourth quarter, INDUS entered into three separate\nagreements to acquire, for a combined purchase price of $72.8 million,\nbefore transaction costs, two industrial/logistics buildings in the\nCharlotte, North Carolina market and one industrial/logistics building in\nthe Charleston, South Carolina market.\n\n//st\n\n  * The first agreement is for an approximately 217,000 square foot,\nrecently\nconstructed industrial/logistics building (the \"Charlotte Acquisition\")\nfor a purchase price of $23.6 million, before transaction costs. The\nCharlotte Acquisition has a short-term lease in-place and INDUS expects\nto close on the purchase during the first quarter of 2022.\n  * The second agreement is for a to-be-constructed, approximately 231,000\nsquare foot industrial/logistics building (the \"Charlotte Forward\nAcquisition\") which is being developed on speculation by the seller. The\nCharlotte Forward Acquisition is expected to be delivered vacant upon\ncompletion in the first quarter of 2023. The purchase price for the\nCharlotte Forward Acquisition is approximately $21.2 million, before\ntransaction costs, and INDUS expects to acquire the land in 2022, and to\nfund portions of the building's development during 2022 and into the\nfirst quarter of 2023.\n  * The third agreement is for a to-be-constructed, approximately 263,000\nsquare foot industrial/logistics building in the Charleston, South\nCarolina market (the \"Charleston Forward Acquisition\") for a purchase\nprice of $28.0 million, before transaction costs. The Charleston Forward\nAcquisition is being developed on speculation by the seller and the\nbuilding is expected to be completed in the 2022 fourth quarter, at which\ntime INDUS expects to complete the acquisition.\n\n//et\n\n    Also during the 2021 fourth quarter, a full building pre-lease was\nexecuted for one of the two buildings that comprise the Nashville\nAcquisition (see below). This lease totals approximately 79,000 square feet\nand is expected to commence in the 2022 second quarter.\n\n    The following is a summary of INDUS's acquisition pipeline for its\nindustrial/logistics portfolio as of December 31, 2021:\n\n//st\n\n  Acquisition    Market                  Building   Type        Purchase\nExpected\n                                     Size                   Price\nClosing\n                                     (SF)                   (in\n                                                            millions)\n\n  Acquisitions\n  Under\n  Contract\n\n  Nashville      Nashville, TN           184,000    Forward     $31.5\nQ1 2022\n  Acquisition\n  (two\n  buildings)\n\n  Charlotte      Charlotte,    217,000              Value-Add   $23.6\nQ1 2022\n  Acquisition    NC\n  (one\n  building)\n\n  Charleston     Charleston, SC          263,000    Forward     $28.0\nQ4 2022\n  Forward\n  Acquisition\n  (one\n  building)\n\n  Charlotte      Charlotte, NC           231,000    Forward     $21.2\nQ1 2023\n  Forward\n  Acquisition\n  (one\n  building)\n\n  Total Acquisition Pipeline Under       895,000                $104.3\n  Contract\n\n//et\n\n    The acquisitions in INDUS's pipeline are each subject to the\nsatisfactory completion of due diligence and other contingencies. There can\nbe no guarantee that these transactions will be completed under their\ncurrent terms, anticipated timelines, or at all.\n\n    Development Pipeline\n\n    On October 8, 2021, INDUS completed and placed in service its\napproximately 141,000 square foot build-to-suit in Charlotte for Amazon.\n\n    On December 10, 2021, INDUS completed the acquisition of two previously\nannounced abutting parcels of land in Allentown, PA totaling approximately\n23 acres (the \"Allentown Land\") for a combined purchase price of\napproximately $3.9 million, before transaction costs. The Company plans to\ndevelop a 206,000 square foot industrial/logistics building on the acquired\nland parcels.\n\n    On December 24, 2021, INDUS entered into a first generation lease for\napproximately 68,000 square feet at its Chapmans Road speculative\ndevelopment property (see below). This lease is expected to commence by the\nend of the 2022 first quarter.\n\n    The following is a summary of INDUS's development pipeline for its\nindustrial/logistics portfolio as of December 31, 2021:\n\n//st\n\n  Name             Market         Building      Type             Expected\n                              Size (SF)                      Delivery\n\n  Owned Land\n\n  Chapmans Road    Lehigh         103,000       66% Pre-leased   Q2 2022\n  (one building)   Valley, PA\n\n  110 Tradeport    Hartford, CT   234,000       67% Pre-leased   Q3 2022\n  Drive (one\n  building)\n\n  Landstar         Orlando, FL    195,000       Speculative      Q3 2022\n  Logistics\n  (two\n  buildings)\n\n  Allentown        Lehigh         206,000       Speculative      Q2 2023\n  Land (one        Valley, PA\n  building)\n\n  Land Under Purchase &amp; Sale Agreement\n\n  Lehigh Valley    Lehigh         90,000        Speculative      Q2 2023\n  Land parcel      Valley, PA\n  (one building)\n\n  Total                           828,000\n  Development\n  Pipeline\n\n//et\n\n    INDUS expects that the total development and stabilization costs of\ndevelopments in its pipeline will total approximately $92.8 million\n(including all amounts previously spent). The Company estimates that the\nunderwritten weighted average stabilized Cash NOI yield on its development\npipeline is between 5.8% - 6.3%.3 Actual initial full year stabilized Cash\nNOI yields may vary from INDUS's estimated underwritten stabilized Cash NOI\nyield range based on the actual total cost to complete a project or acquire\na property and its actual initial full year stabilized Cash NOI.\n\n    Closing on the purchase of the Lehigh Valley Land parcel, in addition\nto the completion and stabilization of the development pipeline, are each\nsubject to a number of contingencies including the satisfactory completion\nof due diligence by INDUS. There can be no guarantee that these\ntransactions and developments will be completed under their current terms,\nanticipated timelines, at the Company's estimated underwritten yields, or\nat all.\n\n    Disposition Pipeline\n\n    During the 2021 fourth quarter, INDUS completed four separate,\npreviously-announced disposition transactions that generated approximately\n$34.5 million in aggregate gross proceeds before transactions costs. INDUS\nutilized $14.1 million of these proceeds to extinguish three mortgages with\na weighted average interest rate of approximately 5.0%. Dispositions\ncompleted during the quarter included:\n\n//st\n\n  * approximately 1,066 acres of undeveloped land in Quincy, Florida for\n$1.0\nmillion in gross proceeds;\n  * approximately 209,000 square feet across three office/flex properties\nand\n8 acres of land in Windsor, Connecticut for $5.2 million in gross\nproceeds;\n  * approximately 165,000 square feet across one industrial/logistics\nproperty and 39 acres of land in Windsor, Connecticut for $18.0 million\nin gross proceeds; and\n  * approximately 670 acres of undeveloped land in East Granby and Granby,\nConnecticut for $10.3 million in gross proceeds.\n\n//et\n\n    Also during the 2021 fourth quarter, the buyer under the previously\nannounced East Granby/Windsor Option Agreement elected not to proceed with\nthe purchase.\n\n    Corporate Updates\n\n    On October 8, 2021, INDUS completed an underwritten public offering of\n2,150,000 shares of its Common Stock at a public offering price of $66.00\nper share. On October 22, 2021, the underwriters exercised their option to\npurchase an additional 293,228 shares of Common Stock from INDUS at the\nsame price. INDUS received proceeds of $152.8 million, after expenses, from\nthe aggregate of 2,443,228 shares issued on October 8, 2021, and October\n22, 2021. The Company intends to use the proceeds from the October 8, 2021\nand October 22, 2021 sales of its Common Stock to finance its acquisition\nand development pipeline and for other corporate purposes.\n\n    Upcoming Investor Conferences\n\n    INDUS will participate in the Capital One Securities 2nd Annual REIT\nConference to be held virtually January 10, 2022. In connection with the\nconference, INDUS will be sharing an updated investor presentation which\nwill be made available on the Investors section of its website at\nir.indusrt.com prior to the conference.\n\n    About INDUS\n\n    INDUS is a real estate business principally engaged in developing,\nacquiring, managing and leasing industrial/logistics properties. INDUS owns\n35 industrial/logistics buildings aggregating approximately 5.2 million\nsquare feet in Connecticut, Pennsylvania, North Carolina, South Carolina\nand Florida in addition to several office/flex properties and undeveloped\nland.\n\n    Forward-Looking Statements:\n\n    This Press Release includes \"forward-looking statements\" within the\nmeaning of Section 27A of the Securities Act of 1933, as amended, and\nSection 21E of the Securities Exchange Act of 1934, as amended. These\nforward-looking statements include INDUS's beliefs and expectations\nregarding future events or conditions including, without limitation,\nstatements regarding the completion of acquisitions under agreements,\npre-leasing agreements, construction and development plans and timelines,\nexpected total development and stabilization costs of developments in\nINDUS's pipeline, the estimated underwritten stabilized Cash NOI yield of\nthe Company's development pipeline, and expected capital availability and\nliquidity. Although INDUS believes that its plans, intentions and\nexpectations reflected in such forward-looking statements are reasonable,\nit can give no assurance that such plans, intentions or expectations will\nbe achieved. The projected information disclosed herein is based on\nassumptions and estimates that, while considered reasonable by INDUS as of\nthe date hereof, are inherently subject to significant business, economic,\ncompetitive and regulatory uncertainties and contingencies, many of which\nare beyond the control of INDUS and which could cause actual results and\nevents to differ materially from those expressed or implied in the\nforward-looking statements. Other important factors that could affect the\noutcome of the events set forth in these statements are described in\nINDUS's Securities and Exchange Commission filings, including the\n\"Business,\" \"Risk Factors\" and \"Forward-Looking Statements\" sections in\nINDUS's Annual Report on Form 10-K for the fiscal year ended November 30,\n2020, filed with the SEC on February 18, 2021, and Quarterly Report on Form\n10-Q for the fiscal quarter ended September 30, 2021, filed with the SEC on\nNovember 4, 2021. INDUS disclaims any obligation to update any\nforward-looking statements as a result of developments occurring after the\ndate of this press release except as required by law.\n\n    1 Stabilized Properties reflect buildings that have reached 90% leased\nor have been in service for at least one year since development completion\nor acquisition date, whichever is earlier. 7770 Palmetto Commerce Parkway,\nan approximately 197,000 square foot industrial/logistics building in\nCharleston, South Carolina, which was 57.1% leased as of December 31, 2021,\nwas acquired on November 12, 2021, and is not included in the Stabilized\nProperties pool for the 2021 fourth quarter.2 Weighted average rent growth\nreflects the percentage change of annualized rental rates between the\nprevious leases and the current leases. The rental rate change on a\nstraight-line basis represents average annual base rental payments on a\nstraight-line basis for the term of each lease including free rent periods.\nCash basis rent growth represents the change in starting rental rates per\nthe lease agreement on new and renewed leases signed during the period, as\ncompared to the previous ending rental rates for that same space. The cash\nrent growth calculation excludes free rent periods.3 As a part of INDUS's\nstandard development and acquisition underwriting process, INDUS analyzes\nthe targeted initial full year stabilized Cash NOI yield for each\ndevelopment project and acquisition target and establishes a range of\ninitial full year stabilized Cash NOI yields, which it refers to as\n\"underwritten stabilized Cash NOI yields.\" Underwritten stabilized Cash NOI\nyields are calculated as a development project's or acquisition's initial\nfull year stabilized Cash NOI as a percentage of its estimated total\ninvestment, including costs to stabilize the buildings to 95% occupancy\n(other than in connection with build-to-suit development projects and\nsingle tenant properties). INDUS calculates initial full year stabilized\nCash NOI for a development project or acquisition by subtracting its\nestimate of the development project's or acquisition's initial full year\nstabilized operating expenses, real estate taxes and non-cash rental\nrevenue, including straight-line rents (before interest, income taxes, if\nany, and depreciation and amortization), from its estimate of its initial\nfull year stabilized rental revenue.\n\nContact Information:\n\nAshley Pizzo\nVice President, Capital Markets &amp; Investor Relations\n(212) 218-7914\napizzo@indusrt.com\n\nJon Clark\nExecutive Vice President, Chief Financial Officer\n(860) 286-2419\njclark@indusrt.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200500914.MNPRE2200502948-13593820220106</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}