{"date": "2021-11-05 22:56:02+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3477.0, "close": 3488.98}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By David Randall</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Nov 5 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Rising valuations and hefty year-to-date gains for big technology stocks are pushing some investors to diversify away from the sector that has led markets for years. </p><p>Tech stocks have soared this year, and their big weighting in the S&amp;P 500 <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPX\" data-type=\"ric\" data-ric=\".SPX\" translate=\"no\" dir=\"ltr\">.SPX</a> has helped push the index to records with a <span class=\"tr-strong\">25.1% </span>year-to-date gain in 2021. </p><p>Some investors<span class=\"tr-strong\"> are worried the valuations may have ascended into nosebleed territory</span>. Google-parent Alphabet <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a>, for instance, trades at a 12-month forward price-to-earnings ratio of 26.6, compared to a valuation of 21.1 for the S&amp;P 500. </p><p>Apple Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a> is valued at 26.2 forward earnings, while the information technology sector, up nearly 28% this year, carries a forward P/E of 26.4.</p><p><span class=\"tr-strong\">While gains in big technology stocks have boosted the S&amp;P for more than a decade now, their heavy weighting could sink the index if tech falls</span> out of favor. Microsoft, Apple and Amazon, Wall Street's three most valuable companies, account for close to 15% of the S&amp;P 500's market capitalization, according to Refinitiv Datastream. </p><p>Fund managers in last month's BoFA Global Research Survey named “long tech” as the market’s most crowded trade and had collectively reduced their “overweight” positions in tech stocks to the lowest level since May. The market’s top four most crowded individual stocks are Microsoft, Apple, Alphabet and Amazon, according to a recent analysis by research firm Bernstein, incorporating factors such as institutional ownership and price momentum. </p><p>Limiting exposure to tech stocks over the last decade has tended to hurt portfolio performance over the long run, making investors wary of cutting their holdings too drastically. Still, some are looking to broaden their portfolios to reduce their exposure to the sector’s biggest names. </p><p>Garret Melson, a portfolio strategist at Natixis Investment Managers Solutions, believes large technology company stocks may be vulnerable to investors seeking to lock in profits and move some funds to other sectors. Melton is buying shares in financial and energy companies, which he believes will benefit from rising inflation and a strong economic recovery. </p><p>\"We're in the camp that the growth rate in the economy is being under-appreciated this year and next year,\" Melson said.</p><p>Analysts at DataTrek Research believe sectors that can benefit from rising growth, including financials and energy companies, are likely to challenge big tech stocks into year-end. </p><p>“Technology has been a winning group for many years, and we expect it will continue to be so in the future,” they wrote in a Friday report. “But as investors consider where to allocate capital today … we think it likely they will seek out sectors with more exposure to improving economic fundamentals.”</p><p>Strong U.S. employment numbers on Friday brightened the economic outlook, as did news of a promising experimental antiviral drug from Pfizer <a href=\"reuters://REALTIME/Verb=FullQuote/ric=PFE.N\" data-type=\"ric\" data-ric=\"PFE.N\" translate=\"no\" dir=\"ltr\">PFE.N</a>. Travel stocks benefited, with the S&amp;P 1500 airlines index <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPCOMAIR\" data-type=\"ric\" data-ric=\".SPCOMAIR\" translate=\"no\" dir=\"ltr\">.SPCOMAIR</a> climbing 7% on the day. <a href=\"reuters://REALTIME/verb=Headlines/ric=.N\" data-type=\"newsExpression\" data-expression=\".N\" translate=\"no\" dir=\"ltr\">.N</a><span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2RW0N5\" data-type=\"storyId\" data-story-id=\"nL1N2RW0N5\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span><span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2RV2UM\" data-type=\"storyId\" data-story-id=\"nL1N2RV2UM\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Investors will gain insight into inflation when U.S. consumer price data is released next week.</p><p>Denny Fish, a portfolio manager and technology sector lead at Janus Henderson, said inflation concerns and high valuations in the technology sector have prompted him to look for smaller companies that will benefit from growth of giants with more crowded stock positions. </p><p>Fish is bullish on shares of Australian software development company Atlassian Corp PLC <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TEAM.O\" data-type=\"ric\" data-ric=\"TEAM.O\" translate=\"no\" dir=\"ltr\">TEAM.O</a>, whose product management tools \"augment\" Microsoft's suite of applications, as well as Canadian e-commerce company Shopify Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SHOP.TO\" data-type=\"ric\" data-ric=\"SHOP.TO\" translate=\"no\" dir=\"ltr\">SHOP.TO</a>, which benefits from the growth of Amazon, he said. </p><p>\"What we're doing is finding emerging companies that have even better growth than the giant companies and rational valuations that will outperform over multi-year periods,\" Fish said. </p><p>Plenty of investors remain bullish on big tech-focused stocks, citing their strong earnings and history of dynamic growth.</p><p>Saira Malik, chief investment officer for global equities at Nuveen, is looking for tech companies that may benefit from rising inflation and have lagged the broad market rally. </p><p>She believes shares of Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, which has trailed the market with an 8<span class=\"tr-strong\">% </span>gain this year, will be one such “catch up trade,\" powered by growth in e-commerce.</p><p>\"This is a time to be more selective,\" Malik said.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by David Randall; Additional reporting by Noel Randewich and Ira Iosebashvili; Editing by David Gregorio)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:David.Randall@thomsonreuters.com\" data-type=\"email\" translate=\"no\">David.Randall@thomsonreuters.com</a> ; 646-223-6607; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://david.randall.thomsonreuters.com@reuters.net\">david.randall.thomsonreuters.com@reuters.net</a> ))</p><div class=\"tr-additinfo\"><pre>Wall St Week Ahead runs every Friday. For the daily stock market report, please click <a href=\"reuters://REALTIME/verb=Headlines/ric=.N\" data-type=\"newsExpression\" data-expression=\".N\" translate=\"no\" dir=\"ltr\">.N</a> \n</pre></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-STOCKS/WEEKAHEAD (SCHEDULED COLUMN)</p></div>"}