{"date": "2021-11-26 20:51:50.458000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3504.56, "close": 3507.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Black Friday 2021 is here and Amazon has all the fashion deals you could want from Calvin Klein, Adidas, Lee Jeans, Under Armour, and more. To add more excitement to your bargain hunting, Prime's personal shopper program will let you sit back, relax, and have the experts pick your clothing if you prefer. Save $10 off of $50 when you use the code PS10 at checkout while updating your wardrobe for the year. </p></div><div class=\"tr-npp-body\"><p><span><span>Tackle your holiday shopping with deals and expert advice delivered straight to your phone.</span> Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p>One standout deal on Amazon Black Friday we found is Levi Jeans for 40% off. Since straight-leg jeans are back in style, we thought the Levis Ribcage Straight Ankle Jeans (with a cropped length for Petites and stretchy fabric) starting at $39.62 was a steal as they usually cost $98. Since you're sure to spend hours digging through Black Friday deals on Amazon, we've rounded up the best women's and men's fashion steals for outerwear, sweaters, shoes, dresses, accessories, handbags, and of course, jeans.</p><p class=\"tr-npp-section-title\">Amazon Black Friday Women's Clothing Deals</p><p class=\"tr-npp-section-title\">Dresses</p><ul class=\"bulleted-list arrowlist\"><li><span>Sarin Mathews Women's Off the Shoulder Short Sleeve High Low Cocktail Skater Dress Starting at $12.99</span> </li><li><span>VIISHOW Women's Round Neck 3/4 Sleeves A-Line Casual T-Shirt Dress starting at $15.29</span> </li><li><span>Lark &amp; Ro Women's Crepe Cross-Over Empire Wrap dress starting at $16.40</span> </li><li><span>AUSELILY Women's Short Sleeve Pleated Loose Swing Casual Dress starting at $24.64</span> </li><li><span>Calvin Klein Long Sleeve Hoodie Dress starting at $47.05 </span> </li> </ul><p class=\"tr-npp-section-title\">Sweaters and Tops</p><ul class=\"bulleted-list arrowlist\"><li><span>Lands' End Women's No-Iron Supima Cotton Long Sleeve Shirt starting at $10.18</span> </li><li><span>Lands' End Women's Cotton Open Long Cardigan Sweater starting at $11.08</span> </li><li><span>Lands' End Women's Supima Cotton Turtleneck Tunic starting at $15.08</span> </li><li><span>Amazon Essentials Women's Soft Touch Funnel Neck Cable Sweater starting at $20.90</span> </li><li><span>Jescakoo Tunic Top for Leggings Long Sleeve Crew Neck Shirt starting at $23.99</span> </li> </ul><p class=\"tr-npp-section-title\">Jeans, Skirts and Bottoms</p><ul class=\"bulleted-list arrowlist\"><li><span>find. Women's Wide Leg Trousers starting at $19.53</span> </li><li><span>Riders by Lee Indigo Women's Fringe Cuff Boyfriend Jean starting at $21.46</span> </li><li><span>Grace Karin Women's Cropped Paper Bag Waist Pants with Pockets starting at $26.34</span> </li><li><span>Levi's Women's 311 Shaping Skinny Jeans (Standard and Plus) starting at $28.55</span> </li><li><span>Calvin Klein Women's Cargo Highwaisted Belted skirt starting at $30.12</span> </li><li><span>Adidas Originals Women's Adicolor Shattered Trefoil Track Pants starting at $38.41</span> </li><li><span>Levi's Women's Ribcage Straight Ankle Jeans starting at $39.62</span> </li> </ul><p class=\"tr-npp-section-title\">Outerwear</p><ul class=\"bulleted-list arrowlist\"><li><span>Calvin Klein Women's Double Breasted Peacoat starting at $102.44</span> </li><li><span>Calvin Klein Women's Zip Front Polyfill Anorak Parka starting at $118.18</span> </li> </ul><p class=\"tr-npp-section-title\">Bags</p><ul class=\"bulleted-list arrowlist\"><li><span>Druebea Women's Soft Faux Leather Tote for $15.09 (Save $15.90)</span> </li><li><span>Timberland Women's RFID Leather Wallet Phone Bag with Detachable Crossbody Strap for $29.71 (Save $15.28</span> )</li> </ul><p class=\"tr-npp-section-title\">Shoes</p><ul class=\"bulleted-list arrowlist\"><li><span>Adidas Women's Adilette Shower Slides starting at $14.99</span> </li><li><span>Hush Puppies Women's Seasonal Chaste Ballet Flat starting at $27.78</span> </li><li><span>Adidas Women's QT Racer 2.0 Running Shoes starting at $28.55</span> </li><li><span>Sperry Women's Seasonal Saltwater Rain Boots starting at $46.91</span> </li><li><span>Koolaburra by UGG Women's Koola Short Fashion Boot starting at $64.95</span> </li> </ul><p class=\"tr-npp-section-title\">Accessories</p><ul class=\"bulleted-list arrowlist\"><li><span>Fossil Women's Georgia Quartz Stainless Steel and Leather Casual Watch for $53 (Save $72)</span> </li><li><span>Ray-Ban Women's Erika Round Sunglasses for $115.04 (Save $57.96)</span> </li><li><span>Ray-Ban Women's Jackie Ohhh Sunglasses for $137.20 (Save $58.80)</span> </li> </ul><p class=\"tr-npp-section-title\">Amazon Black Friday Men's Clothing Deals</p><p class=\"tr-npp-section-title\">Outerwear</p><ul class=\"bulleted-list arrowlist\"><li><span>Amazon Essentials Men's Lightweight Water-Resistant Packable Hooded Puffer Jacket starting at $31.10</span> </li><li><span>Amazon Essentials Men's Heavyweight Hooded Puffer Coat starting at $38.40</span> </li><li><span>Levi's Men's Sherpa Trucker Jacket starting at $55.78</span> </li> </ul><p class=\"tr-npp-section-title\">Sweaters and tops</p><ul class=\"bulleted-list arrowlist\"><li><span>Amazon Essentials Men's Crewneck Sweater starting at $13.20</span> </li><li><span>Wrangler Authentics Men's Sweater Fleece Zip-Up starting at $15.94</span> </li><li><span>ATG by Wrangler Men's Long Sleeve Mixed Material Shirt starting at $23.99</span> </li><li><span>Adidas Men's Essentials Warm-Up 3-Stripes Track Top starting at $26.25</span> </li><li><span>Under Armor Men's Challenger II Midlayer T-Shirt starting at $35.69</span> </li> </ul><p class=\"tr-npp-section-title\">Jeans and bottoms</p><ul class=\"bulleted-list arrowlist\"><li><span>Wrangler Authentics Men's Premium Relaxed Fit Straight Leg Cargo Pant starting at $21.59</span> </li><li><span>Adidas Men's Essentials Fleece Tapered Cuff 3-Stripes Pants starting at $23</span> </li><li><span>Levi's Men's 505 Regular-Fit Jeans starting at $24.69</span> </li><li><span>Calvin Klein's Men's Slim-Fit Jeans starting at $33.99</span> </li> </ul><p class=\"tr-npp-section-title\">Shoes</p><ul class=\"bulleted-list arrowlist\"><li><span>Adidas Men's Adilette Shower Slides from $14</span> </li><li><span>Under Armour Men's Ignite Vi Graphic Strap Slide Sandal from $18.38</span> </li><li><span>Under Armour Men's Charged Assert 9 Running Shoe from $39.38 </span> </li><li><span>Sperry Men's Seasonal Avenue Duck Boot from $59 </span> </li> </ul><p class=\"tr-npp-section-title\">Accessories</p><ul class=\"bulleted-list arrowlist\"><li><span>Fossil Men's the Minimalist Stainless Steel Watch for $61 (Save $78)</span> </li><li><span>Ray-Ban Classic Aviator Sunglasses for $107.76 (Save $53.94)</span> </li><li><span>Ray-Ban Original Wayfarer Glasses for $112.70 (Save $48.30)</span> </li> </ul><p class=\"tr-npp-section-title\">Shop the Amazon Black Friday Sale</p><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Amazon has major markdowns on fashion for Black Friday: These are the best deals on Adidas, Ugg and more</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}