{"date": "2022-01-11 21:51:57.392000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_6ehrvisb&amp;referenceId=1_6ehrvisb&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_6ehrvisb&amp;referenceId=1_6ehrvisb&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: Bango PLC (AIM:BGO) (Bango PLC (AIM:BGO)) Paul Larbey joins Proactive London's Katie Pilbeam after revealing underlying profits for 2021 were in line with expectations, while revenue grew by a forecast-beating 32%.&amp;#xD;&amp;#xD;He says the period witnessed 'high growth' in the payments business following new deals with Amazon.com, Inc. and Microsoft Corp and global partnerships with NTT Data, KakaoPay and TPAY.&amp;#xD;&amp;#xD;Revenue increased to US$20.7mln in the year to 31 December 2021 from US$15.7mln in the previous year. End-user spend grew to US$4.1bn from US$2.4bn and adjusted EBITDA rose to US$6.1mln from US$6mln.<br/>Short Link: <a href=\"https://refini.tv/3tikSIe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3tikSIe</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Hello there. You're watching Proactive London. And today we're joined by Paul Larbey here from Bango to talk about your strong trading update for your investors this morning that's been published. So good to see you, Paul. How are you feeling about this one? &gt;&gt; Good, thanks. And happy new year to you and anybody watching. And a great way to start the year. We delivered 30% growth which is ahead of the market expectations of 20%, and that's on the back of what. Last year was a record year where we grew 70%, so a really solid year and we're really pleased. &gt;&gt; [inaudible 00:00:36] You delivered revenue growth above expectations. What do you think have been the main drivers behind that growth, would you say? &gt;&gt; I think there are three key drivers behind that if you look fundamentally at the payments business. We continue to grow, bringing on more routes and more merchants. We launched our first Microsoft Game Pass Ultimate bundles. We then expanded the relationship with them to Microsoft 365. So continue to grow with new merchants and the merchants bringing on new services to the platform. So just that continuous of that [inaudible 00:01:08] historic growth that we've seen. And then, on top of that, we saw the layer in the platform business. Whereas with the weather, people who want to bundle multiple services together pay a platform free to aggregate all third-party services together. And when we started that with BT back in 2020. We announced Horizon last year. And there's a great pipeline of deals there. And the nice thing about that is a great foundation when actually you don't see a lot of those great results we've just talked about. The benefit for those deals is not that evident. It becomes more evident in 2022 and 2023 and beyond as they start to grow. And then, the third element, that is the power purchase behavior targeted. So buying audience is where we take all that payment data we have created into segments that we call audiences that allow people to target in marketing tools based on purchase history. And in that one, we've seen a massive expansion in the app developer space like the start of games to NFT apps, to crypto and trading apps. And some really big customers on board now who are putting significants amount of their marketing spend through Bango audiences to take advantage of purchase [inaudible 00:02:12] As always, it's a combination of those three. &gt;&gt; And you've typically had a second-half waited results, what we've seen in more streamlined performance from you for this year. Can you maybe talk about what's allowed for that shift? &gt;&gt; I think it's a combination of the three businesses together. I think historically in payments, there's a lot of events in the second half which drive a lot of spending. We have Black Friday, Cyber Monday, Christmas, New Year, [inaudible 00:02:38] in Japan is a big event. So lots of big payment events in the second half. And also, you get the natural evolution though. You launch something and it grows continuously over time. So you get more revenue six months out when it was launched. So there's a combination of both of those. And what's offset that slightly is the marketplace; for example, buying audiences has a slightly different seasonality. Had a great year, but I think December, somewhat ironically, is not a great year for app developers marketing because the cost of advertising goes up, because a lot of the retail developers take a lot of the Facebook marketing and that drives up the cost. So they ramp back their expense bent slightly. So slightly different seasonality. And also, the platform business is a little bit lumpy. There's integration fees and license fees and step up in license and maintenance fees, so it becomes a little lumpy. So it's a combination of all of those things. We'll see how it evolves over time. But still second half wait to join good growth second half to first half. &gt;&gt; Let's maybe get stuck in and talk about your financial strategy and how that revenue growth crucially dropped through to adjusted EBITDA. &gt;&gt; One of the nice things we have is we have this platform approach. So the more top line we generate, a lot of that can drop straight through to the bottom line, and up to 2020, that's exactly what we did. We allowed all that top line growth to drop straight through into the bottom line. We're in the very fortunate position now where we're very cash [inaudible 00:03:56] We have no debt, we have a strong balance sheet with a growing cash position. And so we chose this year [inaudible 00:04:02] in 2021 to reinvest a lot of extra profit that came from that top-line growth to allow us to grow the two new areas fastest, specifically the Bango audiences with a purchase [inaudible 00:04:10] targeting, but also the platform business. So we're in our very nice position where we can choose to grow, where we don't need to go back to the market to raise money with generating cash was very profitable. So the tap on the investment is entirely within our control and that's what we chose to do in 2021, which is why you see the slight growth on the EBITDA, but it's largely slapped with the [inaudible 00:04:30] year. And it's because of that increase investment which will pay dividends in the future. &gt;&gt; Well, maybe looking ahead to this year, what can we expect from Bango? &gt;&gt; So great progress in 2021. I said a bit earlier, a lot of the exciting things that form a foundation for future growth you don't necessarily see in the top-line numbers at the senior trading update. 2021 was all about building the foundations for the growth that we see this year and beyond and continue traction with payments, new merchants coming all the time, it's [inaudible 00:05:01]. com recently. New operators connecting into the platform. That platform approach, I talked about early, we'll start to see as these services start to launch and people ramp up the license revenues. That will start to meaningfully contribute. But most of those are driving annual to spend for our purchase behavior targeting. And we've seen from some of the campaigns when we're increasing the awareness of purchase behavior targeting, so that more and more segments of app developers, but also outside of developers, start to become aware of the power of that technology. And so we get a broader range of customers who are connected to that platform. So you put all those together, it makes it a very exciting year. We have the right strategy, we have three strong and very fast-growing revenue streams, a strong balance sheet with no debt and importantly, the right team that's very motivating, very engaged, and it's actually growing fast that can help us grow. So put all that together, we report fully results in March. But the next couple of years look really exciting indeed. &gt;&gt; Paul Larbey, thank you so much from Bango here on Proactive today.<br/></span></div></div></div></div>"}