{"date": "2022-02-08 14:36:05.358000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">HARMLESS HARVEST, TOP-SELLING U.S. COCONUT FOOD &amp; BEVERAGE BRAND, DEBUTS IN CANADA THIS FEBRUARY 2022</p>\n<p>OAKLAND, Calif., Feb. 8, 2022</p>\n<p>\n<span>Harmless Harvest will Launch Organic Coconut Products at Costco Canada This Month And at All Whole Foods Market Locations and other Select Retailers in <span>April 2022</span>\n</span>\n</p>\n<p>\n<span>\n<span>OAKLAND, Calif.</span>\n</span> , <span>\n<span>Feb. 8, 2022</span>\n</span> /CNW/ -- <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3435039-1&amp;h=459154673&amp;u=https%3A%2F%2Fharmlessharvest.com%2F&amp;a=Harmless+Harvest\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Harmless Harvest</a>\n</span> , maker of organic coconut-based food and beverage products, will be available in <span>Canada</span> for the first time, launching its famed Organic Coconut Water in the Costco Western Canada Region this <span>February 2022</span> along with additional products to appear on shelves at all Whole Foods Market locations and other select retailers nationwide in <span>April 2022</span> . The bestselling CPG brand with a loyal fanbase in the U.S. has long been renowned for its portfolio of uniquely delicious coconut water, refreshing smoothies, and satisfying dairy-free coconut yogurt alternatives, bringing joy to consumers with its great tasting, organic, sustainable, and ethically-sourced products.</p>\n<p>\n\n</p>\n<p>Harmless Harvest's debut in Costco Canada will mark its first ever international launch, a long-time goal of the beloved brand with a substantial and rapidly growing following of dedicated fans. \"We've earned a reputation as an innovative category leader in the plant-based food and beverage industry in the U.S., and we're excited to bring the energy that fuels that fandom to <span>Canada</span> , a market that has been clamoring for Harmless Harvest for quite some time,\" said <span>Heather Cutter</span> , Chief Growth Officer at Harmless Harvest. \"As an ever-evolving brand, we endeavor to reach new audiences with our remarkable products while sharing our message of transparency and social accountability in all we do.\"</p>\n<p>The Costco Canada launch will introduce Canadians to Harmless Harvest's Organic Coconut Water, the fan-favorite product that has garnered major recognition for the brand in the U.S. Harmless Harvest uses organic, uniquely fragrant young coconuts grown on farms in the Samut Sakhon region of <span>Thailand</span> . The product is minimally processed to preserve that straight-from-the-coconut taste. Harmless Harvest is the first company to use a non-thermal pasteurization method that allows the coconut water to turn pink naturally due to its antioxidants interacting with the elements, such as light.</p>\n<p>In addition to Harmless Harvest's Organic Coconut Water, the brand will also launch its award-winning Organic Coconut Smoothie, a product U.S. consumers have fallen in love with, in Whole Foods Market and several other retailers across <span>Canada</span> this spring. Harmless Harvest's Organic Coconut Smoothie is a single-ingredient beverage that blends coconut water with hand-scooped coconut meat and contains naturally occurring electrolytes and MCTs.</p>\n<p>Harmless Harvest Coconut Water will be available in 6-pack cases at Costco Canada locations. All other retailers will offer individual bottles of both the Coconut Water and Harmless Harvest's Coconut Smoothie in various sizes.</p>\n<p>True to its name, Harmless Harvest is committed to regenerative agriculture practices, including the implementation of cover crops and intercropping with its farmer partners to improve yields and build drought resiliency. Harmless Harvest's mission is rooted in doing minimal harm through a thoughtful supply chain that takes care of people and the environment, all while making exceptional products. A Fair For Life Certified brand, Harmless Harvest has donated over <span>$1 million</span> through the Fair for Life fund to the communities in which it operates, which, in 2021, was used to support initiatives such as mobile health checkups, providing school laptops, uniforms, and PPE to local Thai communities.</p>\n<p>\n<span>About Harmless Harvest</span>\n</p>\n<p>Harmless Harvest makes delicious organic coconut-based products including coconut water, coconut-based beverages, and coconut-based yogurts. The brand was the first to launch a non-thermally pasteurized coconut water in the US, as well as the first coconut water to be Fair for Life certified. Harmless Harvest is committed to rigorous and independent standards for fair trade and social progress within its supply chain. It operates on an ecosystem-based approach, considering its impact from seed to shelf. True to its name, Harmless Harvest is an ever-evolving brand with the ultimate goal of doing minimal harm while making remarkable products. For more information please visit <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3435039-1&amp;h=2887972872&amp;u=https%3A%2F%2Fharmlessharvest.com%2F&amp;a=harmlessharvest.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">harmlessharvest.com</a>\n</span> .</p>\n<p>SOURCE Harmless Harvest</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/08/c3730.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/08/c3730.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}