{"date": "2021-12-21 13:41:09+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        Repsol has signed a strategic collaboration with Amazon Web Services (AWS) through which both companies will cooperate to achieve their respective sustainability goals. AWS will provide Repsol with new cloud services to further advance its digital transformation, and Repsol will supply renewable energy to power Amazon business operations.\n      </p>\n                <p>\n        As part of this collaboration, Repsol and Amazon executed power purchase agreements (PPA) to supply Amazon with renewable energy generated from 234 MW of solar and wind installed capacity in Spain. Repsol plans to continue growing its renewable business thanks to the development of a portfolio of projects in operation and development in OECD countries, being currently present in Spain, the United States, Chile, and Portugal.\n      </p>\n                <p>\n        According to María Victoria Zingoni, Repsol Client and Low Carbon Energy Generation Executive Managing Director, \"this collaboration agreement with AWS shows the quality of our renewable business and adds a boost to its profitability. It represents a further step in the fulfillment of our strategy for a sustainable and efficient energy transition, committing to digitalization as an indispensable lever of transformation.\"\n      </p>\n                <p>\n        Howard Gefen, AWS General Manager of Energy, said: \"This collaboration will help us meet our Climate Pledge commitment to reach net-zero carbon by 2040 and power our operations with 100% renewable energy by 2030, a target we are on a path to meet 5 years early by 2025. We are excited to work with Repsol to develop new innovative cloud solutions to help them achieve their sustainability goals and accelerate their digital transformation.\"\n      </p>\n                <p>\n        Repsol has renewable power generation as one of its decarbonization pillars and has recently updated its 2030 installed capacity targets to 20 GW, a 60% increase over the previous target. By 2025, installed capacity will increase to 6 GW, up from the 1.7 GW that Repsol expects to achieve by the year's end.\n      </p>\n                <p>\n        In October, Repsol increased its ambition to invest in low-carbon projects. Between 2021 and 2025, the multi-energy company will allocate an additional €1 billion to low-carbon projects, up to a total of €6.5 billion, compared to the €5.5 billion set out in the Strategic Plan approved in November 2020. Moreover, in December 2019, Repsol was the first company in its sector to commit to be carbon neutral by 2050.\n      </p>\n                <p>\n                  <strong>\n                    <span>New cloud services</span>\n                  </strong>\n                  <br/>\n                </p>\n                <p>\n        Through this collaboration, AWS will provide Repsol with new cloud services such as High Performance Computing (HPC), Digital Twins, and Natural Language Processing to help Repsol accelerate its digital transformation of operations while supporting its sustainability goals, strengthening their integrated approach towards a hybrid multicloud for agility, flexibility, emissions reduction, and cost savings, as set out in the multi-energy company's 2021-2025 Strategic Plan.\n      </p>\n                <p>\n        One of the pillars of Repsol's transformation and the 2021-2025 Strategic Plan is digitalization, with a digital program that in just over three years has carried out more than 300 initiatives with more than 1,200 people are involved. Artificial intelligence, big data, automation of operations, and cloud solutions are the main axes for transforming the businesses, building customer loyalty, and accelerating the energy transition. Returns have been above €330 million in 2020, of which €150 million are specific to the use of data, analytics, and artificial intelligence. By 2021, returns from the digital program are expected to reach €500 million.\n      </p>\n                <p>\n        Both companies will also analyze opportunities for collaboration to deploy new digital technologies, such as Quantum Computing, and to increase the efficiency of the logistics operations of Repsol's businesses. In addition, both companies will create a transversal platform to systematically analyze business opportunities in the field of mobility and electricity generation.\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.repsol.com/en/press-room/press-releases/2021/repsol-and-amazon-announce-strategic-collaboration/index.cshtml\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Repsol SA</strong> published this content on <strong>21 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>21 December 2021 13:41:09 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Repsol SA</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Repsol-SA</p></div>"}