{"date": "2022-02-15 07:00:46.463000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 6521BSoftline Holding PLC15 February 2022</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>Softline Holding PLC</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Softline announces</span>\n</span>\n<span>\n<span>\n<span>strong results for</span>\n</span>\n</span>\n<span>\n<span>Q3'21, including 25% increase in gross profit and 36% increase in adj. EBITDA, further demonstrating the success of its 3D strategy with geographic expansion, sales channel development and product portfolio expansion</span>\n</span>\n</p>\n<p>\n<span>\n<span>\n</span></span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>15 <span>th</span> February 2022, London, UK</span>\n</span>\n<span>\n<span>-</span>\n</span>\n<span>Softline Holding PLC [SFTL,</span>\n<span>\n<span>US83407L2079</span>\n</span>\n<span>]</span>\n<span>\n<span>(Softline, Softline Group, the Group, or the Company), a leading global IT solution and services provider with a focus on digital transformation, cloud, and cybersecurity, announces unaudited key operating highlights for the third quarter of financial year ending 31 March 2022.</span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Q3 and 9M 2021 BUSINESS HIGHLIGHTS</span>\n</p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>•</span>\n</p>\n</td>\n<td>\n<p>\n<span>Gross Profit increased 25% YoY to $102M for period Q3'21, and 36% YoY to $231M for the 9 Months to 31 December 2021.</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>•</span>\n</p>\n</td>\n<td>\n<p>\n<span>Adj. EBITDA Margin (from Gross Profit) was 33% for period Q3'21, an increase of 36% YoY. For the 9 Months to 31 December 2021, Adj. EBITDA Margin (from Gross Profit) was 26%, an increase of 42% YoY, and provides a strong foundation for 2021 business outlook.</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>•</span>\n</p>\n</td>\n<td>\n<p>\n<span>Turnover for the period 31 March - 31 December 2021 increased by 20% year-on-year to US$1,642 million. Including the impact of unconsolidated turnover of $46M from Belitsoft, DigiTech and Squalio, turnover growth was 23% for the same period.</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>•</span>\n</p>\n</td>\n<td>\n<p>\n<span>Turnover growth of 114% YoY from higher profitability Services business.</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>•</span>\n</p>\n</td>\n<td>\n<p>\n<span>Recurring turnover increased to more than 55% of overall turnover.</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>•</span>\n</p>\n</td>\n<td>\n<p>\n<span>Softline made five key strategic acquisitions since IPO… accelerating geographic expansion, skills and capabilities, including Umbrella Infocare - a market-leading cloud services company based in Delhi; Softclub - a specialist in the rapidly-growing industry of fintech; MMTR Technology - a specialist in software development and application engineering employing nearly 500 software engineers; Academy IT - bespoke corporate training solutions; and TC Engineer - cyber security capabilities.</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>•</span>\n</p>\n</td>\n<td>\n<p>\n<span>Launched industry leading performance based long-term all employee partnership program, driving talent attraction and retention. Comprehensive motivational programme will help drive long-term partnership with employees as we double down on attracting the best talent and boosting opportunities… which is critical in this industry, and strengthens our long-term competitive positioning.</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>•</span>\n</p>\n</td>\n<td>\n<p>\n<span>37% increase in headcount YoY to 6,536. Boosted capacity to 2,500 software engineers since 31st December, and targeting 5,000 professionals in the medium term.</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>•</span>\n</p>\n</td>\n<td>\n<p>\n<span>Completed the expansion of the Board, which now has a majority of independent non-executive directors, in line with our commitment to best practice governance.</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>•</span>\n</p>\n</td>\n<td>\n<p>\n<span>Published our ESG statement, in line with our focus on ESG</span>\n<span>\n<span>\n<a href=\"https://softline.com/about/esg/esg-statement\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://softline.com/about/esg/esg-statement</a>\n</span>\n</span>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>•</span>\n</p>\n</td>\n<td>\n<p>\n<span>Implemented and increased the share buyback programme to fund the Company's long-term management incentive plan, the long-term employee partnership program (\"LTEPP\"), and the employee share purchase scheme announced on 24 January 2022.</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Igor Borovikov, Chairman of the Board of Directors of Softline Group, noted:</span>\n</p>\n<p>\n<span>\"Softline is a story of growth. Bringing the company to the stock market was a dream we have since fulfilled, and we have already embarked on the next chapter on our journey to reach our Dream 2.0 as we drive the next wave of growth. We will continue on our geographic expansion to more than 80 countries, solidifying our position as a global leader in digital transformation solutions, platforms and services. Our talent strategy also underpins Dream 2.0, and we recently made a significant step forward by implementing the industry leading performance based long-term employee partnership program. The company that wins in the market is the one that knows how to attract and retain the best personnel, and we strive to be the best company on the market for employees, creating an environment of shared success where our people can prosper. In addition to the business results, we want to further improve our position as sector leader in compliance and in matters that define modern responsible business: environment, society and governance. We look forward to continuing this journey alongside our customers, teams, partners, and investors.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Softline Global CEO Sergey Chernovolenko said:</span>\n</p>\n<p>\n<span>\"I would like to thank our entire team of more than 6,500 Softliners around the world, in addition to warmly welcoming more than 1,700 newcomers to our business over the past month, as we remain committed to partnering with our customers and continuing to help drive their digital transformation. Once again, the results demonstrate the success of our 3D strategy across geographic, portfolio, and sales channel expansion, and we are pleased with the very significant profitability in the third quarter. We are operating at speed and scale, and we continue to deliver on the commitments we made during our IPO. We promised to invest the large majority of US$400 million capital raised on strategic and targeted M&amp;A using advantageous multipliers, and we are delivering. The five new deals we have recently announced bring significant skills and capabilities in fast growing areas, for example with our expanded footprint in Services, where we now have around 2,500 software engineers and developers around the world, well on our way to our target of 5,000. Acquisitions are a catalyst for growth, and are aligned with our 3D strategy and our ambitious plans for 2022 and beyond.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Key Figures</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n</p></td>\n<td colspan=\"2\">\n<p>\n<span>9M 2021</span>\n</p>\n</td>\n<td>\n<p>\n<span>9M 2020</span>\n</p>\n</td>\n<td>\n<p>\n<span>%</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n<span>3</span>\n</span>\n<span>\n<span>Q</span>\n</span>\n<span>\n<span>2021</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>3Q 2020</span>\n</p>\n</td>\n<td>\n<p>\n<span>%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td colspan=\"2\">\n<p>\n<span>Turnover ($ '000)</span>\n</p>\n</td>\n<td>\n<p>\n<span>1 641 531</span>\n</p>\n</td>\n<td>\n<p>\n<span>1 362 695</span>\n</p>\n</td>\n<td>\n<p>\n<span>20%</span>\n</p>\n</td>\n<td>\n<p>\n<span>665 055</span>\n</p>\n</td>\n<td>\n<p>\n<span>587 076</span>\n</p>\n</td>\n<td>\n<p>\n<span>13%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td colspan=\"2\">\n<p>\n<span>Recurring turnover %</span>\n</p>\n</td>\n<td>\n<p>\n<span>55.2%</span>\n</p>\n</td>\n<td>\n<p>\n<span>54.6%</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td colspan=\"2\">\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td colspan=\"4\">\n<p>\n<span>Turnover by business line ($ '000)</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td colspan=\"2\">\n<p>\n<span>Software &amp; Cloud</span>\n</p>\n</td>\n<td>\n<p>\n<span>1 365 343</span>\n</p>\n</td>\n<td>\n<p>\n<span>1 139 066</span>\n</p>\n</td>\n<td>\n<p>\n<span>2</span>\n<span>0</span>\n<span>%</span>\n</p>\n</td>\n<td>\n<p>\n<span>5</span>\n<span>29</span>\n<span>\n<span>325</span>\n</span></p>\n</td>\n<td>\n<p>\n<span>484 980</span>\n</p>\n</td>\n<td>\n<p>\n<span>9%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td colspan=\"2\">\n<p>\n<span>IT</span>\n<span>S</span>\n<span>ervices</span>\n</p>\n</td>\n<td>\n<p>\n<span>103 240</span>\n</p>\n</td>\n<td>\n<p>\n<span>54 447</span>\n</p>\n</td>\n<td>\n<p>\n<span>90%</span>\n</p>\n</td>\n<td>\n<p>\n<span>50</span>\n<span>\n<span>562</span>\n</span></p>\n</td>\n<td>\n<p>\n<span>23 572</span>\n</p>\n</td>\n<td>\n<p>\n<span>11</span>\n<span>4</span>\n<span>%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td colspan=\"2\">\n<p>\n<span>Hardware</span>\n</p>\n</td>\n<td>\n<p>\n<span>172 949</span>\n</p>\n</td>\n<td>\n<p>\n<span>169 183</span>\n</p>\n</td>\n<td>\n<p>\n<span>2</span>\n<span>%</span>\n</p>\n</td>\n<td>\n<p>\n<span>85 168</span>\n</p>\n</td>\n<td>\n<p>\n<span>78 523</span>\n</p>\n</td>\n<td>\n<p>\n<span>8%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n</td><td>\n</td><td>\n</td><td>\n</td><td>\n</td><td>\n</td><td>\n</td><td>\n</td></tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n<span>9M 2021</span>\n</p>\n</td>\n<td>\n<p>\n<span>9M 2020</span>\n</p>\n</td>\n<td>\n<p>\n<span>%</span>\n</p>\n</td>\n<td>\n<p>\n<span>3Q 2021</span>\n</p>\n</td>\n<td>\n<p>\n<span>3Q 2020</span>\n</p>\n</td>\n<td>\n<p>\n<span>%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td colspan=\"2\">\n<p>\n<span>Turnover by region ($ '000)*</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>APAC</span>\n</p>\n</td>\n<td>\n<p>\n<span>395 670</span>\n</p>\n</td>\n<td>\n<p>\n<span>213 145</span>\n</p>\n</td>\n<td>\n<p>\n<span>85.6%</span>\n</p>\n</td>\n<td>\n<p>\n<span>109 948</span>\n</p>\n</td>\n<td>\n<p>\n<span>76 410</span>\n</p>\n</td>\n<td>\n<p>\n<span>4</span>\n<span>3.4</span>\n<span>%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>EMEA</span>\n</p>\n</td>\n<td>\n<p>\n<span>107 685</span>\n</p>\n</td>\n<td>\n<p>\n<span>24 456</span>\n</p>\n</td>\n<td>\n<p>\n<span>340.3%</span>\n</p>\n</td>\n<td>\n<p>\n<span>60 169</span>\n</p>\n</td>\n<td>\n<p>\n<span>11 913</span>\n</p>\n</td>\n<td>\n<p>\n<span>405</span>\n<span>.1</span>\n<span>%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Russia</span>\n</p>\n</td>\n<td>\n<p>\n<span>885 221</span>\n</p>\n</td>\n<td>\n<p>\n<span>864 306</span>\n</p>\n</td>\n<td>\n<p>\n<span>2.4%</span>\n</p>\n</td>\n<td>\n<p>\n<span>403 204</span>\n</p>\n</td>\n<td>\n<p>\n<span>401 667</span>\n</p>\n</td>\n<td>\n<p>\n<span>0</span>\n<span>.4</span>\n<span>%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>RoE</span>\n</p>\n</td>\n<td>\n<p>\n<span>104 464</span>\n</p>\n</td>\n<td>\n<p>\n<span>96 942</span>\n</p>\n</td>\n<td>\n<p>\n<span>7.8%</span>\n</p>\n</td>\n<td>\n<p>\n<span>42 753</span>\n</p>\n</td>\n<td>\n<p>\n<span>51 106</span>\n</p>\n</td>\n<td>\n<p>\n<span>-16</span>\n<span>.3</span>\n<span>%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>LATAM</span>\n</p>\n</td>\n<td>\n<p>\n<span>147 692</span>\n</p>\n</td>\n<td>\n<p>\n<span>163 846</span>\n</p>\n</td>\n<td>\n<p>\n<span>-9.9%</span>\n</p>\n</td>\n<td>\n<p>\n<span>48 181</span>\n</p>\n</td>\n<td>\n<p>\n<span>45 980</span>\n</p>\n</td>\n<td>\n<p>\n<span>4.8</span>\n<span>%</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>*</span>\n<span>Regional numbers exclude intercompany sales</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>BUSINESS Review - THIRD QUARTER</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Services -</span>\n</span>\n<span>Services grew 114% YoY comparing to Q3 2020, and 92% QoQ comparing to Q2 2021 reflecting the success of our 3D strategy. While traditionally a higher growth quarter, we exceeded the seasonality impact in Q3. Growth reflects the impact of acquisitions, but we also had strong organic growth.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Software &amp; Cloud</span>\n</span>\n<span>-</span>\n<span>Turnover</span>\n<span>from Software &amp; Cloud increased by 9% in Q3, driven by growing demand for digital transformation among our customers. The cloud business is growing very well, with continued strength in Q3, and growth overall was on the base of a strong compare in Q3 last year in Software.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Hardware -</span>\n</span>\n<span>Hardware grew 8%, despite the increased delivery time due to the global shortage of chips. We continue to see demand, even with extended production times for hardware.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Geographic Turnover -</span>\n</span>\n<span>Growth was driven by particular strength in our international business with turnover now representing 46% of total turnover. This is part of our promise to advance the diversification of our business. Growth was particularly strong in EMEA, and APAC, both organically and due to recent acquisitions. Russia came in as expected, and growth was impacted partly due to a strong Q3 from 2020 with the impact of the VAT introduction for software transactions, and hardware delays, though overall there is no significant change to customer demand. LATAM improved with growth at mid-single digits in Q3.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Profitability</span>\n</p>\n<p>\n<span>Gross Profit in Q3 2021 was $101.8M, up 25% year over year, compared to $81.2M for Q3 last year. Growth was broad-based overall, particularly with 146% growth of our Services business. Gross Profit margin, turnover based, was 15.3%, compared to 13.8% for Q3 last year thanks to the contribution of more profitable services business.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>For Q3, adjusted EBITDA was $33.2M, representing growth of 36% from $24.5M reported in Q3 2020. Adjusted EBITDA margin, Gross Profit based, was 32.6%, compared to 30.1% for Q3 last year.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Other selected financial metrics</span>\n</p>\n<p>\n<span>As previously announced, Softline implemented a GDR buyback programme intended to fund the Company's long-term management incentive plan, as notified in the Company's half year report on 30 November 2021, and additionally the long-term employee partnership program (\"LTEPP\"), and the employee share purchase scheme announced on 24 January 2022. The maximum number of GDRs that can be bought back under the Programme remains up to 10% of the Company's issued share capital (no more than 18.3M GDRs) and the Company cannot own such GDRs for more than 2 years. The company will continue to fund the buyback programme from operations, and finance investments. As approved by the Board the programme has one year duration starting from the date of approval. However, the Company intends to continue the programme for the next few years.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The company had 16,508,117 management LTI options outstanding as at 31 December 2021.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>As of the reporting date operational Net debt/adj.EBITDA came at 0.92x. It excludes IPO proceeds and proceeds from sale of Crayon shares.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>M&amp;A</span>\n</p>\n<p>\n<span>Softline continues to focus on organic growth, as well as targeting M&amp;A to add skills and capabilities, and scale faster in strategic areas. Acquisitions complement the 3D strategy. Softline has a strong track record of identifying and acquiring international companies to help drive growth plans. Recently announced acquisitions include:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Umbrella Infocare is a market-leading cloud services company based in Delhi with a 200+ strong team of cloud professional. Umbrella Infocare is an AWS Premier Consulting Partner with competencies in AWS Managed Services, Migration and DevOps and it also has Platinum Plus Consulting partnership with Citrix. India is a priority market for Softline, and we have established ourselves as a major multi-cloud player, where we have grown 120x organically since 2014, with revenues of over $230m in 2020. This deal will significantly grow our presence in the territory while strengthening our cloud services offerings. Together with our existing expertise, this acquisition will form the basis for creating Softline's global AWS Centre of Excellence (CoE) for customers in almost 60 countries, giving them access to market leading cloud engineering and development services.</span>\n</p>\n<p>\n<span>·</span>\n<span>SoftClub is a specialist in the rapidly-growing industry of financial technology, and the largest developer of integrated solutions for banks, e-commerce, and stock exchanges in Central and Eastern Europe. Considered by industry experts to be amongst the top-100 software firms in the world. SoftClub has one of the most qualified software engineering teams in Eastern Europe with over 20 years of industry experience, and this brings nearly 1,000 professionals with a deep knowledge of the sector to Softline. With annual growth of almost 10%, the fintech industry is set to reach almost $200B in 2023, helped in no small part by the fact that many financial institutions are still faced with the task of overhauling legacy architectures. As such, the financial services sector is tipped to remain one of the largest consumers of information technology in the coming years. The clear potential for growth in this dynamically changing sector was the key driver behind Softline's investment in SoftClub. SoftClub's team of more than 950 employees, including the management team and the company's founder, will form the basis for a centre of excellence for fintech and CRM within Softline, and will be working on complex, large-scale transformations in the banking sector which utilise the latest IT solutions in the ever-changing world of financial services.</span>\n</p>\n<p>\n<span>·</span>\n<span>MMTR Technology is a specialist in software development and application engineering employing nearly 500 software engineers, with a focus on business process automation and quality assurance testing. The acquisition is another important step in Softline's 2022 growth strategy and the company's mission to extend its range of capabilities for next-generation application engineering and software development. Softline is now capable of providing customers with comprehensive support during the application development cycle, including hiring and training software engineering personnel. The range of training capabilities offered by MMTR Technology complements those of Academy IT.</span>\n</p>\n<p>\n<span>·</span>\n<span>Academy IT creates, develops, and deploys bespoke corporate training solutions and has a strong track record particularly in cybersecurity training. The global education technology market is an industry which is forecast to grow to US$404B by 2025, and this acquisition strengthens our position in this high-growth technology sector around the world. It complements our existing technology education and training business and accelerates our growth strategy in emerging markets. This positions us as a market leader in technology training and will help us improve our training capabilities in this booming sector and ideally positions us to pursue new international business opportunities in areas where we see significant demand.</span>\n</p>\n<p>\n<span>·</span>\n<span>Finally, with TC Engineer, we are broadening our cyber security capabilities - extending our portfolio of services with more expertise in compliance, GDPR and cybersecurity awareness training. TC Engineer brings capabilities across the entire spectrum of cybersecurity consulting services. It is clear that cyber security is a critically important need for clients all around the world, and Softline is even better equipped to partner with our clients on the most complex projects.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Softline's management team is pleased with the constantly evolving strong pipeline of deals that they are working on, and the company's M&amp;A strategy supports its three-dimensional growth plans.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Microsoft</span>\n</p>\n<p>\n<span>In November, Softline became a member of the Microsoft Intelligent Security Association (MISA), strengthening its collaboration with Microsoft and its position as a global IT provider. MISA is an ecosystem of independent software vendors and managed security services that integrate solutions to improve security in the face of emerging cyber threats. Microsoft also recognized Softline with multiple <span>Partner of the Year</span> awards, in Bulgaria, Cambodia, Malaysia and Vietnam. In India, Softline proudly received the <span>Technology Partner of the Year</span> award - <span>Security</span> . The company was honoured among a global field of top Microsoft partners for demonstrating excellence in innovation and implementation of customer solutions based on Microsoft technology.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>ESG</span>\n</p>\n<p>\n<span>We continue to advance and embed ESG across our operations, and it continues to be at the forefront of Softline's strategy. The company focuses on creating an environment where people can prosper. Softline's commitment to its teams has been recognized with the certification of <span>Great Place To Work</span> in many of our regions. We have a longstanding dedication to the preservation of basic rights and human dignity in our workplace and beyond, including diversity and inclusion policies which are incredibly important to the company's leadership team.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>As part of its ESG strategy, Softline's purpose is to ensure environmentally sound and sustainable development of the company, and we will continue to look for ways to reduce the climate impact of our business. Softline also has a resilient framework in place for ethics and compliance in all the markets where they operate. The company will continue to promote diversity across its extended governance structure. We have implemented the right board structure to ensure we advance our governance processes, and we now have 4 independent board members. This year, Softline launched a Supplier Code of Conduct (SCoC), focused on gaining supplier commitment to ESG credentials.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Also, this year the company published its ESG statement that can be read here:</span>\n<span>\n<span>\n<a href=\"https://softline.com/about/esg/esg-statement\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://softline.com/about/esg/esg-statement</a>\n</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Outlook</span>\n</p>\n<p>\n<span>For financial year 2021, Softline expects to deliver turnover based gross profit margin of at least 13.5%, versus the prior range of 13 to 14%. Softline expects adjusted EBITDA (gross profit based) to be at least 26%, and turnover to be in the range of $2.3B to $2.4B. Over the medium-term, we are targeting turnover based Gross Profit in the range of at least 13.5% margin, versus the outlook of 13-14% outlined in the prospectus. All other medium-term metrics remain the same, with increasing adjusted EBITDA margin, Gross Profit based reaching the low-30% range, turnover in the high-teens CAGR, with additional turnover contribution from M&amp;A, which our recent transactions give us confidence to support margin objectives in FY22.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Additional Information</span>\n</p>\n<p>\n<span>Softline's related supporting materials can be accessed in the Investor Relations section of Softline.com</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Results conference call</span>\n</p>\n<p>\n<span>An investor, analyst and media webcast will be held on 15 <span>th</span> February 2022 at 8:00am UK time. Softline will announce key operating highlights for the third quarter of financial year ending 31 March 2022.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The webcast can be accessed from the Investor Relations section of Softline.com</span>\n</p>\n<p>\n<span>A livestream of the investor call will be available and can be accessed here:</span>\n</p>\n<p>\n<span>\n<span>\n<a href=\"https://www.lsegissuerservices.com/spark/SOFTLINEHOLDING/events/3f10d8ee-71b7-443f-a7a2-9d2e38fcdbf0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Softline - Q3 FY 21 Trading update - Webcast</a>\n</span>\n</span>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Contacts</span>\n</p>\n<p>\n<span>Eve Frayling Steven Salter</span>\n<span>Alexandra Melnikova</span>\n</p>\n<p>\n<span>Media Global Investor Relations VP IR Director</span>\n</p>\n<p>\n<span>\n<span>\n<a href=\"mailto:Eve.frayling@pagefield.co.uk\" data-type=\"email\" translate=\"no\">Eve.frayling@pagefield.co.uk</a>\n</span>\n</span>\n<span>\n<span>\n<span>\n<a href=\"mailto:IR@softline.com\" data-type=\"email\" translate=\"no\">IR@softline.com</a>\n</span>\n</span>\n<span>\n<span>\n<span>\n<a href=\"mailto:IR@softline.com\" data-type=\"email\" translate=\"no\">IR@softline.com</a>\n</span>\n</span>\n</span></span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>About Softline</span>\n</p>\n<p>\n<span>Softline is a leading global solutions and services provider in digital transformation and cybersecurity, with its headquarters in London. The company enables, facilitates and accelerates the digital transformation of its customers' businesses, connecting over 150,000 organizations from all industries with over 6,000 best-in-class IT vendors, and delivering its own services and solutions. Softline is executing its three-dimensional growth strategy of geographic, portfolio and sales channel expansion.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Currently one of the fastest growing companies in the sector, Softline achieved a turnover of US$1.8 billion in the financial year of 2020. In October 2021, the company listed on the London and Moscow stock exchanges.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Softline's 6,500 employees work in almost 60 countries throughout Asia, Latin America, Eastern Europe and Africa - markets with significant growth potential. The company delivers a comprehensive range of IT solutions and is at the center of the digital transformation megatrend.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Important Notices</span>\n</p>\n<p>\n<span>The financial results set out in this release are sourced from the Group's management accounts for Q3 2021 and Q3 2020 and are unaudited.</span>\n<span>The \"constant currency\" metric excludes the effect of foreign currency exchange rate fluctuations by translating the current period revenues into U.S. dollars at the weighted average exchange rates of the prior period of comparison.</span>\n</p>\n<p>\n<span>This document may constitute or include forward-looking statements. Forward looking statements are statements that are not historical facts and may be identified by words such as \"plans\", \"targets\", \"aims\", \"believes\", \"expects\", \"anticipates\", \"intends\", \"estimates\", \"will\", \"may\", \"continues\", \"should\" and similar expressions. These forward-looking statements reflect, at the time made, the Company's beliefs, intentions and current targets/aims concerning, among other things, the Company's or the Group's results of operations, financial condition, liquidity, prospects, growth and strategies. Forward-looking statements include statements regarding: objectives, goals, strategies, outlook and growth prospects; future plans, events or performance and potential for future growth; liquidity, capital resources and capital expenditures; economic outlook and industry trends; developments of the Company's or the Group's markets; the impact of regulatory initiatives; and the strength of the Company's or any other member of the Group's competitors. Forward-looking statements involve risks and uncertainties because they relate to events and depend on circumstances that may or may not occur in the future. The forward-looking statements in this document are based upon various assumptions, many of which are based, in turn, upon further assumptions, including without limitation, management's examination of historical operating trends, data contained in the Company's records (and those of other members of the Group) and other data available from third parties. Although the Company believes that these assumptions were reasonable when made, these assumptions are inherently subject to significant known and unknown risks, uncertainties, contingencies and other important factors which are difficult or impossible to predict and are beyond its control. Forward-looking statements are not guarantees of future performance and such risks, uncertainties, contingencies and other important factors could cause the actual outcomes and the results of operations, financial condition and liquidity of the Company and other members of the Group or the industry to differ materially from those results expressed or implied in this document by such forward-looking statements. No representation or warranty is made that any of these forward-looking statements or forecasts will come to pass or that any forecast result will be achieved. Undue influence should not be given to, and no reliance should be placed on, any forward-looking statement. No statement in this document is intended to be nor may be construed as a profit forecast.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>TSTFZGMZRDGGZZM</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}