{"date": "2022-02-10 16:18:00.069000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3223.79, "close": 3065.87}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>San Antonio, Texas, Feb.  10, 2022  (GLOBE NEWSWIRE) -- <a href=\"https://www.globenewswire.com/Tracker?data=U3xxA_MK2WU28WSqeK5kFMfRtftIGy3tkxs5q0CxDxZLzCmlNq2L-DMSealr7Z2syt5kqE02kdNQ4SaMWDjYs5GheuupVcbNSDb36v4dYYs=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">New Apprenticeship</a> (NEW), a federally recognized digital apprenticeship solution that is bridging the tech skills and opportunity gap with innovative career pathways, announced it is working with Amazon Web Services (AWS) to deliver AWS Training to learners first within Texas and Indiana, then expanding to other states throughout 2022. NEW has joined the AWS Training Partner <a href=\"https://www.globenewswire.com/Tracker?data=h_F1RunuPiW2zsfI63wpW9wrozNiDY4Ny5Bp__rcNRgtGZeZyuLr3J6KPvABHz82SnufLEoByYetfzQXWF8mIa9_RdkA9A8sMBwnJXuW4FUfO5tCb0HG79561qnegku-\" data-type=\"url\" class=\"tr-link\" translate=\"no\">(ATP)</a> program, which enables AWS authorized instructors to deliver training developed by AWS. </p><p>As an ATP, NEW offers a breadth of AWS training options for all learning levels, including both classroom training delivered by live, expert instructors and on-demand digital training. Additionally, NEW can work with organizations on a tailored training plan through an AWS Learning Needs Analysis to assess the team’s skills, identify gaps, and implement customized training so that apprentices can close those gaps.  </p><p>NEW’s Cloud Apprentices will receive training in areas like cloud fundamentals, Python machine learning for developers, developer tools, security, and more. To address financial barriers, NEW sources federal and local grant funding to enable diverse apprentices to participate without any cost to them, while receiving a full-time salary. </p><p>In addition to cloud skills training and certification, apprentices receive 12-months of coaching and mentoring to accelerate their impact with partners and customers. Access to expert AWS instructors ensures that apprentices remain on the cutting edge of how their organizations can leverage AWS for improved results. </p><p>“As a longstanding advocate for New Apprenticeship and an employer who has hired several team members through the program, I’m thrilled to see an AWS collaboration launch,” says David Snowden, Senior Vice President of Group Communications at <a href=\"https://www.globenewswire.com/Tracker?data=u91fF70M32qOAFuG5wdmxMibeZapUOy3AwGr38AFwqWJOTuoisfihA_m8-GVl2WsIEI0fgYZRYmDCRxwOPFpFg==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Argo Group</a>. “The program provides employers with an outstanding, diverse talent pool of employees who can contribute to the business on day one. Employees receive training from industry leading instructors customized for an employer’s specific needs, which results in increased productivity and long-term retention.”  </p><p>NEW’s AWS-focused classroom training gives learners the opportunity to engage live and get questions answered by an expert instructor. Many courses also include hands-on labs, which allow learners to practice real-world scenarios in a sandbox environment. Training helps prepare learners for AWS Certification exams, which validate technical skills and expertise with an industry-recognized credential. </p><p>Brad Voeller, Chief Executive Officer at NEW, outlines how as an ATP, NEW will prepare employers with a sustainable solution to hiring challenges in the increasingly dynamic tech world: “AWS is helping employers accelerate their tech and digital transformation. NEW’s role in facilitating access to skilled tech talent provides AWS customers with sustainable pipelines now and into the future. Together, we are creating pathways for employers to tap into the underrepresented and often overlooked candidates and communities through modern degree apprenticeships as an alternative pathway to tech careers.” </p><p>Maureen Lonergan, Vice President of Training and Certification at AWS, states that, “As cloud technologies continue to help organizations transform their businesses at a rapid pace, employees with the necessary cloud skills are in high demand. The AWS Training Partner Program is designed for organizations like NEW that meet or exceed rigorous criteria for delivering or offering high-quality technical training experiences. As part of the program, NEW delivers AWS Training to enable IT professionals and businesses to leverage the power of the AWS Cloud.” </p><p>Employers that are interested in participating can contact NEW’s team directly <a href=\"https://www.globenewswire.com/Tracker?data=GJlT-g-ious0AxDRC7hzOh34Nl8T1xDQxqD7rzEJvMtAjkYyVJ1MpKFOjJPoyd4YXEKHFg_DroiD91dME5jhDQ==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.</p><p>About New Apprenticeship</p><p>Founded in 2016 in San Antonio, TX, <a href=\"https://www.globenewswire.com/Tracker?data=U3xxA_MK2WU28WSqeK5kFDY7dH7cZ2noULKHx8gwFHa1b1zROfV4h2tWCFG9Z0_40ZW9lwgVtHjUflj30dzUOlary4hnsW2rDKk2oZ7qUhU=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">New Apprenticeship</a> partners with employers nationally to transform lives by bridging the gap between what schools teach and only experience can bring. Our experience-based learning and performance coaching system equips workforce talent with the skills they need to accelerate their careers and provides employers with highly qualified and productive talent, creating future leaders in tech. For more information visit: <a href=\"https://www.globenewswire.com/Tracker?data=FRA-9dCy1kx3G8OH2dg8Gsp1xNnClqdNZermXgc8O0_6yVme01kgcZkatZiBxetlGNmcZevrujXRcPuXq0bfuXFMLGeYVNIFGVWpMWhtxnk=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">NewApprenticeship.com</a>.</p><p> </p><p>Follow NEW on LinkedIn – <a href=\"https://www.globenewswire.com/Tracker?data=A-869MRRAtETzwTnjiguDax7QxdKXdO5Xw7o3xpIDsObWCdrh_jOg6papzrNIN331HaskZ-1NzoYh2dyICIlq8haSGaMjuV-RGQMQdGNpGKd_VFnuZED4Pypov6XmUnanuyuMDtJ7IjN5491dvfKnwu9WAjEJ07ErAFTp5IxzII=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.linkedin.com/company/new-apprenticeship</a></p><p>Follow NEW on Facebook – <a href=\"https://www.globenewswire.com/Tracker?data=A-869MRRAtETzwTnjiguDXYB4BpQExsUVg6totgWJssDX815HMJ4DGyDS_5v7lQuudlT7MIapq9bBz1_JLVWgE56Dquux1XXtmlMsb597EvEednzJ2SEmFKiXPwwFfUnttWI9WTzw7Wm7gz_uBO39qTRCkCRNAP02ykeX9xJGrA=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/newapprenticeshiptalent</a> </p><p> </p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQ3MjU5MSM0NzIwMzcyIzIyMjM0NzE=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RRM01qVTVNU00wTnpJd016Y3lJekl5TWpNME56RT0=&amp;key=2d4e9aec16644a6046b9bd42273cb2b03d92027d63cbacd750237abdd0a5fd9aa2d570db762c90962d8c8795f5b6cac6135e30e1964c6ccfa341d62a032bbc1f\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/MTEyZmI1ZTAtY2VkNi00ZWRiLWFkOGItNzEzNThmMjY4MTYxLTEyMzUwMjQ=/tiny/New-Apprenticeship.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9NVEV5Wm1JMVpUQXRZMlZrTmkwMFpXUmlMV0ZrT0dJdE56RXpOVGhtTWpZNE1UWXhMVEV5TXpVd01qUT0vdGlueS9OZXctQXBwcmVudGljZXNoaXAucG5n&amp;key=544f1c3963430977362c500c71e199059f8276594953d97cdd174f377ea1dec8bb0e373d70fed46b4f53feb6716461e788f31bac14d7cfa6102af10f4c92914a\"/></div></div><pre>Erin Ipsen\nNew Apprenticeship\n717.572.2107\nerini@newapprenticeship.com\n\nMatt Urban\nNew Apprenticeship\n330.416.0794\nmattu@newapprenticeship.com\n</pre><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2022</p></div>"}