{"date": "2022-01-18 16:12:21.479000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>MONTREAL, QC / ACCESSWIRE / January 18, 2022 /</strong> <a href=\"https://pr.report/Y-Rf14ih\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Valsoft Corporation</a> Inc. (\"Valsoft\"), a Canadian-based company specializing in the acquisition and development of vertical market software businesses, is pleased to announce the acquisition of Advanced Weighing Systems (AWS), a leader in truck scale ticketing and data collection software.</p>\n<p>Headquartered in Chippewa Falls, Wisconsin, AWS has been providing unattended scale systems since 1995, which allows for automated weighing and data collection. That allows their end users to reduce their labor costs and optimize their operations.</p>\n<p>\"As a small business owner with no exit strategy, my main objective was to sell my business to a company that would be able to provide opportunities while maintaining our culture,\" said Thomas J. Davis, President of AWS, who is staying with the business. \"Valsoft, led by Stephane and his team, was by far the best fit for us. Their approach was relaxed and reassuring, and their buy and hold strategy is a model that will provide our employees with long-term security. Under Valsoft's guidance, our employees will be able to grow professionally, and our customers will enjoy an expanded product offering.\"</p>\n<p>With CIS, Aldata, and Vertical Software, AWS is the fourth company to join Valsofts' Industrial portfolio and can be a strategic collaborator for growth.</p>\n<p>\"With AWS joining the Valsoft Industrial, we now serve more than 1,500 customers in the truck scale ticketing and automation sector across multiple vertical markets including aggregates/construction, waste, grain, and forestry. AWS brings a strong line of industry-leading driver assisted scale automation kiosks augmenting the software solutions provided by the industrial portfolio.\" - Ted Chumas, Portfolio Manager at Valsoft Industrial.</p>\n<p><strong><u>About AWS</u></strong></p>\n<p>AWS specializes in delivering high-end automation to bulk material handling businesses for their scale ticket collection needs and system integration. Whether it's a single license of the software to be operated by a scale attendant or an automated ticketing system, AWS is committed to developing and providing quality data collection products and services for the bulk materials industry, with the goal to provide user-friendly, cost-effective solutions for our customers, while maintaining the highest ethical standards.</p>\n<p><strong><u>About Valsoft</u></strong></p>\n<p>Established in 2015, Valsoft acquires and develops vertical market software companies, enabling each business to deliver the best mission-critical solutions for customers in their respective industries or niche. A key tenet of Valsoft's philosophy is to invest in well-established businesses and foster an entrepreneurial environment that molds companies into leaders in their respective industries. Valsoft looks to buy, hold, and create value through long-term partnerships with existing management.</p>\n<p>For more information, please visit <a href=\"https://pr.report/MJsRvg-V\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://awsys.com/</a> and <a href=\"https://pr.report/0fI5TelJ\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.valsoftcorp.com</a></p>\n<p><strong>For further information: </strong></p>\n<p>Joey Strizzi<br/>\nDirector of Communications and Public Relations<br/>\nValsoft Corporation<br/>\n<a href=\"mailto:j.strizzi@valsoftcorp.com\" data-type=\"email\" translate=\"no\">j.strizzi@valsoftcorp.com</a><br/>\nOffice: 514-316-7647<br/>\nMobile: 514-258-0256</p>\n<p><strong>SOURCE:</strong> Valsoft Corporation</p>\n<br/>\n<br/>\nView source version on accesswire.com:<br/>\n<a href=\"https://www.accesswire.com/684362/Valsoft-Expands-Industrial-Portfolio-with-Acquisition-of-Advanced-Weighing-Systems-AWS\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.accesswire.com/684362/Valsoft-Expands-Industrial-Portfolio-with-Acquisition-of-Advanced-Weighing-Systems-AWS</a><br/>\n<br/>\n<div class=\"tr-image\"><div class=\"tr-image-components\"><img height=\"0\" src=\"https://www.accesswire.com/img.ashx?id=684362\" width=\"0\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright 2022 ACCESSWIRE. All Rights Reserved.</p></div>"}