{"date": "2021-11-10 14:00:01.614000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p align=\"left\">SANTA CLARA, Calif., Nov.  10, 2021  (GLOBE NEWSWIRE) -- <a href=\"https://www.globenewswire.com/Tracker?data=fXKgTUg6T-0OYEMK5LUoGfIZnLpby54EBtJQyFxUbd0WNarnQNUmqge_Hw6ZGWH2LfCOKCENGEaEDvwrJXKyQQ==\">Clumio<sup>®</sup> Inc.</a>, an industry leader in simplifying cloud data protection, today announced the availability of Clumio Protect for Microsoft SQL Server on Amazon Elastic Compute Cluster (Amazon EC2). Clumio Protect provides ransomware and bad actor protection that enables the lowest Recovery Time Objective (RTO) to meet any Service Level Agreement (SLA).</p><p>As business-critical applications and databases move into the public cloud, new challenges arise that require a cloud native architecture, built in the public cloud, to deliver on today’s data protection requirements. Clumio Protect already protects SQL Server within Amazon Relational Database Service (RDS), however, many enterprises continue to run SQL Server inside of Amazon EC2 instances to take advantage of native SQL Server capabilities and continue using their on-premises workflows and licenses.</p><p><strong>Enhancing Data Protection for Microsoft SQL Server on Amazon EC2</strong></p><p>Integrated point-in-time backups are not natively found in SQL Server on Amazon EC2, leaving enterprises to leverage manual SQL scripts and native tools, or legacy on-premises backup products in the cloud. These protection options can result in increased cyber-attack vulnerability, missed Recovery Point Objective (RPO)/Recovery Time Objective (RTO), database performance impact, and higher compliance risks.<br/></p><p align=\"justify\">“Data protection of SQL Server running on Amazon EC2 creates an inflection point for enterprises: Drag your legacy backup products to the cloud, or try to build it yourself via complex scripts,” said Chadd Kenney, Vice President of Product, Clumio. “Neither option is viable in today’s cloud-first model where cloud native scalability, low RPO/RTO with granular recovery, and ransomware protection are first principles. Clumio Protect for SQL Server on Amazon EC2 extends the existing SQL support of Amazon RDS and VMware Cloud on Amazon Web Services (AWS), delivering a comprehensive solution that provides a DBA-like experience, without the need to be a DBA.”</p><p><strong>Introducing Clumio Protect for Microsoft SQL Server on Amazon EC2 </strong></p><p><a href=\"https://www.globenewswire.com/Tracker?data=fXKgTUg6T-0OYEMK5LUoGbirQjbX0kWvsqNBQ_qk8bryvECCOkK_BHFMnhzf1PBYmacS7pR4_8kfW41eHfuOQ5_XXE_R2ZiCRpnsoFHmOU0f9tsxQzaquuSNbtvktzlTHht5dxhbQSj8jHgvSTZSfHvpqNUlaQwwGFAi7LVEGL0=\"><u>Clumio Protect for Microsoft SQL Server on Amazon EC2</u></a> provides ransomware protection for mission critical applications, low RPO and RTO with rapid database point in time recovery, and an agent-less backup as a service with zero impact on the database performance.</p><p align=\"justify\">“Clumio has been a critical partner in providing air gap protection for our customers and we are excited to begin offering SQL Server support to our customers,” said Charlie Gautreaux, Managing Director at Defiance Digital, a managed service provider. “Clumio solves a massively complex challenge for us, alleviating the need for us to develop our own solution. With Clumio Protect for Microsoft SQL Server, we can now provide our customers both data and ransomware protection with no performance impact and fast granular recovery for their mission critical databases.”</p><p>The key benefits of Clumio Protect for Microsoft SQL Server on Amazon EC2 include:</p><ul type=\"disc\" class=\"bulleted-list arrowlist\"><li style=\"margin-top:9pt\"><strong>SecureVault Ransomware Protection:</strong> Air-gapped SQL backups are stored outside the customer’s AWS account providing data-at-rest and in-flight encryption with immutable storage. Clumio’s platform provides multi-factor authentication, access controls, and comes without a delete button so there isn’t a vulnerability for hackers to get access or delete customers’ data.</li><li><strong>Low RPO and RTO with Rapid Flexible Database Recovery:</strong> Meet your business SLA requirements with a forever incremental strategy; point-in-time recovery at 15-min log granularity. Reduce recovery times with rapid incremental recovery back to production or full backup to any instance or AWS accounts.</li><li><strong>Agent-less with No Database Performance Impact:</strong> SaaS simplicity lowers operational overhead and does not require agents which in turn reduces performance impact and lowers the possibility of security vulnerabilities. Clumio Protect for SQL Server provides holistic coverage that is Availability Group (AG) aware, enabling backup from sync-secondaries and further avoiding primary database performance impact.</li><li><strong>Lower TCO:</strong> Customers can now solve operational recovery, ransomware protection, and long-term compliance with one data protection provider; dramatically reducing costs compared to managing disparate legacy point solutions.</li></ul><p align=\"justify\">“Enterprise digital transformation is driving a dramatic shift of critical workloads from on-premises to the cloud. This is increasing the demand for Microsoft SQL Server on Amazon EC2. Enterprises are looking for a fully integrated cloud-based solution to accelerate their cloud transformation and secure their data,” said Ashish Palekar, General Manager, Amazon Elastic Block Store (Amazon EBS) Snapshots at AWS. “Clumio Protect for Microsoft SQL Server on Amazon EC2 which integrates with Amazon Simple Storage Service (Amazon S3) and Amazon EBS Snapshots provides customers a simple, integrated data protection as a service to improve protection of their business-critical data and to provide rapid, granular recovery from ransomware, accelerating the customer journey to adopt Microsoft SQL Server on Amazon EC2.”</p><p>Clumio Protect for Microsoft SQL Server on Amazon EC2 is available now. Clumio Protect also supports SQL Server protection on Amazon RDS and VMware Cloud on AWS; try it for free <a href=\"https://www.globenewswire.com/Tracker?data=tghoZn8YvmftWQ4Undf2HduMOimj9KcTwEuKJZSleBlPmYf8zQ9BRsFMP8O7eR6VuVoiGNPnHB-XUoI9ZeNYlPOVjLMn1oser9b0iA5Ux1cChBCtG3W1GVjnqgf1xzN6\"><u>here</u></a>. Clumio Protect for Amazon S3 is now in <a href=\"https://www.globenewswire.com/Tracker?data=4vwyTsTWNTqIkdHY51hXI5FtadX2kI9iylLU-vF12GncUZiIuGwS6c9dqHqfYUXOq_6UxeMXP9SQhqN6Najve-9A56qgC3mgRl-vCl_DdqI=\"><u>early access</u></a>. For more information about these new services in Clumio Protect, click <a href=\"https://www.globenewswire.com/Tracker?data=_vvNG-htj7ARjCeucaM08umjDpTXgZIDte4x7zYdTTzPquGy00mwInrUGZwW01DlTM_2gzrZtGVpavOt-MPl1A==\"><u>here</u></a>.<br/><br/><strong>Additional Resources</strong></p><ul type=\"disc\" class=\"bulleted-list arrowlist\"><li><a href=\"https://clumio.com/events/\"><u>See Clumio’s upcoming webinars and events</u></a></li><li><a href=\"https://clumio.com/why-clumio/\"><u>Learn How Clumio is Reimagining Enterprise Backup</u></a></li><li><a href=\"https://clumio.com/blog/\"><u>Read more about Clumio on our Blogs</u></a></li><li><a href=\"https://twitter.com/clumioinc\"><u>Follow Clumio on Twitter</u></a></li></ul><p><strong>About Clumio</strong><br/>Clumio helps organizations simplify cloud data protection. Its secure air-gapped SaaS solution enables organizations to achieve stringent compliance requirements, backup, and restore data in minutes, and gain better visibility to optimize cloud storage costs. Join a community of passionate users and try Clumio for <a href=\"https://www.globenewswire.com/Tracker?data=EuDtveW5pHbklmQn6kJaCqEZM5tlnL6xYyuppYFwGUfgoABmgQuZwq3TzzqX60pJlr-nP8j-YvKcklvJaA2BgmQJ6O4uQWk6Ca3V3ElLafKpMIz-nrDs3Oy56YYp1rZp\"><u>free today</u></a>.</p><p align=\"center\"><span>Clumio is a registered trademark of Clumio Inc. All other marks and names mentioned herein may be trademarks of their respective companies. This article may contain hyperlinks to non-Clumio websites that are created and maintained by third parties who are solely responsible for the content on such websites.</span></p><p><strong>Media Contact</strong><br/>John McCartney<br/>Jmac PR for Clumio<br/><a href=\"https://www.globenewswire.com/Tracker?data=skTzuZbnfhslr5_HUggRS_xpeuBwRO0itPXHn375f9sHaq2fgXEYh9UGbxBDpAoCJ6MpXGSVx4lRrrf7F8ktNA==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">john@jmacpr.com</a><br/>646-280-8573</p><p> <br/></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODM5MDc2NyM0NTQ0MTQ2IzIxOTQ1NzY=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RNNU1EYzJOeU0wTlRRME1UUTJJekl4T1RRMU56WT0=&amp;key=d601a2a5ec142a3de76ca3d876a30df05b0e708dbcb6466fb8cdf619ddbb210e4ed8c7b67c02559a6c088e5de779779838ffb132f0f13e4e8c502fe9044b3d1b\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/NzE2MDFlN2QtZGE4NC00NGZiLWFjOTItZThlMmM3ZmNjNzhlLTEyMDYxMjk=/tiny/Clumio.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9OekUyTURGbE4yUXRaR0U0TkMwME5HWmlMV0ZqT1RJdFpUaGxNbU0zWm1Oak56aGxMVEV5TURZeE1qaz0vdGlueS9DbHVtaW8ucG5n&amp;key=2c5d3a84fadb758fecc40cae857d5c7bb55762387bd14b43bbab1e02e8517de96375734b7a6f2efb74cfe3139337fd9b89aac84baf70de909f1a8dc0d37d0b3b\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/3cc4da8b-9ab8-49ac-a82b-90af6eca17bf\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/3cc4da8b-9ab8-49ac-a82b-90af6eca17bf/small/clumio-logo-stacked-png.png\" style=\"max-height:145px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS8zY2M0ZGE4Yi05YWI4LTQ5YWMtYTgyYi05MGFmNmVjYTE3YmYvc21hbGwvY2x1bWlvLWxvZ28tc3RhY2tlZC1wbmcucG5n&amp;key=2fadecf1c2e6d7158b7013ed076a9ef8fe909e44c60a5288d7f6858e6d19dcf632f14a70e1d825642da22436a7c9041995cfbf97ec1abc408012282e842dec59\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}