{"date": "2021-12-22 19:12:25.545000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ALLOT COMMUNICATIONS LTD (\"ALLT-Q\")\n- NetworkSecure Automatically Detects and Blocks Amazon Black Friday\n- Phishing Attack\n\n     Allot Ltd. a leading global provider of innovative network\nintelligence and security-as-a-service (SECaaS) solutions for communication\nservice providers (CSPs) and enterprises, revealed that in Europe alone\ntheir Allot NetworkSecure solution was successful nearly 1.7 million times\nin automatically detecting and blocking two variants of a phishing attack\ntargeting Amazon Black Friday shoppers.\n\n     The attack was disguised as a fake promotion that was spread\npredominantly through links on WhatsApp during the month of November in the\nweeks leading up to Black Friday. The target was offered an opportunity to\nfill out a survey that led to an offer of free gifts on Amazon. Once the\nsurvey was completed, the target was directed to a page where they were\ninstructed to provide financial information including credit card\ninformation. Allot NetworkSecure blocked communication with the Websites\nthat hosted the fake promotion, relieving those protected of the need to\ndecide whether to click on a dangerous link.\n\n     NetworkSecure is a network-based solution, offering zero-touch,\nclientless operation, requiring no application installation by the end\ncustomer. With NetworkSecure, CSPs can offer their customers a security\nservice that protects them from cyber attacks, including viruses, phishing\nand ransomware attacks and other types of malware. An easy-to-use branded\ninterface provides alerts and reporting that help strengthen brand loyalty.\n\n     \"This was one of the largest phishing attacks that we've seen in\nrecent history. Fortunately for people subscribed to CSP cybersecurity\nservices based on Allot NetworkSecure no damage was incurred as a result of\nthis attack,\" said Itay Glick, Vice President Security Products for Allot.\n\"Though we did not have prior knowledge of this attack, the solution kicked\nin and blocked a serious threat, keeping regular people safe with no manual\nintervention.\"\n\n     ###\n\n     Additional Resources:\n\n     Allot Blog: <a href=\"https://www.allot.com/blog\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.allot.com/blog</a>\n\n     Allot On-air Podcast: <a href=\"https://www.allot.com/resources/podcasts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.allot.com/resources/podcasts</a>\n\n     Follow us on Twitter: @allot_Ltd\n\n     Follow us on LinkedIn:\n<a href=\"https://www.linkedin.com/company/allot-communications\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.linkedin.com/company/allot-communications</a>\n\n     About Allot\n\n     Allot Ltd. (NASDAQ: ALLT, TASE: ALLT) is a provider of leading\ninnovative network intelligence and security solutions for service\nproviders and enterprises worldwide, enhancing value to their customers.\nOur solutions are deployed globally for network and application analytics,\ntraffic control and shaping, network-based security services, and more.\nAllot's multi-service platforms are deployed by over 500 mobile, fixed and\ncloud service providers and over 1000 enterprises. Our industry-leading\nnetwork-based security as a service solution has achieved over 50%\npenetration with some service providers and is already used by over 20\nmillion subscribers Globally.\n\n     Allot. See. Control. Secure.\n\n     Forward-Looking Statement\n\n     This release contains forward-looking statements, which express the\ncurrent beliefs and expectations of company management. Such statements\ninvolve a number of known and unknown risks and uncertainties that could\ncause our future results, performance or achievements to differ\nsignificantly from the results, performance or achievements expressed or\nimplied by such forward-looking statements. Important factors that could\ncause or contribute to such differences include risks relating to:\nacceptance of our products by our reseller and customer in EMEA, our\nability to compete successfully with other companies offering competing\ntechnologies; the loss of one or more significant customers; consolidation\nof, and strategic alliances by, our competitors, government regulation;\nlower demand for key value-added services; our ability to keep pace with\nadvances in technology and to add new features and value-added services;\nmanaging lengthy sales cycles; operational risks associated with large\nprojects; our dependence on third-party channel partners for a material\nportion of our revenues; and other factors discussed under the heading\n\"Risk Factors\" in the Company's annual report on Form 20-F filed with the\nSecurities and Exchange Commission. Forward-looking statements in this\nrelease are made pursuant to the safe harbor provisions contained in the\nPrivate Securities Litigation Reform Act of 1995. These forward-looking\nstatements are made only as of the date hereof, and the Company undertakes\nno obligation to update or revise the forward-looking statements, whether\nas a result of new information, future events or otherwise.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135500857.MNPRE2135501983-11005520211222</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}