{"date": "2022-01-05 19:41:18.443000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>1NCE and Amazon Web Services (AWS) have collaborated pushing forward the expansion of 1NCEs IoT platform on a global scale, bringing its cloud native IoT offering closer to its customers worldwide.</p><p>The collaboration further aims to strengthen ties between the two companies and to develop the Next Level IoT Software speeding up global deployment of IoT projects.1NCE has developed a unique software offering on AWS that enables IoT developers to quickly integrate cellular IoT connectivity into their own solutions with plug &amp; play functionalities.The collaboration allows for the expansion of the 1NCE IoT platform via AWS infrastructure globally, significantly increasing its overall platform performance. It will literally bring the 1NCE IoT platform closer to its customers, wherever they are.\"This intensified engagement with AWS also allows us to boost our network and IoT software portfolio at greatly improved conditions and with the appropriate know-how,\" added Younes Allaki, Chief Technology Officer (CTO) at 1NCE. \"We can leverage synergies between the AWS infrastructure and our IoT platform which helps us to develop our next Level IoT Software at low costs. This is a prerequisite to implement new features into our existing IoT Flat Rate offering, like protocol conversion, energy management and localization services.\"1NCE is a global IoT powerhouse funded by Softbank and the German Telecommunication giant Deutsche Telekom with direct access to its networks and roaming partners via 2G, 3G, 4G, LTE, NB-IoT and LTE-M in over 100 countries worldwide. 1NCE enables business customers to easily connect their IoT devices for 10 US$ for 10 years.With its IoT Flat Rate offering 1NCE has proven to be a real disruptor within the IoT world, 1NCE is leveraging AWS to deliver reliable IoT services by combining secure connectivity with sophisticated software applications.Due to its close relationship with Deutsche Telekom and Amazon Web Services, 1NCE has obtained a leading position in costs and features counting more than 7,000 customers and 10 million managed connections to date. With \"1NCE For All\" customers can order up to 100 SIM cards for free exclusively at AWS Marketplace. </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}