{"date": "2021-11-22 17:12:33+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">WASHINGTON, Nov 22 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Four big unions, including the Service Employees International Union and the Teamsters, urged the U.S. Federal Trade Commission on Monday to oppose Amazon.com's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> plan to buy Metro-Goldwyn-Mayer Studios, saying it would reduce competition in the streaming video market.</p><p>Amazon announced the $8.45 billion deal in May, saying the purchase of the fabled U.S. movie studio, home to the James Bond franchise, would give it a library of films and TV shows to compete with rivals like Netflix and Disney+. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL3N2ND36G\" data-type=\"storyId\" data-story-id=\"nL3N2ND36G\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>    The unions, in a report by an entity they support called the Strategic Organizing Center, argued that the deal would bring Amazon's industry-leading streaming library to more than 55,000 titles, with more under development, which would give the company greater incentive to discriminate against rivals. Netflix has the second-greatest number of titles at just under 20,000, the letter said.</p><p>\"The prospect of Amazon acquiring a trove of additional MGM content to build on Amazon's existing vast library should raise alarm bells,\" the group said. \"With control over MGM's vast library, Amazon may acquire enough market power over streaming content to raise prices for (streaming video-on-demand) SVOD competitors or for SVOD consumers.\"</p><p>    Amazon, which the group said grew exponentially during the  U.S. coronavirus lockdown, has used its streaming service to attract new Prime members. Prime members make up some 68 percent of Amazon shoppers and spend significantly more than non-Prime shoppers, the group said.</p><p>The Service Employees International Union, International Brotherhood of Teamsters, Communications Workers of America and the United Farmworkers, sent the letter to Holly Vedova, director of the FTC's Bureau of Competition.</p><p>Amazon handily beat back an effort by the Retail, Wholesale and Department Store Union to organize a Bessemer, Alabama, warehouse earlier this year. But unions have continued to organize, with the RWDSU gearing up potentially to try again. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2RJ021\" data-type=\"storyId\" data-story-id=\"nL1N2RJ021\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Diane Bartz; Editing by Dan Grebler)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Diane.Bartz@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Diane.Bartz@thomsonreuters.com</a> ; 1 202 898 8313; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: MGM-M&amp;A/AMAZON.COM-UNIONS (PIX)</p></div>"}