{"date": "2021-12-11 12:13:09+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3483.42, "close": 3391.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Corrects to remove reference to state of Missouri</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Dec 10 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Many people were trapped after a roof partially collapsed at an Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> warehouse near the U.S. city of St. Louis late on Friday, after tornadoes and strong storms roared through the area, local authorities said. </p><p>The Colinsville Emergency Management Agency said it was a  \"mass casualty incident\", adding that multiple people were trapped inside the warehouse in Edwardsville, southern Illinois.</p><p>In a posting on Facebook, the agency did not give details, and there was no immediate word on how many people had been injured or killed.</p><p>Emergency service vehicles surrounded the scene.</p><p>Drone footage from the scene showed rescue workers picking through a huge area of debris in the pre-dawn darkness.</p><p>An Amazon spokesperson said the company was assessing the situation and damage at the facility.</p><p>One woman outside, Sarah Bierman, said she was very worried about her husband, who works at the warehouse.</p><p>\"I talked to him about eight o'clock tonight, a little before I texted him, and he was returning to the warehouse to drop his van off,\" she told a reporter.</p><p>\"And I haven't heard from him since, I just heard through the news and we live in Edwardsville; we lost power. So I decided to come down here to see what was going on, and I had no idea the building looked that bad. And I'm just; I'm worried sick,\" she said.</p><p>     Illinois Governor JB Pritzker tweeted: \"My prayers are with the people of Edwardsville tonight, and I've reached out to the mayor to provide any needed state resources.\" </p><p>The U.S. National Weather Service had issued tornado warnings on Friday night for areas in several states including Arkansas, Tennessee, Missouri and Illinois.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Radhika Anilkumar in Bengaluru and Njuwa Maina in Washington <br/>Editing by Frances Kerry and Edmund Blair)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Radhika.Anilkumar@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Radhika.Anilkumar@thomsonreuters.com</a> ; +91 8067490824; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-WEATHER/TORNADOES-AMAZON.COM (CORRECTED, UPDATE 4, PIX, TV)</p></div>"}