{"date": "2022-02-14 16:26:00.214000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Amazon Music Names BRELAND as the Next Breakthrough Artist, Expands Its Breakthrough Program to Support More Emerging Artists</b>\n</p><p class=\"bwalignc\">\n<span>Amazon Music reveals that the country trailblazer will be the next Breakthrough Artist in the U.S., receiving a global campaign to support his upcoming releases, including enhanced playlist support, social media campaigns, an Amazon Original song, marketing opportunities, and bespoke editorial content</span>\n</p><p class=\"bwalignc\">\n<span>Breakthrough—the program from Amazon Music supporting up-and-coming artists from around the world—announces increased opportunities, including The Breakthrough Development Fund, a new initiative providing backing for independent artists</span>\n</p><p>\nToday, Amazon Music is announcing that country trailblazer BRELAND has been selected as the next Breakthrough Artist. A bold new force on the music landscape, BRELAND’s groundbreaking mix of hip-hop and country has turned heads, and as a Breakthrough Artist, the singer/songwriter/producer will receive substantial support from Amazon Music, including bespoke video and audio content, global marketing campaigns, increased visibility across playlists and programming, and high-profile Amazon Original tracks.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20220214005570/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220214005570/en/</a></p><div id=\"bwbodyimg\" style=\"width:480px;float:left;padding-left:0px;padding-right:20px;padding-top:0px;padding-bottom:0px\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"(Photo: Business Wire)\" src=\"https://mms.businesswire.com/media/20220214005570/en/1358593/4/122421_USEN_Breakthrough_Brekland_PG_PA_EG_4188x2094.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbXMuYnVzaW5lc3N3aXJlLmNvbS9tZWRpYS8yMDIyMDIxNDAwNTU3MC9lbi8xMzU4NTkzLzQvMTIyNDIxX1VTRU5fQnJlYWt0aHJvdWdoX0JyZWtsYW5kX1BHX1BBX0VHXzQxODh4MjA5NC5qcGc=&amp;key=f7e38c4c3a7d6f2dc9b2acfb355718dd0ff9efd6999712734396a5b3be1ef7417e5e11cc3de0e3c8742a1ce5fe0e4e97074bce4c19c37a4564ca7f5030f82ff5\"/></div></div><p style=\"font-size:85%\">(Photo: Business Wire)</p></div><p>\nAs part of Breakthrough, BRELAND will be a featured guest on <span>Country Heat Weekly</span>, the first genre-focused Original podcast from Amazon Music, to connect with co-hosts Kelly Sutton and Amber Anderson on his new music and the year ahead.\n</p><p>\n“It’s an honor to be selected as the next Breakthrough Artist. Coming together with Amazon Music is a natural pairing. We share the same vision for my music, and I know that by working with them, I’ll be able to make even my most ambitious plans a reality. I can’t wait to share what we’re working on with my fans,” said BRELAND.\n</p><p>\nNew Jersey-born BRELAND began writing songs as a teenager, inspired by a diverse collection of sounds and eclectic artists like the Beatles, Rascal Flatts, Prince, and his number-one influence, Stevie Wonder. His debut single, “My Truck,” fused hip-hop with country and became a breakout success, going platinum and ending up on best-of-the-year lists from NPR and <span>The New York Times</span>. Since signing to Bad Realm Records/Atlantic Records, BRELAND has collaborated with heavy-hitters such as Gary LeVox of Rascal Flatts, Nelly, Blanco Brown, Lauren Alaina, and Chase Rice. He recently enlisted Keith Urban for the dynamic collaboration “Throw It Back,” and is currently featured on Dierks Bentley’s single with HARDY, “Beers On Me.” Praised by <span>Rolling Stone</span> as “1,000 percent the whole package,” he made his Grand Ole Opry debut to a standing ovation last year.\n</p><p>\nAmazon Music has also unveiled details of the Breakthrough Development Fund, an initiative created to provide independent artists with additional financial support to help them as they launch their careers. The fund is the newest part of the Breakthrough program from Amazon Music, joining Breakthrough Live and the Breakthrough playlists supporting new artists. Each month, one independent artist in the U.S. will receive financial support that they’ll be able to use to cover some of the costs artists face when starting out, like funding an early tour, hiring a PR or social team, and more. Thus far in 2022, Amazon Music has used the fund to support singer/songwriter Lauren Spencer-Smith in January and Muni Long in February.\n</p><p>\n“Helping to develop artists is something that is very important to Amazon Music, and we understand that as their career starts to grow, each artist has different needs. Depending on where they’re at in their career, they may need to build a strong team around them or to enhance their live show. With the Breakthrough Development Fund, we want to help artists build their teams and their profile,” said Amazon Global Co-Head of Artist Relations Chris Graham. “Whether we’re backing artists with this new fund, providing a stage for their music on our Breakthrough playlists, or supporting them with the Breakthrough Artist program, Amazon Music is constantly working to help emerging artists find new fans and get to the next level of their careers.”\n</p><p>\nBreakthrough is the emerging artist program from Amazon Music, aimed at amplifying the best new talent and championing them at different moments early in their careers. The program encompasses playlisting, livestreams, funding, marketing and social campaigns, events, editorial content, and more. Breakthrough has supported a wide variety of artists from around the globe, including U.S. hip-hop artist Blxst, country powerhouse Gabby Barrett, rising pop star Remi Wolf, London-based musician and poet Arlo Parks, rising German pop sensation Malik Harris, London singer/songwriter Olivia Dean, and Latin pop duo Las Villa.\n</p><p class=\"bwalignc\">\n(Download hi-res art <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Famznstudios.box.com%2Fs%2Fux0zz8nzuk4kw96xl2iq7coaamku2qss&amp;esheet=52578892&amp;newsitemid=20220214005570&amp;lan=en-US&amp;anchor=here&amp;index=1&amp;md5=70557e0c9408e5b4f641c342ccaf42fa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>)\n</p><p class=\"bwalignc\">\n<span>For more information on Amazon Music, please contact David Marek (<a href=\"mailto:davmarek@amazon.com\" data-type=\"email\" translate=\"no\">davmarek@amazon.com</a>)</span>\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220214005570r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMjE0MDA1NTcwcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=0e1eb785fe44a8dd1279f4ee5125675296cf2370658de20d6b425573ba18b7579f970a96f7f55c25bc2d57094668927458b77700218ab842af9226f1db5fa5ac\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220214005570/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220214005570/en/</a></span></p><p>\nDavid Marek\n<br/><a href=\"mailto:davmarek@amazon.com\" data-type=\"email\" translate=\"no\">davmarek@amazon.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-MUSIC</p></div>"}