{"date": "2021-11-02 16:53:44+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Recasts first paragraph, adds quotes from attorney general and publishers</p><p class=\"tr-by\">By Diane Bartz and David Shepardson</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">WASHINGTON, Nov 2 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The U.S. Justice Department filed a lawsuit on Tuesday aimed at stopping Penguin Random House, the world's biggest book publisher, from buying competitor Simon &amp; Schuster, saying the deal would give the company \"outsized influence\" over what Americans read.</p><p>German media group Bertelsmann, which owns Penguin Random House, last year agreed to pay $2.175 billion in cash to buy Simon and Schuster from ViacomCBS, strengthening its presence in the United States and adding novelist Stephen King, Pulitzer Prize winner Anthony Doerr and veteran journalist Bob Woodward to its stable of authors.</p><p><a href=\"https://www.justice.gov/opa/press-release/file/1445916/download?utm_medium=email&amp;utm_source=govdelivery\" data-type=\"url\" class=\"tr-link\" translate=\"no\">In its complaint</a> filed in federal court in Washington, the Justice Department said the deal would give \"outsized influence over who and what is published, and how much authors are paid for their work.\"</p><p>The complaint stresses the importance of the companies competing for top-selling books as well as the money earned by the people who write them.</p><p>\"Authors are the lifeblood of book publishing in America. But just five publishers control the U.S. publishing industry,\" Attorney General Merrick Garland said in a statement. \"If the world's largest book publisher is permitted to acquire one of its biggest rivals, it will have unprecedented control over this important industry.\"</p><p>The complaint said that the publishers have argued that the deal is needed so they can better negotiate with ecommerce giant Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>. But the Justice Department in its complaint quoted a top Penguin Random House executive as saying that he \"never, never bought into that argument\" and that a post-merger goal would be to become an \"exceptional partner\" to Amazon. </p><p>The department did not specify when or in what context the executive's comments were made.</p><p>If the merger were to go forward, the deal would give Penguin Random House nearly half of the market for publishing rights to blockbuster books while its nearest competitors would be less than half its size, the complaint said.</p><p>The complaint also said that Simon &amp; Schuster is the fourth biggest U.S. book publisher and that, if combined with Penguin Random House, its U.S. revenues would be twice that of their closest competitor's.</p><p>Penguin Random House and Simon &amp; Schuster said in a joint statement that they will \"fight this lawsuit vigorously.\" They said the government did not allege that the deal would harm competition in book sales. </p><p>\"The market for selling books is unconcentrated and the combined shares are well below the levels of concern,\" they added.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Diane Bartz and David Shepardson<br/>Editing by Will Dunham and Mark Potter)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Diane.Bartz@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Diane.Bartz@thomsonreuters.com</a> ; 1 202 898 8313; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SIMON&amp;SCHUSTER-M&amp;A/PENGUINRANDOMHOUSE (UPDATE 2, PIX)</p></div>"}