{"date": "2021-12-08 14:56:10.076000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>DOLPHIN ENTERTAINMENT INC (\"DLPN-Q\")\n- Enters Ready to Drink Cocktail Market With Ownership Stake in\n- Crafthouse Cocktails\n\n   Dolphin Entertainment, a leading independent entertainment marketing and\nproduction company, today announced it has entered into a strategic\npartnership with Crafthouse Cocktails, a pioneering brand of\nready-to-drink, all-natural classic cocktails created by world renowned\nmixologist, Charles Joly and esteemed restaurateur, Matt Lindner. Dolphin\nwill manage all aspects of publicity and marketing for the brand through\nits network of agencies and will facilitate talent and commercial\nrelationships within the entertainment and culinary industries.\n\n   This new deal comes on the heels of Dolphin Entertainment's announcement\nthat it has also taken an ownership position in the Midnight Theatre, a\nstate-of-the-art contemporary variety theater and restaurant experience in\nthe heart of Manhattan, New York. That move further supports the company's\nvision to partner with and invest in projects and companies that can\nbenefit from its collection of best-in-class marketing, public relations\nand production service providers.\n\n   Crafthouse Cocktails is a pioneer in the premium ready-to-drink cocktail\ncategory. With recipes curated by global bartending champion Joly and\nbar/restaurateur Lindner, the two reimagined the prepared cocktail format\nin 2013. Real, quality ingredients, balanced cocktails and authenticity at\nevery level have been hallmarks of the brand since day one.\n\n   Today, Crafthouse Cocktails has eight different, made-from-scratch\ncocktails in 750ml reusable glass flip-top bottles, resealable 200ml\naluminum bottles and 1.75L boxes, using all-natural ingredients and premium\ncraft spirits. The company's large format, \"cocktail on-tap\" format\nlaunched in 2021 to provide a more upscale, environmentally friendly option\nthat preserves the integrity of the cocktail.\n\n   Crafthouse Cocktails are available in more than 2,000 retail locations\nnationally including Total Wine &amp; More, Binny's, Foxtrot, Whole Foods,\nWegmans, Hyvee, Plum Market, Bevmaxx and other leading independent\nretailers across the country, and through partnerships with a select group\nof establishments such as Kimpton, Marriott and Hilton hotels &amp; resorts,\nGaylord Hotels, Ambassador Theatre Group, Virgin Voyages, OTG, Blackberry\nFarm and Sea Island.\n\n   Ready-to-drink (RTD) cocktails are the fastest growing alcohol category,\nexpected to double by 20251.Bank of America Securities is forecasting that\nthe category will reach $3 billion to $4 billion in revenue over the next\nfew years2.\n\n   \"Crafthouse Cocktails is already an award-winning brand we've been\npassionately championing for years via their long-term relationship with\nThe Door | idea house,\" said Dolphin Entertainment CEO, Bill O'Dowd. \"We\nknow first-hand that they have a fantastic product line that is\nconsistently recognized as a market leader in taste and quality. And, with\nthe explosion in popularity of RTDs over the past 18 months, we feel that\nCrafthouse is extremely well-positioned because of the brand's commitment\nto natural, premium ingredients and Matt and Charles' incredible vision for\nthe future of the category. The timing is absolutely perfect to take\nadvantage of this tremendous growth opportunity by amplifying Crafthouse\nacross all of our consumer touchpoints, utilizing the relationships and\nreach of our entire Super Group.\"\n\n   \"As an independent brand it has been challenging to compete on a\nnational scale against behemoth suppliers who have entered our space. By\njoining the Dolphin Entertainment family it gives us the marketing muscle\nto extend the brand's reach to a broader audience with a partner that\nshares our vision and values,\" said Lindner. \"With mutual confidence that\nboth Crafthouse and Dolphin are the best in class in their respective\nfields, becoming one of their first Dolphin 2.0 partners will allow us to\nrealize our full potential. Industry professionals have long recognized\nCrafthouse as the premium RTD leader, with Dolphin behind us the whole\nworld will soon know!\"\n\n   Crafthouse founder Joly added, \"We couldn't be more excited to partner\nwith Dolphin Entertainment. My specialty is cocktails, hospitality,\nentertaining and education; this partnership allows each of us to focus on\nour strengths without distraction. Every entrepreneur knows that having the\nbest quality product in a category simply isn't enough. You need an\neffective way to share your story and allow your voice to be heard.\"\n\n   About Crafthouse Cocktails\n\n   Crafthouse Cocktails is a pioneering range of ready-to-drink cocktails\ncreated in 2013 by world-renowned bartender, Charles Joly and trailblazing\nChicago restaurateur, Matt Lindner to give consumers access to world-class\ncocktails anytime, anyplace. Joly is the official mixologist for the Oscars\nand Emmys, and his credits include a stint as Beverage Director at The\nAviary, a James Beard Award, and the distinction of being the only American\nto have won Diageo World Class Bartender of the Year. Crafthouse Cocktails\nhighlights include the Rum Old Fashioned made with Plantation Rum and being\nthe first ever to create a bottled Moscow Mule. Crafthouse Cocktails can be\nfound nationally at Total Wine, Wegmans, Binny's Beverage, Whole Foods and\nmany other retailers as well as at hotel and resort chains including select\nMarriott hotels, Amtrak's Acela line, OTG Group airports including LGA and\nJFK, with some major partnerships in the pipeline including Virgin Voyages\nand Vail Resorts and Kimpton Resorts.\n\n   About Dolphin Entertainment\n\n   Dolphin Entertainment is a leading independent entertainment marketing\nand production company. Through our subsidiaries 42West, The Door, Shore\nFire Media and B/HI (a division of 42West), we provide expert strategic\nmarketing and publicity services to many of the top brands, both individual\nand corporate, in the film, television, music, gaming and hospitality\nindustries. All three PR firms were ranked among the most recent Observer's\n\"Power 50\" PR Firms in the United States, an unprecedented achievement.\nViewpoint Creative and Be Social complement their efforts with full-service\ncreative branding and production capabilities as well as social media and\ninfluencer marketing services. Dolphin's legacy content production\nbusiness, founded by Emmy-nominated CEO Bill O'Dowd, has produced multiple\nfeature films and award-winning digital series. Dolphin's Non-Fungible\nTokens (NFTs) division is dedicated to designing, producing, distributing\nand promoting NFTs for itself and its clients within the film, television,\nmusic, gaming, epicurean, and technology industries. The NFTs division is\ncomprised of executives across all six of Dolphin's wholly owned\nsubsidiaries blending their collective expertise in creative services,\ndigital design, production, marketing, sales and public relations.\n\nTel   : 305-774-0407    DOLPHIN ENTERTAINMENT INC\nWWW   : <a href=\"https://www.dolphinentertainment.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.dolphinentertainment.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134100718.MNPRE2134102051-06551920211208</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}