{"date": "2021-12-14 15:36:18.195000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMERICAN AIRLINES GROUP INC (\"AAL-Q\")\n- Senior Leadership Team\n\n     American Airlines Group Inc. announced the senior leadership team that\nwill report to Robert Isom when he becomes CEO on March 31, 2022.\n\n     Current Chief Financial Officer Derek Kerr will assume the additional\ndesignation of Vice Chair of American Airlines, overseeing all corporate\nfinancial functions, global corporate risk and corporate development. Kerr\nwill also continue oversight of American Eagle operations, the regional\nnetwork responsible for approximately half of American's departures.\n\n     Steve Johnson will undertake a new strategic advisory role focused on\nstrategy development, economics and competition issues, corporate\ngovernance and ESG, and corporate development. In this role Johnson will\nhold the title of Executive Vice President.\n\n     Maya Leibman will continue serving as Executive Vice President and\nChief Information Officer, leading all technology efforts for the airline,\nincluding the organization's next-generation strategic initiatives.\n\n     In addition, the following individuals will be joining American's\nsenior leadership team:\n\n     *  Priya Aiyar, Senior Vice President, Corporate Affairs and Chief\nLegal Officer\n     *  Cole Brown, Senior Vice President, Chief People Officer\n     *  Ron DeFeo, Senior Vice President, Chief Communications Officer\n     *  Nate Gatten, Senior Vice President, Corporate Affairs and Chief\nGovernment Affairs Officer\n     *  Vasu Raja, Senior Vice President, Chief Commercial Officer\n     *  David Seymour, Senior Vice President, Chief Operating Officer\n\n     Current President and Incoming CEO Robert Isom said: \"These executives\nare all extremely capable and experienced leaders, and together, they form\nan unstoppable team. This team possesses deep intellectual and technical\nexpertise and truly takes the ethos of servant leadership to heart. And\nthey all embrace and live our purpose of caring for people on life's\njourney. Importantly, we are all aligned around the importance welcoming\nour customers back to an incredibly reliable airline and returning American\nto profitability as soon as possible. Each of these individuals has played\na key part in American's recovery through the pandemic and I'm excited to\nwork with them as we lead American forward into 2022 and beyond. We are\nhonored to work for our people, customers and shareholders, and know that\nwe only win when we operate as one team.\"\n\n     Senior Leadership Team\n\n     Derek Kerr is Vice Chair, Chief Financial Officer and President,\nAmerican Eagle. He has held the title of Executive Vice President, Chief\nFinancial Officer since December 2013. Previously, Kerr served as Executive\nVice President and Chief Financial Officer for US Airways, a role that he\nbegan in 2009. Prior to that, he was Senior Vice President and Chief\nFinancial Officer of America West Airlines, a role he began in 2002. He\njoined America West in 1996 as Senior Director, Planning, and was promoted\nto Vice President, Financial Planning and Analysis, in 1998. In 2002, Kerr\nwas promoted to Senior Vice President, Finance, adding responsibility for\npurchasing and fuel administration. Prior to joining America West, Kerr\nserved in various financial planning and analysis positions with Northwest\nAirlines. Previously, he was a flight test coordinator/control engineer\nwith Northrop Corporation's B-2 Division. Kerr serves on the advisory board\nfor the University of Michigan Ross School of Business and the board of\ndirectors of the Dallas Regional Chamber and the Cotton Bowl. He is also a\nmember of the Knight Commission on Intercollegiate Athletics and the Knight\nCommission Task Force on Racial Equality. He earned a Bachelor of Science\nin aeronautical engineering and a Master of Business Administration in\nfinance from the University of Michigan, where he was a catcher for the\nWolverine baseball team.\n\n     Steve Johnson is Executive Vice President and strategic advisor to the\nCEO, the leadership team, and the board of directors. Steve collaborates\nand provides counsel on American's strategy development and strategic\npositioning; economics and competition issues; corporate governance,\ncorporate purpose and ESG; policy development and external affairs;\npartnerships, alliances, deals and deal making; and labor strategy. Since\n2009, Steve has served as Executive Vice President - Corporate Affairs,\nresponsible for corporate governance and legal affairs, government and\nregulatory affairs, labor relations and real estate and airport affairs.\nFrom 2003 until 2009, he was a partner at Indigo Partners LLC, a private\nequity firm specializing in investments in the airline industry. Between\n1995 and 2003, he held a variety of positions at America West, including\nExecutive Vice President - Corporate. Prior to that, Steve served as Senior\nVice President and General Counsel at GPA Group PLC and practiced law at\nthe Seattle-based law firm Bogle &amp; Gates. Steve is a member of the board of\ndirectors of Wizz Air Holdings PLC, is a Lecturer at the Haas School of\nBusiness at the University of California, Berkeley, and serves on the\nExecutive Advisory Board of the University's Berkeley Center for Law and\nBusiness. Steve earned his Master of Business Administration and Juris\nDoctor from the University of California, Berkeley. He began his\nundergraduate education at the University of Washington and earned a\nBachelor of Arts in economics from California State University, Sacramento.\n\n     Maya Leibman is Executive Vice President and Chief Information\nOfficer, a position she has held since November 2015. Previously, she\nserved as Senior Vice President and Chief Information Officer from January\n2012 to November 2015. Prior to her role as Chief Information Officer,\nLeibman was President of the AAdvantage loyalty program from 2010 to 2012.\nFrom 2001 to 2010, Leibman held several positions in the Information\nTechnology department, culminating in the position of Vice President,\nBusiness Operations Systems from 2006 to 2010. Leibman joined American in\n1994 in the Revenue Management department. She is on the board of Acuity\nBrands and volunteers for a number of local organizations, including the So\nSMAART program, where she works with minority girls ages 9 to 12, teaching\nthem about technology and life. She is the executive sponsor for Living\nGreen, American's Employee Business Resource Group that explores new ways\nfor us all to \"reduce, reuse and recycle.\" Leibman earned a Bachelor of\nArts in English literature from the University of Chicago and a Master of\nBusiness Administration from the University of California, Berkeley.\n\n     Priya Aiyar is Senior Vice President, Corporate Affairs and Chief\nLegal Officer. In this role she will continue to lead American's Legal\nAffairs team and legal strategies for the airline. Previously, she was\nSenior Vice President and General Counsel for American, a position she held\nsince September 2019. Prior to that, she served as a partner at Willkie\nFarr &amp; Gallagher LLP from 2017 to 2019, as Acting General Counsel and\nDeputy General Counsel for the U.S. Department of the Treasury from 2013 to\n2017, and as Deputy General Counsel for the U.S. Department of Energy from\n2011 to 2013. Earlier in her career, she held other senior legal roles\nwithin the federal government and was a partner at Kellogg, Huber, Hansen,\nTodd, Evans &amp; Figel PLLC. She began her legal career as a clerk to Judge\nMerrick Garland of the U.S. Court of Appeals for the D.C. Circuit and to\nJustice Stephen Breyer of the U.S. Supreme Court. Aiyar holds a Juris\nDoctor from Yale Law School, a master's degree from the University of\nOxford and a bachelor's degree from Harvard University.\n\n     Cole Brown is Senior Vice President, Chief People Officer, a position\nshe has held since June 2021. In this role she leads the team responsible\nfor Global Talent and Recruitment, Benefits and Compensation, People\nOperations and Diversity, Equity and Inclusion. Previously, Brown served as\na Vice President of Human Resources at Amazon from November 2018 to 2021.\nIn that role she was Vice President, Human Resources for Amazon's Devices &amp;\nServices, Corporate &amp; Business Development, and Advertising &amp; Entertainment\nbusiness segments. Prior to this role, she was Amazon's Vice President of\nHuman Resources for North America Customer Fulfillment. In these roles, she\nserved as each business's chief human resources officer with responsibility\nfor all aspects of human resources, including recruiting, organizational\ndesign, training and development, diversity and inclusion, and employee\nrelations. Before joining Amazon, Brown served as Senior Vice President and\nChief Human Resources Officer for Conifer Health Solutions from 2015 to\n2018. Before that, she held a variety of positions during her time at\nWalmart from 2002 to 2014, including Chief Diversity Officer and\nculminating in the position of Senior Vice President of Human Resources.\nPrior to joining Walmart in its Legal Department, Brown practiced as an\nattorney specializing in the area of employment law and administrative\nregulations with Bashen Consulting, Wickliff &amp; Hall, P.C. and Doerner,\nSaunders, Daniel &amp; Anderson, L.L.P. She holds both a bachelor's degree and\na Juris Doctor from Southern Methodist University in Dallas.\n     Ron DeFeo is Senior Vice President, Chief Communications Officer. He\nmost recently was Senior Vice President, Global Engagement for American, a\nposition he has held since October 2018. Previously, DeFeo served as Vice\nPresident of Global Communications for American since August 2015. In these\nroles, DeFeo has been responsible for all of American's internal and\nexternal communications, team member recognition programs, leadership\ndevelopment and community affairs. Prior to joining the airline, DeFeo\nserved as Senior Vice President of Communications for Darden Restaurants\nfrom 2012 to 2015. Before that, DeFeo held various roles of increasing\nresponsibility leading communications teams at The Home Depot from 2003 to\n2011. Before that, he worked for four years with Ketchum, a public\nrelations agency. He earned a bachelor's degree in communication from\nDePauw University and a Master of Business Administration from the\nUniversity of Georgia.\n\n     Nate Gatten is Senior Vice President, Corporate Affairs and Chief\nGovernment Affairs Officer. Most recently, he served as Senior Vice\nPresident of Global Government Affairs of American, a position he has held\nsince August 2017. He will continue to lead American's federal and\ninternational government and regulatory affairs teams, ESG, and corporate\nsecurity. With today's announcement, Gatten will assume oversight of the\nairline's properties and corporate real estate portfolios, including\noverseeing all airport properties and leases and corporate facilities.\nPreviously, Gatten was Managing Director and Head of Global Government\nRelations at JPMorgan Chase &amp; Co. where he led the government relations and\npolicy teams globally, and served as the organization's primary\nrepresentative before Congress, the White House and international\npolicy-making bodies. From 2019-2021 he represented the United States as a\nmember of the Asia-Pacific Economic Cooperation Business Advisory Council.\nGatten holds a bachelor's degree from Willamette University and a Master of\nBusiness Administration from the Booth School of Business at the University\nof Chicago.\n\n     Vasu Raja is Senior Vice President, Chief Commercial Officer, where he\noversees American's global network and has oversight of the airline's\nalliances and partnerships, revenue management, sales and marketing\norganization, and American's loyalty program, AAdvantage. Previously, he\nserved as Senior Vice President, Revenue and Senior Vice President, Network\nStrategy, where he was responsible for network and alliances. Raja joined\nAmerican in 2004 and has held a variety of roles in Sales, Corporate\nPlanning and Revenue Management. He began his career with Teach for America\nin 1999 and taught for three years in Baltimore City Public Schools. In\n2013, he was named one of the Top 50 Executives under 50 by Diversity MBA\nMagazine. Raja earned a bachelor's degree in humanities from The University\nof Texas at Austin, a master's degree in teaching from Johns Hopkins\nUniversity and a Master of Business Administration from Georgetown\nUniversity.\n\n     David Seymour is Senior Vice President, Chief Operating Officer. He is\nresponsible for the airline's operations and its operating teams, including\nAirport Operations, Flight Operations, Technical Operations, Flight\nService, the Integrated Operations Center and Cargo. Seymour's aviation\ncareer began at the airline in 1999. Throughout his career he has held a\nvariety of leadership roles in Technical Operations, Operations Control,\nCrew Resources and Flight Operations. Prior to being named Chief Operating\nOfficer in 2020, Seymour served as Senior Vice President of Operations.\nEarly in his career, Seymour served as an airborne infantry officer in the\nU.S. Army and then held numerous management positions in purchasing,\ninventory management, distribution and finance after leaving the Army. In\n1987, after graduation from U.S. Army Ranger School, he was assigned to the\n82nd Airborne Division where he served as a Platoon Leader and Company\nExecutive Officer. He finished his active service in 1991 as the Operations\nOfficer for the U.S. Army Parachute Team \"Golden Knights.\" Seymour is an\nexecutive sponsor for American's Veteran &amp; Military Employee Business\nResource Group, an employee-led organization that supports veterans,\ncurrent military service members and their families. He also served as the\nChairman on the board of the Medal of Honor Foundation. Seymour holds a\nBachelor of Science degree in mathematical science of operations research\nfrom the U.S. Military Academy and a Master of Management degree in\nmarketing and transportation from Northwestern University's Kellogg School\nof Management. Seymour graduated from the United States Military Academy in\n1986.\n\n     About American Airlines Group\nAmerican's purpose is to care for people on life's journey. Shares of\nAmerican Airlines Group Inc. trade on Nasdaq under the ticker symbol AAL\nand the company's stock is included in the S&amp;P 500. Learn more about what's\nhappening at American by visiting news.aa.com and connect with American on\nTwitter @AmericanAir and at Facebook.com/AmericanAirlines.\n\n     Cautionary Statement Regarding Forward-Looking Statements and\nInformation\nCertain of the statements contained in this report should be considered\nforward-looking statements within the meaning of the Securities Act, the\nExchange Act and the Private Securities Litigation Reform Act of 1995.\nThese forward-looking statements may be identified by words such as \"may,\"\n\"will,\" \"expect,\" \"intend,\" \"anticipate,\" \"believe,\" \"estimate,\" \"plan,\"\n\"project,\" \"could,\" \"should,\" \"would,\" \"continue,\" \"seek,\" \"target,\"\n\"guidance,\" \"outlook,\" \"if current trends continue,\" \"optimistic,\"\n\"forecast\" and other similar words. Such statements include, but are not\nlimited to, statements about the Company's plans, objectives, expectations,\nintentions, estimates and strategies for the future, and other statements\nthat are not historical facts. These forward-looking statements are based\non the Company's current objectives, beliefs and expectations, and they are\nsubject to significant risks and uncertainties that may cause actual\nresults and financial position and timing of certain events to differ\nmaterially from the information in the forward-looking statements. These\nrisks and uncertainties include, but are not limited to, those set forth\nherein as well as in the Company's Quarterly Report on Form 10-Q for the\nquarter ended September 30, 2021 (especially in Part I, Item 2.\nManagement's Discussion and Analysis of Financial Condition and Results of\nOperations and Part II, Item 1A. Risk Factors), and other risks and\nuncertainties listed from time to time in the Company's other filings with\nthe Securities and Exchange Commission. In particular, the consequences of\nthe coronavirus outbreak to economic conditions and the travel industry in\ngeneral and the financial position and operating results of the Company in\nparticular have been material, are changing rapidly, and cannot be\npredicted. Additionally, there may be other factors of which the Company is\nnot currently aware that may affect matters discussed in the\nforward-looking statements and may also cause actual results to differ\nmaterially from those discussed. The Company does not assume any obligation\nto publicly update or supplement any forward-looking statement to reflect\nactual results, changes in assumptions or changes in other factors\naffecting these forward-looking statements other than as required by law.\nAny forward-looking statements speak only as of the date hereof or as of\nthe dates indicated in the statement.\n\n(br/)\n\nTel   : 817-963-1234    AMERICAN AIRLINES GROUP INC\nEmail : investor.relations@aa.com\nWWW   : <a href=\"http://www.aa.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.aa.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134700326.MNPRE2134702083-07331120211214</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}