{"date": "2021-12-03 11:55:41+00:00", "ticker": "III", "mrkt_info": {"open": 1433.5, "close": 1408.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n      03 Dec 2021 \n      <h4>\n        3i Infrastructure plc invests a further £268 million in ESVAGT\n      </h4><p>\n        3i Infrastructure plc (\"3i Infrastructure\" or the \"Company\") announces that it has agreed to acquire the stake in ESVAGT owned by its co-investor AMP Capital. This will result in 3i Infrastructure holding 100% of the equity in ESVAGT. This further investment is expected to be £268 million. Completion is subject to certain third party consents and is expected to take place in the first quarter of 2022.\n      </p><p>\n        In its half year results announcement, 3i Infrastructure said that a strategic review of its holding in ESVAGT was in progress and that as part of that review, offers had been invited. However, the Company retained the options of continuing to hold its 50% stake, to sell, or to offer to buy the AMP Capital stake. Binding offers for 100% of the equity were received but not at a compelling price for 3i Infrastructure, and so the Company elected to offer to buy the AMP Capital stake.\n      </p><p>\n        ESVAGT is the market leader in the fast growing segment of service operation vessels (\"SOV\") for the offshore wind industry. The company is also a leading provider of emergency rescue and response vessels (\"ERRV\") and related services to the offshore energy industry in and around the North Sea and the Barents Sea.\n      </p><p>\n        Since acquiring ESVAGT in 2015, 3i Infrastructure and AMP have supported management in driving the company's shift in strategic focus towards SOVs and becoming a key enabler of offshore wind operations in Europe. SOVs represented less than 10% of earnings at acquisition, but have grown to provide the majority of ESVAGT's contracted earnings today. During this period, ESVAGT has delivered six new SOVs, and has entered into a joint venture with Crowley in the USA to support the emerging offshore wind energy market there.\n      </p><p>\n        The offshore wind market, and hence demand for SOVs, is expected to grow strongly over the coming years, as many European governments and US states have set ambitious offshore wind build-out targets as part of their wider net-zero emissions plans.\n      </p><p>\n        Richard Laing, Chair of 3i Infrastructure, commented:\n      </p><p>\n        \"ESVAGT's transition into a market leader in European offshore wind has been a major achievement. We believe that it is well-placed to benefit from continuing attractive growth prospects in the wind sector and we are delighted to be acquiring 100% of the business.\"\n      </p><p>\n        Phil White, Managing Partner and Head of Infrastructure, 3i Investments plc, Investment Manager of the Company, added:\n      </p><p>\n        \"We very much look forward to continuing to work with CEO Peter Lytzen and the ESVAGT team to take advantage of the future growth of the offshore wind market, both in Europe and the US.\"\n      </p><p><strong>-ENDS-</strong></p><p><strong><a href=\"https://www.3i-infrastructure.com/media/5558/esvagt-final-031221.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download this press release</a></strong></p><p><strong>For further information, contact:</strong></p><div class=\"story-table-container\"><table class=\"story-basic-table\"><tbody><tr><td><p>\n                Thomas Fodor\n              </p><p>\n                Investor enquiries\n              </p><p>\n                Kathryn van der Kroft\n              </p><p>\n                Media enquiries\n              </p></td><td><p>\n                Tel: +44 207 975 3469\n              </p><p>\n                Email: <a href=\"mailto:thomas.fodor@3i.com\" data-type=\"email\" translate=\"no\">thomas.fodor@3i.com</a></p><p>\n                Tel: +44 20 7975 3021\n              </p><p>\n                Email: <a href=\"mailto:kathryn.vanderkroft@3i.com\" data-type=\"email\" translate=\"no\">kathryn.vanderkroft@3i.com</a></p></td></tr></tbody></table></div><p><strong>Notes to editors:</strong></p><p><strong>3i Infrastructure plc</strong></p><p>\n        3i Infrastructure plc is a Jersey-incorporated, closed-ended investment company and an approved UK Investment Trust, listed on the London Stock Exchange and regulated by the Jersey Financial Services Commission. The Company's purpose is to invest responsibly in infrastructure, delivering long-term sustainable returns to shareholders and having a positive impact on its portfolio companies and their stakeholders.\n      </p><p>\n        3i Investments plc, a wholly-owned subsidiary of 3i Group plc, is authorised and regulated in the UK by the Financial Conduct Authority and acts as Investment Manager of 3i Infrastructure plc.\n      </p></div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.3i-infrastructure.com/newsroom/press-releases/2021/3i-infrastructure-plc-invests-a-further-268-million-in-esvagt/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>3i Infrastructure plc</strong> published this content on <strong>03 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>03 December 2021 11:55:41 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - 3i Infrastructure plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: 3i-Infrastructure-plc</p></div>"}