{"date": "2021-12-02 15:11:14.781000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>FOBI AI INC (\"FOBI-V;FOBIF-0\")\n- Signing Of Amazon Fulfillment And Business Seller Agreement\n\n     Fobi AI Inc. Inc. (the \"Company\" or \"Fobi\"), a leader in providing\nreal-time data analytics through artificial intelligence to drive customer\nactivation and engagement, announced it has signed an agreement with Amazon\nfor distribution and fulfillment of Fobi AI's various hardware products. As\npart of the agreement, Fobi will also become an Amazon Business Seller\nwhich will enable Fobi to gain access to Amazon's global e-commerce,\nlogistics and fulfillment infrastructure.\n\n     By joining Amazon Business, Fobi immediately reaches over 5 million\nbusiness customers in nine countries: a network that Fobi is very proud to\nnow be included in. Fobi will now generate additional revenue through\nhardware, products and services sold on Amazon Business.\n\n     Fobi will be launching their Fobi 3.0 IoT hardware devices in the\ncoming weeks on Amazon Business. Fobi's proprietary IoT device will provide\nAmazon Business customers with real-time point of sale connectivity through\ncapturing and attributing first-party data in real-time.\n\n     The Fobi 3.0 product offering will also include access to Fobi's Data\nExchange which leverages the power of artificial intelligence and machine\nlearning to provide actionable insights and data utilization. All offerings\nwill include the company's current and future engagement programs through\nFobi's Wallet Pass and Coupon platforms. Other products to be launched\ninclude Fobi's Smart Tap NFC tap devices for contactless Wallet Pass\nverification for venues and events. Also, Fobi's new Smart Scanner product\nthat consists of a tablet or a kiosk and software that can be used to scan\nand verify Fobi Wallet passes such as employee IDs, event tickets and even\nFobi's CheckVax(TM) digital proof of vaccination and Covid testing.\n\n     Fobi CEO Rob Anson stated, \"As a result of COVID-19, businesses and\nconsumers have been hindered by major disruptions to the global supply\nchain. As we are now set to roll out our Fobi 3.0 IoT devices globally and\nas we anticipate a record-breaking year for the Company in 2022, leveraging\nFulfillment by Amazon is something we have been working on for quite some\ntime and we are very pleased that we will now be ready to launch in January\n2022. For a fast-paced growing company like Fobi, it is extremely fortunate\nthat we can now leverage the strengths of Amazon as we go to market, and\nthere is simply no one stronger than Amazon when it comes to logistics,\nproduct distribution and support. This move is a key stepping-stone in\nstrengthening our reseller channel and growing our global client base even\nfurther.\"\n\n     This Press Release Is Available on the Fobi Website, as well as the\nFOBI Verified Forum On AGORACOM For Shareholder Discussion And Management\nEngagement.\n\n     About Fobi\n\n     Fobi is a cutting-edge data intelligence company that helps our\nclients turn real-time data into actionable insights and personalized\ncustomer engagement to generate increased profits. Fobi's unique IoT device\nhas the ability to integrate seamlessly into existing infrastructure to\nenable data connectivity across online and on-premise platforms creating\nhighly scalable solutions for our global clients. Fobi partners with some\nof the largest companies in the world to deliver best-in-class solutions\nand operates globally in the retail, telecom, sports &amp; entertainment,\ncasino gaming, and hospitality &amp; tourism industries.\n\nContact Information:\n\n//st\n\n            Fobi AI Inc.                 Fobi Website: www.fobi.ai\n\n            Rob Anson, CEO               Facebook: @ Fobiinc\n\n            T : +1 877-754-5336 Ext. 3   Twitter: @ Fobi_inc\n\n            E: ir@fobi.ai                LinkedIn: @ Fobiinc\n\n//et\n\n     This news release contains certain statements that constitute\nforward-looking statements or information, including statements regarding\nFobi's business and technology; the ability of Fobi to engage with industry\nparticipants to achieve its goals; the development of Fobi's technology;\nand the viability of Fobi's business model. Such forward-looking statements\nare subject to numerous risks and uncertainties, some of which are beyond\nFobi's control, including the impact of general economic conditions,\nindustry conditions, competition from other industry participants, stock\nmarket volatility, and the ability to access sufficient capital from\ninternal and external sources. Although Fobi believes that the expectations\nin its forward-looking statements are reasonable, they are based on factors\nand assumptions concerning future events which may prove to be inaccurate.\nThose factors and assumptions are based upon currently available\ninformation. Such forward-looking statements are subject to known and\nunknown risks, uncertainties, and other factors that could influence actual\nresults or events and cause actual results or events to differ materially\nfrom those stated, anticipated, or implied in the forward-looking\nstatements. As such, readers are cautioned not to place undue reliance on\nthe forward-looking statements, as no assurance can be provided as to\nfuture results, levels of activity, or achievements. The forward-looking\nstatements contained in this news release are made as of the date of this\nnews release and, except as required by applicable law, Fobi does not\nundertake any obligation to publicly update or to revise any of the\nincluded forward-looking statements, whether as a result of new\ninformation, future events or otherwise. The forward-looking statements\ncontained in this document are expressly qualified by this cautionary\nstatement. Trading in the securities of Fobi should be considered highly\nspeculative. There can be no assurance that Fobi will be able to achieve\nall or any of its proposed objectives.\n\n     Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccept responsibility for the adequacy or accuracy of this release.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133500298.MNPRE2133501630-06530720211202</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}