{"date": "2022-02-10 19:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3223.79, "close": 3065.87}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Lisa Richwine</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LOS ANGELES, Feb 10 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A year ago, many Super Bowl advertisers tiptoed into the U.S. football championship trying to respectfully acknowledge a difficult year in the COVID-19 pandemic. </p><p>This Sunday, brands will return to the big game using the time-tested tactics of going for big laughs, or trying to uplift audiences with messages of strength and triumph.</p><p>While COVID-19 remains a concern, new cases are on the decline across the United States, some areas are scrapping mask mandates and health experts are optimistic that the virus is becoming more manageable. </p><p>The game itself, in front of 70,000 people at SoFi Stadium outside Los Angeles, will look more like pre-pandemic times than last year when the crowd in Tampa, Florida, was limited to one-third capacity. Many commercials will reflect that.</p><p>\"We're hopefully getting a little bit back to the normal. There's fans in games and there is an excitement,\" two-time Super Bowl winner Eli Manning told Reuters.     </p><p>Manning and his two-time Super Bowl champion brother Peyton will appear in an ad that features a road trip in a party bus to promote Frito-Lay products including Doritos and Mountain Dew.</p><p>The Super Bowl offers brands the chance to get in front of the year's largest U.S. television audience of around 100 million viewers. Broadcaster NBC, a unit of Comcast Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CMCSA.O\" data-type=\"ric\" data-ric=\"CMCSA.O\" translate=\"no\" dir=\"ltr\">CMCSA.O</a>, charged as much as $7 million for 30 seconds of commercial time.  </p><p>Advertisers are not expected to mention the pandemic explicitly, but some will tout the ability to bounce back from challenges. Budweiser, for example, <a href=\"https://www.reuters.com/business/media-telecom/chloe-zhao-directs-budweisers-return-super-bowl-ad-battle-2022-02-02\" data-type=\"url\" class=\"tr-link\" translate=\"no\">will tell the story</a> of one of its trademark Clydesdales recovering from injury.</p><p>The beermaker, owned by Anheuser-Busch Inbev <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ABI.BR\" data-type=\"ric\" data-ric=\"ABI.BR\" translate=\"no\" dir=\"ltr\">ABI.BR</a>, sat out last year's Super Bowl, instead <span class=\"tr-strong\">donating </span>to support COVID-19 vaccine awareness. The company decided to come back with a more serious tone, said Budweiser <span class=\"tr-strong\">Vice President of Marketing </span>Daniel Blake, rather than something akin to its comedic talking frogs of the past.</p><p>\"It was key to return to the stage with a message of hope and resilience for America,\" Blake said. </p><p>The game will feature a mix of returning advertisers and brands making their first Super Bowl appearance.</p><p>Returning brands include carmakers such as GM <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GM.N\" data-type=\"ric\" data-ric=\"GM.N\" translate=\"no\" dir=\"ltr\">GM.N</a> and Nissan <a href=\"reuters://REALTIME/Verb=FullQuote/ric=7201.T\" data-type=\"ric\" data-ric=\"7201.T\" translate=\"no\" dir=\"ltr\">7201.T</a>, Kellogg's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=K.N\" data-type=\"ric\" data-ric=\"K.N\" translate=\"no\" dir=\"ltr\">K.N</a> Pringles and travel website Expedia <span class=\"tr-strong\"><a href=\"reuters://REALTIME/Verb=FullQuote/ric=EXPE.O\" data-type=\"ric\" data-ric=\"EXPE.O\" translate=\"no\" dir=\"ltr\">EXPE.O</a>. </span></p><p>Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> will offer the first trailer for its much-anticipated \"Lord of the Rings\" streaming TV series that will debut on Prime Video in September.</p><p>Newcomers will include cryptocurrency exchanges FTX Trading Ltd and Crypto.com.  </p><p>\"A lot of brands are taking stock of the times that we're in now and the rise in curiosity around crypto and the metaverse,\" said Adweek editor Shannon Miller.</p><p>Meta <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a>, the company formerly known as Facebook, will pitch its Quest 2 virtual reality headset. The commercial shows an animatronic singing dog that has faded from popularity but finds a new and exciting life in the metaverse.</p><p>Elsewhere, celebrities will abound. Arnold Schwarzenegger will portray Zeus to promote an electric BMW <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BMWG.DE\" data-type=\"ric\" data-ric=\"BMWG.DE\" translate=\"no\" dir=\"ltr\">BMWG.DE</a>, while Gwyneth Paltrow will tout Uber Eats <a href=\"reuters://REALTIME/Verb=FullQuote/ric=UBER.N\" data-type=\"ric\" data-ric=\"UBER.N\" translate=\"no\" dir=\"ltr\">UBER.N</a>. Zendaya will appear on behalf of Squarespace <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SQSP.N\" data-type=\"ric\" data-ric=\"SQSP.N\" translate=\"no\" dir=\"ltr\">SQSP.N</a> as woman who turns to ecommerce to save her struggling seashell business.    </p><p>\"We're not going to see all this COVID stuff like we did before. People are tired of thinking about all that,\" said Ronald Goodstein, associate marketing professor at Georgetown University's McDonough School of Business.</p><p>He said brands returning to familiar themes or mascots such as the Budweiser Clydesdales will appeal to audiences this year.</p><p>\"I think people are looking for some tradition. People like comfort given the time we have now, and there's some comfort in nostalgia,\" he added.</p><p><br/></p><p>    </p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Lisa Richwine in Los Angeles;<br/>Additional reporting by Amy Tennery and Aleksandra Michalska in New York; Editing by Lisa Shumaker)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:lisa.richwine@thomsonreuters.com\" data-type=\"email\" translate=\"no\">lisa.richwine@thomsonreuters.com</a> ; <br/> Follow me on Twitter <a href=\"https://twitter.com/LARichwine\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/LARichwine</a>; <br/> 1-424-434-7324; <br/> Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://lisa.richwine.thomsonreuters.com@reuters.net\">lisa.richwine.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: FOOTBALL-NFL-SUPERBOWL/COMMERCIALS (PIX, TV)</p></div>"}