{"date": "2021-12-14 19:14:08+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">In Dec. 12 story, corrects nature of storm to tornado in paragraph</p><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Workers say they were told to shelter in bathrooms</li><li class=\"tr-summaryitem\">Amazon says workers allowed cell phones</li><li class=\"tr-summaryitem\">Police release names of the dead</li></ul><p class=\"tr-by\">By Richa Naidu</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">EDWARDSVILLE, Ill., Dec 12 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon cargo driver Austin J. McEwen, 26, was an only child who loved to listen to rapper Mac Miller and hunt with his friends. </p><p>He died trying to shelter from <a href=\"https://www.reuters.com/world/us/injuries-reported-after-roof-collapse-amazon-warehouse-illinois-ap-2021-12-11\" data-type=\"url\" class=\"tr-link\" translate=\"no\">a powerful tornado</a> in the bathroom at an Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> warehouse on Friday night, according to a coworker.</p><p>McEwen was one of six workers identified by police on Sunday who were killed when their plant in Edwardsville, Illinois, buckled under the force of the devastating storm. A barrage <a href=\"https://www.reuters.com/markets/commodities/devastated-kentucky-tornado-survivors-pick-through-debris-shelter-with-relatives-2021-12-12\" data-type=\"url\" class=\"tr-link\" translate=\"no\">of tornadoes</a> ripped through six U.S. states, leaving a trail of death and destruction at homes and businesses stretching more than 200 miles (322 km).</p><p>\"He was my friend and he didn't make it,\" said coworker Brian Erdmann, who was on his way to make a delivery to the warehouse. \"If I would have got back 45 minutes earlier, I probably would have been at the same place. I would have been right there with him.\"</p><p>The other Amazon workers identified as dead by a coroner were Deandre S. Morrow, 28, of St. Louis, Missouri; Kevin D. Dickey, 62, of Carlyle, Illinois; Clayton Lynn Cope, 29, of Alton, Illinois; Etheria S. Hebb, 24, of St. Louis, Missouri; and Larry E. Virden, 46, of Collinsville, Illinois.</p><p>Several employees told Reuters that they had been directed to shelter in bathrooms by Amazon managers after receiving emergency alerts on mobile phones from authorities. </p><p>Amazon said employees were directed to shelter in place at a designated assembly area at the front of the building, which was near a restroom.  </p><p>The site received tornado warnings between 8:06 p.m. and 8:16 p.m. before the tornado struck the building at 8:27 p.m., the company said.  </p><p>\"Our team worked quickly to ensure as many employees and partners could get to the designated Shelter in Place,\" the company said in a statement. \"We thank them for everything they were able to do.\"</p><p>Some of those workers said they had kept their phones despite what they believed was a violation of an Amazon policy that prevents them from having cellphones at work. </p><p>The company responded by saying that there was no Amazon policy that prevents employees or contractors from having a cell phone at work. </p><p>\"I was at the end of my route. I was just getting in the building and they started screaming, 'Shelter in place!'\" said David Kosiak, 26, who has worked at the facility for three months. \"We were in the bathrooms. That's where they sent us.\"</p><p>\"It sounded like a train came through the building. The ceiling tiles came flying down. It very loud. They made us shelter in place til we left - it was at least two and a half hours in there.\"</p><p>The National Weather Service said the <span class=\"tr-strong\">tornado</span> hit the area between 8:28 and 8:32 p.m. central time, intensifying rapidly as it struck the Amazon warehouse. With estimated peak winds of 150 miles per hour (241 km-per-hour) winds, the force was so severe that the roof was ripped off and 11-inch (28-cm) thick concrete walls longer than football fields fell in on themselves.</p><p>At least 45 Amazon employees made it out safely. Authorities had given up hope of finding more survivors as they shifted from rescue to recovery efforts that were expected to last days.  </p><p>The company has three facilities in Edwardsville: the delivery station hit by the storm as well as a fulfillment center and a sorting station. The delivery station opened in July 2020 to prepare orders for last-mile delivery to customers.</p><p>Amazon said it was donating $1 million to the Edwardsville Community Foundation. The company said it is providing relief supplies as well as transport, food and water.</p><p>On Sunday, Amazon workers arrived at the warehouse across the street, heavily guarded by security, to start shifts.</p><p>\"It's a reminder of the trauma that I just endured but I will be returning to work at Amazon,\" said McEwen's friend and coworker Emily Epperson. \"This is my livelihood.”</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Richa Naidu in Edwardsville, Illinois and Caroline Stauffer in Chicago; Writing by Leela de Kretser; Editing by Lisa Shumaker, Robert Birsel)</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-WEATHER/TORNADOES-AMAZON.COM (CORRECTED, UPDATE 2, PIX, TV)</p></div>"}