{"date": "2021-11-26 16:38:40.685000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3504.56, "close": 3507.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Climate activists blockaded Amazon warehouses in three European countries on Friday, part of a global effort to pressure the ecommerce giant on one of its busiest days of the year to improve working conditions and end business practices that hurt the environment.</p><p>Members of Extinction Rebellion targeted 13 Amazon fulfilment centers in the United Kingdom with the aim of disrupting 50% of the company's deliveries on Black Friday, which marks the unofficial start to the holiday shopping season. They staged similar protests in Germany and the Netherlands.</p></div><div class=\"tr-npp-body\"><p>\"The action is intended to draw attention to Amazon's exploitative and environmentally destructive business practices, disregard for workers' rights in the name of company profits, as well as the wastefulness of Black Friday,\" the group said. It vowed to remain at the scene</p><p>At least 13 people were arrested at three of the U.K. locations, with some held on suspicion of aggravated trespass or public nuisance, police forces said.</p><p>Extinction Rebellion and dozens of other activist groups in the U.S. and around the world are organizing a day of global protests and strikes on Friday against Amazon to demand the company provide better working conditions, commit to operating sustainably, and pay its fair share of tax.</p><p>In the U.S., labor activists planned a small protest at Amazon's fulfilment center on Staten Island, New York.</p><p>Activists in the U.K. blocked the entrance to Amazon's warehouse in Tilbury, just east of London, with an effigy of Amazon founder Jeff Bezos sitting on top of a rocket.</p><p>At Amazon's distribution center in Dunfermline, Scotland, about 20 Extinction Rebellion members strung banners across the entrance road that said \"Make Amazon Pay\" and locked themselves together, stopping trucks from entering and some from leaving.</p><p>Amazon did not directly address the protests in response to a request for comment, but said the company takes its responsibilities \"very seriously.\"</p><p>\"That includes our commitment to be net zero carbon by 2040 — 10 years ahead of the Paris Agreement — providing excellent pay and benefits in a safe and modern work environment, and supporting the tens of thousands of British small businesses who sell on our store,\" the company said.</p><p>Extinction Rebellion activists also blocked an Amazon logistics center in the central German town of Bad Hersfeld by erecting a makeshift bamboo scaffold that they used to suspend themselves in the air. Authorities later removed them with the help of a fire department ladder truck, according to video posted on the group's German Facebook page.</p><p>The group staged a similar protest at an Amazon facility at Amsterdam's Schipol airport.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.</p></div>"}