{"date": "2021-11-09 10:19:44+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <h4>\n                  <span>09 Nov 2021<br/></span> Amazon's deal with UK spy agencies likely to push revenue from UK Government above record yearly high of £88m, says GlobalData\n      </h4>\n      Posted in <a href=\"https://www.globaldata.com/category/aerospace-defense-security/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Aerospace, Defense &amp; Security</a></div>\n              <div>\n                <p>\n        Following today's news (26 October) that Amazon Web Services (AWS) has struck a new deal with GCHQ, MI5 and MI6 to host classified data;\n      </p>\n                <p>\n                  <strong>Amir Boubaker, Defence Analyst at GlobalData, a leading data and analytics company, offers his view:</strong>\n                </p>\n                <p>\n        \"This deal with Amazon is another reminder that the UK Government is willing to partner with a foreign supplier if it means gaining the edge over its adversaries.\n      </p>\n                <p>\n        \"According to GlobalData's latest market data, AWS has taken over 50% of public sector market share for hosting services this fiscal year. This comes amid a clear strategy by AWS to grow its presence across the UK Government, with its revenue reaching a high of £88m in fiscal year 2020-21. This includes doubling its revenue with HMRC in 2020-21 alone (£51m) and record highs with the Department for Work and Pensions (£14m) in 2020-21 and Home Office (£25m) in 2019-20.\n      </p>\n                <p>\n        \"While no official contract has been published yet, early reports suggest the new AWS deal is worth between £500m to £1bn over the next ten years, significantly boosting UK Government revenue with the cloud provider. The deal was signalled last October when Strategic Command, the intelligence-focused branch within the Ministry of Defence (MoD), published a pre-tender looking for a supplier to deliver a SECRET (classification level) cloud capability. Codenamed the EMPORIUM Project, the supplier would be responsible for migrating MoD data to a new private cloud environment - something that would require the supplier to have access to MoD secure networks and data centres.\"\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.globaldata.com/amazons-deal-uk-spy-agencies-likely-push-revenue-uk-government-record-yearly-high-88m-says-globaldata/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>GlobalData plc</strong> published this content on <strong>09 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>09 November 2021 10:19:44 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - GlobalData plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: GlobalData-plc</p></div>"}