{"date": "2021-11-08 17:18:13.722000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z;NEXCF-0\")\n- Third Quarter 2021 Earnings &amp; Conference Call\n\n    Nextech AR Solutions Corp. (\"Nextech\" or the \"Company\"), a diversified\nleading provider of augmented reality (\"AR\") experience technologies plans\nto release its third quarter 2021 financial results before markets open on\nThursday, November 11, 2021.\n\n    Subsequently, Nextech will host a conference call to discuss the third\nquarter results on November 11, 2021, at 9:00 a.m. Eastern Time. Please\njoin Evan Gappelberg, Chief Executive Officer, Andrew Chan, Chief Financial\nOfficer, and Bradley Gittings, VP of Investor Relations to discuss these\nfinancial and operating results followed by a question and answer period.\n\n    Conference Call Details:\n\n    Date: Thursday, November 11, 2021Time: 9:00 a.m. Eastern Standard\nTimeToll Free Dial-In Number: (877) 201-0168International Dial-In Number:\n(647) 788-4901Conference ID: 5039337Webcast Link: Nextech AR Q3, 2021\nEarnings Call\n\n    For those unable to join the live event, a recording of the\npresentation will be posted on the company's IR website.\n\n    To learn more, please follow us on Twitter, YouTube, Instagram,\nLinkedIn, and Facebook, or visit our website: <a href=\"https://www.Nextechar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.Nextechar.com</a>.\n\n    About Nextech AR\n\n    Nextech develops and operates augmented reality (\"AR\") platforms that\ntransports three-dimensional (\"3D\") product visualizations, human holograms\nand 360 portals to its audiences altering e-commerce, digital advertising,\nhybrid virtual events (events held in a digital format blended with\nin-person attendance) and learning and training experiences.\n\n    Nextech focuses on developing AR solutions however most of the\nCompany's revenues are derived from three e-Commerce platforms:\nvacuumcleanermarket.com (\"VCM\"), infinitepetlife.com (\"IPL\") and\nTrulyfesupplements.com (\"TruLyfe\"). VCM and product sales of residential\nvacuums, supplies and parts, and small home appliances sold on Amazon.\n\n    Forward-looking Statements\n\n    The CSE and the NEO have not reviewed and do not accept responsibility\nfor the adequacy or accuracy of this release.\n\n    Certain information contained herein may constitute \"forward-looking\ninformation\" under Canadian securities legislation. Generally,\nforward-looking information can be identified by the use of forward-looking\nterminology such as, \"will be\" or variations of such words and phrases or\nstatements that certain actions, events or results \"will\" occur.\nForward-looking statements regarding the completion of the transaction are\nsubject to known and unknown risks, uncertainties and other factors. There\ncan be no assurance that such statements will prove to be accurate, as\nfuture events could differ materially from those anticipated in such\nstatements. Accordingly, readers should not place undue reliance on\nforward-looking statements and forward-looking information. Nextech will\nnot update any forward-looking statements or forward-looking information\nthat are incorporated by reference herein, except as required by applicable\nsecurities laws.\n\nContact Information:\n\nBradley Gittings\ninvestor.relations@nextechar.com\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131100537.MNPRE2131101907-09152520211108</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}