{"date": "2021-11-03 07:04:15.605000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">BANGALORE, India, Nov. 3, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">BANGALORE, India</span>, <span class=\"xn-chron\">Nov. 3, 2021</span> /PRNewswire/ --<b> Rapyder Cloud Solutions Pvt. Ltd. (Rapyder)</b> announced that it has won the AWS Consulting Partner of the Year 2021 (<span class=\"xn-location\">India</span>) award at the Amazon Web Services (AWS) Partner Summit Online in <span class=\"xn-location\">India</span>. The AWS Consulting Partner of the Year award recognizes AWS Partners who play a key role in helping their customers drive innovation and digital transformation of their businesses through creative and optimum use of their IT infrastructure with impactful solutions built on AWS. </p>\n<p>The AWS Partner Awards recognize a wide range of born-in-the-cloud and traditional consulting and independent software vendor (ISV) partners whose business models have embraced specialization and collaboration.</p>\n<p>Rapyder is an AWS Advanced Consulting Partner which is all-in on AWS, offering end-to-end cloud solutions across industry verticals. Rapyder's service offering includes applications and infrastructure migrations to the cloud, consulting and architecture services, DevOps, and Managed Services. With a focus on strengthening its technical capabilities, Rapyder has achieved two AWS Competencies, the AWS DevOps Competency and AWS Microsoft Workloads Competency. Rapyder also participates in seven AWS Service Delivery Programs and five AWS Partner Programs.</p>\n<p>An established player in the cloud-tech space in <span class=\"xn-location\">India</span>, Rapyder has proven capabilities and offerings in AWS cloud migration, adoption and optimization for business relating to security, assessment, pinpoint, business continuity and many more. Rapyder enables its customers across education, healthcare, retail, manufacturing, financial services, and other industry verticals to accelerate their cloud journeys effectively and quickly. </p>\n<p>Speaking about the achievement, <span class=\"xn-person\">Amit Gupta</span>, founder and CEO of Rapyder, said, \"It is an honor to receive the AWS Consulting Partner of the Year 2021 Award for <span class=\"xn-location\">India</span>. It speaks a lot about how fast and far we have come in just four and half years of our journey. This achievement further strengthens our collaboration with the AWS Partner Network (APN) and encourages us to further transform enterprises on the cloud. It's still Day One at Rapyder and we are looking to continue our momentum.\"</p>\n<p><b>About</b> <b>Rapyder Cloud Solutions Pvt Ltd</b></p>\n<p>Rapyder is an agile, precise, and innovative company that offers end-to-end cloud solutions across industry verticals. With headquartered in Bengaluru, it works with a clear vision to help organizations achieve their business goals, leveraging technologies best suited for them. Rapyder has extensive experience applying its cloud services to enable operational efficiencies across Cloud Migration, DevOps Automation, App Modernization, Cost Optimization, and NextGen Managed Services.</p>\n<p><b>Media Contact:</b> </p>\n<p>Interlock PR<br/><span class=\"xn-person\">Jaya Sara Varghese</span><br/><a href=\"mailto:Jaya.sara@interlockpr.com\" data-type=\"email\" translate=\"no\">Jaya.sara@interlockpr.com</a><br/>+91-9742260425</p>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p></div>"}