{"date": "2022-02-25 11:20:29+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2896.54, "close": 3075.77}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        Telefónica strengthens its strategic collaboration with Amazon and reaches a new global agreement to drive the digital transformation of the business-to-business (B2B) and business-to-consumer (B2C) worlds. Through this agreement, <u><a href=\"https://telefonicatech.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Telefónica Tech</a></u> and Amazon Web Services (AWS) will invest in joint go-to-market activities, develop new cloud solutions, and expand AWS cloud skills and capabilities of Telefonica Tech's professionals to better support customers in their journey to the cloud. In addition, Movistar Fusión customers will enjoy an innovative TV-commerce experience with the Movistar Plus+ Living App 'Selección Hogar de Movistar'.\n      </p>\n                <p>\n        This agreement includes a joint go-to-market proposition with AWS with the aim to bring innovation to customers faster and to help them better leverage the agility of the cloud. Telefónica Tech will also provide its enterprise, SMB and public sector customers with native professional services on AWS at any stage of their cloud journey, offering support through the various stages of platform assessment, design and deployment, and migration.\n      </p>\n                <p>\n        Telefónica Tech and AWS are committed to fostering innovation in the cloud. Telefónica Tech plans to launch several value-added solutions such as edge computing and cloud native private 5G networks that run on AWS Outposts. This collaboration will open up new opportunities in 5G and use cases for edge computing, machine learning, Internet of Things (IoT), video and game streaming and Industry 4.0.\n      </p>\n                <p>\n        In addition, Telefónica Tech will continue to expand its managed and professional services with the creation of an AWS competence centre that will use best practices recommended by AWS to help customers transition to the cloud in a fast and secure way. This AWS competence centre will offer new services relating to cost optimisation, devops and automation, application modernisation and other cloud related capabilities. Telefónica Tech currently has a qualified team of around 4,000 expert professionals serving the Telefónica Group's 5.5 million B2B customers in 175 countries.\n      </p>\n                <p>\n        The new agreement with AWS will allow Telefónica Tech to train and certify hundreds of its professionals in the services and best practices of AWS's cloud services with the aim of supporting Telefónica customers during their migration to the cloud. To this end, Telefónica Tech will expand its capabilities and become an AWS Premier Consulting Partner and will acquire other technical competencies such as AWS Managed Services Provider and AWS Migration Acceleration Program.\n      </p>\n                <p>\n        Jose Cerdán, CEO of Telefónica Tech, said: \"This agreement with AWS strengthens our partnership and allows us to go to market with a comprehensive and cutting-edge proposition. Our customers demand greater innovation in the design of cloud solutions and demand to use AWS services from the most appropriate location. The professional and managed services that Telefónica Tech will offer will therefore be key to helping companies in this complex process of adopting the public cloud with edge locations.\"\n      </p>\n                <p>\n        Adolfo Hernandez, Vice President Global Telco Industry, AWS, said: \"We are excited to work with Telefónica to bring our successful collaboration to the next level and build out customer-centric solutions on AWS, especially on 5G and edge computing. This collaboration means AWS can bring the highest level of cloud native expertise to an even wider audience with Telefónica, significantly accelerating the pace of innovation and cloud adoption.\"\n      </p>\n                <p>\n                  <strong>Para más información:</strong>\n                  <strong>\n                    <a href=\"https://www.telefonica.com/es/mwc/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Telefónica en el MWC 2022</a>\n                  </strong>\n                </p>\n                <h4>\n                  <strong>\n                    <strong>Committing to innovation in the Digital Home</strong>\n                  </strong>\n                </h4>\n                <p>\n        The agreement reached between Telefónica and Amazon also includes an innovative commitment to the Digital Home with the launch of the <u><a href=\"https://livingapps.telefonica.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Living App</a></u> 'Selección Hogar de Movistar' on Movistar Plus+. From today, users of the TV platform in more than one million homes in Spain will be able to conveniently and directly access over 20,000 products of Amazon.es products such as decoration, cooking, DIY, lighting, electrical appliances, and gardening with the option of fast delivery.\n      </p>\n                <p>\n        'Selección Hogar de Movistar' will be among the new services that the company will present during its participation in the Mobile World Congress (MWC), to be held in Barcelona between 28 February and 3 March. This new TV-Commerce on Movistar Plus+ is part of the Digital Home proposal that Telefónica will include in its booth during the Mobile World Congress, a space that will provide a first-hand look at this new service.\n      </p>\n                <p>\n        This launch is an innovative TV-Commerce integration that reinforces the strategic relationship that the two companies <u><a href=\"https://www.telefonica.com/en/communication-room/telefonica-announces-a-strategic-collaboration-with-amazon-web-services-to-enable-an-easier-journey-to-the-cloud-for-enterprise-customers/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">began in 2018</a></u> in the consumer area, a collaboration that has materialised, among other initiatives, in the integration of Prime Video in Telefónica's television platforms in several markets and the implementation of the AWS infrastructure in several of Telefónica's digital services.\n      </p>\n                <p>\n        \"Amazon is a strategic partner for Telefónica with whom we will continue to collaborate on new initiatives to offer the best integrated services to our customers as part of Telefónica's digital home proposition,\" said Chema Alonso, Chief Digital Officer of Telefónica.\n      </p>\n                <p>\n        The <u><a href=\"https://livingapps.telefonica.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Living Apps</a></u> are entertainment, education, culture, consumer or sports applications for TV integrated into Movistar Plus+, from where users can enjoy digital experiences whenever they connect through the UHD set-top box.\n      </p>\n                <p>\n        Movistar Plus+ customers do not need to download or install any software to enjoy this new service, as the 'Selección Hogar de Movistar' Living App is available through in the \"Apps\" section of the home screen for customers with the <u><a href=\"https://www.movistar.es/particulares/movil/moviles/descodificador-uhd/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Movistar Plus+ UHD set top box</a></u>. In it, users can go shopping in a comfortable way and on a large screen and discover products to renovate every corner of the home. In addition, they can add products to the Living App basket and involve the rest of the family members in the shopping process. The purchase transaction is completed through the Amazon.es mobile app or online site.\n      </p>\n                <p>\n        Within each category, products will have descriptions, average ratings from other users and even other related products to make the purchase decision easier.\n      </p>\n                <div>\n                  <ul class=\"bulleted-list arrowlist\">\n                    <li>\n                      <div>\n                        <a href=\"https://www.telefonica.com/en/wp-content/uploads/sites/5/2022/02/Telefonica-AWS-Amazon-ENG.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Telefónica expands its strategic collaboration with Amazon for cloud development and the digital home</a>\n                      </div>\n                      <div>\n                        <a href=\"https://www.telefonica.com/en/wp-content/uploads/sites/5/2022/02/Telefonica-AWS-Amazon-ENG.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">PDF | 159 KB</a>\n                      </div>\n                    </li>\n                    <li>\n                      <div>\n                        <a href=\"https://www.telefonica.com/en/wp-content/uploads/sites/5/2022/02/telefonica-amazon-living-app.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Image Telefónica expands its strategic collaboration with Amazon for cloud development and the digital home</a>\n                      </div>\n                      <div>\n                        <a href=\"https://www.telefonica.com/en/wp-content/uploads/sites/5/2022/02/telefonica-amazon-living-app.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">JPG | 293 KB</a>\n                      </div>\n                    </li>\n                  </ul>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.telefonica.com/en/communication-room/telefonica-expands-its-strategic-collaboration-with-amazon-for-cloud-development-and-the-digital-home/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Telefónica SA</strong> published this content on <strong>25 February 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>25 February 2022 11:20:29 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Telefónica SA</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Telefónica-SA</p></div>"}