{"date": "2022-01-27 19:33:17.422000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon recently launched two new initiatives for the automotive industry. To learn more, we spoke to Dean Phillips, Worldwide Technical Leader, AWS Automotive.</p><p>Could you tell us a little about AWS Automotive?While we've helped automakers, partners and Tier 1 suppliers across the globe for several years, we've now consolidated our services into a robust offering called AWS for Automotive.  Launched in 2021, AWS for Automotive is a comprehensive offering of AWS services and AWS Partner Network (APN) solutions to digitally transform their business for autonomous and ADAS development, connected mobility, digital customer engagement, product design and engineering, manufacturing, and supply chain.AWS offers three main solutions for the automotive industry. Starting with the broadest and most advanced set of resources available to automotive manufacturers and suppliers, AWS Connected Vehicle Solutions enable teams to build serverless IoT applications that gather, process, analyse, and act on connected vehicle data, without having to manage any infrastructure.AWS has also developed a full suite of services to support ADAS and autonomous vehicle development and deployment. Original equipment manufacturers are leveraging AWS' expansive cloud services to process simulation workloads of over one million cores on Amazon Elastic Compute Cloud (Amazon EC2), as well as dev-ops for software-defined vehicle initiatives and automotive software development.Lastly, on the business-to-consumer side, AWS supports digital customer engagement workloads with solutions like ZeroLight, leveraging the world's broadest set of virtual GPU instances on the Amazon Elastic Compute Cloud (Amazon EC2). Thanks to this innovation, the car-buying experience can be enhanced and personalised, with customers now able to craft tailor-made designs in online configurators, creating life-like renderings with endless model features and colour combinations.What are the general architecture pattern trends for the automotive industry?True to their engineering heritage, automakers are embracing cloud computing, storage, and supplementary technologies to enable data-driven decision making and machine learning (ML) and analytics platforms to frame and fuel their transformation strategies. However, building the tools for transformation requires having your data house in order - which inevitably means migrating data from multiple, often disparate legacy IT systems and databases to a centralised repository, or \"data lake,\" which can store structured and unstructured data at any scale.Using data-heavy processes to make decisions is not a new idea in the automotive industry. Most often, however, the data exists in silos -- typically organised by functional areas such as marketing, engineering, and manufacturing. Each area in the company brings its own insights from the information assets collected and decisions are made based on a complex combination of the disparate data sets.One example of this in action is Volkswagen, which is using data lakes to pinpoint operational trends, improve forecasting, and streamline operations by identifying gaps in production and waste. BMW Group is also using data lakes to leverage information from across the company globally to make data-driven decisions that guide vehicle and technology development, manufacturing, sales, and service.We understand that you also recently rolled out your AWS IoT FleetWise service. Could you explain a little more about that service and how it's shaping up?Part of AWS for Automotive, AWS IoT Fleetwise provides automakers with purpose-built tools for autonomous development, connected mobility, product design, and digital customer engagement, across engineering, manufacturing, and supply chain. The service makes it easier and more cost-effective for automakers to collect, transfer, and transform vehicle data in the cloud in near-real time. The solution allows customers to build applications backed by advanced analytics and ML, to continually improve vehicle quality, safety, and autonomy.Today, cars have new classes of advanced sensors like cameras and radar that improve vehicle safety, but this, on top of the plethora of data already collected, generates exponential amounts of data. For instance, advanced vehicle sensors generate upwards of two terabytes of data hourly per vehicle, meaning the cost of transferring this to the cloud would be prohibitive. Collecting and transforming all of this vehicle data for analysis in the cloud can be extremely difficult and time-consuming. With AWS IoT Fleetwise, automakers can select the data they want to collect and transfer to the cloud in near-real time based on their specific use case, allowing them to diagnose issues with individual vehicle performance, spot fleet-wide issues before they become a concern, and use data to improve vehicle performance and autonomy. With no upfront costs or commitments, customers only pay for the services they use.How can AWS be utilised to help engineers spot trends in big data sets?One way that AWS helps here is through AWS IoT, which provides automakers with simple and secure connectivity and management of millions of vehicles and devices globally, tools to easily govern and track data access rights, and regular security updates. AWS is the only cloud platform that brings together data management and rich analytics in easy-to-use services designed specifically for IoT data.An example of how AWS helps the automotive industry to leverage big data sets for predictive analytics is our work with BMW Group. The company needed to more easily scale its data lake to support the growing demands of internal and external stakeholders. Because data wasn't easily accessible--spread across myriad, siloed environments--the group's innovation was slowed down by its own IT infrastructure and the long lead times required to support new initiatives. BMW Group decided to re-architect and move its on-premises data lake to the AWS Cloud. The company's Cloud Data Hub (CDH) processes now combines anonymised data from vehicle sensors and other sources across the enterprise to make it easily accessible for internal teams creating customer-facing and internal applications enabling it to move quickly to address the array of emerging use cases its customers demand. We also helped BMW Group integrate analytics and machine learning into the data lake to accelerate development.How can automotive companies, be they in mainstream or motorsport, integrate AWS capabilities into their existing operations?Due to the flexible and scalable nature of AWS solutions, automotive companies can easily integrate AWS technology into their existing platforms. For example, designed specifically for automakers, AWS's Connected Vehicle Solution allows automakers to develop a wide variety of connected vehicle applications, without having to manage the underlying infrastructure operations.The integration of AWS technologies into existing operations gives automotive companies great benefits, like the ability to transfer extensive amounts of data from real-world tests and utilise AWS Cloud computing power to run computer simulation and deep learning exercises at a rapid rate.When moving from simulation to assembly, automakers can apply AWS analytics and Amazon SageMaker to inform testing and optimize vehicle design for performance and efficiency. At Ferrari, for example, the car manufacturer is leveraging AWS to rapidly increase the pace of innovation across the entire business ecosystem, including road cars, GT Competitions, the Ferrari Challenge and the Scuderia Ferrari F1 team. Harnessing the power of the cloud, Ferrari will gain deeper more complex and detailed insights to create safer and more reliable vehicles.How quickly can engineers scale resources to meet complex demands using AWS tech?Key players in the automotive industry rely on AWS's compute, storage, and database capabilities, advanced analytics, and ML to achieve insights, design, and performance at pace.AWS makes it easy for engineers to rapidly scale resources to meet demand at all stages of the development process, with virtually unlimited capacity in the cloud. Customers can dynamically scale to meet engineer needs with AWS, without having to build and maintain their own data centres, making it possible to achieve results in record time. In the case of Nissan, Rescale and AWS HPC reduces time to market for computer aided engineering workloads such as aerodynamics development and crash simulation.Another example is F1, which selected AWS HPC for its Computational Fluid Dynamics (CFD), running thousands of compute cores on AWS to design their next-generation race car that will be used by teams this year. Thanks to the unmatched scalability of AWS, F1 was able to reduce the average time to run simulations by 80 percent - from 60 hours down to 12 hours and lower the running cost of these workloads by 30 percent, using AWS Graviton2-powered EC2 instances.Automakers are tapping into the virtually unlimited scale of AWS HPC resources to run thousands of simulations concurrently, gaining insights faster than ever when running simulations on-premise. This frees up resources, allowing engineers to create experimental designs and strategies to accelerate their speed of innovation.What's your outlook for AWS in the automotive industry, and what role will cloud play in future development efforts?Until the 2012 launch of the Tesla Model S, automakers could only make the majority of vehicle software updates in-house at dealerships. Now, vehicles can house over 100 discreet electronic control units running on more than 100 million lines of code.Tesla disrupted the industry by adopting built-in cellular and Wi-Fi connectivity to deliver software updates, as well as adding new capabilities over-the-air (OTA) without ever going to the service facility. OTA updates have become the norm on smartphones, tablets, and smart devices at home and those same customers now question why their non-Tesla cars cannot do the same.  Incremental updates to improve capability, performance, and security will become the new standard in the automotive industry. To manage the scale of OTA updates for hundreds of millions of vehicles will be incredibly challenging, with robust connectivity and a secure cloud platform essential components for success.As the world moves into the era of automated driving, the cloud will become even more essential. With the ability to run automotive software on Arm Neoverse designed AWS Graviton instances, customers can run thousands if not millions of automated tests before the software is deployed OTA to the vehicles, thereby improving overall software quality. With the pace of innovation at an all-time high, engineers must be able to develop and deploy updates anytime, anywhere. Cloud will allow these new developments to work in the real world, where AVs must coexist with human-driven vehicles and ever-changing weather conditions. Every AV will require regular updates to address performance as well as other software defects, and the amount of data automakers are required to process and analyse will increase exponentially. This future development is only possible with a move to cloud.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}