{"date": "2022-01-28 08:10:09+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        Caring about our customers means we care about data privacy.\n      </div>\n                <div>\n                  <p>\n          Amazon understands that your personal data is just that-personal. We know you care how your information is collected, used, and shared to deliver Amazon experiences. We take the privacy of your data seriously and work every day to earn your trust.\n        </p>\n                  <p>\n          We use customer data responsibly to improve your experiences with Amazon, from personalizing shopping in Amazon's online store to enabling Alexa to recognize different accents and dialects. We can show you items inspired by your previous Amazon purchases, whether that's a new fashion brand or a personalized playlist on Amazon music. Across all of Amazon's products and services, our principled approach to privacy begins with three key priorities: transparency, customer control, and security.\n        </p>\n                  <h4>\n          Transparency\n        </h4>\n                  <p>\n          We always strive to be clear about how Amazon is collecting, using, or sharing your personal data. That's why we not only build privacy directly into our products and services, but we also make it easy and intuitive for customers to learn more about how Amazon collects, uses, and shares their data. In fact, Amazon was one of the very first retailers to allow customers to view their browsing and purchase history from \"Your Account\" and manage which items could be used for product recommendations. You can also easily view all your shipping addresses, digital content purchases, and device information, and manage your payment methods directly from Your Account.\n        </p>\n                  <p>\n          We know many customers who enjoy our products and services want to understand more about how the technology behind them works. For customers of Alexa-enabled devices, the <span><a href=\"https://www.amazon.com/b/?node=19149155011&amp;tag=googhydr-20&amp;hvadid=352456913463&amp;hvpos=&amp;hvnetw=g&amp;hvrand=16384623707438967710&amp;hvpone=&amp;hvptwo=&amp;hvqmt=e&amp;hvdev=c&amp;hvdvcmdl=&amp;hvlocint=&amp;hvlocphy=9008181&amp;hvtargid=kwd-568076830233&amp;ref=pd_sl_9g20ttlk7a_e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alexa Privacy Hub</a></span>is a globally available resource that provides information about how Alexa and Echo devices work. It gives customers an easy way to access their most important Alexa privacy settings in one location. Customers can learn more about privacy and the Alexa experience by asking Alexa questions like \"Alexa, what's a wake word?\" or \"Alexa, what are my privacy settings?\" We also regularly send customer emails highlighting important privacy information and new tools and features-just one more way we're creating a transparent Alexa experience. <span><a href=\"https://ring.com/privacy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ring</a></span>, <span><a href=\"https://www.amazon.com/gp/help/customer/display.html?ie=UTF8&amp;nodeId=GQFYXZHZB2H629WN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Fire TV, and Kindle</a></span>privacy pages provide additional details on how we prioritize customer privacy with those devices.\n        </p>\n                  <p>\n          Our <span><a href=\"https://www.amazon.com/gp/help/customer/display.html?nodeId=GX7NJQ4ZB8MHFRNJ\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Notice</a></span>describes in simple language how Amazon and its affiliates collect, use, and share customers' personal data through Amazon websites, devices, products, and services, as well as through online and physical stores. You can also request a copy of the data that Amazon collects across our various products and services by <span><a href=\"https://www.amazon.com/gp/privacycentral/dsar/preview.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">submitting a request</a></span>. (Some Amazon subsidiaries, like <span><a href=\"https://ring.com/users/sign_in?return=account&amp;path=/account/data-requests\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ring</a></span>, have their own data request pages.)\n        </p>\n                  <h4>\n          Customer control\n        </h4>\n                  <p>\n          In addition to transparency, we know that customers want a choice in how their personal data is used. That's why we make it easy for you to choose the privacy options that make the most sense for you and your family.\n        </p>\n                  <p>\n          For example, by default, Alexa-enabled devices are designed to detect only your chosen wake word (e.g., Alexa, Ziggy, Amazon, Computer, or Echo). The device detects the wake word by identifying acoustic patterns that match the wake word, and only then does the device begin streaming audio to Amazon's secure cloud. When a customer activates the \"microphone off\" button on top of every Echo device (indicated by the red illuminated LED light), the microphone cannot receive power and cannot collect voice data. Most Echo Show devices also include a built-in physical camera shutter.\n        </p>\n                  <p>\n          You can also visit the <span><a href=\"https://www.amazon.com/alexa-privacy/apd/home\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alexa Privacy Settings</a></span>to review and delete your voice history, set how long voice recordings should be stored, and decide if the recordings can be used to develop new features or manually reviewed to improve the service. To delete your voice recordings, you can also simply ask, \"Alexa, delete what I just said\" or \"Alexa, delete everything I said today.\" Similarly, <span><a href=\"https://support.ring.com/hc/en-us/articles/360038142272-Ring-Control-Center-Information\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ring's Control Center</a></span>allows customers to control important privacy features and settings, including who's able to see and access their videos and personal information, all from one easy-to-use dashboard.\n        </p>\n                  <p>\n          Amazon physical retail technologies, like Just Walk Out technology and Amazon Dash Carts, offer customers the option for a checkout-free shopping experience. Amazon One is a quick, reliable, and secure option for customers to identify themselves, enter a store or venue, or authorize a payment transaction with a scan of their palm<span>.</span> These technologies improve the in-store shopping experience by saving time and removing friction from shopping trips, and they have been designed from the ground up following Amazon's privacy and security policies to keep customers' data safe. You always have the option to check out in a more traditional manner at Amazon's physical stores with cash, with the help of a store employee, or in some stores with a traditional point-of-sale system.\n        </p>\n                  <p>\n          Amazon customers also have control over the types of ads they see. Amazon's advertising services are designed to protect user privacy, and we only use information that does not directly identify you to serve ads for products and services we think may be of interest. You always have a choice in whether you receive interest-based advertisements, and you can adjust your preferences by visiting our <span><a href=\"https://www.amazon.com/adprefs\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Advertising Preferences</a></span>page. If you opt out, you may still see ads, but they won't be based on your interests.\n        </p>\n                  <h4>\n          Security\n        </h4>\n                  <p>\n          And finally, keeping your data private requires a focus on data security. Amazon designs all of our products, services, and systems with privacy and security in mind, and we employ thousands of professionals whose sole mission is to ensure the integrity and security of customer data. We maintain physical, electronic, and procedural safeguards in connection with the collection, sharing, and storage of customer data, and our devices offer security features that protect against unauthorized access and loss of data. We also use proven encryption protocols and software to protect the security of your personal data during transmission.\n        </p>\n                  <p>\n          For example, Ring offers the choice for end-to-end encryption of customer videos on eligible devices. This advanced encryption option allows only a user's enrolled mobile device to decrypt videos. Amazon devices also regularly receive security updates with the latest protections against possible threats and vulnerabilities. In many cases, customers don't have to do anything to update their devices-it happens automatically when the devices are connected. These security measures help to ensure that your devices and your data stay protected against bad actors.\n        </p>\n                  <p>\n          Amazon products and services also benefit from the underlying privacy and security capabilities of Amazon Web Services (AWS), one of the most secure cloud computing environments available today. Our core infrastructure is designed to satisfy the security requirements for military, global banks, and other high-sensitivity organizations, and it includes sophisticated technical and physical measures to prevent unauthorized access. Amazon also has a world-class team of security experts monitoring our infrastructure 24/7 to protect our customers. (Learn more about <span><a href=\"https://aws.amazon.com/compliance/data-privacy-faq/?\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS and privacy</a></span>.)\n        </p>\n                  <p>\n          In addition to our own internal security processes and procedures, we also work to educate customers on how they can help keep their account information private with simple steps, such as creating strong, unique passwords and using <span><a href=\"https://www.amazon.com/gp/help/customer/display.html?nodeId=G9MX9LXNWXFKMJYU\" data-type=\"url\" class=\"tr-link\" translate=\"no\">multi-factor authentication</a></span>.\n        </p>\n                  <div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/news/devices/this-amazon-devices-engineer-is-leading-customer-privacy-efforts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">This Amazon Devices engineer is leading customer privacy efforts</a>\n                      </span>\n                    </div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/news/devices/this-amazon-devices-engineer-is-leading-customer-privacy-efforts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                      </span>\n                    </div>\n                  </div>\n                  <p>\n          Caring about our customers means caring about the privacy of their data. We appreciate that customers who use our products and services every day trust that we will collect, use, and store their personal data carefully and responsibly. We will continue to build privacy and security features into all of our products and services, and we look forward to sharing more about the people, processes, and technologies that enable us to earn and maintain the trust of customers around the world.\n        </p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/devices\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Devices</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/privacy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/customers\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Customers</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/how-amazon-works/amazon-is-earning-and-maintaining-customer-trust-through-privacy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>28 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>28 January 2022 08:10:09 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}