{"date": "2022-02-18 14:40:44.616000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3162.01, "close": 3052.03}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z;NEXCF-0\")\n- Join Nextech AR For a Proactive Livestream Event on\n- February 23, 2022\n\n    Nextech AR Solutions Corp. (\"Nextech\" or the \"Company\"), a Metaverse\nCompany and leading provider of augmented reality (\"AR\") experience\ntechnologies and services is pleased to invite you to a Proactive Live\nevent hosted by Steve Darling, featuring:\n\n//st\n\n  * Evan Gappelberg, CEO,\n  * Adrian Hinrichsen, SVP Business Development &amp; Global Head of Digital\n    Sales\n  * Brynne Kennedy, Director of UX/UI Product Design\n\n//et\n\n    This special Livestream event will showcase Nextech's Metaverse Suite\nand update investors on the 3D modeling industry.\n\n    Livestream Details\n\n    Date: Wednesday, Feb 23, 2022\n\n    Time: 1:00 PM Eastern Time (US and Canada)\n\n    Topic: Nextech's Metaverse Suite, the state of the 3D modeling industry\nand business opportunities, including ARitize 3D, ARitize CAD, ARitize\nSwirl as well as all of the latest 3D model, hologram and spatial mapping\napps.\n\n    Register here:\n<a href=\"https://zoom.us/webinar/register/WN_bcYw8hPjRJODQJ44T_Z-LQ\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://zoom.us/webinar/register/WN_bcYw8hPjRJODQJ44T_Z-LQ</a>\n\n    After registering, you will receive a confirmation email containing\ninformation about joining the livestream.\n\n    ARitize Metaverse SuiteFormerly \"ARitize Metaverse Studio\", and\noriginally announced in November 2021 ARitize Metaverse Suite is a SaaS\nMetaverse Studio SDK (Software Development Kit). It uses robust mapping\ntechnologies for location persistent AR experiences, enabling its customers\nto create their own metaverses. Nextech's customers can access all their 3D\nassets, compose AR experiences, and publish them into the Metaverse in any\nformat. In ARitize Metaverse Suite, customers can manage 3D/AR content and\npoint cloud maps, which are used for localization. It also gives users the\nability to update these point cloud maps and 3D/AR content in their\napplication in real-time. ARitize Metaverse Suite will assist in managing\nand creating mini-metaverse environments such as shopping malls, airports,\nmuseums, university campuses, and more.\n\n    ARitize 3DNextech's patent-pending technology that leverages Artificial\nIntelligence (AI) to enhance the building of quality 3D models from simple\n2D photos at scale for ecommerce websites. ARitize 3D is a disruptive\nend-to-end solution for the Augmented Reality (\"AR\") industry. Through a\nsimple JavaScript tag integration, product photos are automatically\nonboarded, and 3D models are created for each product and then hosted on\nARitize 3D's cloud. Learn More\n\n    ARitize CADNextech's patent pending technology, enabling the conversion\nof CAD files into 3D AR models at scale. CAD is a function of product\nengineering. Industrial designers, working for product manufacturers, use\nCAD software (e.g., AutoCAD, SolidWorks, etc.) to design many of the\nproducts in the modern world. Learn More\n\n    ARitize SwirlAn ARitize Swirl is a swirling (rotating) 3D asset on the\nheader or page of an ecommerce website. In a few simple steps, any customer\ncan create a fully interactive ARitize Swirl 3D/AR banner using their\nexisting 3D models, and embed them into their ecommerce website to create\n6X higher purchase intent, increase conversions and click-through rates.\nThe ARitize Swirl self-serve creator tool is an upsell opportunity for\nexisting ARitize 3D clients, and allows for the creation and management of\n3D and AR banners for their ecommerce websites, highlighting the products\nthat clients wish to promote. All of the client's ARitize 3D models are\naccessible through this platform. Existing 3D models, generated through\nARitize 3D, are made available to be searched by title or SKU. Custom\ndimensions can be entered, or set dimensions can be selected from a list of\npresets. Unique backgrounds can be uploaded by users, or premade template\nbackgrounds can be selected from an image library. ARitize Swirls can be\npreviewed and reviewed before publishing, and embed codes are automatically\ngenerated once an ARitize Swirl is published, and can be copied and pasted\nonto the user's ecommerce site. ??Banners can also be managed, edited, and\narchived on the self-serve platform, giving users ultimately flexibility\nwhen it comes to their Swirls.\n\n    View a video showcasing ARitize Swirl - click here\n\n    To learn more, please follow us on Twitter, YouTube, Instagram,\nLinkedIn, and Facebook, or visit our website:https://www.Nextechar.com.\n\n    On behalf of the Board of Nextech AR Solutions Corp.Evan GappelbergCEO\nand Directorinfo@nextechar.com 866-274-8493\n\n    About Nextech ARNextech AR Solutions is a Metaverse company that\ndevelops and operates augmented reality (\"AR\") platforms, transporting\nthree-dimensional (\"3D\") product visualizations, human holograms and 360\nportals to its audiences altering e-commerce, digital advertising, hybrid\nvirtual events (events held in a digital format blended with in-person\nattendance) and learning and training experiences.\n\n    Nextech focuses on developing AR solutions for the Metaverse, however\nmost of the Company's revenues are derived from three e-Commerce platforms:\nvacuumcleanermarket.com (\"VCM\"), infinitepetlife.com (\"IPL\") and\nTrulyfesupplements.com (\"TruLyfe\"). VCM and product sales of residential\nvacuums, supplies and parts, and small home appliances sold on Amazon.\n\n    Forward-looking StatementsThe CSE and the NEO have not reviewed and do\nnot accept responsibility for the adequacy or accuracy of this release.\n\n    Certain information contained herein may constitute \"forward-looking\ninformation\" under Canadian securities legislation. Generally,\nforward-looking information can be identified by the use of forward-looking\nterminology such as, \"will be\" or variations of such words and phrases or\nstatements that certain actions, events or results \"will\" occur.\nForward-looking statements regarding the completion of the transaction are\nsubject to known and unknown risks, uncertainties and other factors. There\ncan be no assurance that such statements will prove to be accurate, as\nfuture events could differ materially from those anticipated in such\nstatements. Accordingly, readers should not place undue reliance on\nforward-looking statements and forward-looking information. Nextech will\nnot update any forward-looking statements or forward-looking information\nthat are incorporated by reference herein, except as required by applicable\nsecurities laws.\n\n     Contact Information:\n\n     Investor Relations\n     Lindsay Betts\n     investor.relations@Nextechar.com\n     866-ARITIZE (274-8493) Ext 7201\n\n                            ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204800193.MNPRE2204800729-06330720220218</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}