{"date": "2022-02-07 06:53:55.643000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>MUMBAI</p></div><div class=\"tr-npp-lead\"><p>MUMBAI, Feb. 7 -- The National Company Law Appellate Tribunal (NCLAT) on 14 February will hear Amazon's plea seeking a stay on the Competition Commission of India's (CCI) 17 December order which had suspended the 2019 approval for Amazon's deal to acquire a 49% stake in Future Coupons Pvt Ltd (FCPL), promoter of Future Retail. It had also slapped a penalty of Rs.202 crore on the US e-commerce major.</p><p>Justice M.Venugopal said due to constraint of time, the tribunal will take up the matter on 14 February now.</p></div><div class=\"tr-npp-body\"><p>On 9 January, Amazon approached the NCLAT, challenging the CCI order.</p><p>The anti-trust watchdog's order had said that Amazon tried to \"suppress and misrepresent\" the facts of the deal. It had, however, granted time to Amazon to seek fresh approval for the deal.</p><p>Earlier, the tribunal led by Justice M. Venugopal and V.P. Singh had asked CCI to file replies within 10 days of hearing Amazon. CCI counsel today informed that it has filed a reply in the matter.</p><p>Future and Amazon have been locked in a bitter legal tussle after the US e-commerce giant dragged Future Group to arbitration at the Singapore International Arbitration Centre in October 2020, arguing that Future Retail had violated their contract by entering into a deal for sale of its assets to billionaire Mukesh Ambani's Reliance Retail on a slump sale basis for Rs.24,713 crore. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}