{"date": "2022-01-04 13:41:06+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MASONITE INTERNATIONAL CORP (\"DOOR-N\")\n- Unveils M-Pwr(TM) Smart Doors\n\n     Masonite International Corporation, a leading global designer,\nmanufacturer, marketer and distributor of interior and exterior doors,\nrevealed Masonite M-PwrTM Smart Doors, the first residential exterior doors\nto integrate power, lights, a video doorbell and a smart lock into the door\nsystem.\n\n          \"The debut of Masonite M-PwrTM Smart Doors is a milestone event\nin that we believe it will fundamentally change homeowners' expectations of\ntheir exterior doors,\" said Howard Heckes, President and CEO. \"The\nrevolutionary technology of these doors provides families with the peace of\nmind that they are always connected and always protected.\"\n\n     Masonite M-PwrTM Smart Doors employ patent-pending, Underwriters\nLaboratories (UL) certified technology to connect residential exterior\ndoors to a home's electrical system and wireless internet network. To\nensure that the doors are \"always on\" in the event of a power outage, an\nemergency backup battery can sustain system power up to 24 hours when fully\ncharged. The Masonite M-PwrTM smartphone app enables homeowners to remotely\nprogram and control motion-activated LED welcome lighting as well as\nconfirm whether the door is open or closed at any time.\n\n     As a result of previously announced collaborations with Ring and Yale\nHome, Masonite has integrated best-in-class technology into the first\nedition of M-PwrTM Smart Doors. The fully integrated Ring Video Doorbells\nand Yale smart locks do not require individual device batteries.\n\n     Masonite M-PwrTM Smart Doors are currently offered in new home\nconstruction by Barringer Homes in the Plaza Midwood neighborhood of\nCharlotte, North Carolina, with additional builder partner announcements\nexpected this year.\n\n     \"We're proud to work with Barringer Homes to bring families a level of\nconnected convenience they've never previously experienced with their\ndoors,\" said Cory Sorice, Chief Innovation Officer, Masonite. \"Masonite\nM-Pwr Smart Doors will enhance the lives of homeowners in a very tangible\nway. They are proof positive of our vision of Doors That Do More.\"\n\n     \"As a high-end homebuilder, we always look for the latest technology\nthat will add value for our customers,\" said Adam Danneman, President,\nBarringer Homes. \"Masonite M-Pwr Smart Doors integrate all of the features\nhomeowners need to stay connected to their homes while offering the\naesthetic qualities they want to complement any style.\"\n\n     The intelligent design of Masonite M-PwrTM Smart Doors is incorporated\ninto premium fiberglass doors that are available in a variety of styles,\ncolors and finishes, including multiple glass options.\n\n     For more information, or to submit a collaboration request, visit\nMPwrSmartDoors.com.\n\n     ABOUT MASONITE\n\n     Masonite International Corporation is a leading global designer,\nmanufacturer, marketer and distributor of interior and exterior doors for\nthe new construction and repair, renovation and remodeling sectors of the\nresidential and non-residential building construction markets. Since 1925,\nMasonite has provided its customers with innovative products and superior\nservice at compelling values. Masonite currently serves approximately 7,600\ncustomers in 60 countries. Additional information about Masonite can be\nfound at masonite.com.\n\n     ABOUT RING\n\n     Since its founding in 2013, Ring has been on a mission to make\nneighborhoods safer, together for everyone. From the first-ever Video\nDoorbell, to the award-winning DIY Ring Alarm system, Ring's smart home\nsecurity product line, as well as the Neighbors app, offer users affordable\nwhole-home and neighborhood security. At Ring, we are committed to making\nsecurity accessible and convenient for everyone--while working hard to\nbring communities together. Ring is an Amazon company. For more\ninformation, visit www.ring.com. With Ring, you're always home.\n\n     ABOUT YALE\n\n     At 180 years strong, Yale is a leading security brand that protects\nthe people, places and things we love most. It secures millions of homes\nand businesses worldwide with its innovative mechanical locks, safes and\nsmart locks for front doors, interior doors, cabinets, package deliveries\nand more. Yale is part of the ASSA ABLOY Group, the global leader in access\nsolutions. Every day, we help billions of people experience a more open\nworld. For more information, visit US.yalehome.com.\n\n     ABOUT BARRINGER HOMES\n\n     Founded in 2018, Barringer Homes is a luxury home builder based in\nCharlotte, NC. For more information, visit barringer-homes.com\n\n     Media Contacts:\n     Masonite:\n     Lori Conrad\n     813.739.1828\n\n     Ring:\n\n     Yale:\n\n     Barringer Homes:\n     Andi Zage\n\n     Investor Contact:\n\n     Richard Leland\n     VP, FINANCE AND TREASURER, MASONITE\n     813.739.1808\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200300166.MNPRE2200301085-05394820220104</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}