{"date": "2021-11-09 20:00:00.249000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\n<b>Amazon Expands Investment with Four New Operations Sites in Alabama</b>\n</p><p class=\"bwalignc\">\n<span>Announces two new fulfillment centers in Huntsville, a Receive Center in Montgomery, and a delivery station in Birmingham</span>\n</p><p class=\"bwalignc\">\n<span>Amazon has created more than 9,000 jobs in Alabama, with an additional 500 full-time roles expected by the end of 2021</span>\n</p><p>\nAmazon.com, Inc. (Nasdaq:AMZN) today announced plans for three new operations facilities in Alabama and celebrates the launch of a new fulfillment center that will support customers across the state.\n</p><p>\n“We are proud to continue our investment in Alabama with thousands of good jobs and new, state-of-the-art operations facilities,” said Brian Huseman, vice president of public policy at Amazon. “Our success would not be possible without our great employees and we are grateful for the enthusiasm and strong state and local support we have received since first launching operations in 2020. We look forward to continued investment as we innovate and grow to better serve our customers across the state.”\n</p><p>\n“Amazon’s decision to simultaneously launch and announce these projects in Alabama shows the high level of confidence the company has in the abilities of our hard-working citizens, who have shown time and time again that they can get the job done,” Governor Kay Ivey said. “Companies from around the world have discovered that Alabama offers them all the ingredients of success, and this is another prime example.”\n</p><p>\nAmazon has created more than 9,000 direct jobs statewide and invested more than $1 billion in Alabama in infrastructure and compensation to employees. The company plans to add more than 500 full-time jobs to its operation by the end of 2021 and have created more than 1,800 seasonal positions across the state in preparation for the holiday season. The fulfillment and transportation jobs support communities of all sizes, pay a minimum starting wage of $15 per hour-which is more than double the federal and state minimum wage—and provide comprehensive health benefits on the first day of employment, paid time off, up to 20 weeks of fully paid parental leave, and more for employees and their families.\n</p><p>\n<b>New Amazon Sites Coming to Alabama</b>\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>Birmingham Delivery Station: </b>In November, Amazon plans to expand the delivery services in greater Birmingham. This new station will employ approximately 150 people and create indirect job opportunities for hundreds of people through the empowerment of the Delivery Service Partner program.\n</li>\n<li>\n<b>Huntsville XL Fulfillment Cente</b>r: In 2022, Amazon will open its third fulfillment center. This “XL” Non-Sortable facility is designed to receive, store, and package heavy or bulky items like home appliances. The 1 million-square-foot facility in Limestone County will provide more than 250 full-time jobs and will utilize innovative technologies and energy-efficient, zero-emission power industrialized truck (PIT) equipment.\n</li>\n<li>\n<b>Montgomery Receive Center: </b>In 2022, Amazon will open an Inbound Cross Dock facility that will receive and consolidate items from vendors and facilitate shipment to fulfillment centers. This 650,000 square foot facility will provide more than 500 full-time jobs.\n</li>\n</ul><p>\n<b>Alabama Site Now Officially Launched:</b>\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>Huntsville Non-Sortable Fulfillment Center</b>: Amazon’s new Huntsville Non-Sortable Fulfillment Center is now open for business. This is the first of two fulfillment centers in the area. This nearly 1 million square foot facility has created hundreds of full-time jobs and allows Amazon employees to pick, pack, and ship larger items to customers, such as bulk paper goods, outdoor equipment, or rugs. Additionally, this facility utilizes innovative technologies and energy-efficient, zero-emission power industrialized truck (PIT) equipment.\n</li>\n</ul><p>\nPositions are available at all new operations facilities. Interested candidates can visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.hiring.amazon.com&amp;esheet=52526814&amp;newsitemid=20211109006349&amp;lan=en-US&amp;anchor=www.hiring.amazon.com&amp;index=1&amp;md5=67b4a90bc3536e8086017ef447df496c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.hiring.amazon.com</a>, to learn more.\n</p><p>\nFor fulfillment center and delivery station images and b-roll, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fpress.aboutamazon.com%2Fimages-videos&amp;esheet=52526814&amp;newsitemid=20211109006349&amp;lan=en-US&amp;anchor=https%3A%2F%2Fpress.aboutamazon.com%2Fimages-videos&amp;index=2&amp;md5=6483aa115399501f82276de8e8b4e906\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://press.aboutamazon.com/images-videos</a>.\n</p><p>\n<b>Additional Quotes – Huntsville:</b>\n</p><p>\n<b>Mayor Tommy Battle, Huntsville</b>\n</p><p>\n<span>\"The growth of Huntsville and North Alabama is a natural fit for Amazon’s fulfillment centers as the company expands its physical distribution network. We welcome the new job opportunities and service options Amazon will bring to the region.\"</span>\n</p><p>\n<b>Chip Cherry, Chamber President &amp; CEO:</b>\n</p><p>\n<span>\"We are pleased to welcome Amazon to an area of the city that is really growing. This is one in a series of recent developments, bringing exciting new opportunities for people in our region for years to come.\"</span>\n</p><p>\n<b>Chairman Collin Daly, Limestone County Commission</b>\n</p><p>\n<span>\"This is the second exciting announcement in Limestone County from Amazon. This investment in our county and the 250 jobs that will be created by this project, will greatly impact our future for many years. We would like to thank Amazon for believing in us, selecting our county for their second fulfilment center, and we look forward to being a part of their success in the future.\"</span>\n</p><p>\n<b>John Meredith, Huntsville City Council Representative, District 5</b>\n</p><p>\n<span>“The Amazon facility is proving to be a fantastic addition to the District 5 Huntsville/Limestone County family of businesses. This non-sort fulfillment center will bring over 500 much needed, well paying, full time jobs to area citizens,” said John Meredith. “Combined with a second fulfillment center responsible for large bulky items, Amazon expects to provide in excess of 750 new jobs operating out of a 2 million square feet of state-of-the-art warehouse space by this time next year.”</span>\n</p><p>\n<b>Additional Quotes – Montgomery</b>\n</p><p>\n<b>County Commission Chairman Elton Dean</b>\n</p><p>\n<span>“We are proud to welcome Amazon to Montgomery County and into this growing community of diverse industries,” said County Commission Chairman Elton Dean. “This facility will provide excellent opportunities for our citizens and pave the way for even more growth and investment in our area.”</span>\n</p><p>\n<b>Mayor Steven L. Reed</b>\n</p><p>\n<span>“Amazon’s major investment shows that Montgomery is on the map and an essential part of logistics solutions for major brands and industries,” said Montgomery Mayor Steven L. Reed. “We’re eager to grow this partnership on behalf of the Montgomerians who will benefit from the careers that this new facility will bring.”</span>\n</p><p>\n<b>Additional Quotes – Birmingham</b>\n</p><p>\n<b>Chief Executive Officer, Birmingham Business Alliance, Ron Kitchens</b>\n</p><p>\n<span>“We are incredibly proud and grateful for the continuing investment that Amazon had made in the Birmingham region, the 150 new jobs coming online will ensure families have well-paying jobs with access to educational benefits that are truly life changing.”</span>\n</p><p>\n<b>About Amazon: </b>Amazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2F&amp;esheet=52526814&amp;newsitemid=20211109006349&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.aboutamazon.com%2F&amp;index=3&amp;md5=04fbb081fe29e5b8e93d222fbf4659d5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.aboutamazon.com/</a> and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211109006349r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTA5MDA2MzQ5cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=5679e4571adac05347f3e61f7265d71445fb13dc76544e4b8ca79c775cf8b91b3768959de7b794fbde69ee762b819b151906d94651750637b12ea7a408fc08d9\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211109006349/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211109006349/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52526814&amp;newsitemid=20211109006349&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=4&amp;md5=4c2e60af904f57ea1fb8ae9ed97ee177\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON.COM</p></div>"}