{"date": "2021-10-01 09:03:33.654000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3639.0, "close": 3516.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 7288NAVEVA Group PLC01 October 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>AVEVA Group plc</p>\n<p>Director Appointment</p>\n<p>\n<span>AVEVA Group plc is pleased to announce the appointment of Dr Ayesha Khanna as an independent Non-Executive Director, effective 28 October 2021.</span>\n</p>\n<p>Dr Khanna is Co-Founder and CEO of ADDO AI, an artificial intelligence (AI) solutions firm and incubator. She has been a strategic advisor on artificial intelligence and smart cities to leading corporations and governments. Ayesha also serves on the Board of Infocomm Media Development Authority, the Singapore government's agency that develops and regulates its world class technology sector. She is the co-author of Hybrid Reality: Thriving in the Emerging Human-Technology Civilization. ADDO AI was featured in Forbes magazine as one of four leading artificial intelligence companies in Asia in 2017, and Ayesha was named one of Southeast Asia's ground-breaking female entrepreneurs in 2018 by Forbes. She is also founder of 21st Century Girls, a charity that teaches girls coding and artificial intelligence.</p>\n<p>\n<span>Prior to founding ADDO AI, Ayesha spent more than a decade on Wall Street developing large scale trading, risk management and data analytics systems.</span>\n</p>\n<p>\n<span>Commenting on the appointment, Chairman Philip Aiken said: \"We are delighted to welcome Ayesha to the Board. Ayesha brings a significant depth of technology and industry knowledge, which will be of great value to AVEVA as it continues to lead the digital transformation of the industrial world.\"</span>\n</p>\n<p>\n<span>There are no details to disclose in respect of Listing Rule paragraphs</span>\n<span>9.6.13 (2) to (6).</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>Enquiries:</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>AVEVA Group plc</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>Matt Springett, Head of Investor Relations</p>\n</td>\n<td>\n<p>+44 (0)7789 818 684</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>FTI Consulting LLP</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>Edward Bridges/Dwight Burden</p>\n</td>\n<td>\n<p>+44 (0) 20 3727 1000</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>BOAFSSSAFEFSEIS</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}