{"date": "2021-12-03 19:37:17.826000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3437.36, "close": 3427.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon Web Services (AWS) announced that American International Group has chosen AWS as its preferred public cloud provider.</p><p>The global insurance provider chose AWS for its proven reliability, security, and comprehensive set of cloud capabilities. AIG is undergoing a large-scale digital transformation with AWS as part of its \"AIG 200\" strategy that aims to improve core business processes, modernize technology infrastructure and services, and create a culture of innovation. The enterprise-wide initiative will use AWS technologies to deliver underwriting excellence, product portfolio optimization, and enhanced customer experiences for AIG's 90 million policyholders worldwide.\"AWS provides us with the deep portfolio of services we need to streamline our global operations and continuously innovate for our customers,\" said Peter Zaffino, President and Chief Executive Officer, AIG. \"AIG's work with AWS is integral to our business transformation that will help us become a more nimble, efficient, and unified company. Moving the majority of our workloads off legacy platforms to the cloud enables us to seize new market opportunities quickly, enhance security, and become even more responsive to our customers' needs.\"AIG began its digital transformation journey with AWS in 2017. AIG's adoption of AWS's broad portfolio of cloud services will accelerate in 2021 and 2022 with the expanded relationship and AIG's engagement of AWS Professional Services.\"AIG is a forward-thinking and client-centric business, and AWS is excited to help them innovate with the next 100 years in mind,\" said Frank Fallon, Vice President of Financial Services at Amazon Web Services, Inc. \"AIG has embarked on a transformation and growth strategy using AWS to help the company deliver better service for its customers, create long-term value for its shareholders, and quickly innovate secure, compliant new services. Leveraging AWS's global infrastructure, unparalleled portfolio of cloud services, and financial services expertise, leading insurance companies like AIG can become more agile and efficient to deliver industry-leading products and customer experiences.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}