{"date": "2021-12-08 14:30:04.331000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Amazon grants more than $5 million to support new real estate developer training program and fund early-stage development projects</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">SEATTLE, Dec. 8, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">SEATTLE</span>, <span class=\"xn-chron\">Dec. 8, 2021</span> /PRNewswire/ -- <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3383470-1&amp;h=719232292&amp;u=https%3A%2F%2Fwww.lisc.org%2F&amp;a=The+Local+Initiatives+Support+Corporation\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Local Initiatives Support Corporation</a> (LISC), a US nonprofit CDFI that supports community development initiatives across the country, has teamed up with Amazon to help build the next generation of real estate developers of color in the Puget Sound region and expand affordable housing in the communities they serve.</p>\n<p><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3383470-1&amp;h=3090194573&amp;u=https%3A%2F%2Fwww.lisc.org%2Fpuget-sound%2F&amp;a=LISC+Puget+Sound\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LISC Puget Sound</a>, the national nonprofit's local arm, today launched the Housing Equity Accelerator to provide professional training, mentorship, and capacity-building for real estate developers of color, as well as pre-development funding for the affordable housing projects they have planned. Upfront costs can include expensive survey and site planning fees, permitting, legal expenses, and feasibility studies. </p>\n<p>The program is funded with a more than <span class=\"xn-money\">$5 million</span> grant from the <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3383470-1&amp;h=2928874527&amp;u=https%3A%2F%2Fwww.aboutamazon.com%2Fimpact%2Fcommunity%2Fhousing-equity&amp;a=Amazon+Housing+Equity+Fund\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Housing Equity Fund</a>, a more than <span class=\"xn-money\">$2 billion</span> commitment to create and preserve 20,000 affordable homes for individuals and families earning moderate- to low- incomes in <span class=\"xn-location\">Washington state's</span> Puget Sound region; the <span class=\"xn-location\">Arlington, Virginia</span> region; and <span class=\"xn-location\">Nashville, Tennessee</span>. The new initiative also dovetails with LISC's <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3383470-1&amp;h=1795876493&amp;u=https%3A%2F%2Fwww.lisc.org%2Fproject-10x%2F&amp;a=Project+10X\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Project 10X</a>, which is investing <span class=\"xn-money\">$1 billion</span> to bridge racial gaps in health, wealth and opportunity throughout the country.</p>\n<p>\"Amazon understands that the affordable housing issue is not just about buildings, it's about people,\" said <span class=\"xn-person\">Catherine Buell</span>, director of the Amazon Housing Equity Fund. \"That's why it is so important that we support emerging real estate developers of color who can offer different perspectives to community building and help come up with lasting, impactful solutions.\"</p>\n<p>\"Historical barriers have made it very difficult for Black and other developers of color to get a foothold in the development business,\" said <span class=\"xn-person\">Brian Surratt</span>, executive director of LISC Puget Sound, who noted that only 5 percent of developers nationwide are Black, due largely to lack of access to capital.</p>\n<p>Surratt also pointed to the unique challenges of affordable housing development, which is highly regulated and requires technical knowledge well beyond traditional commercial real estate operations. Affordable housing finance programs often advantage large, experienced, and highly networked developers, Surratt explained, making it difficult for emerging developers to compete.</p>\n<p>\"With Amazon's support, our hope is to bridge that knowledge gap and build a bench of developers of color who are trusted in their communities and who are likely to hire contractors and other workers of color, some of whom may live in those same neighborhoods,\" he explained. \"It is part of a wealth-building strategy for individuals and communities, and it directly addresses the economic implications of our region's shortfall in affordable housing.\"</p>\n<p>\"This program shows how companies like Amazon, mission-driven lenders, and entrepreneurs can team up to help drive community-led solutions for affordable housing,\" said <span class=\"xn-location\">Seattle</span> Mayor-elect <span class=\"xn-person\">Bruce Harrell</span>. \"Supporting emerging real estate developers of color helps to create more equitable and inclusive communities because these developers can engage with and listen to the community's concerns, build meaningful partnerships, and help to generate greater access to opportunities for residents.\"  </p>\n<p>LISC will select eligible participants to join the two-year, part-time program which is open and free of charge to eligible developers of color with a demonstrated commitment to affordable and workforce housing.  The participants, or \"fellows,\" will have access to a broad network of established real estate professionals. They will participate in cohort training sessions on a range of topics, from project feasibility to joint venture partnerships, and have one-on-one sessions with mentors to tackle specific project barriers. </p>\n<p>\"Programs meant to redress the real estate industry's racial imbalance need to be carefully designed so that more of the critical early-stage investment winds up in the hands of developers of color,\" Surratt said. \"Amazon's investment is a new source of social and financial capital for these developers that centers them in the local real estate community.\"</p>\n<p>The program is part of a <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3383470-1&amp;h=752709370&amp;u=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fcommunity%2Famazon-launches-21m-program-for-real-estate-developers-of-color&amp;a=%2421+million+commitment+from+Amazon\"><span class=\"xn-money\">$21 million</span> commitment from Amazon</a> to pilot a professional training, mentorship, and capital funding program to help promote real estate developers of color. For more information on the Housing Equity Accelerator, eligibility requirements, and how to apply please visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3383470-1&amp;h=2124334434&amp;u=https%3A%2F%2Flisc.tfaforms.net%2F545&amp;a=this+link\" data-type=\"url\" class=\"tr-link\" translate=\"no\">this link</a>. </p>\n<p><b>About LISC<br/></b>LISC is one the country's largest community development organizations, helping forge vibrant, resilient communities across America. We work with residents and partners to close systemic gaps in health, wealth and opportunity and advance racial equity so that people and local economies can thrive. Since our founding in 1979, LISC has invested <span class=\"xn-money\">$24 billion</span> to create more than 436,320 affordable homes and apartments, and develop 74.4 million square feet of retail, community and educational space. For more, visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3383470-1&amp;h=746699280&amp;u=http%3A%2F%2Fwww.lisc.org%2F&amp;a=www.lisc.org\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.lisc.org</a>.</p>\n<p><b>About LISC Puget Sound<br/></b>LISC has been active in the state of <span class=\"xn-location\">Washington</span> for decades, including investing in more than 33,000 units of affordable housing. LISC's comprehensive community development efforts include support for Financial Opportunity Centers that offer job training and placement; community safety programs that help residents and local leaders address crime; capacity-building for local nonprofits to expand their service; and economic development strategies to catalyze opportunity—including relief grants for minority- and women-led small businesses impacted by the pandemic. LISC revived its on-site local presence in the summer of 2021, when it launched <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3383470-1&amp;h=3090194573&amp;u=https%3A%2F%2Fwww.lisc.org%2Fpuget-sound%2F&amp;a=LISC+Puget+Sound\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LISC Puget Sound</a>, with an urgent focus on bridging racial and socio-economic gaps that affect families and communities.</p>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=DC00847&amp;sd=2021-12-08\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1EQzAwODQ3JnNkPTIwMjEtMTItMDg=&amp;key=1ffd629c422d159a374ce984b199bfa5438f8196359529617551cd1f3d1e546db5f7484c4dbacdf3eea03fafa5dfe222bc5c820f0fe1931852895354c53516aa\"/></div></div> View original content:<a href=\"https://www.prnewswire.com/news-releases/lisc-teams-with-amazon-to-support-emerging-real-estate-developers-of-color-and-expand-affordable-housing-in-the-puget-sound-region-301440243.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/lisc-teams-with-amazon-to-support-emerging-real-estate-developers-of-color-and-expand-affordable-housing-in-the-puget-sound-region-301440243.html</a><p></p>\n<p>SOURCE  Local Initiatives Support Corporation (LISC)</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-LISC-Amazon</p></div>"}