{"date": "2021-11-01 22:11:30.088000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GAMESQUARE ESPORTS INC (\"GSQ-Z;GMSQF-0\")\n- Strong Sequential Revenue Growth in Q3 2021 and\n- Accelerated Sales Activity in Q4 2021\n\n   GameSquare Esports Inc. (\"GameSquare\", \"GameSquare Esports\" or the\n\"Company\"), an international gaming and esports company, today announced\nits results for the third quarter ended August 31, 2021 (all amounts in CDN\ndollars, unless otherwise indicated). The Company has scheduled a\nconference call to discuss its Q3 FY2021 financial results and provide a\nbusiness update on November 1, 2021, at 5:00pm ET (2:00pm PT). A complete\nset of Financial Statements and Management's Discussion &amp; Analysis for the\nthree and nine-months ended August 31, 2021 are accessible on SEDAR at\nwww.sedar.com under GameSquare's profile.\n\n   Q3 FY2021 Highlights\n\n   *  GameSquare reported revenue of $2,464,906 which included a full\nquarter of Code Red and GCN as well as two months contribution by\nComplexity Gaming, and one month contribution from Cut+Sew;\n   *  For the three months ended August 31, 2021, the Company's Teams\nsegment generated revenue of $254,066 in North America. The Company's\n\"Teams\" segment represents its esports teams which generate revenue through\nsponsorship, prizes, and player related revenue;\n   *  The Company's Agency services segment generated revenue of $2,210,840\n(Europe $1,438,472 and North America $772,368). The Company's Agency\nservices segment represents its esports agencies which generate revenue\nthrough: talent management, influencer promotional fees and consulting;\n   *  The Teams segment generated gross profit of $96,845, while the Agency\nservices segment generated gross profit of $590,192;\n   *  Ended the quarter with $13,079,212 of cash and working capital of\n$12,365,615;\n   *  Acquired 100% of NextGen Tech, LLC. (dba. as Complexity Gaming)\n(\"Complexity\"), a leading esports organization and one of only four esports\norganizations to have an exclusive partnership with Twitch;\n   *  Closed a private placement for US$7.0 million, which was subscribed\nto and filled by the Jerry Jones family and Goff Capital, the former\nmajority shareholders of Complexity;\n   *  Closed a bought deal financing of $8.5 million led by Canaccord\nGenuity, Eight Capital, Haywood Securities and Echelon Wealth Partners;\n   *  Completed the acquisition of Swingman LLC (dba. Cut+Sew and Zoned)\n(\"Cut+Sew/Zoned\"), a digital lifestyle marketing agency;\n   *  Appointed Paradigm Sports to GameSquare's advisory board.\n\n   Subsequent Events to Quarter End\n\n   *  TimTheTatman, one of gaming and esports' biggest personalities,\njoined Complexity Gaming;\n   *  GCN teamed up with Kraft Heinz brand Bagel Bites to launch the\n\"Unexpected Combinations\" relay race;\n   *  GCN partnered with Roc Nation Sports and Uplive to host Call of Duty\nTournament with top sports stars;\n   *  GameSquare submitted its application for an OTC QB listing.\nManagement expects its common shares to commence trading on the OTC QB\nbulletin board in the United States in the very near term;\n   *  The Company generated in excess of $3.5 million of revenue in Q4 as\nof October 28, 2021, in part as a result of progress in the integration of\nits acquisitions, the impact of signing TimTheTatman including merchandise\nsales, and sales initiatives undertaken following the appointment of Sean\nHorvath as Chief Revenue Officer for GameSquare.\n\n   Management Comments and Outlook\n\n   \"We have made great progress over the last twelve months and Q3 has been\ntruly transformational for GameSquare,\" said Justin Kenna, CEO of\nGameSquare. \"We have been active in acquiring assets that enable us to\nexecute on our strategic vision and we have now turned much of our\nattention to integrating the assets to accelerate revenue growth while\nkeeping profitability top of mind in every decision that we make. The\nacquisition of Complexity Gaming and the addition of TimTheTatman positions\nGameSquare as a leading esports organization and we are just getting\nstarted. Our agency business was strengthened by the acquisition of Cut+Sew\nand the work that we have done to realize revenue synergies with GCN and\nCode Red is happening faster than we expected, as evidenced by the strength\nof our preliminary Q4 results. I would like to reiterate that early\nprogress in Q4 gives us continued confidence that our illustrative revenue\nprojections of $28 million for calendar 2022 is realistic and achievable.\"\n\n   \"The progress that we made in Q3 has paved the path for the strong\nfinancial results that we are seeing across the business in Q4,\" added\nJustin. \"We are building a leading esports organization. The strategic\npartnerships that we have announced and the acquisitions that we have\nclosed are showing real progress and the inbounds that we have had from\nbrands, talent, and potential M&amp;A targets has been remarkable. While our\nfocus through Q3 has been integration of the great companies that we own,\nwe continue to look at great companies run by great people that fit within\nwhat we are building. We continue to consider acquisitions of high growth,\nEBITDA positive agencies with a focus on esports, sports and entertainment\nin order to strengthen our footprint in Europe and the US; however, we\ndon't expect to complete additional transactions in 2021. We have built a\ngreat platform, with great people that are already doing great things. The\ntrends in esports point to growing engagement by global brands and we\nbelieve that the GameSquare family of companies is at the intersection of\nculture, commerce, and investment.\"\n\n   Financial Review\n\n   GameSquare's revenues were $2,464,906 for the three months ended August\n31, 2021, a 123% increase over Q2 FY2021, and $4,616,977 for the nine\nmonths ended August 31, 2021. The core business of Code Red showed strong\nsequential results as the influencer component of the business posted\nquarterly revenue of $1,312,685, an 84% sequential increase over the\n$714,808 reported in Q2 FY2021.\n\n//st\n\n          Three months ended     Three months ended    Nine months ended\nNine months ended\n\n($ Canadian)      August 31, 2021    August 31, 2020   August 31, 2021\nAugust 31, 2020\n\nRevenue       $    2,464,906     $    -    $    4,616,977      -\n\nCost of sales      1,777,869      -     3,539,639      -\n\nGross profit       687,037    -     1,077,338      -\n\nExpenses\n\n    Salaries,      1,546,495      10,000    3,390,577      196,632\n    consulting and\n    management fees\n\n    Player     362,903    -     362,903    -\n    compensation\n\n    Professional   500,144    (19,846)    920,195    13,964\n    fees\n\n    General office     490,405    36        656,326    2,294\n    expenses\n\n    Selling and    798,381    -     1,099,170      -\n    marketing\n    expenses\n\n    Travel expenses    237,664    -     360,507    -\n\n    Shareholder    41,672     -     163,571    10,000\n    communications\n    and filing fees\n\n    Interest       156,880    4,267     158,369    10,040\n    expense\n\n    Bad debt       (2,178)    -     55,973     -\n    expense\n\n    Foreign    11,644     -     6,904      -\n    exchange loss\n\n    Change in      -      -     (95,288)    -\n    provision for\n    reclamation\n    deposit\n\n    Share-based    1,676,185      -     2,434,495      -\n    compensation\n\n    Transaction    5,871,448      -     15,013,268     -\n    costs\n\n    Amortization   1,985,082      -     2,833,223      -\n\nTotal expenses         13,676,725     (5,543)    27,360,193     232,930\n\nLoss for the period before     (12,989,688)    5,543     (26,282,855)\n(232,930)\nincome taxes\n\nIncome tax (recovery)      (179,835)    -     (405,164)    -\n\nLoss for the period        (12,809,853)    5,543     (25,877,691)\n(232,930)\n\nOther comprehensive loss\n\nItems that will subsequently\nbe reclassified to operations:\n\n    Foreign    743,012    -     522,348    -\n    currency\n    translation\n\nTotal comprehensive loss for  $    (12,066,841)   $    5,543    $\n(25,355,343)   $    (232,930)\nthe period\n\n(Loss) profit for the period\nattributable to:\n\n    Owners of the      (12,841,601)    5,543     (25,915,195)    (232,930)\n    parent\n\n    Non-controlling    31,748     -     37,504     -\n    interest\n\n          $    (12,809,853)   $    5,543    $    (25,877,691)   $\n(232,930)\n\nBasic and diluted net loss per    $    (0.07)   $    0.00     $    (0.22)\n$    (0.01)\nshare\n\nWeighted average number of     191,051,221    20,000,000    117,061,379\n20,000,000\ncommon shares outstanding -\nbasic and diluted\n\n//et\n\n   Conference Call Details\n\n   CEO Justin Kenna and President and Chairman Kevin Wright are scheduled\nto host a conference call for the investment community to discuss the\nfinancial results for the three months ended August 31, 2021. Analysts and\ninterested investors can join the call via the details below:\n\n   Date: Monday, November 1, 2021\n\n   Time: 5:00pm ET (2:00pm PT)\n\n   Webcast: <a href=\"http://services.choruscall.ca/links/gamesquare20211101.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://services.choruscall.ca/links/gamesquare20211101.html</a>\n\n   About GameSquare Esports Inc.\n\n   GameSquare Esports Inc. is an international gaming and esports company\nheadquartered in Toronto, Canada. The Company is seeking to acquire\nadditional assets and entities serving the gaming and esports markets and,\nmore broadly, in sports and entertainment. GameSquare owns a portfolio of\ncompanies including Code Red Esports Ltd. (\"Code Red\"), an esports talent\nagency serving the UK, Reciprocity Corp. (\"Reciprocity\"), which provides\nthe Company access to Asia, Latin America and North America, NextGen Tech,\nLLC (dba as Complexity Gaming), a leading esports organization operating in\nthe United States, and, most recently, Swingman LLC (dba Cut+Sew and\nZoned), a gaming and lifestyle marketing agency based in Los Angeles, USA.\nReciprocity's gaming and esports assets include: a CrossFire franchise in\nChina that it owns with its partner LGD Gaming, a 40% interest in a League\nof Legends team that competes in Latin America, and its wholly owned\nsubsidiary corporation, GCN, Inc. (\"GCN\"), a digital media company focusing\non the gaming and esports audience based in Los Angeles, USA.\n\n   Contact\n\n Contact Information:\n\nContact:\n\n   Kevin Wright, President and Chairman\nPhone: (647) 670-2500\n   Nikhil Thadani, Investor Relations\nEmail: IR@gamesquare.com\nPhone: (416) 930-2949\n\n   Forward-Looking Information\n\n   This news release contains \"forward-looking information\" and\n\"forward-looking statements\" (collectively, \"forward-looking statements\")\nwithin the meaning of the applicable Canadian securities legislation. All\nstatements, other than statements of historical fact, are forward-looking\nstatements and are based on expectations, estimates and projections as at\nthe date of this news release. Any statement that involves discussions with\nrespect to predictions, expectations, beliefs, plans, projections,\nobjectives, assumptions, future events or performance (often but not always\nusing phrases such as \"expects\", or \"does not expect\", \"is expected\",\n\"anticipates\" or \"does not anticipate\", \"plans\", \"budget\", \"scheduled\",\n\"forecasts\", \"estimates\", \"believes\" or \"intends\" or variations of such\nwords and phrases or stating that certain actions, events or results \"may\"\nor \"could\", \"would\", \"might\" or \"will\" be taken to occur or be achieved)\nare not statements of historical fact and may be forward-looking\nstatements. In this news release, forward-looking statements relate, among\nother things, to: the Company's future financial performance, the Company's\nability to integrate and monetize its core asset portfolio, to accelerate\nits business objectives of revenue growth and profitability, to capitalize\non the accelerating growth of esports audiences, to be a leader in bridging\nthe gap between global brands and esports audiences, and to continue to\nbuild a pipeline of strategic acquisition targets in esports and sports and\nentertainment more broadly; the business and operations of the Company; and\nthe Company's ability to execute its business plan. These forward-looking\nstatements are provided only to provide information currently available to\nus and are not intended to serve as and must not be relied on by any\ninvestor as, a guarantee, assurance or definitive statement of fact or\nprobability. Actual events and circumstances are difficult or impossible to\npredict and may differ materially from those contained in or implied by\nsuch forward-looking statements. Forward-looking statements are necessarily\nbased upon a number of estimates and assumptions that, while considered\nreasonable, are subject to known and unknown risks, uncertainties, and\nother factors which may cause the actual results and future events to\ndiffer materially from those expressed or implied by such forward-looking\nstatements. Such factors include, but are not limited to: general business,\neconomic, competitive, political and social uncertainties as well as\nfactors discussed in the Company's Management's Discussion and Analysis for\nthe period ended August 31, 2021, which is available on SEDAR at\nwww.sedar.com. There can be no assurance that such statements will prove to\nbe accurate, as actual results and future events could differ materially\nfrom those anticipated in such statements. Accordingly, readers should not\nplace undue reliance on the forward-looking statements and information\ncontained in this news release. GameSquare assumes no obligation to update\nthe forward-looking statements of beliefs, opinions, projections, or other\nfactors, should they change, except as required by law.\n\n   Neither the Canadian Securities Exchange (\"CSE\") nor its Market\nRegulator (as that term is defined in the policies of the CSE) accepts\nresponsibility for the adequacy or accuracy of this release.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130400604.MNPRE2130403099-13485920211101</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}