{"date": "2021-12-13 18:32:49.261000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_ewvyz4mk&amp;referenceId=tag:reuters.com,2021:newsml_OVF7VM74B_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_ewvyz4mk&amp;referenceId=tag:reuters.com,2021:newsml_OVF7VM74B_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Harley-Davidson electric-motorcycle division will go public through a merger with a blank-check firm in a deal valued at $1.77 billion, the company said on Monday, as the 118-year old brand bets on younger customers to boost volumes.  Conway G. Gittens reports.<br/>Short Link: <a href=\"https://refini.tv/3GCws4g\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3GCws4g</a><br/><br/>Video Transcript:<br/><br/>Harley-Davidson wants to capitalize on Wall Street's new love affair with electric vehicles and so it is spinning-off its electric motorcycle unit LiveWire. The iconic motorcycle company announced Monday that LiveWire will start trading on the stock market via a SPAC merger or deal with special purpose acquisition company AEA-Bridges. The SPAC deal values LiveWire at $1.7 billion. LiveWire was Harley-Davidson's attempt to win over younger customers and re-energize sales, as its key buyer - baby-boomers- age out of their interest in motorcycle riding as a recreational activity. LiveWire, in an investor presentation, projected it will see sales of 100,961 electric bikes by 2026. By going public, LiveWire will be the first pure-play electric motorcycle company to trade on the stock market. EVs are the hot trade right now as the push for green vehicles goes mainstream. Tesla's market value shot up this year, solidifying the company as the world's most valuable automaker by far. And last month, Amazon-backed EV maker Rivian shot past $100 billion in valuation in its market debut, surpassing Ford and General Motors, even though Rivian sells far fewer cars than Detroit's Big Two. LiveWire will trade on the New York Stock Exchange, under the ticker symbol L-V-W. Shares of Harley-Davidson surged 11% in mid-day trading.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}