{"date": "2022-01-11 20:12:29.205000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">project44 Receives $420 Million Investment led by Thoma Bravo, TPG and Goldman Sachs Valuing Business at $2.2 Billion Pre-Money</p>\n<p>CHICAGO, Jan. 11, 2022</p>\n<p>- <span>With $100+ million in ARR, 1,000+ team members, 1,000+ customers, 1+ billion packages tracked annually and the top performer in analyst reports, project44 leads the supply chain visibility market</span>\n</p>\n<p>\n<span>CHICAGO</span> , <span>Jan. 11, 2022</span> /CNW/ -- <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3406223-1&amp;h=3063818572&amp;u=https%3A%2F%2Fproject44.com%2F&amp;a=project44\" data-type=\"url\" class=\"tr-link\" translate=\"no\">project44</a> , the leading supply chain visibility platform, announced today that it received an investment totaling <span>$420 million</span> . A syndicate led by Thoma Bravo, TPG and Goldman Sachs Asset Management (\"Goldman Sachs\") with participation from Emergence Capital, Insight Partners, Chicago Ventures, Generation Investment Management, Sapphire and Sozo Ventures acquired equity interests resulting in a pre-money valuation of <span>$2.2 billion</span> , and Sixth Street committed to make available additional funding, in support of the company's strategic acquisition program and product development activities. When combined with its <span>$202 million</span> equity raise in May of 2021, project44 has set a funding record for Logistics Tech enterprise SaaS companies. These investments position project44 to accelerate its mission to help leading brands optimize the movement of products across supply chains, delivering better resiliency, sustainability and value for their customers.</p>\n<p>\n\n</p>\n<p>\"Today, project44 is helping companies solve supply chain challenges ranging from inflationary pressure and lockdowns to unpredictable weather and bottlenecks at ports. Our growth over the past year speaks to these macroeconomic tailwinds and the competitive edge we can provide to our customers,\" said <span>Jett McCandless</span> , Founder &amp; CEO of project44. \"With ongoing support from our investors, we can offer even more value to our customers and solidify our position as the global network that powers the future of the supply chain.\"</p>\n<p>\n<span>#1 in Supply Chain Visibility</span>\n</p>\n<p>Throughout 2021, project44 cemented its position as the #1 company in supply chain visibility with global port-to-door coverage across all modes of transportation. The company now generates more than <span>$100 million</span> in annual recurring revenue (ARR), the largest generation 2 logistics tech in the world.</p>\n<p>The most influential analysts within the logistics industry also rank project44 ahead of its competitors. Placing first in <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3406223-1&amp;h=1429907296&amp;u=https%3A%2F%2Fwww.project44.com%2Fpress-releases%2Fproject44-named-1-on-2022-freighttech-25-list&amp;a=FreightTech+25\" data-type=\"url\" class=\"tr-link\" translate=\"no\">FreightTech 25</a> , Gartner <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3406223-1&amp;h=2310166534&amp;u=https%3A%2F%2Fwww.project44.com%2Fpress-releases%2Fproject44-named-a-2021-customers-choice-in-gartner-peer-insights-voice-of-the-customer&amp;a=Voice+of+the+Customer\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Voice of the Customer</a> and <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3406223-1&amp;h=1199188976&amp;u=https%3A%2F%2Fwww.project44.com%2Fpress-releases%2Fproject44-named-a-leader-in-g2s-fall-2021-grid-report-for-supply-chain-visibility-software&amp;a=G2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">G2</a> have all awarded project44 their highest honors. In addition, Chicago Inno named project44 among the best 100 places to work in the city.</p>\n<p>\"Supply chain visibility has become increasingly important as shortages, delays and bottlenecks ramp up. project44's potential to solve even the most complex of these issues is unparalleled,\" said <span>Robert (Tre) Sayle</span> , Partner at Thoma Bravo. \"By continuously evolving to meet customer needs, project44 has developed a revolutionary platform that adds significant value to the entire global supply chain.\"</p>\n<p>\"project44 has been scaling at an impressive pace, executing decisively on its vision of a global end-to-end supply chain visibility platform. Supply chain visibility has become a critical technology to solving large-scale problems in the world today, and project44 has emerged as the global market leader,\" said Malte Janzarik, Partner at TPG based in <span>Europe</span> . \"The breadth of data project44 offers and ease of access for shippers, logistics providers and carriers are unmatched. We believe that project44's next-gen platform and highly valuable network will continue to drive tremendous growth.\"</p>\n<p>TPG is investing in project44 out of TPG Tech Adjacencies (TTAD), an investment vehicle focused on flexible capital solutions for the technology industry.</p>\n<p>\n<span>Meeting a Critical Need for Global Businesses</span>\n</p>\n<p>As the supply chain connective tissue, project44 offers the largest carrier network of any supply chain visibility provider with more than 142,732 multimodal carrier integrations and 2.7 million trucks. Shippers and logistics providers depend on project44 to help them navigate today's increasingly complex supply chains, improving their sustainability, building transportation resiliency and meeting the evolving demands of their customers. project44 supports more than 1,000 organizations across industries including leading brands such as Amazon, Baker Hughes, Coop, CNHI, Danone, Dollar General, FedEx, General Mills, Goodyear, Kuehne &amp; Nagel, Lenovo, McKesson, Mondelez, Nestle, The Home Depot and Unilever.</p>\n<p>\n<span>Record-Shattering Growth</span>\n</p>\n<p>project44's momentum speaks to its differentiation and immense lead in the supply chain visibility space. Following an exceptional Q3 2021, project44 has landed <span>$12.7 million</span> of newly booked annual recurring revenue (ARR) in Q4. The company has closed 117 logos over that timeframe, contributing to YoY bookings increase of 170% and YoY logo growth of 216%.</p>\n<p>In addition to new business wins, net retention for 2021 is at 133%, while annualized gross retention was 96%. project44's ARR has reached over <span>$100 million</span> with a subscription gross margin of 70%, which is up 3% year-over-year. To build on this success, project44 will be nearly doubling its investment in product and engineering in 2022 to deliver improved real-time visibility across more modes of transportation in more regions.</p>\n<p>\n<span>Expanding International Team</span>\n</p>\n<p>project44 continues to expand its international footprint, offering supply chain visibility in 166 countries. More than 1,000 team members work with project44 at its 17 global offices. Over the coming year the company plans to hire hundreds of new talented team members in <span>China</span> , <span>Europe</span> , <span>Latin America</span> , <span>North America</span> , and <span>Japan</span> .</p>\n<p>project44 also hired its first director of diversity, equity, inclusion &amp; culture executive, <span>Ivana Savic-Grubisich</span> . The company is committed to hiring team members who reflect the rich diversity of the communities in which it operates.</p>\n<p>\n<span>Executive Hires</span>\n</p>\n<p>In 2021, project44 added five new executives to the team to manage its growing footprint. <span>Charlie Ungashick</span> joined as Chief Marketing Officer in February and <span>Diane Gordon</span> joined as SVP, Global Customer Success in March. In November, <span>Elliot Rodgers</span> joined as Chief People Officer, <span>Jennifer Coyne</span> was appointed General Counsel and <span>Andy Grygiel</span> returned as Chief <span>Brand Officer</span> . These experienced executives bring unique insight to accelerate project44's growth.</p>\n<p>\n<span>Massive Gains Through M&amp;A</span>\n</p>\n<p>Throughout 2021, project44 increased its value to shippers and logistics providers through acquisitions of leading companies in the market offering complementary solutions. The September acquisition of <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3406223-1&amp;h=1316795720&amp;u=https%3A%2F%2Fwww.project44.com%2Fpress-releases%2Fproject44-acquires-convey&amp;a=Convey\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Convey</a> has enabled project44 to extend real-time visibility and exception management to last-mile, including parcel, courier, white-glove doorstep delivery, and visibility into item returns. <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3406223-1&amp;h=1296523951&amp;u=https%3A%2F%2Fwww.project44.com%2Fpress-releases%2Fproject44-acquires-ocean-insights&amp;a=Ocean+Insights\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ocean Insights</a> , acquired in March, brought much-demanded visibility into cargo at sea. <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3406223-1&amp;h=2186749101&amp;u=https%3A%2F%2Fwww.project44.com%2Fpress-releases%2Fproject44-acquires-clearmetal&amp;a=ClearMetal\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ClearMetal</a> , acquired in May, established project44 as the leader in artificial intelligence and machine learning with automation that reduces costs throughout the supply chain.</p>\n<p>\n<span>What Our Customers Say</span>\n</p>\n<p>\"project44 has enabled us to meet our commitment to customers in a year of unpredictability,\" said <span>Pat Kenefick</span> , Vice President, Global Distribution and Logistics at AbbVie. \"With awareness of where our goods are located, we can adapt to interruptions and make proactive decisions to ensure that our distributors are stocked with inventory. Supply chain visibility is a game changer for our ability to drive growth and enhance patient experiences in a challenging economic environment.\"</p>\n<p>\"HARIBO is committed to delivering our beloved products on time and at the high level of quality our brand is known for. This is a core piece of what has allowed us to become a successful business. We benefit from being a global company with a decentralized manufacturing structure. A perfectly coordinated global supply chain is essential for us and that is why we continuously invest in it. We chose to work with project44, the leader in real-time transportation visibility,\" said <span>Stefan Sorce</span> , Head of global logistics and managing director in the Haribo Logistics Company, at Haribo. \"These insights will help us increase the resiliency of our supply chain and enable faster and smarter decisions that will get Haribo's products into the hands of our customers.\"</p>\n<p>\"The ongoing events of the last two years have placed unprecedented strain on the supply chains of consumer products manufacturers, and this has only served to highlight the critical need to mitigate risk and increase supply chain resilience,\" said <span>Alessandro Bonanno</span> , Head of Global Logistics and Customer Service at Beiersdorf AG. \"Partnering with project44 will provide Beiersdorf with improved visibility into our transportation flows and shipments, which will help us cope better with any future supply chain disruptions and fulfill consumer demand.\"</p>\n<p>\"Our team brought on project44 because of its global visibility into import and export arrival and departures,\" said Hiroshi Etani, Managing Executive Officer, at Yamato Transport Co., Ltd., <span>Japan's</span> largest delivery company, \"The broad network of multimodal transportation tracking brings more predictability to our business and helps us better communicate with our customers.\"</p>\n<p>About project44</p>\n<p>project44 is the world's leading advanced visibility platform for shippers and logistics service providers as defined by number of happy customers, number of carriers, number of customers, ARR, net retention, shipments per day, growth rate and gross margin. project44 connects, automates and provides visibility into key transportation processes to accelerate insights and shorten the time it takes to turn those insights into actions. Leveraging the power of the project44 cloud-based platform, organizations increase operational efficiencies, reduce costs, improve shipping performance and deliver an exceptional experience to their customers. Connected to thousands of carriers worldwide and having comprehensive coverage for all ELD and telematics devices on the market, project44 supports all transportation modes and shipping types, including Air, Parcel, Final-Mile, Less-than-Truckload, Volume Less-than-Truckload, Groupage, Truckload, Rail, Intermodal and Ocean. In 2021, project44 was named a Leader among Real-Time Transportation Visibility Providers in Gartner's Magic Quadrant. To learn more, visit <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3406223-1&amp;h=2419459969&amp;u=http%3A%2F%2Fwww.project44.com%2F&amp;a=www.project44.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.project44.com</a>\n</span> .</p>\n<p>Contact <a href=\"mailto:project44@nextpr.com\" data-type=\"email\" translate=\"no\">project44@nextpr.com</a>\n</p>\n<p>\n\n</p>\n<p>View original content to download multimedia: <a href=\"https://www.prnewswire.com/news-releases/project44-receives-420-million-investment-led-by-thoma-bravo-tpg-and-goldman-sachs-valuing-business-at-2-2-billion-pre-money-301458551.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/project44-receives-420-million-investment-led-by-thoma-bravo-tpg-and-goldman-sachs-valuing-business-at-2-2-billion-pre-money-301458551.html</a>\n</p>\n<p>SOURCE project44</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/January2022/11/c8374.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/January2022/11/c8374.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}