{"date": "2021-11-10 05:26:48.279000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_w5uoz2g1&amp;referenceId=6280989132001_B35&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_w5uoz2g1&amp;referenceId=6280989132001_B35&amp;pageId=RefinitivNewscasts</a></pre>Source: Real Vision<br/><br/>Description: Edan Yago, co-founder of Sovryn, understood early on the promise of Bitcoin and seized on the opportunity to upset the feudal dynamic of Web 2.0, an environment within which a few key players own a vast majority of networks. This proved to be a revolutionary moment for Yago, who set out to develop a DeFi infrastructure through his company, Sovryn. In this interview, Yago explains why, in his view, Bitcoin is so important and why it provides freedom and equal access to individuals. He says, “When I read the Bitcoin white paper, what I saw was the ability to have a digital commodity, but more importantly the ability to have digital rights, digital property.\" He also discusses why he believes smart contracts and other DeFi functions can operate competitively on a Bitcoin sidechain, disrupting the common trope that Bitcoin would likely function as a less liquid reserve asset in a crypto-dominated future. Interviewed by Ash Bennington on November 1, 2021.<br/>Short Link: <a href=\"https://refini.tv/3mXgw5N\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3mXgw5N</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Edan Yago, core contributor at Sovryn. It's a pleasure to have you here today. Excited to talk to you about Bitcoin; the Bitcoin ecosystem, Bitcoin culture, and of course, defy on Bitcoin. Edan, welcome. &gt;&gt; Ash, thanks very much for having me. It's a pleasure to speak with you. &gt;&gt; Edan, you have a very interesting background. Before we get started here, tell us a little bit about what you did before you got involved in this space? &gt;&gt; Well, right before I got into Bitcoin, actually, the whole reason I got into Bitcoin was in 2011, I was the founder of a biotech startup. The biotech startup was doing diagnostics using neural networking systems. We were using machine learning to do better diagnostics. I was reading a lot in networking science. One of the papers I came across was the Bitcoin white paper. It blew my mind. I had spoked my coffee all over my laptop by the time I'd finished reading it. It sticky fingers, I sent emails to everyone I knew telling them that this was going to be the most important thing that they would see probably in their lifetimes and that everyone should try and figure out how they can get involved. Pretty much everyone ignored me. Frequently I'm told that they regret ignoring those emails. But I think the reason I was so primed and ready to grasp the potential of Bitcoin was, my background was I had studied psychology and neuroscience, I'd studied network science. I was convinced that people were going to spend more and more of their time in digital environments. That was something which was fascinating to me. I was convinced that more and more of our world was going to be managed by data. But also, when I was a young kid, I'd grown up in South Africa and my family had been involved in fighting against the apartheid regime, and so many of them had been forced to flee south Africa and I, as a young kid, ended up smuggling gold out of South Africa in the form of Krugerrand, which my mother would sew into my clothing because they wouldn't search young children and so I got sent alone on flights with Krugerrands embedded in my clothes. I think for me, I had on the one hand, an interest in the technology, but I also understood the massive sea change that this represented in terms of people's ability to have private property rights, which they could navigate outside of the realm of the physical and outside of the grasp of potentially kleptocratic regimes. It was a little bit of the smuggler, a little bit of the politics, and a little bit of the interest in neuroscience and networking that got me into Bitcoin. In 2011, within a few months, I had switched to being full-time Bitcoin, and I've been full-time Bitcoin ever since. &gt;&gt; It's obviously a fascinating background that you have coming to this, the cultural and social background, but also you were studying in a PhD program, I believe, in neuroscience. Tells us what you saw that others didn't that caused you to spill your coffee that morning in excitement about this technology? &gt;&gt; When I read the Bitcoin white paper, what I saw was the ability to have a digital commodity, but more importantly, the ability to have digital rights; digital property. Now, this is a huge deal. It's a huge deal for two reasons. First, up until now, we've had more and more of our lives managed by the digital, but it's been a realm bereft of property rights. The only people who have had secure property, secure rules, and the ability to enforce rules in the Internet space have been the people who have owned the servers. What we've seen is the Internet started as an idealistic vision of everyone being able to communicate and to transact on equal footing and a place of great openness. But instead what it's become is a set of world walled gardens where a small number of people own the servers, they're the land barons and pretty much everyone else or serfs subservience to them in those worlds. The reason is we've taken 21st century technology, this digital technology, and we've married it to the political and legal sophistication of the pharaohs of the Iron Age, where one emperor controls everything because nobody else has property rights. The first thing that I saw was this ability to introduce property rights into the Internet. Then what comes from that is the ability to create true economic and financial systems that are based in the Internet. Up until quite recently the Internet really only provided one true native economy, and that was advertising. Facebook make all of their money from advertising, Google make all of their money from advertising, and Amazon are effectively doing advertising as well, and they've connected it to a real-world distribution system, but it's all been about being able to get people to view and purchase products rather than actually building digital products and natively digital economies. This ability to have property rights and to have scarcity in the digital realm suddenly opens up the right and the ability for people to start transacting truly amongst themselves and to build that type of economy. What we've seen in a very, very short space of time is we've seen this Crypto economy go to $2.5 trillion economy with no end in sight, and it's likely going to become the largest economy in the world because it connects everyone together. That was a very, very big deal as well. Then maybe the final thing is, for all of human history, the only way we've been able to secure property, the only way we've been able to secure rights, has been through the explicit or implicit threat of violence. At the end of the day, if you went down the rabbit hole of any economic system, ultimately, it was enforced by some government, and that government was in power because it had the implicit threat of violence. For the first time, we have now access to a system of property rights which is secured not by the threat of violence, but by the ability to have unbreakable and unforgeable cryptography, which treats everyone equally, it doesn't matter if you're a government or you're somebody living in a shack outside of the city of Lagos in Nigeria. Everyone has equal access to that technology. It's a very, very powerful equalizer and it's a very, very democratic technology. When you combine all of those different aspects, you have truly a paradigm changing technology and it all stems from this ability to have property rights that are digital and secured by cryptography. &gt;&gt; Edan, I've heard you speak on this topic before, and it's something that you have such a comprehensive vision for. You've talked about Bitcoin as fundamentally a revolution in human freedom. Give us a sense of what that world might look like as we look 3, 5, 10 years in the future if this thesis that you're describing continues to play out. &gt;&gt; I think one of the interesting things that I've come across is the estimation, which is quite consensus among economists that if we didn't have borders, in other words, if immigration was available to anyone to anywhere, that we would within a day, overnight, we would double the global economy. The reason we would double the global economy is because there's a huge amount of talent out there that is unable to be put to productive use. If you think about why people in the US earn much more than people in Venezuela or people in South Africa. It's not because of intrinsic differences in the human talent available, it's primarily due to the fact that the legal and property systems that those people live with do not promote prosperity and also do not connect them with a wider global economy. What we see with pretty much everyone who immigrates, the reason they do it is because they can improve their lives and they almost immediately are able to command higher earning power. They're able to command higher earning power not because they change, but because they are now in an environment where they're able to reach a much higher degree of their full potential. Now we have a technology where it does this for billions of people who up until now haven't had access to a global economy and have only had access to the property rights and the security of those rights that was provided to them by their governments. A lot of governments out there, in fact, probably the majority of humanity still live with very, very poor laws which do not provide them with a high degree of assurances that what they create and what they develop, there'll be able to keep or even give them the right to be creative and to develop productively in the first batch. What I expect we're going to continue to see is the extension of what we've seen up until now. Over the last 12 years, this economy has gone from 0-$2.5 trillion. We've started to see more and more people from around the world being able to integrate into it. People from China, people from India, people from Africa, people from Latin America, as well as people from Europe, the United States, Japan, South Korea, etc. For example, the project that I'm working on, Sovryn, there's a very, very large number of people working on it. Talented developers, people who are oriented around building communities, people who are oriented around design. &gt;&gt; But what's interesting is that there's no one country which comes even close to dominating, not even a region that comes close to dominating, where these people are from. They're from India, they're from Pakistan, they're from all over Europe, they're from the US, they're from Canada, they're from Latin America, etc. When given the opportunity, people are coming together from around the world to build truly incredible things, and that's something that we've seen pioneered by the crypto industry. I think we're going to continue seeing very substantial growth , and at the same time, we're going to see this having more and more of an impact boots-on-the-ground style. We're going to see it begin to impact the physical economies that we're familiar with. We're already seeing this in places like Nigeria or the Philippines, where people are using it, not just for remittance, but companies are using it as a way of transacting and paying other companies that they deal with around the world, where their banking system won't allow them to do it. We're seeing it in El Salvador, where an entire country has suddenly gained access to a global monetary system and to a global financial system, a very high sophistication that usually a country like that wouldn't have access to. We're seeing it in more mundane ways even, where mining of Bitcoin is something which occurs from everywhere from the United States to Kazakhstan. We're seeing this starting to bend the curve, not just in digital economies, but in physical economies as well, and I expect that trend to continue. I expect that over the next 10 years, we're going to see this go from a $2.5 trillion economy to 100 or $200 trillion economy, and that is going to be a sea change in terms of the way that the world think about the value that people can bring. The pandemic that we've just experienced has really accelerated this by even more so showing people how geography is far less important than they thought in terms of their economic activity. &gt;&gt; Let's step back from the future and take a look at where we are today. What do you see being the current state of play of this ecosystem, and how is Bitcoin right now working, in your view, to improve property rights? &gt;&gt; Bitcoin created this idea of digital property rights, and in many ways, it's the special case. It provides the monetary asset and remains the center of gravity for this entire space. What you would expect out of the monetary assets, the reserved currency of the space is that it remains the center of the space. At the same time, we've seen a huge amount of development in the smart contract world. This is very experimental. There is hacks and there's bugs, and that kind of noise can make people think, well, it's not really that important. We've seen NFTs and a huge amount of irrational exuberance around them, and that can also lead people to think that those are not important. But these are fundamentally new ways of transacting and the short-term irrational exuberance that may exist around them does not change the fact that they are long-term fundamentally important. I have a contrarian view, as opposed to most of the people who are interested in smart contracts and interested in this global economy that's developing around cryptocurrencies and smart contracts, in that I believe that most of the assets that are part of the base chains for these smart contract platforms are going to struggle in the long-term to maintain a high degree of value. The reason is that what we're seeing with all of these smart contract platforms is a race to the bottom. Ethereum is competing with Avalanche, is competing with Solana, is competing with Polygon to be the fastest, cheapest chain. As they're competing, they're going towards zero fees effectively for transactions or near zero fees for transactions, which makes it difficult for the altcoins, the cryptocurrencies that are native to those chains to capture value. Beyond that, we're seeing that there's weak network effects associated with these platforms. It's been very easy for protocols to move from Ethereum, to BSE, to Binance Chain, or to Avalanche, or to Solana. It's been very easy for the users to move. The wallets are able to integrate with all of them, and so there doesn't seem to be a strong network effect there either. While all of this has been happening, at the same time, Bitcoin has managed to forge ahead in a totally separate path, and for some reason, no project is really even trying to compete anymore for this reserve asset status. If once all of the chains were trying to be bitcoin, but better now, they're trying to be the best smart contracting platform. I think what we're going to see is Bitcoin remain the center of gravity for the space, will remain the monetary asset. We'll see growing sophistication in the smart contracting world. We'll see growing interoperability and the end user is going to care less and less which chain they are to the point that they won't know what the underlying chains are so long as they maintain an adequate degree of security and give them an adequate degree or the most frictionless access to the Bitcoin economy, which is the economy of the Bitcoin reserve asset. I think that where we're going is a world where you have a lot of smart contracts developing extensions, generalizing this idea of private property and what you can do with it, basically turning all of our assets, in one way or another, into digital assets, and ultimately being transacted with and bridged by this monetary asset, Bitcoin. &gt;&gt; That means effectively you're talking about a payment rail network layer in addition to the store of value or reserve asset network layer, talking about something like Ethereum, Solana, Cardano as the network layer, and then beneath it, Bitcoin as the monetary asset. &gt;&gt; Yes. I don't know if it's specifically Solana, or Ethereum, or Cardano. I would suspect actually that it isn't because each of those chains, they very quickly reach a point where scale starts to break down, and so then they start to need to shard and to have roll-ups, etc. What each of these shards and roll-ups, roll-ups especially, end up being is effectively separate chains. Solana is a separate chain from Ethereum, BSE is a separate chain from Ethereum, and even roll-ups, which are even more closely associated with Ethereum, are separate chains and are looking to have their own tokens. I think what's important is not the specific chain, because chains in an open source world are effectively commodity technology; they are easily replicable. &gt;&gt; What is more valuable is the technology that is developed. But that technology because it's open-source, it's a public good that anyone can use, anyone can fall. Then the question is, how do you secure it? There is one source of security, which is Bitcoin proof of work, which remains unassailable the most secure. Techniques are being developed to allow other chains to effectively plugged into that security. I think chains will plug into that security, and there is a network effect to assets. We've seen like for example, stable coins have network effects associated with them. Bitcoin has a clear network effects associated with it. There's going to be a few primary assets which are associated with different classes of asset types that are going to continue to have strong network effects even across multiple different chains. &gt;&gt; In some ways that really is the perfect segue to talk about sovereign, give us a sense of what got you involved in this project and why you think it's important. &gt;&gt; Sure. Sovereign is a open source protocol which extends Bitcoin. It's secured by Bitcoin and provides Bitcoin with smart contract functionality. Actually what it does is it provides Bitcoin with EVM functionality. The ability to use Ethereum type smart contracts and also integrates with other types of Bitcoin layer too. For example, it's integrated with rootstock, it's integrating with lightning network and provides a single layer integration for Bitcoin for all of these different layer to technologies. The reason I got into sovereign and I was interested in it is because throughout the years that I was a Bitcoiner, I had always wanted to be able to transact in my Bitcoin, to use it, to borrow, to lend, to trade, whatever it is that my needs were around Bitcoin without having to go through a central intermediary. I think that's obvious. It's like you've got this amazing asset. The reason it's amazing is because you don't need a middleman in order to use it. But then for years now, we found that when you actually do want to use your Bitcoin, you have to go to an exchange or you have to go to a lending provider, some centralized service provider, and you actually lose the primary property of Bitcoin, which was attractive in the first place. When I encountered sovereign, what I realized was that it was a set of tools which would allow me to lend out my Bitcoin, would allow me to have access to Bitcoin backed stable coins would allow me to trade my Bitcoin if I needed to, without having to go through a central intermediary. I became very excited and I started to get more involved in the community, which was quite nascent at the time. What I've seen is a huge amount of excitement grow around this community. I think I've only seen this level of excitement maybe twice before. One was in the early days of Bitcoin and then again in the early days of a Ethereum when people realized that there was a paradigm changing event which could provide a very exciting vision and a community very quickly galvanized around it of developers and supporters who were working to build in. What we've seen with sovereign is it's grown very quickly. &gt;&gt; We were talking a little bit offline. Any doubt about the growth of sovereign? Tell us a little bit about the community, the applications, and also the scale and size of the native coin. &gt;&gt; I think, sovereign has been around for less than a year and actually properly launched only in April, so just a few months ago. In that space of time, the community that's galvanize around sovereign have managed to build out the tools for trading, for margin trading, for derivatives, for borrowing and lending they've created Bitcoin back stable coins if created a way which is going to be launching soon to have zero interest loans and collateralized by Bitcoin. Basically never need to sell your Bitcoin. It's been a very rapid rate of progress. At the same time, they've been now 10s of 1,000s of people who started using the system. They're 13,000 people who are actively engaged in governing the project. There are several 100 contributors to the project, some volunteers and some being paid by the protocol itself. It's been a very rapid rate of growth. it is a unique and I think uniquely valuable protocol in that, the biggest asset in the space is Bitcoin. Perhaps the community which is most interested in decentralized products are Bitcoiners. Up until sovereign, there really hasn't been away for Bitcoiners to have a Bitcoin native way to access these different products. I think what we're seeing is maybe an accelerated rate of progress because it has been a nascent market, it has been a latent desire for it. &gt;&gt; Tell us a little bit about the governance of the token, tell us a little bit of the governance of the protocol, how that works. &gt;&gt; Sovereign has a very different approach to decentralization than Bitcoin. Because if you think about Bitcoin as the base layer, the monetary layer, then sovereign built upon Bitcoin is the application layer or the financial layer. It needs to be dynamic where Bitcoin needs to be consistent. Sovereign has a different way of achieving consensus. The first way to achieve consensus is it's mined by the Bitcoin miners and so secured, the extra transactions are secured by the Bitcoin miners. But then there's the additional application layer where the applications themselves, the parameters of lending and borrowing, the question of which stable coins will be allowed into the protocol. Effectively, what you would maybe think of as the rule setting or the regulation of the system. It's a self-regulating system, has to be managed by the community. For this purpose, there is a token called the SOV token. Now the SOV token is explicitly not a cryptocurrency, it's not a coin. In fact, to use the SOV protocol, you don't need SOV token at all. The only reason you'd want SOV token is because you want to actively participate in the governance of the system. The way that you do that is instead of mining with electricity, you mine with time. You can stake or effectively lock up your SOV for long periods of time. The longer you lock up, in other words, the longer you give up liquidity of this asset for, the more influence, the more voting power you have and the more of the system revenue that accrues to you. This revenue is driven from financial activities such as trading fees or lending fees, where the actual transaction fees continue to accrue to the Bitcoin miners. This is a very interesting approach because it forces a long-term view on those people who are participating in the system. This is very different, for example, from equity where we see companies have a very short-term quarter to quarter view. Here the people who have taken the longest term view have the most influence and also at the same time protects the system from short-term governance detects, which is something we've seen with other types of protocols where you and I could just go and borrow if it's purely one token, one vote, I can borrow a lot of tokens, vote in a way which is malicious or adversarial to the system with almost nothing at stake. Whereas with sovereign you can't do this. It's a new approach in terms of thinking about how you can use this idea of mining, of putting something skin in the game in order to gain participation rights in the protocol and extending that from the monetary layer into the financial layer. &gt;&gt; These are big ideas, particularly for people who are new to this space, trying to get their heads around it. Let's try and unpack this, walk us through with an example of what a typical transaction would look like, what the process would be, and how the mechanics would work? &gt;&gt; Sovereign doesn't work on Bitcoin main chain. Bitcoin main chain is designed to do one thing very well, which is act as the ultimate settlement layer for the monetary. &gt;&gt; Currency, for Bitcoin. Sovereign is designed to work on what's known as Bitcoin layer 2. This is a collection of different technologies, one of which is a side chain technology called Rootstock. When you want to use sovereign, what you do is you lock up your Bitcoin on main chain and you transfer it to the side chain. This can be done as quickly as if in one Bitcoin transaction. But you move the Bitcoin into the Sovereign ecosystem, and now with your Bitcoin in the sovereign ecosystem, you could choose to trade it for some other token. You can switch it for dollars. You could choose to lend it to earn interest, which is payable in Bitcoin. You could choose to borrow against it so that you can get liquidity without having to sell your Bitcoin. There are more and more sophisticated ways that people find to use it. The easiest way probably to experience this is to go to sovereign.app, which is the primary interface that most people use, although it's an open source system. Anyone can construct an interface to it and open that up you can get a sense of how this looks and feels in many ways, similar to a centralized exchange. But you are always in custody of your essence. You actually never need to register, so there are no people registered with the system at all. What that allows us for the system never to be able to identify participants, sensor participants, or never require participants and uses to have some kind of permission to access. It's always permission has access to the system. &gt;&gt; Let's talk a little bit about rootstock or as KEGG give us a sense of what this technology does and why it's so important for Bitcoin layer 2. &gt;&gt; Yes. Rootstock is a very interesting technology in that for a long time it was assumed that if you wanted to be able to do something which you couldn't do on Bitcoin main chain, you had to go and create a new chain. That was the thinking behind a theory M, and it was the thinking behind Ripple, was the thinking behind Litecoin, etc. What rootstock does is rootstock is a technology which allows you to connect to Bitcoin, connect in two ways. One is the miners. The Bitcoin miners secure the chain that you're creating. The second is that the native asset on your chain is Bitcoin. Instead of thinking of a new chain as an entirely new ecosystem, it thinks of a new chain is a new layer of technology which is added to Bitcoin and secured by Bitcoin. In that way it extends and expands the functionality of Bitcoin itself. This is very interesting, I think, because it provides a path to think about what we discussed earlier as commodity technologies simply being added to Bitcoin as people discovered that their functionalities, that they want to add it to Bitcoin. It means that you can now have one cohesive ecosystem built around and secured by Bitcoin, but with any functionality which uses desire. &gt;&gt; How does the Bitcoin mining pools secure these layer 2? &gt;&gt; There's a process known as Merged mining. The way to think about Merged mining is that mining itself is like a lottery. Why did Satoshi Nakamoto invent mining at all? He wanted it to be random. He wanted it to be a random selection of who was going to choose the next canonical block so that no one could ever manipulate what was in the next canonical blog because they didn't know if it was going to be them. Each of these hashes that you hear about when you're mining is effectively creating a new lottery ticket. One of those lottery tickets is going to randomly win the rights to create the next main chain Bitcoin block. But you're producing many lottery tickets while you're a miner, so what Merged mining does is it basically says, if the lottery ticket that was 21, if 21 was going to be the winning number for the Bitcoin main chain, we're going to accept 22, 23, and 24, as well as winning numbers for our chain. In the act of creating these lottery tickets for mining Bitcoin. They're also at the same time creating the lottery tickets that are going to allow them to create the next block in the Rootstock chain. The Rootstock chain can be much faster. It can have more frequent blocks if it chooses, because it can select a larger number of winning tickets. What it is basically piggybacking on all of the hard work that the Bitcoin miners are doing, and at the same time giving them access to an additional revenue stream at almost no additional cost to themselves. &gt;&gt; What are the tradeoffs in using, as you say, multiple lottery tickets to secure the chain in terms of speed, in terms of security, and in terms of scalability? &gt;&gt; The primary tradeoff is that the Bitcoin miners in the current method of merged mining need to be aware of what is happening in the other chain. This probably limits the number of other chains you can have. Because otherwise, Bitcoin miners would need to be running nodes of an infinite number of chains. The amount of computation that would be devoted just to running these nodes could grow exponentially. There is however, a potential solution in the form of Blind Merged Mining, which is a technique which would allow for miners to secure other chains without having to be knowledgeable of what was occurring on them. Blind Merged Mining is not yet possible with Bitcoin, although there are some changes that are being discussed which would allow for Blind Merged Mining in future iterations or soft forks of the current Bitcoin system. But even now, the cost of running an additional node, especially if the parent chain can be quite efficient in terms of the computational requirements it requires is not very high. There is also an additional cost, which is that if you can't get all of the Bitcoin miners to merged mine, then you only get a fraction of the security. For example, right now, something like 60 percent of Bitcoin miners mine the Rootstock channel though that is growing. That means that rootstock will only have the equivalent of 60% of the proof of work or hashpower devoted to its securing its chain. Now this is still more than any other competing chain, but it is a downside compared to Bitcoin main chain. &gt;&gt; Sixty percent is still considerable, particularly when you think about the security of the Bitcoin network relative, as you say, to some of the other networks protocols out there. &gt;&gt; Yes. In fact, if you think, 60 percent of the hash power devoted to Bitcoin is still greater than the entirety of the hashpower devoted, for example, to Ethereum which is the nearest competitor. It is still a very significant security budget, but you want to try and get as close to a 100 as possible. Because you want to avoid a situation where you can suddenly have an influx of new mining, which is potentially malicious. If you have that already existing in the world, in the wild, as you do in a situation, for example, you have 60 and 40 percent, you can see potentially a large influx of new mining in a sudden way. That's something that you want to avoid. It hasn't happened and isn't a likely scenario because there's not that much to be gained from it. But the economics are compelling if you think about the long-term trend because these effectively represent incremental revenue for Bitcoin miners. We're likely to see them go to around a 100 percent merge mining. We're also likely to benefit, even if you're just using Bitcoin main chain, you benefit because this incremental revenue is additional security budget for the Bitcoin chain and the bitcoin ecosystem as a whole. &gt;&gt; That's because of the economics, the miners and continuing to secure rootstock chains and other layer twos, if that's correct. &gt;&gt; Yes. The more security budget you can provide to the Bitcoin miners, the more mining activity you encourage, and the more mining activity you encourage, the more difficult it is for any new party to come in and capture a large percentage of the mining power. That is always been the boogie man of Bitcoin, what's known as the 51 percent attack. If you can capture 51 percent of the total mining power, then you can effectively disrupt or near halt the progress of the chain, at least on a temporary basis. That would be potentially disruptive to Bitcoin and to the economy built around Bitcoin. The more significant the mining power, the more significant the economies of scale that are behind the mining power the more difficult it is for an attacker to capture 51 percent of the network. &gt;&gt; Would this be a technology that would benefit from changes to Bitcoin core because there's updates obviously for people who are not familiar with the technology continue to get rolled out on a regular basis. Would merge mining be benefited from those changes? &gt;&gt; Yes. For example, one thing that I mentioned was the ability to possibly introduce blind merge mining. There are a number of other small advantages that could be provided. But I think actually the place where you're more likely to see big advances is in the technology of pegging. Pegging is the ability to move your Bitcoin or effectively peg it from Bitcoin main chain to a side chain. Here there's more that we can do to make that a more trustless process. For example, this coming month, there's going to be the introduction of taproot, which is a new cryptographic set of technologies for Bitcoin. That will allow much larger sets of validators to be securing these pegs, the ability to move between these different side chains. There are also additional advances that are being worked on which would increase that trustlessness and increase the security of that type of activity even further. Over time I expect that the difference, the delta between the security of main chain and the security of the side chains will diminish until it will effectively feel almost as secure. For the vast majority of users, it will be effectively as secure when you're using a side chain as when you're using main chain itself. &gt;&gt; I know this has been a technical conversation and for people who have hung in there, particularly people who are newer to this space. I would just say, you've gotten a glimpse inside some of the most technical and thorny issues that are surrounding this topic right now. It's fascinating to hear what people who were on the forefront of Bitcoin and of the Bitcoin ecosystem are thinking about right now. In the final minutes we have remaining, give us a sense of what some of the key takeaways are that you'd like to leave our viewers with. &gt;&gt; Maybe I should talk about what I think are probably my most contrarian opinions. I think perhaps my most contrarian opinion about Bitcoin is that Bitcoin isn't primarily a store of value, but rather it actually is a monetary system which is emerging, and that the way it becomes in a reserve asset is not by being adopted by institutions that we see around us. Or not even by being adopted by more countries like El Salvador, but rather by having a fully fleshed out economic system built directly integrated into it. I think that there's a huge amount of value that we're going to start to experience from Bitcoin itself integrated with smart contract. I think the other contrarian view I have is that the many chains that we're seeing right now are not going away. But that actually doesn't make them valuable. They are very important advances in technology but it is hard to capture value just in creating new technologies because these new technologies are all open source. What we'll see is a proliferation of many chains utilizing various forms of these different technologies that are being developed. But they won't necessarily capture a significant chunk of value in the long term. Then finally, I would say that perhaps the third contrarian view I have is that the network effects are not in the chain and that includes Bitcoin itself. The network effects are elsewhere. They're in primarily the asset. They're secured by the community that is interested and that is using that asset and by the properties of the assets rather than by the properties of the chain. To a lesser degree they're also in the security that is provided to these chains. Their Bitcoin Proof of Work is very unique in that there's no other chain which has the level of security that Bitcoin has. I think the final idea is that Bitcoin has unique network effects which aren't already being competed away in the way that other potential network effects in the ecosystem are. In then in the long term, we are likely to continue to see the entire industry circle around this gravity well, which is Bitcoin and galvanize, perhaps even further around Bitcoin as an asset. &gt;&gt; Edan, It's been a fascinating conversation. I hope you'll come back and join us again soon. &gt;&gt; I would love to. Thank you very much. &gt;&gt; Thanks for joining us, everyone. &gt;&gt; Hey, there. Since you got to the end, I'm guessing you like the video. That's probably because we don't just turn on a camera and film. We work really hard on getting the narrative flow just right. That's why many finance companies are actually now hiring Real Vision to make videos for them. One of our recent client videos just hit 100,000 organic views on YouTube, and there were no kittens in site, if you want to find out how Real Vision can make a video for your company, just email us at customvideo@realvision.com.<br/></span></div></div></div></div>"}