{"date": "2022-02-01 14:56:07.884000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>UMAX GROUP CORP (\"UMAX-0;UMAX-0\")\n- Funny Media Group Builds a State-of-the-Art Recording Studio in\n- Downtown Los Angeles Location\n\n   UMAX Group Corp., a Nevada corporation, has built a state-of-the-art\nrecording studio in its Downtown Los Angeles location, expanding the\nfootprint of its subsidiary, Funny Media Group.\n\n   \"We know that there's a natural synergy between the things we are doing\nin comedy and the music business,\" said Rondell Fletcher, UMAX President\nand CEO. \"We are looking forward to using this new studio to complement our\nefforts in comedy.\"\n\n   After the acquisition of Funny Media Group in May 2021, UMAX has now\nfully transitioned into comedy development as the vehicle to achieve a\ncash-flow positive operation and to provide the best return on\nshareholder's investment.\n\n   In the new recording studio, Mr. Fletcher has recruited a top Colombian\nDJ, Jay Rico, 26, to produce content and score projects.\n\n   \"Jay is one of the most talented young producers we've ever seen,\" Mr.\nFletcher said.\"The studio itself features the best gear in the industry,\"\nMr. Fletcher said, with names like Universal Audio, SSL, Neumann, Antares,\nTube-Tech, Apple and many others. \"There's nothing we can't do in this\nstudio,\" Mr. Fletcher said.\n\n   Also, in this 6,000-sq.ft. location, Funny Media Group is prepping for\nSeason 2 of comedy shows, starting in March.\n\n   \"There's a lot of opportunity to create content in this facility,\" Mr.\nFletcher said.\n\n   Mr. Fletcher has an extensive background in production and media. He has\nowned his own production studio in Los Angeles for the past 20 years and\nhas produced national shows for CNN, FOX, Food Network and Comedy Central,\namong others.\n\n   The short-term goal for Funny Media Group is to produce content for\nstreaming services such as Netflix and Amazon with the long-term goal of\nbuilding a large media catalog for acquisition.\n\n   About Us\n\n   UMAX Group Corp. is a Nevada corporation, is a public-quoted Pink Sheet\nissuer under the ticker symbol \"UMAX\". UMAX reports as an alternative\nreporting issuer with OTC Markets Group, Inc. and is current in its\nmandatory required filings (E.g., \"Pink Sheet Current\").\n\n   Disclaimer Regarding Forward Looking Statements\n\n   Certain statements that we make may constitute \"forward-looking\nstatements\" under the Private Securities Litigation Reform Act of 1995.\nForward-looking statements include information concerning future?strategic\nobjectives, business prospects, anticipated savings, financial results\n(including expenses, earnings, liquidity, cash flow and capital\nexpenditures), industry or market conditions, demand for and pricing of our\nproducts, acquisitions and divestitures, anticipated results of litigation\nand regulatory developments or general economic conditions.? In addition,\nwords such as \"believes,\" \"expects,\" \"anticipates,\" \"intends,\" \"plans,\"\n\"estimates,\" \"projects,\" \"forecasts,\" and future or conditional verbs such\nas \"will,\" \"may,\" \"could,\" \"should,\" and \"would,\" as well as any other\nstatement that necessarily depends on future events, are intended to\nidentify forward-looking statements. Forward-looking statements are not\nguarantees, and they involve risks, uncertainties, and assumptions.\n?Although we make such statements based on assumptions that we believe to\nbe reasonable, there can be no assurance that actual results will not\ndiffer materially from those expressed in the forward-looking statements.?\nWe caution investors not to rely unduly on any forward-looking?statements.\n\nUMAX Group Corp.\n2020 Bay Avenue\nLos Angeles, California 90021\nWebsite (FMG): <a href=\"https://funnymediagroup.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://funnymediagroup.com</a>/\nWebsite (FMS): <a href=\"https://BroadcastWest.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://BroadcastWest.com</a>/\nInstagram: <a href=\"https://www.instagram.com/funnymediagroupofficial/?hl=en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.instagram.com/funnymediagroupofficial/?hl=en</a>\nYouTube: <a href=\"https://www.youtube.com/c/FunnyMediaGroup\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.youtube.com/c/FunnyMediaGroup</a>\n\nJack Zietz\nEmail: investors@umaxgrpcorp.com\n\nTel   : 714-325-2123    UMAX GROUP CORP\nWWW   : <a href=\"http://www.umaxcorp.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.umaxcorp.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203100211.MNPRE2203101907-06545320220201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}