{"date": "2021-11-01 21:53:33.406000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>It's no secret that cats love boxes. In July 2020, USA TODAY reported that as part of its \"Less Packaging, More Smiles\" initiative, Amazon introduced a built-in play factor in its shipping boxes allowing them to be turn into \"cat condos.\"</p><p>But a Facebook post claims cat owners should be wary of Amazon boxes.</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">The claim: Amazon sprays its boxes with toxic pesticides that are harmful to cats</p><p>\"Amazon sprays ALL boxes with Toxic Pesticides to kill wearouse (sic) rodents,\" reads the Oct. 19 post. \"If your cats play in Amazon boxes they will be exposed and may experience chemical burns to the tongue. Other symptoms include: fever, lethargic movement, shallow breathing, and sticky salivation.\" </p><p>The post is shared with three images, including one that shows a cat's tongue with what seems to be a chemical burn. It accumulated more than 300,000 shares within a week, and similar versions of this claim gathered hundreds more.</p><p>But there's no truth to this claim. A spokesperson for the company told USA TODAY that Amazon shipping boxes are free of any rodenticide or insecticide.</p><p><span><span>Fact check:</span> Viral TikToks on Bath &amp; Body Works candles encourage abuse of return policy</span> </p><p>USA TODAY reached out to the user for comment. </p><p class=\"tr-npp-section-title\">Amazon boxes are not sprayed with pesticides</p><p>The claim that Amazon boxes are sprayed with chemicals that are harmful to cats first appeared in December 2020. The fact-checking sites Snopes and Lead Stories independently debunked the claim, but it recently resurfaced online.</p><p>Amazon does not spray boxes with any pesticide or disinfectant, Richard Rocha, the company's senior public relations manager, told USA TODAY.</p><p>He said corrugated boxes are made of wood pulp and wood pulp binders, in line with the materials used by other box manufacturers. Rocha said Amazon does not use any special boxes and they are not sprayed for any reason.</p><p>USA TODAY found no other evidence that sprays in this vein are in use by packaging companies.</p><p>Brooke Lujano, senior communications manager at Georgia-Pacific, a North American supplier of corrugated packaging, said boxes made at Georgia-Pacific are not sprayed with any pesticides.</p><p>\"Our facilities are treated for pest control in accordance with the food safety certifications we hold, but that treatment would not be applied to boxes,\" said Lujano.</p><p>Amy Simpson, head of corporate communications at International Paper, a producer of fiber-based packaging, pulp and paper products, also said her firm does not apply pesticides to its corrugated boxes.</p><p>Rachel Kenyon, senior vice president of the Fiber Box Association, a cardboard box industry trade group, told Lead Stories she wasn't \"aware of any member company who is treating boxes with anything that could be harmful to pets.\" The group did not respond to USA TODAY's request for comment.</p><p>Veterinarians also said they aren't aware of any reports of cats sickened or injured by Amazon boxes.</p><p>\"I am not aware of this issue, have never seen this in clinical practice, or heard of it from other emergency veterinarians,\" said Ann Marie Zollo, staff criticalist at New York City's Animal Medical Center. \"There are many ​possible causes of oral ulceration in cats, ​and if your cat develops oral ulcers or injuries, it is very important to work with your veterinarian to determine the underlying reason.\"</p><p>Laura Fourniotis, a spokeswoman with Blue Pearl, a national network of emergency pet hospitals, also told Lead Stories the group wasn't aware of any such reports.</p><p><span><span>Fact check:</span> Home goods retailer Wayfair is not involved in child sex trafficking</span> </p><p class=\"tr-npp-section-title\">Our rating: False</p><p>Based on our research, we rate FALSE the claim that Amazon sprays its boxes with toxic pesticides that are harmful to cats. A spokesperson for the company told USA TODAY that Amazon packaging boxes are not sprayed with any pesticides or disinfectants. Interviews with veterinarians and people in the cardboard box industry also revealed no evidence of this claim.</p><p class=\"tr-npp-section-title\">Our fact-check sources:</p><ul class=\"bulleted-list arrowlist\"><li>USA TODAY, July 22, 2020, Amazon introduces boxes that can be recycled into cat condos, forts and other creations</li><li>Richard Rocha, Oct. 21, phone interview with USA TODAY</li><li>Brooke Lujano, Oct. 27, email exchange with USA TODAY</li><li>Amy Simpson, Oct. 27, email exchange with USA TODAY</li><li>Snopes, Dec. 30, 2020, Does Amazon Spray Boxes With Chemicals Dangerous to Pets?</li><li>Lead Stories, Dec. 30, 2020, Fact Check: Amazon Does NOT Spray Chemicals On Cardboard Shipping Boxes – Claims It Killed Pet Rats And Cats Unconfirmed</li><li>Ann Marie Zollo, Oct. 26, email exchange with USA TODAY</li> </ul><p><span>Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.</span> </p><p><span>Our fact-check work is supported in part by a grant from Facebook.</span> </p><p><span>This article originally appeared on USA TODAY: Fact check: Amazon does not spray its boxes with any pesticides, aren't dangerous for cats</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}