{"date": "2022-02-08 18:56:06.134000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_wms5yg9d&amp;referenceId=tag:reuters.com,2022:newsml_OVFXTK6TN_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_wms5yg9d&amp;referenceId=tag:reuters.com,2022:newsml_OVFXTK6TN_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Peloton will replace its chief executive and cut about 2,800 jobs, the company said on Tuesday. This report produced by Zachary Goelman.<br/>Short Link: <a href=\"https://refini.tv/3oxBf0k\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3oxBf0k</a><br/><br/>Video Transcript:<br/><br/>Peloton is replacing its CEO and slashing thousands of jobs, changes the exercise-bike-maker announced on Tuesday as it wrestles with weakening demand for its at-home fitness equipment. Co-founder John Foley will step down as CEO and will become the executive chair. The company named Barry McCarthy, a former CFO at Spotify and Netflix Inc, to take over starting Wednesday. The executive shuffle comes after Foley fought a board-room brawl with activist investor Blackwells Capital as Peloton struggled to maintain the meteoric growth it saw in 2020 and 2021. Shares have since tumbled nearly 80%. Blackwells pushed for Foleyâ\u0080\u0099s removal and even urged the company to sell itself. Last week, Reuters reported that Peloton has drawn interest from potential buyers including e-commerce giant Amazon.com. Peloton said it would also cut roughly 2,800 jobs, affecting 20% of its corporate positions. Shares of the company rose 10% in early trading on Tuesday.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}