{"date": "2021-09-30 06:02:42+00:00", "ticker": "III", "mrkt_info": {"open": 1272.5, "close": 1281.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><h4>\n      3i Infrastructure plc - Pre-close update\n    </h4><p><strong>Portfolio performing strongly; on track to meet dividend target, up 6.6% year-on-year</strong></p><p>\n      3i Infrastructure plc (\"3i Infrastructure\" or the \"Company\") is an investment company whose purpose is to invest responsibly in infrastructure, delivering long-term sustainable returns to shareholders and having a positive impact on our portfolio companies and their stakeholders. This statement relates to the period from 1 April 2021 to 29 September 2021 (the \"Period\").\n    </p><h4>\n      Highlights\n    </h4><ul class=\"bulleted-list arrowlist\"><li><strong>Portfolio performing strongly:</strong> Most portfolio companies have met or exceeded the expectations we set at March 2021.\n      </li><li><strong>Sale of Oystercatcher's four European terminals:</strong> Sale announced at an attractive uplift to carrying value, increasing Oystercatcher's unrealised money multiple to 2.8x and unrealised IRR to 13.5% over the Company's 14 year investment period.\n      </li><li><strong>DNS:NET investment:</strong> On 10 June 2021, 3i Infrastructure completed the acquisition of a 60% stake in DNS:NET for €182 million.\n      </li><li><strong>Income as expected in the Period:</strong> Total income and non-income cash was in line with expectations at £56 million in the Period. This compares with £48 million of income and non-income cash received in the same period last year.\n      </li><li><strong>FY22 dividend target:</strong> The Company is on track to deliver its dividend target for the year ending 31 March 2022 of 10.45 pence per share, a year-on-year increase of 6.6%.\n      </li><li><strong>Good level of liquidity:</strong> The Company's cash balance was £252 million at 29 September 2021.\n      </li></ul><p>\n      Phil White, Managing Partner and Head of Infrastructure, 3i Investments plc, Investment<br/>\n       Manager of the Company, commented: \"The key highlight during the Period was the sale of Oystercatcher's European terminals at an attractive price. We have also seen strong performance from the portfolio, which has met our income expectations. We are progressing several potential investment opportunities across our target markets and have ample liquidity available to invest, but pricing in sale processes remains high and we continue to be patient and disciplined in selecting the best opportunities to pursue.\"\n    </p><h4>\n      Portfolio update\n    </h4><p>\n      Overall the portfolio has performed well in the Period.\n    </p><p>\n      On 23 September 2021, the Company announced an agreement to sell its 45% stakes in four European liquid storage terminals to Evos who will also acquire the 55% stakes in the terminals held by co-shareholder Oiltanking GmbH (\"Oiltanking\"). Completion is expected at the end of October 2021. The proceeds from the transaction will be used to repay debt and related break costs of 3i Infrastructure's holding company, Oystercatcher. The balance of the proceeds, which is estimated not to exceed c.€50 million, will be distributed to the Company. The sale price achieved implies an increase in 3i Infrastructure's NAV of c. €110 million or c.10p per share, before any revision to the value of Oiltanking Singapore Limited.\n    </p><p>\n      On 10 June 2021, the Company invested €182m to acquire a 60% stake in DNS:NET and to provide additional funding for the future growth of the business. DNS:NET is a leading independent telecommunications provider in Germany growing a fibre-to-the-home network in Berlin and surrounding areas.\n    </p><p>\n      At Infinis and Attero, strong operational and financial performance in the Period was partially offset by lower expectations for future power prices and, for Attero, for future gate fees for incoming waste reflecting softer recent market conditions.\n    </p><p>\n      ESVAGT performed ahead of expectations in the Period as the oil price recovered to above pre-pandemic levels, benefiting its operations in the emergency rescue and response market. ESVAGT also took delivery of the second and third of three vessels to serve Vestas in maintaining offshore wind farms in the North Sea.\n    </p><p>\n      Ionisos's performance exceeded expectations in the Period driven by increasing end customer demand in the surgery, pharmaceutical and testing segments. This strong performance more than offset the effects of the closure of the Italian operations, as previously reported.\n    </p><p>\n      TCR outperformed our expectations even though the recovery in air traffic has been slower than anticipated, thanks to continued strong cost discipline and focus on cash management, while also seeing continued heightened interest for future growth from existing and new customers.\n    </p><p>\n      The performance of Joulz's infrastructure services and metering businesses was in line with expectations and we saw continued healthy growth in the order book. Joulz did experience some delays in completing new projects in infrastructure services and in its solar rooftop business, acquired earlier in the year, but these delays are expected to reduce over the second half.\n    </p><p>\n      Tampnet performed broadly in line with expectations and has appointed a new CEO, Elie Hanna who joined on 1 September 2021 from Ericsson. Elie is a Canadian citizen and holds a BEng in Telecommunications and an EMBA. We believe he will drive forward Tampnet in helping its customers in their digitalisation journey, increasing efficiency and identifying new revenue streams.\n    </p><p>\n      We also saw good performance from Valorem and the projects portfolio, while there was completion of a further divestment from the India Fund at an uplift to carrying value.\n    </p><p><span>Portfolio returns</span></p><p>\n      The portfolio is delivering a good level of income. Total income and non-income cash was £56 million in the Period, comprising income of £56 million and non-income cash of less than £1 million. This compares with £46 million of income and £2 million of non-income cash received in the same period last year.\n    </p><p>\n      As usual, an important element of the determination of the Company's results for the<br/>\n       half-year to 30 September 2021 will be the valuation exercise carried out on the investment portfolio at that date.\n    </p><p><span>Balance sheet</span></p><p>\n      At 29 September 2021, the Company's cash balance was £252 million. The full revolving credit facility of £300 million remains undrawn and is available to fund new investments.\n    </p><p>\n      £109 million of deferred proceeds (including accrued interest to date) from the sale of WIG in 2019 is due to be received in December 2021.\n    </p><p><strong><span>-ENDS-</span></strong></p><p><a href=\"https://www.3i-infrastructure.com/media/5421/h12022-pre-close.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download this press release</a></p><p>\n      For information, please contact:\n    </p><div class=\"story-table-container\"><table class=\"story-basic-table\"><tbody><tr><td><p>\n              Thomas Fodor\n            </p></td><td><p>\n              Shareholder enquiries\n            </p></td><td><p>\n              +44 20 7975 3469\n            </p></td></tr><tr><td><p>\n              Kathryn van der Kroft\n            </p></td><td><p>\n              Media enquiries\n            </p></td><td><p>\n              +44 20 7975 3021\n            </p></td></tr></tbody></table></div><p><span>About 3i Infrastructure plc</span></p><p>\n      3i Infrastructure plc is a Jersey-incorporated, closed-ended investment company, an approved UK Investment Trust, listed on the London Stock Exchange and regulated by the Jersey Financial Services Commission. The Company's purpose is to invest responsibly in infrastructure, delivering long-term sustainable returns to shareholders and having a positive impact on our portfolio companies and stakeholders.\n    </p><p>\n      3i Investments plc, a wholly-owned subsidiary of 3i Group plc, is authorised and regulated in the UK by the Financial Conduct Authority and is the investment manager of 3i Infrastructure plc.\n    </p><p><strong>This press release is not for distribution (directly or indirectly) in or to the United States, Canada, Australia or Japan and is not an offer of securities for sale in or into the United States, Canada, Australia or Japan. Securities may not be offered or sold in the United States absent registration under the U.S. Securities Act of 1933, as amended (the \"Securities Act\"), or an exemption from registration under the Securities Act. Any public offering to be made in the United States will be made by means of a prospectus that may be obtained from the issuer or selling security holder and will contain detailed information about 3i Group plc, 3i Infrastructure plc, 3i India Infrastructure Fund and management, as applicable, as well as financial statements. No public offering in the United States is currently contemplated.</strong></p><p><strong>This statement aims to give an indication of material events and transactions that have taken place in the period from 1 April 2021 to 29 September 2021 and their impact on the financial position of 3i Infrastructure plc. These indications reflect the Board's current view. They are subject to a number of risks and uncertainties and could change. Factors which could cause or contribute to such differences include, but are not limited to, general economic and market conditions and specific factors affecting the financial prospects or performance of individual investments within the portfolio of 3i Infrastructure plc.</strong></p><div id=\"public_attachments\"><p><strong>Attachments</strong></p><ul class=\"bulleted-list arrowlist\"><li><a href=\"https://www.3i-infrastructure.com/newsroom/press-releases/2021/3i-infrastructure-plc-pre-close-update-1/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a></li></ul></div><div id=\"public_disclaimer\"><p><strong>Disclaimer</strong></p><p><strong>3i Infrastructure plc</strong> published this content on <strong>30 September 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>30 September 2021 06:02:42 UTC</strong></p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - 3i Infrastructure plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: 3i-Infrastructure-plc</p></div>"}