{"date": "2021-11-20 19:59:38+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3676.57, "close": 3580.04}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds company comment, para 6,7</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LUCKNOW, India Nov 20 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Indian police said on Saturday they had charged senior executives of Amazon.com's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> local unit under narcotics laws in a case of alleged marijuana smuggling via the online retailer.</p><p>Police in the central Madhya Pradesh state arrested two men with 20 kg of <a href=\"https://www.reuters.com/world/india/india-police-question-amazon-executives-probe-over-marijuana-smuggling-2021-11-15\" data-type=\"url\" class=\"tr-link\" translate=\"no\">marijuana</a> on Nov. 14 and found they were using the Amazon India website to order and further smuggle the substance in the guise of stevia leaves, a natural sweetener, to other Indian states. </p><p>State police said in a statement that executive directors of Amazon India were being named as accused under the Narcotic Drugs and Psychotropic Substances Act due to differences in answers in documents provided by the company in response to police questions and facts unearthed by discussion. </p><p>    Police did not disclose how many executives were charged.</p><p>The police, who had previously summoned and spoken to Amazon executives in the case, estimate that about 1,000 kg of marijuana, worth roughly $148,000, was sold via Amazon.</p><p>Amazon said in a statement that it does not allow the listing and sale of legally prohibited products, adding that it takes strict action against sellers in case of any contravention.</p><p>\"The issue was notified to us and we are currently investigating it,\" Amazon said of the alleged marijuana smuggling.</p><p>Indian authorities have in recent years intensified their efforts to crack down on illicit drugs. Many high-profile Indian actors and TV personalities have been under scrutiny from narcotics officials since last year.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Saurabh Sharma<br/>Writing by Sankalp Phartiyal, Editing by William Maclean)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:sankalp.phartiyal@thomsonreuters.com\" data-type=\"email\" translate=\"no\">sankalp.phartiyal@thomsonreuters.com</a> ; +91-11-49548064; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-INDIA/ (UPDATE 1, PIX)</p></div>"}