{"date": "2021-11-23 14:00:00.812000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p>\n<b>CVG Airport Works With TaskWatch and AWS Panorama to Enhance Operations With Computer Vision Automation</b>\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nCVG is using computer vision, AI, and advanced technologies to manage capacity constraints while maintaining its commitment to customer service and brand reputation\n</li>\n</ul><ul class=\"bulleted-list arrowlist\">\n<li>\nTaskWatch enhances CVG with self-service capability to deploy custom computer vision applications in an ever-evolving business landscape.\n</li>\n</ul><p>\nCincinnati/Northern Kentucky International Airport (CVG) is working with TaskWatch and AWS Panorama to implement custom computer vision applications. After a successful pilot in 2020 where analytics were applied to video feeds and integrated into CVG’s existing TaskWatch wearable platform, the airport has now adopted TaskWatch for multiple operational areas for connected workers respond in real-time to events detected by computer vision.\n</p><p>\nTaskWatch captures existing video streams and detects events defined by airport operations leaders using AWS Panorama. Computer vision algorithms are then run on the edge computing device. Once TaskWatch identifies an event or an anomaly, the system triggers work processes for employees equipped with a TaskWatch wearable device to initiate the appropriate response.\n</p><p>\nTraditional work efforts at the airport have relied on visual cues and radio relays among specific team members leaving others potentially left out or the information misinterpreted. Computer vision automates the same process over multiple and simultaneous events, something that a widely dispersed team is challenged to do under the best of circumstances. Tracking to this level of detail helps ensure that service activities run smoothly, and passengers have the most up-to-date travel information.\n</p><p>\nWhen the airport was first designed, more than 80% of passengers were connecting through CVG. The remaining 20% of passengers came through the Terminal, or the airport’s “front door.” Now, approximately 95% of passengers start or end their travel through that same front door without major structural modifications. Even with a lower 2019 year-end passenger volume of 9.1 million, capacity through the same Terminal building, curbsides, and roadways handle more than 8.6 million passengers, nearly double the peak activity in the airport’s previous connection-hub days. Faced with limited infrastructure and the reality of not being able to build a new Terminal or add additional roadways, CVG has turned to advancing technologies to manage capacity constraints while maintaining its commitment to customer service and brand reputation.\n</p><p>\n<b>Chief Innovation Officer for CVG Brian Cobb explains:</b>\n</p><p>\n<span>“CVG Airport is committed to providing a world-class travel experience through continuous innovation and strategic partnerships. Using TaskWatch’s computer vision platform with AWS Panorama, we can bring computer vision to our existing IP cameras to automatically monitor congestion for more than 70,000 square feet of airport traffic lanes. Once TaskWatch detects an issue, such as a disabled vehicle, TaskWatch sends real-time alerts to airport staff so they can provide assistance, keep the traffic flowing, and reduce delays for our passengers.”</span>\n</p><p>\n<b>Speaking on behalf of Amazon Web Services, Kim Majerus, Vice President, US Public Sector Education, State &amp; Local Government, noted:</b>\n</p><p>\n“<span>Together, AWS and TaskWatch are providing self-service capability for CVG Airport to deploy custom computer vision (CV) applications. Instant response with CV event driven workflows on wearable devices is helping CVG mitigate risks and enhance operations.</span>”\n</p><p>\n<b>Vivek Saini, Operations Head and Co-founder at TaskWatch describes:</b>\n</p><p>\n<span>“With AWS Panorama and our new computer vision platform, TaskWatch is allowing non-technical enterprise customers to design, build, and deploy custom AI applications. TaskWatch also connects frontline workers to CV events so business risks are mitigated right away and there are enhanced operational efficiencies across business verticals.”</span>\n</p><p>\nUsing state-of-the-art technology, user-defined events, and identification of operational exceptions, TaskWatch is redefining the way CVG gains efficiencies through automation. Demonstration of successes and quick deployment of custom computer vision solutions have opened doors for additional business use cases with TaskWatch. Supported by the stability of the AWS Cloud and AWS Panorama hardware, TaskWatch can ensure that product delivery is reliable and scalable to meet future-defined needs. At CVG, TaskWatch is maximizing advancements between computer vision and artificial intelligence to minimize operational deficiencies and excel in customer experience.\n</p><p>\n<b>About Cincinnati/Northern Kentucky International Airport (CVG)</b>\n</p><p>\nCVG Airport welcomed more than 9.1 million passengers in 2019, serving a record number of local passengers. As the airport recovers from the COVID-19 pandemic, it still offers the most nonstop destinations and the lowest average airfares in the region. CVG is diversified in both passenger and cargo operations with an annual economic impact of $6.8 billion. It is the 7<sup>th</sup> largest cargo airport in North America – home to Amazon Air’s primary U.S. Hub and DHL Express Global Superhub. Learn more at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fcvgairport.com%2F&amp;esheet=52537885&amp;newsitemid=20211123005473&amp;lan=en-US&amp;anchor=CVGairport.com&amp;index=1&amp;md5=2e8bbb73b74f284e24e61c26c3a391b6\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CVGairport.com</a>.\n</p><p>\n<b>About TaskWatch</b>\n</p><p>\nTaskWatch is a Mason, Ohio based AI and process automation company that enables enterprise customers to design, build, and deploy custom computer vision applications and response workflows.\n</p><p>\nTaskWatch enables process automation on wearables through a zero-code cloud platform. Handsfree employees respond to business events identified on TaskWatch AI/Computer Vision backend, IoT Hub or 3rd party systems such as Robot control systems, ERP systems and even in-house IT systems. TaskWatch initiates collaborative workflows to enhance efficiency, mitigate risks and gain insights into operational details.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211123005473r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTIzMDA1NDczcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=880b524fc945060d387967043b5cffafe5726d29b9cbd83d124197f6719e5d827f13b1e5e3af23dfdc5af0b60723469930bbd4b7522f31c1bfc933f1dbc1bfb1\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211123005473/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211123005473/en/</a></span></p><p>\nMedia Inquiries please contact:\n<br/>Bharat Saini\n<br/><a href=\"mailto:pr@TaskWatch.com\" data-type=\"email\" translate=\"no\">pr@TaskWatch.com</a><br/>+1.513.258.2560\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: OH-TASKWATCH</p></div>"}