{"date": "2021-11-09 15:07:30.360000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Nov 09, 2021</p></div><div class=\"tr-npp-lead\"><p>It isn't just the new products or the deal with Meta Platforms <a href=\"https://www.zacks.com/stock/quote/FB\" data-type=\"url\" class=\"tr-link\" translate=\"no\">FB</a> at its Accelerated Data Center conference that makes Advanced Micro Devices <a href=\"https://www.zacks.com/stock/quote/AMD\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMD</a> stock interesting. It's more about what this kind of news tells us about the company and its superwoman CEO Lisa Su.</p><p>Today AMD looks very much like a company that is doing everything right to ensure continued growth for years to come. So although it's already extremely well positioned with its current technology, management continues to push the envelope on delivered performance.</p></div><div class=\"tr-npp-body\"><p>So on a single day, management could talk about brand new MI200 series accelerators for high performance computing (HPC) and artificial intelligence (AI) workloads; preview its Gen 3 EPYC processors; and offer additional information on its next-gen Zen 4 processor while announcing the Zen 4c (next) version for data centers.</p><p>Management's decision to double down on design while outsourcing production to the foundry with latest and greatest technology (in this case, Taiwan Semiconductor Manufacturing <a href=\"https://www.zacks.com/stock/quote/TSM\" data-type=\"url\" class=\"tr-link\" translate=\"no\">TSM</a> ), has proved more successful than anyone imagined.</p><p>Moreover, AMD's strategy has come to fruition at a time when the market is expanding very rapidly because of much broader semiconductor application across sectors, renewed strength in the traditional PC, data center, cloud and gaming, as well as strong demand coming from AI and machine learning. The pandemic also served to expand the market because operating flexibly from different locations has become much more acceptable, thus increasing the scope and scale of computing requirements.</p><p>Of all these, the PC market is the one likely to slow down or possibly flatten next year, coming off two years of stellar growth and still grappling with supply chain issues that could take a few quarters to iron out. But Lisa Su remains optimistic about AMD's prospects in this environment as well, because PC users are huge in number and growing, and also because of the possibility of taking further share from market leader Intel on the back of its superior technology.</p><p>Management expects to close the Xilinx <a href=\"https://www.zacks.com/stock/quote/XLNX\" data-type=\"url\" class=\"tr-link\" translate=\"no\">XLNX</a> acquisition by year-end, which will further improve its prospects.</p><p>Management strategy seems focused on matching the needs of the world's largest hyperscalers since these are the folks in need of the most compute power. The ability to satisfy them is a testament to the company's prowess. And that's why the Meta deal is so huge for AMD. Actual deployment could be gradual and take shape only as the company's metaverse concept comes into reality. But the fact that AMD was chosen is the really big deal.</p><p>And it comes on top of its existing engagements with Amazon's <a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> AWS, Microsoft's <a href=\"https://www.zacks.com/stock/quote/MSFT\" data-type=\"url\" class=\"tr-link\" translate=\"no\">MSFT</a> Azure and Alphabet's <a href=\"https://www.zacks.com/stock/quote/GOOGL\" data-type=\"url\" class=\"tr-link\" translate=\"no\">GOOGL</a> Google Cloud; its notebook wins at Acer, Asus, Dell, HP, Lenovo, etc., and of course its wins at Microsoft's Xbox and Sony's PS.</p><p>No wonder the company continues to increase guidance – it now expects revenues to increase 65% this year! However, cash flows are still much lower than most of the big tech companies, so it must continue to execute.</p><p>So the investment case in favor of AMD boils down to its industry-leading products, a conducive, fast-expanding market with scope for share gains, and a strategic acquisition that's about to close.</p><p>The case against is the valuation, which at 47.06X earnings is more than double the S&amp;P 500's 22.19X and higher than its own median level.</p><p>However, it's worth noting that analysts currently expect AMD's 2021 revenue and earnings to grow 65% and 105%, respectively that will be followed by a respective 18% and 24% growth in 2022. The industry is expected to grow earnings 27% this year and 21% in the next while the S&amp;P 500 is expected to grow 64% this year and just 10% in the next. So AMD's higher valuation seems be coming from its superior growth profile.</p><p>The strong growth prospects make this one of the few companies worth buying and holding for the long term, despite its lofty valuation. And that's why the shares carry a Zacks Rank #2 (Buy).</p><p><span><span>Year-to-Date Price Perrformance</span></span></p><p>Image Source: Zacks Investment Research</p><p><span>Infrastructure Stock Boom to Sweep America</span></p><p>A massive push to rebuild the crumbling U.S. infrastructure will soon be underway. It's bipartisan, urgent, and inevitable. Trillions will be spent. Fortunes will be made.</p><p>The only question is \"Will you get into the right stocks early when their growth potential is greatest?\"</p><p>Zacks has released a Special Report to help you do just that, and today it's free. Discover 7 special companies that look to gain the most from construction and repair to roads, bridges, and buildings, plus cargo hauling and energy transformation on an almost unimaginable scale.</p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/3b9f?add=1728&amp;adid=NEWSTEX_CONTENT_ZU_INFRASTRUCTUREREPORT_ANALYSTBLOG_215_IND_11092021&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1825792\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download FREE: How to Profit from Trillions on Spending for Infrastructure &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1825792\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1825792\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMD&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1825792\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Advanced Micro Devices, Inc. (AMD): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=MSFT&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1825792\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Microsoft Corporation (MSFT): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=XLNX&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1825792\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Xilinx, Inc. (XLNX): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZR_LINK&amp;d_alert=rd_final_rank&amp;t=TSM&amp;ADID=NEWSTEX_CONTENT_ZR_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1825792\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Taiwan Semiconductor Manufacturing Company Ltd. (TSM): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=FB&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1825792\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Meta Platforms Inc. (FB): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=GOOGL&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1825792\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alphabet Inc. (GOOGL): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/stock/news/1825792/amd-shares-are-very-expensive-but-should-you-ignore-the-opportunity?cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1825792\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p><a href=\"http://www.zacks.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Investment Research</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}