{"date": "2021-12-02 14:00:00.651000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Rivian Selects AWS as Its Preferred Cloud Provider to Drive Efficiency, Performance, and Refinement of Electric Vehicles</b>\n</p><p class=\"bwalignc\">\n<span>Automaker uses breadth of AWS capabilities to aid vehicle engineering and deliver connected services, over-the-air software updates, and fleet management solutions at scale</span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced that electric vehicle maker Rivian (NASDAQ: RIVN) has selected AWS as its preferred cloud provider, deepening the companies’ existing relationship. Across its enterprise, the automaker applies AWS capabilities in analytics, compute, containers, and machine learning to help streamline its business and improve the performance of its customers’ electric vehicles—for battery range, driving experience, and owner experience—while simultaneously innovating the technological foundations for customers’ electric vehicle fleet management and more efficient vehicle charging. Rivian applies these innovations across its vehicle lines, including custom-built electric delivery vans (EDVs) for Amazon.com. Through these developments, Rivian aims to accelerate the consumer and commercial shift to electric vehicles and make transportation cleaner and more sustainable in accordance with its goals under <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fsustainability.aboutamazon.com%2Fabout%2Fthe-climate-pledge&amp;esheet=52543120&amp;newsitemid=20211202005042&amp;lan=en-US&amp;anchor=The+Climate+Pledge&amp;index=1&amp;md5=51af381ac4f2fce30c3bfc739c1fde6d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Climate Pledge</a>.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211202005042/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211202005042/en/</a></p><div id=\"bwbodyimg\" style=\"width:480px;float:left;padding-left:0px;padding-right:20px;padding-top:0px;padding-bottom:0px\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Interior, 2022 Rivian R1T Launch Edition (Image: Rivian)\" src=\"https://mms.businesswire.com/media/20211202005042/en/931818/4/2022-Rivian-R1T-LE-03_-_Rivian_Image.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbXMuYnVzaW5lc3N3aXJlLmNvbS9tZWRpYS8yMDIxMTIwMjAwNTA0Mi9lbi85MzE4MTgvNC8yMDIyLVJpdmlhbi1SMVQtTEUtMDNfLV9SaXZpYW5fSW1hZ2UuanBn&amp;key=1362f28f5627be6389ae8db26c79d69808c24d4cd160120b93798d4f9672b7976587d13bce6f100c4e916f9596382c0b07da33698fd0a653a3cd6a52cd58e1b1\"/></div></div><p style=\"font-size:85%\">Interior, 2022 Rivian R1T Launch Edition (Image: Rivian)</p></div><p>\n“Rivian is focused on creating fantastic, category-defining products. Combining our vision with AWS’s breadth and depth of services allows us to use data and connectivity to redefine what is possible in transportation, logistics, and delivery,” said Wassym Bensaid, Rivian’s Vice President of Software Development. “At Rivian, we have created a software-defined vehicle architecture with a technology foundation that powers advanced features such as deep over-the-air software updates to deliver continuous improvements to the vehicles, and the collection of a rich set of real-time vehicle data. By leveraging AWS, and building a central data lake to interconnect Rivian’s operations, products, and services, we can enable proactive diagnostics and add intelligence to our vehicles, and then use what we learn to generate synergies and scale efficiencies. We look forward to furthering our work with AWS to continue to push the boundaries of innovation in engineering, customer service, fleet management solutions, and charging experiences.”\n</p><p>\nAWS powers Rivian’s software-defined vehicle (SDV) architecture and over-the-air software updates, in which new and improved functionality can be delivered remotely. SDV architecture treats the entire vehicle as a single, fully integrated system that is connected to the cloud to allow for remote diagnostics, predictive maintenance, and rapid testing and deployment of new software-powered capabilities to enhance customers’ enjoyment. Rivian uses Amazon Elastic Kubernetes Service (Amazon EKS) to manage and orchestrate software updates, and Amazon CloudFront (AWS’s content delivery network service) to allow deployment of updates at scale. Rivian plans to continuously improve features like infotainment options and fleet management resources over the lifetime of its vehicles. Rivian’s Battery Data Science Team also uses AWS Managed Services to scale its analytics capabilities and more rapidly gain insights from its research, development, and vehicle test fleet.\n</p><p>\n“AWS’s broad and deep portfolio of services helps Rivian use data and connectivity as strategic differentiators in the auto industry. Our analytics, machine learning, containers, and customer service capabilities support Rivian’s business model and will help it scale and continuously improve the customer experience as more and more individuals and organizations go electric,” said Werner Vogels, Vice President and Chief Technology Officer of Amazon.com, Inc. “Powered by the world’s leading cloud, Rivian is reimagining vehicle ownership, operation, and service to usher in a new experience of efficient and enjoyable electric SUVs, trucks, and vans that delight its customers.”\n</p><p>\nIn addition, Rivian uses AWS analytics, database, storage, and security capabilities to enhance visibility and agility throughout its vertically integrated business model, under which the company manages all of its design, production, distribution, sales, and vehicle servicing internally. Rivian built a data lake on Amazon Simple Storage Service (Amazon S3) and uses AWS Glue (a serverless data integration service that makes it easy to discover, prepare, and combine data for analytics, machine learning, and application development) so that its teams can easily share data and gain insights that it believes can lead to structural cost and operational advantages over traditional automakers with less integrated business functions.\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2F&amp;esheet=52543120&amp;newsitemid=20211202005042&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=2&amp;md5=2319067b1f8e040576817c25d588b14b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2F&amp;esheet=52543120&amp;newsitemid=20211202005042&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=3&amp;md5=d98608e89e464b57e10a892f28ac3e1c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p>\n<b>About Rivian</b>\n</p><p>\nRivian creates energy and transportation products and services with the goal of helping electrify the world. We design, develop, and manufacture category-defining electric vehicles and accessories and sell them directly to customers in the consumer and commercial markets. Rivian complements its vehicles with a full suite of proprietary, value-added services that address the entire lifecycle of the vehicle and deepen its customer relationships.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211202005042r1&amp;sid=ucdp3&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjAyMDA1MDQycjEmc2lkPXVjZHAzJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=dfa4b8010053aecd234ca222cae154825f0aec4376405277bdf21f12905a34e7d44ee09e9bb38ea9802fb80439323c7c2b7cea3d50f00b8e5b09b0b1c27b03b9\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211202005042/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211202005042/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52543120&amp;newsitemid=20211202005042&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=4&amp;md5=73c2b600490b1fd6af12bbb5358941c8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}