{"date": "2022-02-14 06:02:53.017000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p> <br/>   By Siddhi Nayak<br/>NewsRise<br/>   MUMBAI (Feb 14) -- India’s National Company Law Appellate Tribunal, or NCLAT, today adjourned to Feb. 25 a hearing in a case filed by Amazon challenging the antitrust watchdog’s revocation of the U.S. online retailer’s 2019 stake buy deal with Future Coupons.<br/><br/>The NCLAT bench was presided by Justice M. Venugopal.<br/><br/>Amazon has been locked in a long-drawn dispute with debt-ridden Future Group over the latter’s plan to sell the retail, wholesale, warehousing, and logistics businesses to billionaire Mukesh Ambani’s Reliance Industries in a deal worth $3.4 billion. <br/><br/>In 2019, Amazon had bought a 49% stake in Future Coupons, the group’s gift voucher unit, which owned a 7.3% stake in Future Retail, effectively giving the U.S. company a foothold in the flagship retailer.<br/><br/>The Competition Commission of India, in December, had suspended the deal, saying Amazon concealed information while filing for regulatory approval. Amazon had “suppressed the actual scope” of the deal and made “false and incorrect statements,” the anti-trust regulator said in its order. The CCI had also asked Amazon to re-file a detailed form within a period of 60 days.<br/><br/>At the hearing today, the counsel for Amazon said that the company seeks a stay on the CCI order since the time period of 60 days would expire this week.<br/><br/>“CCI has to understand that everything is delayed because of the delay in court proceedings,” Amazon’s counsel Gopal Subramaniam told the court today.<br/><br/>Meanwhile, Reliance Industries in 2020 agreed to buy the retail, wholesale, warehousing, and logistics businesses of Future Group. However, the deal has been delayed due to the dispute with Amazon. The dispute started after Amazon sought to block the Reliance deal by getting a freeze order from Singapore arbitration court, citing alleged violation of contractual agreements.<br/>   - By Siddhi Nayak; siddhi.nayak@newsrise.org; 91-22-61353307<br/>- Edited by Gourab Das<br/>- Send Feedback to feedback@NewsRise.org<br/>- Copyright (c) 2022 NewsRise Financial Research &amp; Information Services Pvt. Ltd.<br/>    </p></div>"}