{"date": "2021-12-21 10:00:00.211000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistcircle{list-style-type:circle;}.storyContent .bwmarginl1{margin-left:30px;}</style><p class=\"bwalignc\">\n<b>Amazon Announces Plans to Create 2,000 New Jobs at Austin Tech Hub</b>\n</p><p class=\"bwalignc\">\n<span>More than 1,000 corporate and tech roles are currently available at Amazon’s Austin offices. Those interested can apply at </span><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.jobs%2Fen%2Fsearch%3Foffset%3D0%26result_limit%3D10%26sort%3Drelevant%26city%255B%255D%3DAustin%26category_type%3DCorporate%26distanceType%3DMi%26radius%3D24km%26latitude%3D30.26759%26longitude%3D-97.74299%26loc_group_id%3D%26loc_query%3DAustin%252C%2520TX%252C%2520United%2520States%26base_query%3D%26city%3DAustin%26country%3DUSA%26region%3DTexas%26county%3DTravis%26query_options%3D%26&amp;esheet=52553987&amp;newsitemid=20211221005234&amp;lan=en-US&amp;anchor=amazon.jobs&amp;index=1&amp;md5=bb2202c3286b9287fa6ece236cb09ac7\"><span>amazon.jobs</span></a>\n</p><p>\nAmazon today announced plans to create more than 2,000 corporate and tech jobs in Austin, Texas, over the next few years, further expanding the company’s Austin Tech Hub. These new roles will support teams growing in Operations Technology, Amazon Retail, Amazon Business, and Amazon Web Services, and include positions such as senior data engineers, senior technical program managers, user experience designers, and financial analysts.\n</p><p>\n“Our continued investment in Austin is a testament to the amazing talent and amenities that this city has to offer,” said Doug Gray, site lead for Amazon’s Austin Tech Hub. “With more than 3,000 jobs already created and more than 1,000 corporate and technology roles currently available, we’re looking forward to continue offering exciting career opportunities to local residents.”\n</p><p>\nTo accommodate its growth in Austin, Amazon has signed on to lease 330,000 square feet of space at a new building developed by Cousins Properties at The Domain in Austin. The new office space is expected to open for employees in early 2024. Amazon currently has more than 3,000 tech and corporate employees working at its Austin Tech Hub. This latest investment will join Amazon’s three existing locations in Austin at The Domain, which provides access to local retail, restaurants, entertainment, and more.\n</p><p>\nAs part of its recruitment and hiring efforts, Amazon is constantly innovating and creating new programs to provide candidates of all backgrounds and levels of experience the opportunity to join the company. Two of the latest programs include:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fworkplace%2Famazons-returnship-program-helps-professionals-get-back-to-work&amp;esheet=52553987&amp;newsitemid=20211221005234&amp;lan=en-US&amp;anchor=Amazon+Returnship&amp;index=2&amp;md5=33a455c607acdea907c9ba4bbea40767\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Returnship</a>, an initiative to help professionals get back to work after they lost or left their jobs—including people displaced by the impacts of COVID-19. Through this 16-week paid initiative, Amazon is offering the program to people who have been without a job or underemployed for at least a year. The initiative provides them a new opportunity to rejoin the workforce by restarting their careers at Amazon. Candidates go through a customized and abbreviated interview process that takes into account their career trajectory. Once they start in their new role, they receive dedicated support and personalized coaching. During the program, returners work on a specific project and, after four months, have the possibility to move into full-time positions at Amazon.\n</li>\n<li>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fworkplace%2Fhow-amazon-is-simplifying-the-job-hunt&amp;esheet=52553987&amp;newsitemid=20211221005234&amp;lan=en-US&amp;anchor=Best+Fit&amp;index=3&amp;md5=b9deb6e683498e6508fd33cdd55a1747\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Best Fit</a>, a new program that allows software engineers to apply once and be considered for thousands of jobs across hundreds of teams within the company—including some roles they may not have even thought of.\n</li>\n</ul><p>\nThis investment at Amazon’s Austin Tech Hub is part of a multi-city expansion across the country and company. The company plans to create 3,000 jobs across Austin, Chicago, and Phoenix in the next few years. In the last 18 months, Amazon also announced expansions of its offices in Houston (150 new jobs) and Dallas (600 new jobs). Those interested in applying can learn more <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.jobs&amp;esheet=52553987&amp;newsitemid=20211221005234&amp;lan=en-US&amp;anchor=here&amp;index=4&amp;md5=50cde7104c0c4ef2e807ebd96aee6c89\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.\n</p><p>\n<b>Committed to Austin\n<br/></b>Beyond its efforts to create jobs, Amazon continues to provide support for organizations in the Austin community, including the Austin LGBT Chamber of Commerce, the Equality Texas Foundation, and the University of Texas through the university’s We Teach CS Conference. Amazon also worked with United Way and the City of Georgetown to donate relief supplies for those affected by winter storm Uri in February 2021. Additionally, Amazon has donated transportation services to deliver more than 80,000 meals to vulnerable groups across the Austin region through the Community Delivery program.\n</p><p>\nAmazon also supports local schools through <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazonfutureengineer.com%2F&amp;esheet=52553987&amp;newsitemid=20211221005234&amp;lan=en-US&amp;anchor=Amazon+Future+Engineer&amp;index=5&amp;md5=2465f42ec3ab8c6577ccd12ccf45f636\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Future Engineer</a>, a global computer science education program designed to inspire and educate millions of students each year to try computer science and coding. The program supports more than 20 schools across Austin, reaching almost 1,300 students with high-quality computer science curriculum, robotics clubs, and project-based learning.\n</p><p>\nSince 2010, Amazon has created more than 70,000 full- and part-time jobs in Texas and invested more than $29 billion across the state, including infrastructure from fulfillment centers, Whole Foods Market locations, and three tech hubs. These investments have contributed an additional $34 billion to the Texas economy and have supported 136,000 indirect jobs—in addition to the employees the company directly employs—from jobs in construction to positions in logistics and professional services. Currently, more than 112,000 independent authors and small and medium-sized businesses in Texas are growing their businesses with Amazon.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211221005234r1&amp;sid=ny6r1&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjIxMDA1MjM0cjEmc2lkPW55NnIxJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=844b90c1db6ed411f65b6c1b4de040d472ecdefb9e7a70c8d0d26b013da02398d54df2f68b25959f2d404a5deeb904b4d550060e417106093bd88cf61debfd91\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211221005234/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211221005234/en/</a></span></p><p>\n<b>Media inquiries:\n<br/></b>Zach Goldsztejn\n<br/><a href=\"mailto:amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">amazon-pr@amazon.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TX-AMAZON</p></div>"}