{"date": "2022-02-07 15:10:47.518000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MOTORSPORT GAMES INC (\"MSGM-Q\")\n- RFactor 2 Content Update and User Interface Refresh\n\n     Motorsport Games Inc. (\"Motorsport Games\"), a leading racing game\ndeveloper, publisher and esports ecosystem provider of official motorsport\nracing series throughout the world, announces today the release of the\nfirst rFactor 2 content update and user interface refresh of 2022. This\ncontent drop, set to continue quarterly, includes the addition of brand new\ntracks and car chassis from the world of motorsport. The refreshed UI\nprovides users an easy-to-navigate interface that contains all of the\noptionality necessary for players to create the most authentic driving\nexperience. To view the release trailer, please click here.\n\n     The quarterly content and UI updates within rFactor 2 will breathe new\nlife into the simulation platform on a regular basis, consistently\nproviding players with the most robust offering for their virtual racing\nneeds. Motorsport Games expects the updates to revamp and improve both the\nrFactor 2 platform and user experience. The team has already implemented\nrFactor 2 into its portfolio of live esports events, such as the 24 Hours\nof Le Mans Virtual Series and the recently-announced, inaugural\nINDYCAR-Motorsport Games Pro Challenge (kicking off February 9, 2022).\nMotorsport Games' commitment to continuously upgrading and improving the\noverall experience within rFactor 2 will allow the simulation to remain as\nthe top offering available to virtual SIM racers around the world.\n\n     \"Acquiring rFactor 2 was a massive enhancement to our product\nofferings, as we believe that it is truly the best-in-class simulation\nplatform on the market today,\" said Zach Griffin, Director of Technology at\nMotorsport Games. \"For the past year, we have not only sought to maintain\nrFactor 2's customary level of excellence, but iterate and push it further\nforward in content, user interface and overall capability. We give thanks\nto the Studio397 team for developing such a robust product and we look\nforward to releasing future highly requested quarterly content and UI\nupdates for our racers.\"\n\n\"I have used rFactor 2 a tremendous amount to properly prepare for my real\nlife races, as no other simulation provides the same level of authenticity\nand feel,\" said Fernando Alonso, current Alpine Formula One driver, 2-time\nF1 World Drivers' Champion, 2-time 24 Hours of Le Mans Champion and former\nKarting World Champion. \"It is of the utmost importance that drivers feel\nready to take on challenging circuits and the demands of specific cars and\nrFactor 2 gives me the tools to be completely comfortable behind the wheel\nat any track. It has and will continue to be an invaluable resource during\nmy career.\"\n\n     Content additions include the INDYCAR IR-18, the BMW M4 for the GT3\nclass, the Ligier JS P320 for the LMP3 roster and the iconic Daytona\nInternational Speedway, both the oval and road courses. INDYCAR's IR-18\naddition to rFactor 2 is the latest in a line of additions to replicate as\nmany forms of motorsport as possible within the platform, with the\nINDYCAR-Motorsport Games Pro Challenge providing a showcase event. These\ncars will give users three highly requested and immensely popular options\nto race in. Lastly, the implementation of the Daytona International\nSpeedway brings to life the premium endurance racing circuit in the U.S. to\nrFactor 2, allowing racers to achieve glory at one of the most historic\nvenues in the entire world of motorsport. The track is entirely laser\nscanned to include as much detail as possible and the IR-18 features both\nPush to Pass and Weight Jacker.\n\n\"In my first year competing in INDYCAR, I learned quite quickly how\ndemanding and tough the cars, competition and circuits are,\" said Romain\nGrosjean, current Andretti Autosport driver in the NTT INDYCAR Series and\nformer Haas and Lotus Formula One driver. \"Having come directly from\nFormula One, where there are no oval circuits and the cars are quite\ndifferent, without the time I spent training with rFactor 2, I would not\nhave been able to achieve the level of success or familiarity I did last\nseason. With another full year of racing coming up and new goals in sight,\nI cannot wait to test myself on rFactor 2 and be ahead of the competition\nas a result of its many offerings that are applicable to our real world\nracing experiences.\"\n\n\"I have always been a massive fan of rFactor 2 and I am thrilled with the\nadditions the team continues to make to ensure it stays as the pinnacle of\nracing simulations,\" said Juan Pablo Montoya, current DragonSpeed driver in\nthe IMSA WeatherTech SportsCar Championship and former winner of\nprestigious races such as the Monaco Grand Prix, Indianapolis 500 and 24\nHours of Daytona. \"As someone who has competed in so many different series\nof motorsport throughout my career, it's incredible to see each form\nauthentically replicated within the virtual world. rFactor 2 and its team\nof developers continue to outdo themselves.\"\n\n     All content additions and user interface upgrades are currently live\nwithin rFactor 2 starting today. Players can find a full breakdown of\nfeatures here. The quarterly release cycle will proceed with content and\nbuild updates throughout 2022, with tentative release dates set for May,\nAugust and November of 2022.\n\n     To keep up with the latest Motorsport Game news visit\nwww.motorsportgames.com and follow on Twitter, Instagram, Facebook and\nLinkedIn.\n\n     About Motorsport Games:\nMotorsport Games, a Motorsport Network company, combines innovative and\nengaging video games with exciting esports competitions and content for\nracing fans and gamers around the globe. The Company is the officially\nlicensed video game developer and publisher for iconic motorsport racing\nseries across PC, PlayStation, Xbox, Nintendo Switch and mobile, including\nNASCAR, INDYCAR, 24 Hours of Le Mans and the British Touring Car\nChampionship (\"BTCC\"). Motorsport Games is an award-winning esports partner\nof choice for 24 Hours of Le Mans, Formula E, BTCC, the FIA World\nRallycross Championship and the eNASCAR Heat Pro League, among others.\n\n     Forward-Looking Statements:\nCertain statements in this press release which are not historical facts are\nforward-looking statements within the meaning of Section 27A of the\nSecurities Act of 1933, as amended, and Section 21E of the Securities\nExchange Act of 1934, as amended, and are provided pursuant to the safe\nharbor provisions of the Private Securities Litigation Reform Act of 1995.\nAny statements in this press release that are not statements of historical\nfact may be deemed forward-looking statements. Words such as \"continue,\"\n\"will,\" \"may,\" \"could,\" \"should,\" \"expect,\" \"expected,\" \"plans,\" \"intend,\"\n\"anticipate,\" \"believe,\" \"estimate,\" \"predict,\" \"potential,\" and similar\nexpressions are intended to identify such forward-looking statements. These\nforward-looking statements include, but are not limited to, statements\nconcerning: (i) the expected benefits, content and features from rFactor 2\nupdates and user interfaces and from the rFactor 2 platform; and (ii) the\nCompany's expected timing of releasing future updates and user interfaces\nto rFactor 2, including, without limitation, the Company's plans to release\nquarterly updates in the future. All forward-looking statements involve\nsignificant risks and uncertainties that could cause actual results to\ndiffer materially from those expressed or implied in the forward-looking\nstatements, many of which are generally outside the control of Motorsport\nGames and are difficult to predict. Examples of such risks and\nuncertainties include, but are not limited to the Company experiencing\ndifficulties and/or delays in releasing future rFactor 2 updates and\ninterfaces and/or enhancing the quality of its product offerings that could\nnegatively impact its future development plans, such as due to higher than\nanticipated costs incurred in developing, launching and continuing to\nenhance and improve such products and/or less than anticipated consumer\nacceptance of the Company's products and/or difficulties, delays in or\nunanticipated events that may impact the timing and scope of new updates\nand user interfaces, such as due to delays and higher than anticipated\nexpenses related to the ongoing and prolonged COVID-19 pandemic and related\neconomic lockdowns and government mandates; unanticipated operating costs,\ntransaction costs and actual or contingent liabilities; adverse effects of\nincreased competition; and unanticipated changes in consumer behavior,\nincluding as a result of general economic factors, such as increased\ninflation. Factors other than those referred to above could also cause\nMotorsport Games' results to differ materially from expected results. All\nforward-looking statements involve significant risks and uncertainties that\ncould cause actual results to differ materially from those expressed or\nimplied in the forward-looking statements, many of which are generally\noutside the control of Motorsport Games and are difficult to predict.\nFactors other than those referred to above could also cause Motorsport\nGames' results to differ materially from expected results. Additional\nfactors that could cause actual results to differ materially from those\nexpressed or implied in the forward-looking statements can be found in\nMotorsport Games' filings with the SEC, which may be found at www.sec.gov\nand at ir.motorsportgames.com, including its Annual Report on Form 10-K for\nthe fiscal year ended December 31, 2020, its Quarterly Reports on Form 10-Q\nfiled with the SEC during 2021, as well as in its subsequent filings with\nthe SEC. Motorsport Games anticipates that subsequent events and\ndevelopments may cause its plans, intentions and expectations to change.\nMotorsport Games assumes no obligation, and it specifically disclaims any\nintention or obligation, to update any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nexpressly required by law. Forward-looking statements speak only as of the\ndate they are made and should not be relied upon as representing Motorsport\nGames' plans and expectations as of any subsequent date. Additionally, the\nbusiness and financial materials and any other statement or disclosure on,\nor made available through, Motorsport Games' website or other websites\nreferenced or linked to this press release shall not be incorporated by\nreference into this press release.\n\n     Website and Social Media Disclosure:\n\n     Investors and others should note that we announce material financial\ninformation to our investors using our investor relations website\n(ir.motorsportgames.com), SEC filings, press releases, public conference\ncalls and webcasts. We use these channels, as well as social media and\nblogs, to communicate with our investors and the public about our company\nand our products. It is possible that the information we post on our\nwebsites, social media and blogs could be deemed to be material\ninformation. Therefore, we encourage investors, the media and others\ninterested in our company to review the information we post on the\nwebsites, social media channels and blogs, including the following (which\nlist we will update from time to time on our investor relations website):\n\n//st\n\n         Websites              Social Media\n\n         motorsportgames.com   Twitter: @msportgames &amp; @traxiongg\n\n         traxion.gg            Instagram: msportgames &amp; traxiongg\n\n         motorsport.com        Facebook: Motorsport Games &amp; traxiongg\n\n                               LinkedIn: Motorsport Games\n\n                               Twitch: traxiongg\n\n                               Reddit: traxiongg\n\n//et\n\n     The contents of these websites and social media channels are not part\nof, nor will they be incorporated by reference into, this press release.\n\n     Investors:\nAshley DeSimone\nAshley.Desimone@icrinc.com\n\n     Press:\nASTRSK PR\nmotorsportgames@astrskpr.com\n     A video accompanying this announcement is available at\n\n<a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/146f2d56-c4c3-4bac-87b9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globenewswire.com/NewsRoom/AttachmentNg/146f2d56-c4c3-4bac-87b9</a>\n-173ecd612abf\n\nTel   : 305-507-8799    MOTORSPORT GAMES INC\nEmail : investors@motorsportgames.com\nWWW   : <a href=\"https://www.motorsportgames.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.motorsportgames.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203700480.MNPRE2203701549-06244020220207</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}