{"date": "2022-01-20 14:10:54.279000+00:00", "ticker": "AVV", "mrkt_info": {"open": 2930.0, "close": 3058.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">INDIVA LAUNCHES NEW CANNABIS EDIBLE DESIGNED FOR MICRODOSING</p>\n<p>LONDON, ON, Feb. 24, 2022</p>\n<p>\n<span>From <span>Canada's</span> number one producer of edibles, Jewels Cannabis Tarts offer a convenient microdose option made with real fruit.</span>\n</p>\n<p>\n<span>LONDON, ON</span> , <span>Feb. 24, 2022</span> /CNW/ - Indiva Limited (the \" <span>Company</span> \" or \" <span>Indiva</span> \") (TSXV: NDVA) (OTCQX: NDVAF), <span>Canada's</span> number one producer of cannabis edibles and other cannabis products, is chewing further into the edible market with the launch of its newest product, Jewels Cannabis Tarts (\"Jewels\").</p>\n<p>\n\n</p>\n<p>Each package of Jewels contains 10 tarts bursting with fresh, berry flavour. At 1 mg of THC per tart, Jewels Cannabis Tarts are ideal for cannabis consumers looking for a tasty, portable, microdosing option. Jewels are vegan and gluten-free, using no artificial flavours.</p>\n<p>Launched in <span>Ontario</span> on <span>January 25</span>\n<span>th</span> , Indiva plans to launch Jewels in provincial retail stores in <span>British Columbia</span> at the end of March, and <span>Alberta</span> in April, subject to applicable provincial approvals.</p>\n<p>\"Indiva has become synonymous with creating, selling, and marketing products that are not only innovative, but are also suited to individual dosing needs and we are thrilled to offer Jewels Cannabis Tarts as the low dose, portable cannabis option for Canadians,\" says <span>Leah Thiel</span> , VP Marketing, Indiva. \"The discreet consumption, simple ingredients, and convenient format will resonate with cannabis consumers who are looking for a non-oil microdosing product that is easy to consume and doesn't require additional accessories.\"</p>\n<p>Jewels Cannabis Tarts are available in two unique flavours: Raspberry 1:1 CBD/THC and Strawberry THC. Jewels Raspberry 1:1 Cannabis Tarts are made with real raspberries for a fresh, berry flavour and contain 1 mg THC and 1 mg CBD. Jewels Strawberry Cannabis Tarts are bursting with fresh, fruity flavour, made with real strawberries and 1 mg THC per tart.</p>\n<p>\n<span>About Indiva</span>\n</p>\n<p>Indiva sets the standard for quality and innovation in cannabis. As a Canadian licensed producer, Indiva produces and distributes award-winning cannabis products including Grön™ Pips and Pearls, Bhang® Chocolate, Wana™ Sour Gummies, Slow Ride Bakery Cookies, Jewels Cannabis Tarts, Ruby® Cannabis Sugar, Sapphire™ Cannabis Salt, as well as capsules, pre-rolls, and premium flower under the INDIVA and Artisan Batch brands. Click here to connect with Indiva on <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453860-1&amp;h=919639992&amp;u=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Findivalife%2F&amp;a=LinkedIn\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a>\n</span> , <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453860-1&amp;h=297686678&amp;u=https%3A%2F%2Fwww.instagram.com%2Findivainc%2F&amp;a=Instagram\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Instagram</a>\n</span> , <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453860-1&amp;h=1003965603&amp;u=https%3A%2F%2Ftwitter.com%2Findivalife&amp;a=Twitter\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a>\n</span> and <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453860-1&amp;h=3592995086&amp;u=https%3A%2F%2Fwww.facebook.com%2FIndivaInc&amp;a=Facebook\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Facebook</a>\n</span> , and <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453860-1&amp;h=2924439219&amp;u=https%3A%2F%2Fwww.indiva.com%2F&amp;a=here+to+find+more+information+on+the+Company+and+its+products\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here to find more information on the Company and its products</a>\n</span> .</p>\n<p>\n<span>DISCLAIMER AND READER ADVISORY</span>\n</p>\n<p>\n<span>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) has in any way passed upon the merits of the contents of this press release and neither of the foregoing entities accepts responsibility for the adequacy or accuracy of this release or has in any way approved or disapproved of the contents of this press release.</span>\n</p>\n<p>\n<span>Certain statements contained in this press release constitute forward-looking information. These statements relate to future events or future performance. The use of any of the words \"could\", \"intend\", \"expect\", \"believe\", \"will\", \"projected\", \"estimated\" and similar expressions and statements relating to matters that are not historical facts are intended to identify forward-looking information and are based on the parties' current belief or assumptions as to the outcome and timing of such future events. Actual future results may differ materially. In particular, this release contains forward-looking information relating to the Company's future operations, future results, future product offerings and compliance with applicable regulations. Various assumptions or factors are typically applied in drawing conclusions or making the forecasts or projections set out in forward-looking information. Those assumptions and factors are based on information currently available to the parties. The material factors and assumptions include the parties being able to maintain the necessary regulatory and other third parties' approvals and licensing and other risks associated with regulated entities in the cannabis industry, future sales, the demand for the Company's products and cannabis products generally and the continued operations of the Company in the ordinary course. The forward-looking information contained in this release is made as of the date hereof and the parties are not obligated to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, except as required by applicable securities laws. Because of the risks, uncertainties and assumptions contained herein, investors should not place undue reliance on forward looking information. The foregoing statements expressly qualify any forward-looking information contained herein.</span>\n</p>\n<p>\n<span>MEDIA CONTACT</span> : Meena Nowrattan, Email: <a href=\"mailto:meena@bubblegumcanada.com\" data-type=\"email\" translate=\"no\">meena@bubblegumcanada.com</a>\n<span>INVESTOR CONTACT</span> : <span>Anthony Simone</span> , Email: <a href=\"mailto:ir@indiva.com\" data-type=\"email\" translate=\"no\">ir@indiva.com</a> , Phone: 416.881.5154</p>\n<p>\n\n</p>\n<p>SOURCE Indiva Limited</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/24/c2004.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/24/c2004.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}