{"date": "2022-01-14 19:52:32.494000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3224.28, "close": 3178.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>If you've had your eyes on the newest generation of Apple AirPods, you are not going to want to miss this steal on Amazon.</p></div><div class=\"tr-npp-body\"><p><span><span>Start off the New Year with deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Right now, Amazon has marked down the third-generation Apple AirPods from $179 to $139.99—the best price we've seen on this model.</p><p>When Reviewed managing editor Ryan Waniata tested the third-generation model, he found them to have a \"more convenient and stylish design, better controls, improved (if still limited) sound quality with Spatial Audio and more competitive battery life\" than previous AirPod models. He also noted that the Pods give you access to features that were once exclusively available for the AirPods Pro, such as spatial audio with dynamic head tracking (the feeling of surround sound) and Adaptive EQ, where the sound is adjusted based on how the ear cushions fit your ear.</p><p>We've seen both AirPods and AirPods Pro sell out quick when they're marked down, so we're expecting this deal to go just as fast—if you're in the market for new earbuds, we suggest you shop now. </p><p class=\"tr-npp-section-title\">Get Apple AirPods (3rd Generation) at Amazon for $139.99 (Save $39.01).</p><p><span><span>There's more where this deal came from.</span>  Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Apple AirPods are on sale now at Amazon for the lowest price we've ever seen</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}