{"date": "2021-12-12 20:52:11.997000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">The agonizing wait for answers continues at a Kentucky candle factory where searchers are combing through wreckage after a tornado struck</p><p class=\"tr-npp-section-title\">Iran appears to be preparing for a space launch as negotiations continue in Vienna over its tattered nuclear deal with world powers</p><p class=\"tr-npp-section-title\">Veteran anchor Chris Wallace has left Fox News after 18 years for CNN</p><p class=\"tr-npp-section-title\">Inflation is painfully high, but this hopefully is close to as bad as it gets</p><p class=\"tr-npp-section-title\">A coalition of California restaurants and grocery stores has filed a lawsuit to block implementation of a new farm animal welfare law</p><p class=\"tr-npp-section-title\">Search efforts at an Amazon facility in Illinois where at least six people were killed in a tornado are expected to take several days</p><p class=\"tr-npp-section-title\">A photo from a tornado-damaged home in Kentucky landed almost 130 miles away in Indiana</p><p class=\"tr-npp-section-title\">Autumn Kirks and her boyfriend, Lannis Ward, were both working the night shift at a candle factory in Mayfield, Kentucky, when a massive tornado struck</p><p class=\"tr-npp-section-title\">Prime Minister Boris Johnson says that Britain faces a \"tidal wave\" of infections from the omicron coronavirus variant and he has announced a huge increase in booster vaccinations to strengthen defenses against it</p><p class=\"tr-npp-section-title\">Vicente Fernández, a beloved Mexican singer who was awarded three Grammys and nine Latin Grammys and inspired a new generation of performers, including his son Alejandro Fernández, has died</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The Associated Press.  All rights reserved. This material may not be published, broadcast, rewritten or redistributed.</p></div>"}