{"date": "2021-11-30 20:41:47.788000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>EAT WELL INVESTMENT GROUP INC. (\"EWG-Z\")\n- Amara's Toddler Line is the #1 New Release on Amazon\n\nEat Well Group Announces Amaras Toddler Line is the #1 New Release on\nAmazon\n\nAmara is proud to have #1 new release on Amazon, including 5x revenue\ngrowth since January and up to a 3x ROAS on the platform\n\nEat Well Investment Group Inc. (the Company or Eat Well Group or EWG)\nis pleased to announce that its majority-owned subsidiary, Amara Organic\nFoods (Amara), one of the fastest-growing baby food brands in America,\nhas been named #1 new release on Amazon for its toddler line. Amara has\ngrown its revenue 5x since January 2021.\n\nThis press release features multimedia. View the full release here:\n<a href=\"https://www.businesswire.com/news/home/20211130005496/en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005496/en</a>/\nAmara Organic Baby Food \n\nAmara Organic Baby Food \nWe are incredibly excited that Amara has achieved a number 1 new release\non Amazon, the top eCommerce platform in the world, commented Marc Aneed,\nthe Companys President. More and more consumers are searching for\nhealthier alternatives to legacy baby and food brands and the traction\nAmaras dedicated store on Amazon has shown so quickly after launching it,\naffirms that.\n\neCommerce and Amazon\n\nAmara has partnered with Pharmapacks, one of the largest eCommerce\ndistributors for health, beauty and wellness brands on popular online\nmarketplaces that include Amazon, Walmart, eBay, Target and Google\nShopping. Pharmapacks is an early investor in Amara and will be a key\ncontributor to its continued growth across Amazon and other leading\neCommerce marketplaces.\n\nThe strategic partnership with Pharmapacks allows Amara to reach their\ntarget customer efficiently. In October, Amara provided over 7,000 samples\nto consumers, which data indicated likely to have children at home,\nresulting in a 128% increase in sales of the baby food flavour included in\nthe sample packs.\n\nSince launching its dedicated store page on Amazon, Amara sales have\nincreased by 533%, with a return on ad spend (ROAS) of up to 3x.\n\nThe Amara team is focused on driving new to brand consumers as currently\n82% of sales are currently being driven by Amara branded search terms, a\ntestament to the brands organic reach. The next 12 to 18-month strategy is\nto reach, acquire, and retain more new to brand customers in their\njourney from baby food to toddler snacks and beyond.\n\nWith a strong foundation in place, Amara is currently improving and\noptimizing its website with a major focus over the next 12 to 18 months on\nbringing additional new to brand consumers to the platform.\n\nBrick and Mortar Distribution\n\nAmara boasts a strong foundational retail footprint with distribution to\nsome of North Americas leading big-box retailers, including; Walmart,\nWhole Foods, Sprouts Farmers Market and more. Amara is focused on\naccelerating its omnichannel sales distribution strategy and continued\ngrowth across natural health food stores and traditional big-box retailers.\nEat Well Groups management believes Amaras growth can in part be\nattributed to a broader macro trend from consumers seeking healthier, more\nnutritious alternatives to everyday products that have less sugar and\npreservatives.\n\nPackaged foods found on grocery shelves today are often fruit-based and\nhigh in sugar, and according to internal research, they are sold for\napproximately $3.00 to $7.00 per meal, which also have to be kept cold or\nfrozen. Amaras proprietary technology allows parents to obtain the\nbenefits of fresh food with the convenience of shelf-stable. By contrast to\nthe higher-priced new entrants in the baby food market, Amaras baby food\nmeals start as low as $1.79 per meal and are shelf-stable.\n\nAmara believes that eating well doesnt just build healthier bodies but\nhealthier brains too. Amaras mission is to create better products from\nbaby food to toddler snacks and beyond. By leveraging technology and\nscience to make healthy and convenient foods possible for the modern-day\nparent, Amara can set kids on the right path from a young age; so future\ngenerations live better, feel better, and think better for the rest of\ntheir lives.\n\nAmara currently has 13 SKUs across its baby food and toddler food product\nlines, with a new product line planned in 2022.\n\nKey New Hires\n\nAmara has made several strategic hires in the past 60 days to help\nfacilitate its continued growth, these hires include a Data and Logistics\nCoordinator and two additional content creators with strong experience in\nthe baby and kids space. Amara is currently hiring and expects to continue\nexpanding its core team in the next 60 days.\n\nAmara is also onboarding a new inventory management system that will\nstreamline logistics and drive product efficiency as it continues to grow\nand scale with their partners and suppliers.\n\nThe focus on healthier, more nutritional dense products started as a\nmovement in natural retailers but has now spread rapidly to larger, more\nconventional retailers driving significant momentum in our business,\ncommented Jessica Sturzenegger, Amaras Founder and CEO. We believe that\nif were going to develop a household name and change the way our future\ngenerations eat, think and perform, it has to be at a price point\naccessible for every family. We are proud to offer nutrient dense baby food\nmeals for as low as $1.79 per meal.\n\nTo learn more, join Eat Well Groups mailing list for important updates.\n\nABOUT EAT WELL GROUP\n\nEat Well Group is a publicly-traded investment company primarily focused on\nhigh-growth companies in the agribusiness, food tech, plant-based and ESG\n(environmental, social and governance) sectors. Eat Well Groups management\nteam has an extensive record of sourcing, financing and building successful\ncompanies across a broad range of industries and maintains a current\ninvestment mandate on the health/wellness industry. The team has financed\nand invested in early-stage venture companies for greater than 25 years,\nresulting in unparalleled access to deal flow and the ability to construct\na portfolio of opportunistic investments intended to generate superior\nrisk-adjusted returns.\n\nDisclaimer for Forward Looking Statements\n\nThis news release contains forward-looking information and\nforward-looking statements within the meaning of applicable Canadian and\nUnited States securities laws (collectively, forward-looking\ninformation). Forward-looking information are often, but not always,\nidentified by the use of words such as seek, anticipate, believe,\nplan, estimate, expect, likely and intend and statements that an\nevent or result may, will, should, could or might occur or be\nachieved and other similar expressions. Forward-looking information in this\nnews release includes, without limitation, statements relating to future\ndemand for Amaras products, staffing matters and the strategic direction\nof Amara. Forward-looking information is based on assumptions that may\nprove to be incorrect, including but not limited to the ability of the\nCompany to execute its business plan. The Company considers these\nassumptions to be reasonable in the circumstances. However, forward-looking\ninformation is subject to business and economic risks and uncertainties and\nother factors that could cause actual results of operations to differ\nmaterially from those expressed or implied in the forward-looking\ninformation. Such risks include, without limitation: the ability of Amara\nto realize the expected benefits and synergies of investments; unexpected\ndisruptions to the operations and businesses of the Company and investee\nentities as a result of the COVID-19 global pandemic or other disease\noutbreaks including a resurgence in the cases of COVID-19; the ability of\nthe Company and Amara to comply with applicable government regulations in a\nregulated industry; any change in accounting practices or treatment\naffecting the consolidation of financial results adverse market conditions;\nthe inherent uncertainty of production and cost estimates and the potential\nfor unexpected costs and expenses; costs of inputs; crop failures;\nlitigation; currency fluctuations; competition; availability of capital and\nfinancing on acceptable terms; industry consolidation; loss of key\nmanagement and/or employees; and other risks detailed herein and from time\nto time in the filings made by the Company with securities regulators. For\nmore information on the Company, its investee companies (including Amara)\nand the risks and challenges of their businesses, investors should review\ntheir annual filings that are available at www.sedar.com.\n\nThe Canadian Securities Exchange has neither approved nor disapproved the\ninformation contained herein and does not accept responsibility for the\nadequacy or accuracy of this news release.\n\nEat Well Investment Group Inc.\nMarc Aneed, President\nir@eatwellgroup.com\nwww.eatwellgroup.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300587.MNPRE2133303139-12180020211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}