{"date": "2022-01-31 20:59:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Cassandra Garrison</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MEXICO CITY, Jan 31 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Mexican broadcast powerhouse Grupo Televisa <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TLEVISACPO.MX\" data-type=\"ric\" data-ric=\"TLEVISACPO.MX\" translate=\"no\" dir=\"ltr\">TLEVISACPO.MX</a> and U.S. based Univision <a href=\"reuters://REALTIME/verb=Headlines/ric=UVN.UL\" data-type=\"newsExpression\" data-expression=\"UVN.UL\" translate=\"no\" dir=\"ltr\">UVN.UL</a> are preparing to launch what would be the biggest Spanish-language streaming platform in the world <span class=\"tr-strong\">in the first half of 2022 </span>after sealing a joint venture deal on Monday, the head of Televisa told Reuters.</p><p>The new firm, TelevisaUnivision, will combine content from both broadcasters to target the global Spanish-speaking audience of nearly 600 million people. </p><p>An advertising-based version of the streaming platform will roll out in the first half and a subscription-based product will launch in the second half, Televisa Co-Chief Executive Alfonso de Angoitia <span class=\"tr-strong\">said</span> in an interview. </p><p>The yet-to-be named streaming platform enters a crowded field of heavyweight competitors including Amazon.com Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> Prime, Walt Disney Co's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DIS.N\" data-type=\"ric\" data-ric=\"DIS.N\" translate=\"no\" dir=\"ltr\">DIS.N</a> Plus and Netflix Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NFLX.O\" data-type=\"ric\" data-ric=\"NFLX.O\" translate=\"no\" dir=\"ltr\">NFLX.O</a>, which last year announced it would spend $300 million on original Mexican productions.</p><p>De Angoitia, who will be executive chairman of the TelevisaUnivision board, insisted the platform could break away from the pack, pointing to Televisa's massive content library and broadcast rights for sports. </p><p>\"We will be a fierce competitor,\" he said, adding that at least one \"high quality\" new movie or series will drop every week on the subscription service in the first year. </p><p>Customers in Mexico and the United States will simultaneously have first access to the platform before it rolls out in other Latin American countries and Spain. </p><p>A sort of turf war got underway after news of the TelevisaUnivision plan went public in April. Televisa snatched away executives from Netflix, Disney Plus and others. Competitors rushed to poach top stars, leading Televisa to make its contracts with talent more competitive and exclusive, De Angoitia said. </p><p>U.S. singer and actor Selena Gomez, Peruvian writer Mario Vargas Llosa, Spanish author Maria Duenas and Mexican comedian Eugenio Derbez are among those working on productions for the platform. </p><p>The new firm will generate enough free cash flow to invest hundreds of millions of dollars in more content, De Angoitia said.</p><p>The finalization of the TelevisaUnivision deal comes on the heels of a tumultuous week in Mexico's telecoms sector. A highly anticipated vote by the country's Federal Telecommunications Institute left America Movil, the country's largest telecoms company, without a coveted license to enter the country's pay TV sector, a prospect that had rattled competitors including Televisa, the current industry leader. </p><p>\"In the telecommunications sector, we have not seen effective competition yet.... it's not the right time to grant that change to America Movil,\" De Angoitia said, adding that the IFT \"could do more\" to regulate competition.</p><p>A pay TV entrance by America Movil, already dominant in mobile and internet services, would make it \"increasingly difficult to compete,\" De Angoitia said.</p><p>The TelevisaUnivision deal is partially financed by a $1 billion Series C preferred investment led by the SoftBank <a href=\"reuters://REALTIME/Verb=FullQuote/ric=9984.T\" data-type=\"ric\" data-ric=\"9984.T\" translate=\"no\" dir=\"ltr\">9984.T</a> Latin American Fund, with participation from ForgeLight, The Raine Group, and Google <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a>, which also assisted with technology and engineers.</p><p>Softbank last week announced the departure of its chief operating officer, Marcelo Claure, following a fallout over pay. Claure will retain his seat on Univision's board, De Angoitia said.    </p><p>($1 = 20.8655 Mexican pesos)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Cassandra Garrison in Mexico City; Editing by Christian Plumb and Alistair Bell)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Cassandra.Garrison@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Cassandra.Garrison@thomsonreuters.com</a> ; +52 55 6200 7873; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TELEVISA-UNIVISION/ (EXCLUSIVE, PIX)</p></div>"}