{"date": "2021-02-15 11:49:10+00:00", "ticker": "AVV", "mrkt_info": {"open": 3893.0, "close": 3838.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE</strong> – AVEVA, a global leader in engineering and industrial software, today announced that it has signed partnership agreements with Egypt-based BASS and UAE-headquartered Peritus, to effectively deliver the company’s flagship engineering portfolio to customers across the Middle East and Africa (MEA) region. BASS will specifically meet the increased demands for AVEVA’s solutions in Egypt while Peritus will cater to customers in Saudi Arabia and Pakistan. Both companies will build awareness for AVEVA’s solid portfolio and strengthen the company’s channel network and presence across the MEA region.</p>\n<p>“The MEA region is an important region for AVEVA. We are investing heavily into our resources and channel network to be able to successfully expand our customer base and address the increasing demands for our pioneering solutions,” said <strong>Dr</strong> <strong>Tariq Aslam, Head of MEA, AVEVA. </strong>“Some of the most important criteria that we look at while selecting partners, who can grow together with us, include market expertise, alignment of business values and customer-first approaches. Our newest partners, BASS and Peritus not only meet these requirements but also boast unique strengths that will play a key role in helping us to achieve digital business outcomes for our customers.”</p>\n<p>BASS is a global IT company providing quality software solutions across a broad spectrum of technologies and a well-recognized market player in the field of software development and custom development software projects. </p>\n<p>Mohamed Abdel Salam, Managing Director of BASS said, “AVEVA bridges a genuine gap in the Egypt market and supports our business objective to be the digital partner of choice for our customers in their transformation goals. Our extensive channel partner network will also be able to leverage all the benefits that come with working with a global leader such as AVEVA. We look forward to strengthening this relationship to create joint opportunities.” </p>\n<p>Peritus is dedicated to helping organizations in their journey towards digital transformation. The IT distributor helps companies to streamline processes, increase efficiency through innovation and modern technologies.</p>\n<p>Muhammad Saleem, Director of Peritus said, “We are excited to begin this collaboration with AVEVA and assist our customers in Saudi Arabia and Pakistan to take advantage of AVEVA’s best-in-class portfolio as they fortify their digital journeys. We look forward to building this relationship and scaling it to new heights, together with our partner ecosystem.”</p>\n<p>AVEVA provides innovative industrial software to transform complex industries such as Oil &amp; Gas, Construction, Engineering, Marine, and Utilities. The company’s integrated portfolio capability harnesses the power of technologies such as Artificial Intelligence (AI), machine learning, mixed reality, advanced simulation and cloud computing. AVEVA’s software solutions and platform enable the design and management of complex industrial assets like power plants, chemical plants, water treatment facilities and food and beverage manufacturers – deploying IIoT, big data and AI to digitally transform industries. </p>\n<p>The AVEVA Partner Network today boasts over 5,000 members providing opportunities for Alliances, Systems Integrators, Distributors, Solution Providers and Technology Partners to participate in the AVEVA community. </p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}