{"date": "2021-12-17 17:32:02.476000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3377.42, "close": 3341.58}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-abstract\"><p>The Competition Commission of India (CCI) on Friday suspended the US retail giant Amazon\u0092s 2019 deal with Future Retail (FRL) for its deliberate design to suppress information about the scope and purpose of the deal.</p></div><div class=\"tr-npp-lead\"><p>In its 57-page order, the competition watchdog said it considered necessary to examine the combination afresh, given that the two players were known in the online marketplace and offline retailing and had contemplated strategic alignment between their businesses.</p><p>The antitrust regulator has imposed a penalty of ~200 crore on Amazon to be paid within 60 days of receipt of order. \u0093We are reviewing the order passed by the CCI, and will decide on the next steps in due course,\u0094 said a spokesperson for Amazon on Friday.</p></div><div class=\"tr-npp-body\"><p>The commission said in its order that Amazon ought to have notified the combination for the commercial agreements with Future Group, for the purpose of establishing strategic alignment and partnership between Amazon Group and FRL, as well as have a \u0091foot-in-the-door\u0092 in India's retail sector.</p><p>It said Amazon made false and incorrect statements, while seeking approvals.</p><p>Legal experts like Salman Waris, managing partner at technology law firm TechLegis Advocates &amp; Solicitors, who analysed the CCI order, said the regulator's unprecedented decision is a huge setback for Amazon and could have far-reaching implications \u0097 for not only Amazon, but for the Indian market on the whole.</p><p>\u0093According to the order, the main reasons stated by CCI for the decision was that it was considered \u0091necessary to examine the combination afresh', and for the intervening period the CCI approval provided in 2019 \u0091shall remain in abeyance\u0092,\u0094 said Waris.</p><p>In August 2019, Amazon acquired 49 per cent stake in Future Coupons, the promoter entity of FRL, for around ~1,500 crore. One year later, in August 2020, Future Group struck a $3.4-billion asset-sale deal with Reliance Industries (RIL).</p><p>In October this year, Amazon had sent a legal notice to Future for striking a deal with RIL. It alleged that Future\u0092s $3.4-billion asset sale deal with RIL breached an agreement with Amazon. It cited its non-compete agreement with the Kishore Biyani-led chain. The deal specified any disputes would be arbitrated under the Singapore International Arbitration Centre (SIAC) rules. The same month, Amazon got a favourable ruling for its plea in SIAC against the deal.</p><p>In November 2020, Future moved the Delhi High Court (HC) against Amazon, alleging interference by the US firm in the deal with RIL. Since then, Amazon has been fighting a legal battle with FRL to stop the Kishore Biyani-led retailer's $3.4-billion deal with RIL.</p><p>In August this year, the Supreme Court (SC) had ruled in favour of Amazon, upholding the Singapore emergency arbitrator award against the Future-Reliance deal as enforceable in India. But in a major relief to Future Group, the SC stayed proceedings before Delhi HC in September this year, ordering no coercive action. The court also directed the National Company Law Tribunal, CCI, and the Securities and Exchange Board of India to not pass any final order in relation to the dispute for four weeks.</p><p>In November this year, the SC extended by two weeks the time granted to CCI by Delhi HC to take a decision with respect to the show-cause notice issued by it to Amazon over the deal with Future Group.</p><p>The Confederation of All India Traders (CAIT), which represents around 70 million traders in India, said the CCI had given a landmark order and alleged that Amazon stood fully exposed for its malpractices and lies at all levels, together with continued violation of the laws and rules.</p><p>\u0093The cat has been belled at last,\u0094 CAIT National President B C Bhartia and Secretary-General Praveen Khandelwal said in a statement. They said it is a warning to not only Amazon, but to other foreign-funded e-commerce companies, to stop violating the law, rules, and foreign direct investment policy of the government.</p><p>Bankers worry</p><p>Bankers said this verdict is another facet in the legal tangle involving Future group, reinforcing worries over repayments of loans. It heightens risks of exposure turning non-performing asset (NPA). \u0093Just hope that the legal issues are resolved,\u0094 said a banker.</p><p>Another banker said the risk is that entities in the group under one-time restructuring may not be able to meet the loan repayment timelines. \u0093Hope lenders are able to see through December 2021.\u0094</p><p>The precarious financial status of group entities, however, is known and many lenders had begun making provisions. So, the burden of provisions will not balloon when the group accounts are tagged NPA, bank executives said.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}