{"date": "2021-11-09 12:00:05.462000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p align=\"left\">EMERYVILLE, Calif., Nov.  09, 2021  (GLOBE NEWSWIRE) -- Lucira Health, Inc. (\"Lucira Health\" or \"Lucira\") (Nasdaq: LHDX), a medical technology company focusing on the development and commercialization of transformative and innovative infectious disease test kits, announced that its LUCIRA™ CHECK IT COVID-19 Test Kit, a self-administered PCR quality, single-use, at home molecular diagnostic test for COVID-19, is available for purchase by Amazon U.S.-customers.<br/></p><p>\"We are delighted that our LUCIRA™ CHECK IT COVID-19 test kit is once again available to Amazon U.S.-customers,\" said Erik Engelson, Chief Executive Officer. \"Access to a COVID-19 test with the PCR-level accuracy and early detectability that you get from a lab test combined with the speed and simplicity of our test kit can help Americans confidently return to work or school and to get back to gathering live with family and friends this upcoming holiday season. Amazon's reach enables more people in the United States access to this innovative and unique testing solution.</p><p>The test kit, authorized for emergency use by FDA under EUA, is available over the counter (\"OTC\"), and can produce a positive result in as little as 11 minutes, or a negative result within 30 minutes. Immediately after testing, users can access a free, text based digital LUCI PASS™ verified test result on their phone for work, travel, and leisure.</p><p><strong><span>Accurate, easy to use</span></strong></p><p>The LUCIRA™ CHECK IT COVID-19 test kit is designed to deliver PCR quality molecular accuracy in 30 minutes or less at home. Each single-use test kit contains everything needed to conduct one COVID-19 test. It was designed and tested extensively for individuals to use independently and does not require a physician's prescription or supervised assistance. There is no additional equipment such as a reader or instrument to purchase.</p><p>In clinical trials, 100% of users successfully performed the test at home in about two minutes using Lucira's easy-to-use 'swab, stir and detect' CHECK IT test kit.</p><p>Molecular tests are more sensitive than antigen tests because they amplify critical parts of the viral target. The targeted, molecular amplification that LUCIRA™ CHECK IT and PCR tests employ makes them demonstrably more reliable than \"rapid\" antigen tests, which can miss active COVID-19 infections.</p><p>In a Community Trial setting, LUCIRA™ CHECK IT results were compared with the Hologic Panther Fusion, considered a high-sensitivity molecular test due to its low Limit of Detection (\"LOD\"). Lucira's accuracy was 98%, detecting 385 out of 394 positive and negative samples correctly when compared to the Hologic Panther Fusion, and excluding ten samples with very low levels of virus (those with very high PCR cycle thresholds of 37.5 or greater) that possibly no longer represented active infection. Comparative positive results agreed 97% of the time among this sample, and negative results agreed 98% of the time.</p><p><strong>LUCIRA™ CHECK IT Test Kit</strong></p><p>The LUCIRA™ CHECK IT<strong> </strong>test kit<strong> </strong>fits in the palm of a hand, extracts genetic material from the virus and amplifies it similar to PCR lab tests. Each Lucira test kit contains everything needed to run one COVID-19 test. Users get the test device, two AA batteries, sample vial, swab and simple one-page instructions. The batteries are inserted into the device and the sample vial is placed in the test unit. The user then opens the test swab packet and rotates the swab in each nostril five times. The swab is then stirred in the sample vial, which is then gently pressed into the test unit to start the test. The \"ready\" light will blink until a \"positive\" or \"negative\" green light is illuminated within 30 minutes. Lucira also offers a free LUCI PASS<sup>TM </sup>digital verified test result back to a user's phone. LUCI is accessed via text and does not require downloading an app. There is also an opt-in for public health reporting for users who wish to transmit their results to the relevant public health authorities.</p><p>Lucira's identical, prescription product is also available for sale to healthcare providers at <a href=\"https://www.globenewswire.com/Tracker?data=NHU72CQHYwwkYft3lCdKv4CXm7JCbE-cThdpAUhKucaSjZg8K-qw_3IVt0YFs1mKOSjNWVCB5RT2lJaBlEO4rA==\"><strong>lucirahealth.com</strong></a></p><p><strong>About Lucira Health</strong></p><p>Lucira is a medical technology company focused on the development and commercialization of transformative and innovative infectious disease test kits. Lucira's testing platform produces lab quality molecular testing in a single-use, consumer-friendly, palm-size test kit powered by two AA batteries. Lucira designed its test kits to provide accurate, reliable, and on-the-spot molecular test results anywhere and at any time. The LUCIRA™ CHECK IT COVID-19 Test Kit (OTC) and LUCIRA™ COVID-19 All-In-One Test Kit (Rx) are designed to provide a clinically relevant COVID-19 result within 30 minutes from sample collection. For more information, visit <a href=\"https://www.globenewswire.com/Tracker?data=nhWcLPw5_lbGolsScxczBCYCHUfZzvECuo95CHY3ka_xs1wnidYFV9X56PZS3t4ZpBzPL3e7BndMEb0hzH7JikVb25o6Kp8FXVfHB5aLC4E=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.lucirahealth.com</a>.</p><p><strong>Forward Looking Statements</strong></p><p>Statements contained in this press release regarding matters that are not historical facts are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Because such statements are subject to risks and uncertainties, actual results may differ materially from those expressed or implied by such forward-looking statements. Words such as \"can,\" \"plans,\" \"will,\" \"may,\" \"anticipates,\" \"expects,\" \"potential,\" and similar expressions are intended to identify forward-looking statements. These forward-looking statements are based upon Lucira's current expectations and involve assumptions that may never materialize or may prove to be incorrect. Actual results could differ materially from those anticipated in such forward-looking statements as a result of various risks and uncertainties, including our ability to increase production, streamline operations and increase product availability; the success of our test platform with COVID-19, the impact to our business of the ongoing COVID-19 pandemic; our ability to successfully continue to expand internationally; any impact on our ability to market our products; demand for our products due to deferral of procedures using our products or disruption in our supply chain; our ability to achieve or sustain profitability; our ability to gain market acceptance for our products and to accurately forecast and meet customer demand; our ability to compete successfully; our ability to enhance our product offerings; development and manufacturing problems; capacity constraints or delays in production of our products; maintenance of coverage and adequate reimbursement for procedures using our products; and product defects or failures. These and other risks and uncertainties are described more fully in the \"Risk Factors\" section and elsewhere in our filings with the Securities and Exchange Commission and available at <a href=\"https://www.globenewswire.com/Tracker?data=shwmZDoNU19kr8ac5Oh2-2oH8ZQ-EolOROVgw4s40Vh0VSE5kGkZ6r14eH3c7AtsqnwTjvYLYFCZYQZ5-I_qlwWAwy9BuEdJzDlq_Aj45vvKEE0wf_vMjLbLfpe5PshEk8fS15dpmQ2h2EVLBcVcka8pulJRyShtMUUNRZWot78RZCu5B686NuRK822bnSabPaj_IkGgcNX1DQ3Z1J35TWBq2kCeOkC5p9zK7IFypCg=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sec.gov</a>, including in our most recent Annual Report on Form 10-K and Quarterly Reports on Form 10-Q. Any forward-looking statements that we make in this announcement speak only as of the date of this press release, and Lucira assumes no obligation to update forward-looking statements whether as a result of new information, future events or otherwise after the date of this press release, except as required under applicable law.</p><p><strong>Investor Contact</strong><br/>Greg Chodaczek<br/><a href=\"https://www.globenewswire.com/Tracker?data=aBiMm6Dkm2QjW8XhHKNo2zRbvJizADMB49Xkm6OQ9FuYNKlJRevFWrJLC1Z3hHtvgdgaphluYJDu_WVLUmF9pB0g1U5Oc_Fev6Xtt27DQ251bJrd7W7N_dr6Y-S4Rv8SniXHh16G_S-ozsHT8_IPmQ==\">Investorrelations@lucirahealth.com<br/></a>347-620-7010</p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODM4OTU2NSM0NTQxNDEyIzIyMDg3MDk=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RNNE9UVTJOU00wTlRReE5ERXlJekl5TURnM01Eaz0=&amp;key=cc7be214d4a9a7bfd3e5b85ac6ce20fea4154abf3250673527f691cf7d1ef5be889088cd3e025f7e2e6bf16f2f1a10e5960825cd74d1cee359eb794a76e6c983\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/MmNhNzRhODAtMmM2Mi00YzQwLWE0MjQtZDY5NTk4M2VjNGU0LTEyMjAyNjI=/tiny/Lucira-Health-Inc-.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9NbU5oTnpSaE9EQXRNbU0yTWkwMFl6UXdMV0UwTWpRdFpEWTVOVGs0TTJWak5HVTBMVEV5TWpBeU5qST0vdGlueS9MdWNpcmEtSGVhbHRoLUluYy0ucG5n&amp;key=2f727889754434476ac30bffddbcff16a8efc8b8d572d9ba4ace0d2e3dc74312d43430c5c28ae987e347771dac7387311afeb32e50b1cf06ace533738a9302ab\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/30b0187f-755b-46f2-9d9b-f43cc78c592f\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/30b0187f-755b-46f2-9d9b-f43cc78c592f/small/logo-png.png\" style=\"max-height:40px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS8zMGIwMTg3Zi03NTViLTQ2ZjItOWQ5Yi1mNDNjYzc4YzU5MmYvc21hbGwvbG9nby1wbmcucG5n&amp;key=241be9b3a01bc22df6392e42c9b5f493acf01491bbc8f44a31e1a33100e63833e804cf4c884aed030316a0cd99d888f50d1e781b923a2558b5293d8fdaae38c8\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}