{"date": "2021-12-20 17:10:32.421000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Dec. 20 -- Last week's decision by the Competition Commission of India (CCI) to hold in abeyance its approval of Amazon's 2019 deal with Future Group and slap it with fines of over Rs.200 crore appears to have deprived the American company of a locus standi in its legal battle to stop Future from selling its retail assets to Reliance Retail. Amazon's case rested on its pact with Future, by which it claimed a right to a small slice of its retail business that would be violated if Reliance took it over. The principle of contract sanctity had seen a Singapore arbitration panel uphold its claim, with India's Supreme Court doing likewise. With that agreement's clearance now in limbo, however, Amazon's argument has weakened considerably, though this need not mean Future and Reliance can go ahead with their merger plans. While this saga has raised questions over how the country deals with deals, the US firm's conduct has been questionable too.</p><p>The CCI has directed Amazon to make a detailed submission on the 2019 deal for a complete relook. This, it held, was necessitated by the company's deliberate suppression back then of critical information on the scope and purpose of the arrangement; while the CCI had been informed that a novel form of payment synergy was the pact's main motive and that Amazon's option to acquire a retail stake was meant as a plain investment with a value-protective shield, the US company's later statements aimed at blocking an alleged interloper were not just at variance with its earlier position, it revealed a control orientation of intent that was corroborated by internal corporate emails. All in all, it would seem Amazon had tried to obtain a hidden ticket for access to a market barred to foreign control in anticipation of barriers being lifted at some point ahead. At a minimum, this was violative of the spirit of our multi-brand retail policy, and while a private pact with a conditional clause may still be legally valid, an attempt to paper this part over is apparent in the CCI's documentation of what was submitted to it.</p></div><div class=\"tr-npp-body\"><p>If this episode of misrepresentation does neither Amazon nor the Future Group any credit, it doesn't speak well of how our regulator okays stake acquisitions either. The point of a CCI go-ahead is to ensure that business alliances do not reduce the competitive intensity of a market in unfair ways. This is no easy task and the structure of the 2019 deal had a sequence of equity transfers that added a dense layer of complexity to it. Yet, the Indian approval process should have been designed to spot any gaps between explanations offered and the actual implications of various clauses. Instead, a regulatory nod that went by Amazon's word on key matters has resulted in a retrospective reversal-and that too, only after another suitor entered the picture. That the CCI was misled two years ago could get lost in the broad optics of this case, raising the risk of global investors taking note of this 'flip-flop' as a sign of policy vacillation. Perhaps Amazon will press on with efforts to keep Future's chain of stores out of Reliance's grasp, but it can only do this by challenging last week's CCI order, which would again rake up the issue of what its real target was. Whichever way the fight for Future's retail operations eventually goes, we must fix all that needs to be fixed so that we do not run into such muddles. Clarity of rules is as big a lure for investors as the profit potential of an emerging market like ours. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}