{"date": "2022-01-09 14:19:08.317000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3251.08, "close": 3307.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Mumbai</p></div><div class=\"tr-npp-lead\"><p>Mumbai, Jan. 9 -- US giant Amazon Holdings NV has moved the National Company Law Appellate Tribunal (NCLAT) against the Competition Commission of India (CCI). Its case is against CCI's 17 December where the anti-trust watchdog had suspended and revoked its approval for the deal with Future Coupons alleging misrepresentation, said a lawyer privy to the matter.</p><p>A hearing on the matter is expected in the coming week, the lawyer added.</p></div><div class=\"tr-npp-body\"><p>The move follows a Delhi High Court judgement on 5 January that suspended Amazon's arbitration proceedings in Singapore against estranged partner Future Group for contract violations, giving the debt-ridden Indian retailer a reprieve.</p><p>The high court had pushed the arbitration proceedings owing to the CCI order. As per the CCI's 57-page order, it said that the approval for the Amazon -Future deal would be kept in abeyance.</p><p>As per the anti-trust watchdog'17 December order, Amazon was fined Rs.202 crore by CCI for allegedly misrepresenting and suppressing information while seeking regulatory approval in 2019 to buy a stake in Future Coupons.</p><p>A favourable verdict for Amazon will probably help Amazon's in reinitiating the arbitration proceedings and fight for its contractual rights.</p><p>However, If the NCLAT decides not to dismiss the CCI order the US major will need to go the apex court else it will be left with no locus standi for any arbitration proceedings.</p><p>While commenting on the development, Nikhil Varma, Managing Partner, Miglani Varma &amp; Co - Advocates, Solicitors and Consultants said that it is only natural for Amazon to contest the CCI order suspending its 2019 deal with Future Coupons and imposing a hefty Rs.202 crore fine, which is also the highest amount ever imposed by the CCI in case of a combination.</p><p>In all likelihood, Amazon will manage to get a stay on the CCI order but will be asked to deposit a portion of the penalty amount forthwith.</p><p>\"The decision of the NCLAT in this matter is set to be a crucial one, for it will determine the import of the CCI's power to suspend its approval under the merger control regime introduced in 2011. A favourable verdict would prevent Amazon from paying the hefty fine. Overall, the appeal will not hurt Amazon, for the transaction has already been consummated\", said Varma.</p><p>On the other hand, NCLAT order could further have a significant bearing on the Future Group's asset sale deal with Relaince Industries arm that was signed in 2020.</p><p>Varma believes a favourable verdictfor Amazon will bolsterits claim against the Future group-RIL deal before the Singapore International Arbitration Court (SIAC).</p><p>An unfavourable verdict, however, will certainly ease the pathfor RIL to acquire the Future Group's retail assets as it mayvoid the investment made by Amazon in Future Coupons Pvt Ltd and its rights under the shareholders' agreements and share subscription agreement,\"Varma added.</p><p>Last week, the Future Group urgently had moved the Delhi High Court seeking quashing of the proceedings against it initiated by Amazon in the Singapore arbitration centre.</p><p>This was after the Future Group approached the Singapore Tribunal wherein it had filed a termination application to halt the arbitration proceedings.</p><p>However, the international tribunal turned down the Indian retailer's request. A fixed hearing by the international tribunal on Amazon-Future dispute was already scheduled between 5-7 January.</p><p>Currently, following an order by the division bench of Delhi High Court the SIAC has stalled the hearings in the matter. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}