{"date": "2021-12-15 15:05:56.563000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Check out all the Airtel, Vodafone Idea and Reliance Jio prepaid and postpaid plans that offer bundled subscriptions for Netflix, Amazon Prime Video and Disney+ Hotstar.</p><p>Netflix recently cut its prices for the streaming service's plans, while Amazon now has its increased Prime subscription fees in effect. With the changing prices of the popular streaming services, users may want to shift from one service to another.</p></div><div class=\"tr-npp-body\"><p>While we have a separate guide on the new prices for all major streaming services in India that you can check out, here's a list of all streaming subscriptions that you can get free with Airtel, Vodafone Idea and Reliance Jio prepaid and postpaid plans.</p><p>Airtel</p><p>Airtel currently offers a few prepaid plans that bundle Prime Video and Disney+ Hotstar subscriptions. This includes a Rs 108 add-on plan with 6GB total data and validity the same as your existing plan. The plan also offers a Disney+ Hotstar subscription for 30 days.</p><p>A higher Rs 599 plan offers 3GB data per day, for 28 days, a Rs 838 plan offers 2GB per day, for 56 days, and an annual Rs 3,359 plan offers 2GB per day, for 365 days. All these plans offer Disney+ Hotstar subscription for a year.</p><p>Airtel also has a few prepaid plans with bundled Amazon Prime membership. The Rs 359 plan that offers 2GB of data per day, for 28 days comes with an Amazon Prime Video mobile subscription for 28 days. There is also a Rs 699 plan that offers 3GB of data per day for 56 days and an Amazon Prime Mobile subscription for 56 Days.</p><p>Coming to postpaid plans, Airtel offers a Rs 499 monthly plan that offer 75GB data with rollover, a Rs 999 monthly plan with 150GB data with rollover and a Rs 1,599 monthly plan with 500GB data with rollover. All three of these plans also include one year of Amazon Prime membership and Disney+ Hotstar VIP membership.</p><p>Vodafone Idea</p><p>Vodafone Idea offers four prepaid plans that come with bundled subscriptions. This includes the Rs 501 plan that offers 3GB of data per day, for 28 days, the Rs 701 plan that offers 3GB data per day for 56 days and a Rs 901 plan that offers 3GB data per day for 84 days. All of these plans come with a bundled Disney+ Hotstar subscription for a year.</p><p>For Vodafone Idea's postpaid users, there is a Rs 499 plan that offers 75GB data and comes with a bundled Amazon Prime subscription and a Disney + Hotstar Mobile subscription for a year. There is a Rs 699 plan that offers unlimited data with a bundled Amazon Prime subscription and a Disney+ Hotstar Mobile subscription for a year.</p><p>There's also the VI RedX postpaid plan worth Rs 1099 per month that offers unlimited data along with yearly bundled subscriptions of Netflix, Amazon Prime Video and Disney+ Hotstar Mobile.</p><p>Reliance Jio</p><p>Reliance Jio offers four prepaid plans with bundled Disney+ Hotstar Mobile subscription for a year. These are the Rs 601, Rs 799, Rs 1,066 and Rs 3,119 plans. The Rs 601 plan offers 3GB data per day for 28 days, the Rs 799 plan offers 2GB data per day for 56 days, the Rs 1,066 plan offers 2GB data for 84 days and the annual Rs 3,119 plan offers 2GB data per day for 365 days.</p><p>For postpaid users, Reliance Jio offers five JioPostPaid Plus plans. This includes a Rs 399 plan that offers 75GB, a Rs 599 plan that offers 100GB, a Rs 799 plan that offers 150GB, a Rs 999 plan that offers 200GB and a Rs 1,499 plan that offers 300GB data. All of these plans are payable monthly and include a year's subscription of Netflix, Amazon Prime Video and Disney+ Hotstar.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}