{"date": "2021-11-29 13:05:06+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n                  <span>Introduction</span>\n                </p>\n                <p>\n        With traditional firewalls, network security teams are charged with the heavy lifting of deploying new solutions. They are responsible for a variety of costs, including licensing, appliance, related infrastructure updates, and ongoing maintenance. From a time-value perspective, inserting firewalls also creates additional complexity for NetOps and SecOps teams, delaying time to deployment in production environments due to design and testing required to integrate the new firewall into the network.\n      </p>\n                <p>\n        To become more agile, organizations are increasingly moving towards deploying SaaS-based security offerings hosted directly by vendors. According to Gartner, by 2025, 30% of new deployments of distributed branch-office firewalls will switch to firewall-as-a-service, up from less than 10% in 2021.\n      </p>\n                <p>\n                  <span>Reduce management and deployment complexity</span>\n                </p>\n                <p>\n        Cisco has collaborated with AWS to simplify the way organizations secure their public cloud infrastructure using Firewall-as-a-Service (FWaaS) where <a href=\"https://blogs.cisco.com/partner/cisco-secure-firewall-new-software-release-and-cisco-network\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Cisco Secure Firewall</a> is integrated with the AWS Gateway Load Balancer (GWLB). AWS Gateway Load Balancer enables elastic scaling, improves availability, and simplifies insertion and management of the Cisco Secure Firewall. Starting with version 7.1 of Cisco Secure Firewall Threat Defense, we support integration with AWS Gateway Load Balancer.\n      </p>\n                <p>\n        What does this mean for Cisco Secure Firewall customers?\n      </p>\n                <p>\n        Simply put, experience your firewall working for you, not the other way around. Cisco Secure Firewall-as-a-service on AWS enables you to simply consume our virtual firewall in AWS, without rearchitecting, deploying, or managing new infrastructure. Now, you can simplify security at its core by leaving the heavy lifting to us. Other benefits include:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <strong>Simplified security architecture</strong> - Provisioning of firewalls and control plane infrastructure are managed by Cisco, saving time and accelerating value.\n        </li>\n                  <li>\n                    <strong>Flexible and scalable security</strong> - Elastic firewall infrastructure meets demand by scaling as throughput requirements change.\n        </li>\n                  <li>\n                    <strong>Security that works with you</strong> - Simplified firewall insertion delivers the security you need, without having to rearchitect your network. Additionally, traffic routing configurations and firewall monitoring are performed by Cisco.\n        </li>\n                  <li>\n                    <strong>Stay agile</strong> - Say goodbye to the traditional refresh cycle and stay instantly up to date with the latest firewall software versions and IPS signatures. No hardware required.\n        </li>\n                  <li>\n                    <strong>Achieve better ROI, fast</strong> - Our OPEX-based model will demonstrate to your CFO that you're both a technology and business partner. And you'll reduce upfront costs, paying for only what you need.\n        </li>\n                </ul>\n                <p>\n        Customers also benefit from support for dynamic policies for AWS tags, plus improved threat detection, simplified customization, and enhanced performance of our latest, industry-leading open-source IPS, Snort3.\n      </p>\n                <p>\n                  <span>Architecture and use cases for Secure Firewall-as-a-service on AWS</span>\n                </p>\n                <p>\n        Cisco Secure Firewall-as-a-service on AWS consists of:\n      </p>\n                <p>\n                  <strong>A.) Managed Gateway Load Balancer endpoints (MGE)</strong> - MGEs reside in the customer's VPC/account and are responsible for routing the traffic from the customer's VPC to the Cisco-managed security VPC, where it will be inspected.\n      </p>\n                <p>\n                  <strong>B.) Gateway Load Balancer (GWLB)</strong> - GWLB resides on the Cisco managed VPC/account, this is responsible for hosting the Secure Firewall appliance fleet.\n      </p>\n                <p>\n        Together, these components bring best-in-class managed security infrastructure for customers using AWS.\n      </p>\n                <p>\n        With Cisco Secure Firewall-as-a-service on AWS, we intend to support:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Inspection for ingress (inbound) and egress (outbound) traffic from and to the internet\n        </li>\n                  <li>\n          East-West (E/W) traffic between subnets (resources) within a VPC (Intra-VPC) and between VPCs (Inter-VPC)\n        </li>\n                  <li>\n          Traffic between the on-premises network and customer VPC's, when passed over a Transit Gateway using VPN.\n        </li>\n                </ul>\n                <p>\n        East-West traffic\n      </p>\n                <p>\n        Ingress and egress traffic\n      </p>\n                <p>\n                  <span>Choose between fully managed and partially managed Firewall-as-a-service</span>\n                </p>\n                <p>\n        We recognize some customers want a fully managed service while others wish to configure their own policy. To satisfy both, Cisco is offering a partially managed Firewall-as-a-service option as well. This option provides the customer with most of the benefits of the fully managed service above, but with a partially managed environment where Cisco continues to manage the infrastructure, but lets the customer retain policy management responsibilities.\n      </p>\n                <p>\n                  <span>And if customers wish to manage and deploy their own</span>\n                </p>\n                <p>\n        Looking to manage and deploy your own Cisco firewalls on AWS? The release of Cisco Secure Firewall Threat Defense 7.1 introduces GENEVE support, integrating Cisco Secure Firewall with AWS Gateway Load Balancer, giving customers full control of their infrastructure while simplifying deployment, management, and scaling of firewalls. This integration ensures traffic to and from AWS VMs are inspected by Secure Firewall without requiring any routing changes. This enables rapidly scalable, highly available security with simplified insertion, removing the need to rearchitect your network.\n      </p>\n                <p>\n                  <span>Next Steps</span>\n                </p>\n                <p>\n        Cisco Secure Firewall-as-a-service on AWS will be available in the first half of 2022. Contact your Cisco sales representative to sign up for a limited preview release.\n      </p>\n                <p>\n                  <span>Additional Resources</span>\n                </p>\n                <p>\n                  <a href=\"http://aws.amazon.com/partners/aws-and-cisco/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Partner Network: Cisco Solutions on AWS</a>\n                </p>\n                <p>\n                  <a href=\"https://www.cisco.com/c/en/us/products/security/firewalls/firepower-public-cloud.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Cisco Secure Firewall Threat Defense Virtual for Public Cloud</a>\n                </p>\n                <p>\n                  <a href=\"https://www.cisco.com/c/en/us/products/collateral/security/firesight-management-center/at-a-glance-c45-736624.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">At-a-Glance: Cisco Secure Firewall</a>\n                </p>\n                <p>\n                  <span>We'd love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Secure on social!</span>\n                </p>\n                <p>\n                  <strong>Cisco Secure Social Channels</strong>\n                </p>\n                <p>\n                  <strong>\n                    <a href=\"https://www.instagram.com/CiscoSecure/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Instagram</a>\n                  </strong>\n                  <br/>\n                  <strong>\n                    <a href=\"https://www.facebook.com/ciscosecure/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Facebook</a>\n                  </strong>\n                  <br/>\n                  <strong>\n                    <a href=\"https://twitter.com/CiscoSecure\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a>\n                  </strong>\n                  <br/>\n                  <strong>\n                    <a href=\"https://www.linkedin.com/showcase/cisco-secure\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a>\n                  </strong>\n                </p>\n                <p>\n        Share:\n      </p>\n                <br/>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://blogs.cisco.com/security/simplify-network-security-with-cisco-secure-firewall-as-a-service-fwaas-on-aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Cisco Systems Inc.</strong> published this content on <strong>29 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>29 November 2021 13:05:06 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Cisco Systems Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Cisco-Systems-Inc.</p></div>"}