{"date": "2021-12-28 02:03:09.836000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3393.39, "close": 3384.02}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_3me4tdor&amp;referenceId=tag:reuters.com,2021:newsml_OVF9TJ43V_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_3me4tdor&amp;referenceId=tag:reuters.com,2021:newsml_OVF9TJ43V_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: The S&amp;P 500 index ended at a record high Monday, as strong U.S. retail sales helped push stocks higher in the last week of 2021. This report produced by Chris Dignam.<br/>Short Link: <a href=\"https://refini.tv/3erGYPV\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3erGYPV</a><br/><br/>Video Transcript:<br/><br/>The S&amp;P 500 closed at a record high on Monday, its fourth straight session of gains, as strong US retail sales underscored economic strength and eased worries from Omicron-driven flight cancellations that slammed travel stocks. The Dow rose by nearly 1%, and the S&amp;P 500 and NASDAQ both gained by roughly 1.4%. Hilary Kramer, Chief Investment Officer of Kramer Capital Research said the rally is typical for the US stock market in the final week of December.<br/><br/>We are in a classic Santa Claus rally. This is a year-end, group think effort. It happens every single year that I've been in the market, which is for over 30 years, and everyone just gets in their big funds, fast money. Large institutions know that they can squeeze out a few more dollars from all the top stocks that they've been owning. And that's why we see everything from Nvidia to Amazon to some of those new Rivian electric vehicle kind of cars doing so well today. Everyone's trying to get that up there and we do not call it collusion. It's not. Because a lot of those NASDAQ companies did not perform, and that's why specifically we've seen NASDAQ really catching a bid today.<br/><br/>The NASDAQ got a boost from mega cap companies, including Tesla, which climbed 2.5%. Also Microsoft and Apple, which both rose by more than 2%, and Meta Platform, formerly Facebook, rose by more than 3%. Helping to fuel the gains was a report from Mastercard, which said US holiday season retail sales rose 8.5% from November 1 to December 24, powered by an e-commerce boom. While the S&amp;P 500 retailing index gained, its airlines index plummeted after about 800 more flights were canceled on Monday after airlines nixed thousands during the Christmas weekend as Omicron cases soared. But all 11 main S&amp;P 500 sector indexes advanced on Monday, with energy and tech leading the percentage gains. The main US stock indexes are on track for a third straight yearly gain, with the benchmark S&amp;P 500 poised for its best three-year performance since 1999.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}