{"date": "2021-12-10 22:23:12+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3483.42, "close": 3391.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds Kellogg spokesperson, AFL-CIO comments, background</p><p class=\"tr-by\">By Nandita Bose and Mohammad Zargham</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">WASHINGTON, Dec 10 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>U.S. President Joe Biden said he was \"deeply troubled\" by Kellogg Co'<span class=\"tr-strong\">s</span>  <a href=\"reuters://REALTIME/Verb=FullQuote/ric=K.N\" data-type=\"ric\" data-ric=\"K.N\" translate=\"no\" dir=\"ltr\">K.N</a> plans to hire permanent replacements for striking unionized employees after they voted down a proposed contract this week.</p><p>Biden, who has put unions at the center of his policymaking,  said such actions undermine the critical role collective bargaining plays in giving workers a voice.</p><p>    \"Permanently replacing striking workers is an existential attack on the union and its members' jobs and livelihoods. I have long opposed permanent striker replacements and I strongly support legislation that would ban that practice,\" Biden said in a statement.</p><p>Kellogg said <span class=\"tr-strong\">earlier this week</span> <span class=\"tr-strong\">that a </span>majority of its U.S. cereal plant workers had voted against a new five-year contract, forcing it to hire permanent replacements as employees extend a strike that started more than two months ago. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2SS3FQ\" data-type=\"storyId\" data-story-id=\"nL4N2SS3FQ\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><span class=\"tr-strong\">Kellogg spokesperson Kris Bahner said on Friday the company is \"ready, willing and able to negotiate with the union\" and has made every effort to reach a fair agreement, including making six comprehensive offers to the union throughout negotiations.</span></p><p><span class=\"tr-strong\">\"We agree that this needs to be solved at the bargaining table. Our objective has been – and continues to be – to reach a fair agreement for our people,\" Bahner said in a statement.</span></p><p>    This is the second time <span class=\"tr-strong\">Biden has </span>weighed in <span class=\"tr-strong\">on a key labor action to </span>express his support for unions and the organized labor movement. </p><p>In February, he defended workers' rights to form unions as Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> employees in Alabama prepared to vote on whether to unionize. Last month, a regional director for the U.S. National Labor Relations Board ordered a rerun of that election, which ended in a defeat for the union effort.</p><p>Biden and Democrats have tried to stop the practice <span class=\"tr-strong\">of permanently replacing workers who are striking</span>, <span class=\"tr-strong\">which is currently legal,</span> via the Protecting the Right to Organize Act, or PRO Act. <span class=\"tr-strong\">The legislation</span> was passed by the U.S. House of Representatives in March but faces long odds in the Senate.</p><p>The percentage of U.S. workers represented by a union fell almost 15 percentage points between 1979 and 2020, according to the White House. That drop, the White House says, has cost workers $200 billion a year in unrealized wages and benefits.</p><p><span class=\"tr-strong\">Actions taken by Biden, who is considered one of the most pro-union presidents in the history of the United States, has offered the U.S. labor movement significant momentum, Liz Shuler, president of the AFL-CIO, told the Reuters Next Conference last week.</span></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Nandita Bose and Mohammad Zargham; Editing by Mark Porter)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:mohammad.zargham@thomsonreuters.com\" data-type=\"email\" translate=\"no\">mohammad.zargham@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: KELLOGG-WORKERS/BIDEN (UPDATE 2)</p></div>"}