{"date": "2022-02-12 18:06:30.371000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3065.87, "close": 3130.21}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>It's a conversation we've had time and again in Hong Kong – when \"normal\" travel is finally possible, without weeks of enforced hotel quarantine upon return, where will we head first, and what will we do?</p><p>It's a given that reconnecting with family and friends will be top of the agenda but, beyond that, people are hatching plans for the sorts of experiences and adventures that define the phrase travel writers love to hate – the one involving a list … and a bucket.</p></div><div class=\"tr-npp-body\"><ul class=\"bulleted-list arrowlist\"><li>Flight bans and quarantine rule out leisure travel from Hong Kong. When it resumes, Ollie Haas plans a trek in Colombia, Corey Riches a foodie trip to Beirut</li><li>Rodelia Pedro Villar would learn how to cook her favourite Singaporean dishes, Cristiane Ross would hit Greece, and for Joseph Wong it's grand slam tennis</li></ul><p>We spoke to five Hong Kong residents to discover what their early escapes will entail and the sights, sounds, experiences and flavours that they can't wait to enjoy, from the manicured grass of London SW19 to the wilds of the<a href=\"https://www.scmp.com/magazines/post-magazine/travel/article/3117525/covid-19-foils-our-journey-down-amazon-asia-kapuas\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon jungle</a>.</p><p>Do you have questions about the biggest topics and trends from around the world? Get the answers with<a href=\"https://www.scmp.com/knowledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">SCMP Knowledge</a>, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team.</p><p><span>Ollie Haas is a technology innovator working to build the world's most sustainable airline. A former innovation project lead at Cathay Pacific, he is lured by the siren call of one of the world's most intriguing – and arguably misunderstood – destinations.</span></p><p>\"A trip to<a href=\"https://www.scmp.com/magazines/post-magazine/travel/article/2186943/good-bad-and-ugly-sides-barranquilla-colombia-home\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Colombia</a>. Did I answer that too quickly?</p><p>\"The country has graced the top of my list for at least the past decade. Coming from a mixed background – I am Austrian-Ugandan – I find myself drawn to the country's incredibly rich diversity. I have a similar feeling for Brazil, another very diverse nation that I loved travelling through.</p><p>\"Colombia's history has been shaped by various indigenous cultures, along with influences from seemingly every corner of the world: European settlers, African slaves, Middle Eastern and Asian immigrants. This history has certainly not always been the prettiest and it provides much to learn from – and to reflect on. However, it has also created a nation of incredibly beautiful people, food, music and art. I can't wait to experience all of its flavours.</p><p>\"I'd start by parachuting into Bogotá, getting lost in La Candelaria, the old city centre, and discovering the city's famed street art. Next, I'd jump to Medellín, to experience first-hand the transformation that traded its crime-ridden past for world-leading sustainable urban development.</p><p>\"Nature would be up next, with a trek in the Amazon to live among the breathtaking biodiversity, before dancing off the mosquito bites in Cali, the 'world capital of salsa'. To finish off, I'd head up north for some lazy beach days by the Caribbean Sea. I've heard that San Andrés Island is spectacular, but would certainly be open to suggestions from any Colombian readers here!\"</p><p><span>Rodelia Pedro Villar is a domestic helper and a 2020 winner of a Spirit of Hong Kong award for her work with Domestic Workers Corner, a group she started to help colleagues in need. From Western Visayas, in the Philippines, she has lived in Hong Kong for almost two decades.</span></p><p>\"I'd fly to Singapore to learn how to cook my favourite<a href=\"https://www.scmp.com/lifestyle/food-drink/article/3024676/does-singaporean-cuisine-need-modernise-have-impact-global\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Singaporean dishes</a>. I was working with a Singaporean family for six years, the first family I raised babies for: two boys, a two-year old and a six-month old. I consider them almost my own! I loved learning from Popo, the grandmother, how to cook delicious Singaporean food.</p><p>\"As a graduate with a bachelor of science in hotel and restaurant management, I love to try many kinds of cooking and love to experiment. The family I worked with moved back to Singapore years ago but they would come back to Hong Kong every year and ask me to have a meal with them, meaning I got to see the kids again.</p><p>\"Wow, how I would love to visit them in Singapore, too! Particularly seeing Popo again because she cooked everything perfectly, like leafy greens sautéed in ginger and garlic or the laksa I loved so much – even if I really can't take their levels of spice!</p><p>\"I'd also want to see the Botanic Gardens, the Merlion, visit the parks and maybe connect with the Domestic Workers Corner women there, to talk more about migrant workers' rights. I'd obviously also go to all the hawker markets and eat satay and barbecue, trying all their famous street food.</p><p>\"I'd do that all for two weeks – but I think I'd run out of funds after that.\"</p><p><span>Born and raised in Brazil, Cristiane Ross is a business strategy professional who spent 11 years as head of customer experience for lifestyle brand PURE Group. She is the founder of SPARC Consulting, helping other companies on their customer-centric journeys.</span></p><p>\"In April 2019, in Buenos Aires, I had my last 'reunion' trip with friends I'd met in Hong Kong when I first moved to the city, in 2007. Like many others, they had relocated. We had plans for a girls' reunion trip every two years. Who knew?</p><p>\"As we virtually celebrated one of my closest girlfriends' 49th birthday recently, I planted a seed. 'Let's dream of our next trip' and we agreed on my suggestion:<a href=\"https://www.scmp.com/lifestyle/travel-leisure/article/3147969/chinese-tourists-and-their-big-wallets-still-missed-europe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Greece</a>. A brand new – but old – country for us.</p><p>\"I'm daydreaming as I've kept clippings of articles on the 'Top destinations to visit in Greece', but I want more than the whitewashed beauty of Santorini. I love history and can get carried away when I visit sites, imagining the details of the daily lives of those who walked and lived where now only columns, stones and tiles lie, holding all the whispers, stories and magic of thousands of years in the making.</p><p>\"I'm planning to get lost in the island of Skopelos; off the beaten track with a low-key authentic Greek vibe (Shh, don't tell others, but it was the set location for the movie <span>Mamma Mia!</span> [2008]); soak up as much of the 3,000-plus years of history as I can in Athens – I may get brain overload – and then head up northwest, to visit the isolated region of Zagori.</p><p>\"It's an enticing place to get lost in time, perfect for hiking and biking as I meander through the stone villages, with breathtaking landscapes and sites such as the Vikos Gorge, one of the deepest in the world.</p><p>\"Add to that the flavours and colours of Greek cuisine and wine and I can feel my mouth watering and my brain already lighting up.\"</p><p><a href=\"https://www.scmp.com/lifestyle/food-drink/article/3163893/flexible-vegetarian-options-hong-kong-four-restaurants-city\"><span>Corey Riches is executive chef at Bedu</span></a><span>and the newly opened Little Bedu, both in the dining hot spot of Gough Street, Central. The Australian cut his teeth at restaurants in Brisbane and Melbourne before heading to Hong Kong in 2018 and joining Meraki Hospitality Group.</span></p><p>\"I have experience in kitchens spanning European, Asian and modern Australian cuisine but my passion has always been rooted in the flavours of the Levant. I was trained in the culinary fare of this region and the Bedouin Bowls at Little Bedu are actually named after places in the Middle East: Jordan, Tel Aviv, Cairo and Beirut.</p><p>\"Beirut in particular is high on my bucket list of travel destinations. It feels important to visit a source, and a major influence on the formative years of my culinary career.</p><p>\"Lebanon is more than just political turmoil and tragedy. It's to be celebrated for its vibrant food culture and the deeply hospitable nature of its people. Being Australian, there's a cultural love for eating fresh seafood cooked by the ocean so Beirut has always been a pull for me, and Tripoli, to enjoy street snacks and syrup-rich sweets with sesame and pistachio. Not to mention wineries like Chateau Musar, in the Beqaa Valley – a personal favourite red.\"</p><p><span>Dr Joseph Wong is executive director at the Hong Kong Design Centre. In addition to being a designer, he is an academic and educator, a former vice-principal of the Hong Kong Design Institute and deputy academic director of the Vocational Training Council.</span></p><p>\"Ah, that smell of grass. Nothing gives me quite the same rush as the wafting fragrance of freshly cut grass welcoming you as you walk through the concourse and the famed green lawn of<a href=\"https://www.scmp.com/magazines/style/people-events/article/3019324/what-wimbledon-tennis-champion-novak-djokovics-vegan\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Wimbledon Centre Court</a>comes into sight. As an avid tennis player and fan, my next trip will definitely be to Wimbledon in the summer, hoping to catch one last glimpse of my favourite tennis player of all time [<a href=\"https://www.scmp.com/magazines/style/celebrity/article/3089037/how-roger-federer-became-worlds-highest-paid-athlete\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Roger Federer</a>] graciously floating across the luscious greenery.</p><p>\"The deafening silence before each point just takes my breath away – you have to be physically there to understand the saying 'You could hear a pin drop'. Then wild applause breaks out for yet another seemingly impossible shot.</p><p>\"Strolling around the grounds between matches, I am always touched by the rich history and traditions of the championships. One of my favourite spots is the winners board at the All England Lawn Tennis and Croquet Club, engraved with the names of past champions. Diehard fans need only to look at the names to remember vividly, sometimes agonisingly, what transpired during those match points.</p><p>\"My Wimbledon experience isn't com­plete without watching an entire match, preferably a thrilling five-setter, while sitting on the grass of Murray Mound, formerly known as Henman Hill. You' d better get there early to claim a spot, but don't forget your gingham picnic blanket – and your strawberries and cream!\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 South China Morning Post Publishers Ltd. All rights reserved.</p></div>"}