{"date": "2021-03-19 10:39:59.899000+00:00", "ticker": "AAF", "mrkt_info": {"open": 84.0, "close": 87.6}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, March 18 -- Bharti Airtel Ltd on Thursday said TPG-owned The Rise Fund will invest $200 million in Airtel Mobile Commerce (AMC) BV, the mobile money business of Airtel's Africa unit. The transaction is part of Airtel's strategic asset monetization plan.</p><p>The investment in AMC BV, a wholly-owned subsidiary of the Africa unit, will value the company at $2.65 billion on a cash and debt-free basis. Proceeds from the stake sale will be used to slash Airtel's debt, and invest in developing network and infrastructure across 14 countries in the region.</p></div><div class=\"tr-npp-body\"><p>As part of the transaction, The Rise Fund will pick a minority stake in AMC BV, while Airtel Africa PLC will continue to be the majority stakeholder.</p><p>\"The transaction is subject to customary closing conditions including necessary regulatory filings and approvals, as necessary, and the inclusion of specified mobile money business assets and contracts into AMC BV,\" the company said.</p><p>Bharti Airtel is in talks with other potential investors to sell minority stakes in Airtel Money, up to a total of 25% of the issued share capital of AMC BV, it said.</p><p>As part of the deal, the newly-formed investment vehicle of The Rise Fund will invest $200 million through a secondary purchase of shares in AMC BV from Airtel Africa. The transaction will close in two stages, where $150 million will be invested in the first round. Once the transfer of sufficient mobile money operations and contracts is complete, the remaining $50 million will be infused in the second tranche.</p><p>The deal is expected to reach its first close in the next 3-4 months. The Rise Fund will subsequently be entitled to appoint a director to the AMC BV board.</p><p>\"Our markets afford substantial potential for mobile money services to meet the needs of the tens of millions of customers in Africa who have little or no access to banking and financial services,\" said Raghunath Mandava, chief executive, Airtel Africa. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}