{"date": "2022-02-10 15:18:15.356000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3228.27, "close": 3180.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SUPER LEAGUE GAMING INC (\"SLGG-Q\")\n- Reports Preliminary Fourth Quarter and Full Year 2021 Revenue\n- Results\n\n     Super League Gaming, a leading network of games, monetization tools\nand content channels across metaverse gaming platforms, provided selected\npreliminary unaudited financial results for the fourth quarter and full\nyear ended December 31, 2021.\n\n     Based on preliminary unaudited information, Super League expects to\nreport fourth quarter 2021 revenue between $6.0 million and $6.1 million,\ncompared to $0.8 million reported in the fourth quarter of 2020, reflecting\nan increase of over 650% compared to the prior year quarter.   Full year\n2021 revenue is expected to be between $11.5 million and $11.6 million,\ncompared to $2.1 million in fiscal year 2020, reflecting a year-over-year\nincrease of over 450%.\n\n     In terms of key performance metrics, Super League's platform empowered\nover 1.1 million creators with tools and economies in 2021. The platform\nattracted 75 million monthly active players to its metaverses and surpassed\n11 billion views during 2021.\n\n     \"Our preliminary financial results reflect our ever-expanding, premium\nad inventory and increasing sales force effectiveness as we exited 2021,\"\nsaid Ann Hand, CEO of Super League Gaming. \"Our record-level revenue and\nreach are evidence that players and developers in open gaming platforms -\nthe gaming metaverse, as we call it - are attracted to our games and our\ncreation and monetization tools, and that brands trust us to help them\nnavigate and connect in a high-impact, safe and brand-enhancing way with\nGeneration Z and Millennials. Gaming isn't a new destination - it is where\nthey already are. We believe that we are well-positioned to sustain this\nmomentum in 2022 as we further develop our scalable and immersive in-game\nad platform and build our footprint in the growing metaverse.\"\n\n     Super League expects to release its comprehensive fourth quarter and\nfull year 2021 results in early March.\n\n    About Super League Gaming\n\n    Super League Gaming builds and operates networks of games, monetization\ntools and content channels across open-world gaming platforms that empower\ndevelopers, energize players, and entertain fans. The company's solutions\nprovide incomparable access to an audience consisting of players in the\nlargest global metaverse environments, fans of hundreds of thousands of\ngaming influencers, and viewers of gameplay content across major social\nmedia and digital video platforms. Fueled by proprietary and patented\ntechnology systems, the company's platform includes access to vibrant\nin-game communities, a leading metaverse advertising platform, a network of\nhighly viewed channels and original shows on Instagram, TikTok, Snap,\nYouTube, and Twitch, cloud-based livestream production tools, and an\naward-winning esports invitational tournament series. Super League's\nproperties deliver powerful opportunities for brands and advertisers to\nachieve impactful insights and marketing outcomes with gamers of all ages.\nFor more, go to superleague.com.\n\nContact:Gillian Sheldon\nSuper League Gaming\ngillian.sheldon@superleague.com\n\n     Super League Contact:\nSophie Pearson and Cody Slach\nGateway Investor Relations\nSLG@gatewayir.com\n\n     Forward-Looking Statements\nSafe Harbor Statement under the Private Securities Litigation Reform Act of\n1995. Statements in this press release that are not strictly historical are\n\"forward-looking\" statements within the meaning of Section 27A of the\nSecurities Act of 1933, as amended, and Section 21E of the Securities\nExchange Act of 1934, as amended. These statements involve substantial\nrisks, uncertainties and assumptions that could cause actual results to\ndiffer materially from those expressed or implied by such statements.\nForward-looking statements in this communication include, among other\nthings, statements about our possible or assumed business strategies,\npotential growth opportunities, new products and potential market\nopportunities. Risks and uncertainties include, among other things, our\nability to implement our plans, forecasts and other expectations with\nrespect our business; our ability to realize the anticipated benefits of\nevents that took place during and subsequent to the quarter ended September\n30, 2021, including the possibility that the expected benefits will not be\nrealized or will not be realized within the expected time period; unknown\nliabilities that may or may not be within our control; attracting new\ncustomers and maintaining and expanding our existing customer base; our\nability to scale and update our platform to respond to customers' needs and\nrapid technological change; increased competition on our market and our\nability to compete effectively, and expansion of our operations and\nincreased adoption of our platform internationally. Additional risks and\nuncertainties that could affect our financial results are included in the\nsection titled \"Risk Factors\" and \"Management's Discussion and Analysis of\nFinancial Condition and Results of Operations\" in our Annual Report on Form\n10-K for the year ended December 31, 2020 and other filings that we make\nfrom time to time with the Securities and Exchange Commission which, once\nfiled, are available on the SEC's website at www.sec.gov. In addition, any\nforward-looking statements contained in this communication are based on\nassumptions that we believe to be reasonable as of this date. Except as\nrequired by law, we assume no obligation to update these forward-looking\nstatements, or to update the reasons if actual results differ materially\nfrom those anticipated in the forward-looking statements.\n\nEmail : SLG@gatewayir.com    SUPER LEAGUE GAMING INC\nWWW   : <a href=\"https://www.superleague.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.superleague.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204000536.MNPRE2204002054-07172120220210</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}