{"date": "2022-01-31 19:34:42.994000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>SailPoint Technologies Holdings has launched its new Amazon Web Services region in Tokyo.</p><p>This is the seventh region for the company, with other locations in Frankfurt, London, Montreal, Sydney, and two in the United States. The launch highlights the growing global demand for SailPoint's cloud identity security offerings and the company's focus on helping customers achieve their data residency requirements.\"Identity security is critical for modern enterprise security, helping to secure and enable new technologies while also protecting the workforce. In recent years, data residency has become more important to our customers' identity security programs. Our cloud-native architecture gives us the ability to quickly deploy new regions to help our customers meet their requirements,\" said Asanka Jayasuriya, Chief Technology Officer and Senior Vice President of Engineering at SailPoint. \"In addition, years of investment in our cloud architecture ensures that each new region we launch meets the same high standard for reliability and security.\"Key components of SailPoint's AWS regions:Highly available multi-tenant SaaS environment, which is completely isolated from other regions--no data will be replicated, backed up, or stored in any other region;Any fault in the region is contained, not impacting other SailPoint AWS regions.\"Since our expansion into Japan last year, our customer base in the country continues to rise. In order to deliver a positive customer experience, we must optimize our cloud infrastructure to enable customers' success. The new AWS region in Tokyo accomplishes this, allowing our customers to host their SailPoint identity security offerings within their country's borders,\" said Yutaka Fujimoto, Vice President and Country Manager in Japan, SailPoint. \"We will continue to meet our customers in Japan, and globally, where they are, as their business grows and evolves, providing them with a next-generation identity security solution that sits at the foundation of securing their business.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}