{"date": "2021-11-05 14:47:16.050000+00:00", "ticker": "III", "mrkt_info": {"open": 1368.0, "close": 1372.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- (Part 1 of 2) Strong Third Quarter 2021 Results,\n- Executing on Business Priorities\n\n     Enbridge Inc. (Enbridge or the Company) reported third quarter 2021\nfinancial results, reaffirmed its 2021 financial outlook, and provided a\nquarterly business update.\n\n     Highlights (all financial figures are unaudited and in Canadian\ndollars unless otherwise noted)\n\n//st\n\n* Third quarter GAAP earnings of $682 million or $0.34 per common share,\n  compared with GAAP earnings of $990 million or $0.49 per common share in\n  2020\n* Adjusted earnings of $1.2 billion or $0.59 per common share, compared\n  with $1.0 billion or $0.48 per common share in 2020\n* Adjusted earnings before interest, income taxes and depreciation and\n  amortization (EBITDA) of $3.3 billion, compared with $3.0 billion in 2020\n* Cash Provided by Operating Activities of $2.2 billion, compared with $2.3\n  billion in 2020\n* Distributable Cash Flow (DCF) of $2.3 billion or $1.13 per common share,\n  compared with $2.1 billion or $1.03 per common share in 2020\n* Reaffirmed 2021 full year guidance range for EBITDA of $13.9 billion to\n  $14.3 billion and DCF per share of $4.70 to $5.00\n* Completed and placed into service the U.S. Line 3 Replacement Project\n  ensuring safe, reliable supply of Western Canadian crude\n* Placed into service the expansion of Southern Access (Line 61) increasing\n  capacity to 1.2 million barrels per day\n* Acquired North America's premier crude export facility located near\n  Corpus Christi, Texas, significantly advancing Enbridge's U.S. Gulf Coast\n  export strategy\n* Placed the final phases of the T-South Expansion and Spruce Ridge\n  projects into operation, facilitating the essential supply of natural gas\n  to meet West Coast demand\n* Completed the Appalachia to Market and Middlesex Extension projects,\n  which expand the U.S. Northeast's access to reliable natural gas supply\n* Established a dedicated New Energies Team to advance low-carbon energy\n  infrastructure opportunities across Enbridge's four energy delivery\n  platforms\n* Commissioned industrial scale green hydrogen blending facility to inject\n  hydrogen into the natural gas stream for Enbridge Gas utility customers\n* Construction of three French offshore wind projects, representing\n  approximately 1.4 GW of gross renewable power generation, progressing on\n  schedule\n* Announced a partnership with Vanguard Renewables to build up to eight\n  renewable natural gas (RNG) facilities in the U.S. along Enbridge's gas\n  transmission systems\n* Entered into a memorandum of understanding (MoU) with Shell to develop\n  North American low-carbon energy solutions, focused on hydrogen,\n  renewables, and carbon capture\n* Completed 2021 financing requirements through issuances of $4.8 billion\n  in the U.S. and Canadian debt markets, including $1.1 billion Canadian\n  sustainability-linked bonds\n\n//et\n\n     CEO COMMENT\n\n     Al Monaco, President and CEO commented on the following:\n\n     \"The return of energy demand growth to its pre-pandemic trend, coupled\nwith underinvestment in conventional energy and the recent rise in global\nenergy prices, underscores the criticality of affordable, reliable and\nsecure energy supply for consumers and our social well-being. We believe\nsustainable development of North America's significant energy resources is\nessential to meeting both global energy needs and societal emissions\nreduction objectives. The energy we deliver is critical to fueling quality\nof life in North America and globally and this will continue for decades to\ncome.\n\n     \"At Enbridge, we're strengthening our connections to global markets\nand transitioning our energy mix towards lower-carbon solutions. Over the\nlast two decades, we've significantly expanded our natural gas business and\nconnections to LNG markets, extended our crude oil platform to the U.S.\nGulf Coast and waterborne exports, and built a world-class renewables\nbusiness. Today, we're leveraging these platforms to make disciplined\ninvestments in hydrogen, RNG and carbon capture opportunities, and to\nextend long-term growth and further strengthen our resilience.\n\n     \"Our objective is to be a differentiated energy infrastructure service\nprovider for our customers by leading our industry on environmental, social\nand governance performance. In September, we held our inaugural ESG Forum,\noutlining how we're committed to safely delivering energy, lowering our\nemissions, and diversifying our workforce. Since 2018, we've reduced our\nScope 1 emissions by 32% and Scope 2 by 14%, along with continued\nimprovements in diversity at all levels of our organization. And, to ensure\nwe continue to deliver on our commitments, we've tied our goals to\nenterprise-wide compensation and over $3 billion in sustainability-linked\nfinancings so far.\n\n     \"In the third quarter, the business delivered strong operational\nperformance and financial results across our four franchises. Our low-risk\nbusiness model continues to generate predictable results and execution on\nour strategic priorities is driving solid cash flow growth and per share\nresults.\n\n     \"In Liquids Pipelines, we completed the Minnesota leg of the Line 3\nReplacement Project, allowing us to commence operations of this\nstate-of-the-art pipeline providing a safe and reliable supply of energy.\nWe're very proud of the relationship of trust we've built through this\nproject with communities and Indigenous nations and groups along the\nright-of-way in both Canada and the United States.\n\n     \"During the quarter, we acquired the Ingleside Energy Center, North\nAmerica's premier crude oil export terminal. With the lowest basin-to-water\ncost structure and proximity to world-class Permian reserves, this terminal\nwill be critical to North America capitalizing on its energy advantage. The\ntransaction is expected to be immediately accretive to cash flow per share\nwhile maintaining our strong balance sheet and financial flexibility.\n\n     \"This investment is a prime example of how we're focused on being a\ndifferentiated service provider to our customers. By committing to invest\nin co-located solar power, we will achieve net-zero scope 1 and 2 emissions\nat the facility and contribute to scope 3 emission reductions.\n\n     \"In Gas Transmission, we've continued to advance the execution of our\nNorth American-wide secured capital program. Our multi-year modernization\nprogram is on track, and we've placed the Appalachia to Market and\nMiddlesex Extension projects into service, which will provide much needed\naccess to natural gas supplies in New England for the upcoming heating\nseason. In B.C., our expansions are progressing well, with the $1 billion\nT-South project and the $0.5 billion Spruce Ridge project commencing\noperations.\n\n     \"The Utility is on track to add another 45 thousand customers in 2021\nand advancing community expansion programs across the system. This business\nalso continues to provide us with a unique opportunity to develop\nlow-carbon solutions within our low-risk commercial model. We've now\ncommissioned our first hydrogen blending pilot facility serving the\nUtility's customers and commenced construction of our seventh RNG project.\nThese projects demonstrate the importance of our conventional assets to the\ntransition to a lower-carbon economy.\n\n     \"Our renewables business is making good progress on the construction\nof the three offshore wind projects off the coast of France, which will\ngenerate enough renewable energy to power over 1 million homes. And, in\nNorth America, four more solar self-power projects are in construction\nalong our liquids pipelines, further lowering our emissions.\n\n     \"In September, we announced that we're building on our track record of\nsuccess in renewables and low-carbon investments with the formation of our\nNew Energies Team. This team will be dedicated to advancing our low-carbon\nstrategies and differentiated energy delivery capabilities across each of\nour businesses. And, we're partnering with leading low-carbon energy\ncompanies to combine their technologies with our existing energy\ninfrastructure capabilities.\n\n     \"We're on track to deliver more than $10 billion of capital into\nservice in 2021. This capital, along with embedded growth in each of our\nbusinesses, will drive significant free cash flow growth and approximately\n$5-6 billion of annual investable capacity to redeploy into our business.\nEach of our blue chip platforms has a strong opportunity set of\nconventional and low-carbon organic growth, and we will continue to\nprioritize disciplined capital allocation where new growth projects will\ncompete against capital allocation opportunities.\n\n     \"At our upcoming annual investor day on December 7th, we'll outline\nour 3-year plan priorities, including 2022 financial guidance. And, our\nbusiness leaders will walk through how each of our businesses are\npositioned to benefit from conventional and low-carbon organic growth,\nalong with how our disciplined approach to investment will continue to\nmaximize shareholder value.\n\n     \"2021 continues to be a strong catalyst year for Enbridge. We've\nreaffirmed our full year 2021 EBITDA and DCF per share guidance and\nexecuted on our strategic priorities. We're excited about how we're\npositioned for energy transition and the opportunities that lay ahead in\n2022 and beyond.\"\n\n     FINANCIAL RESULTS SUMMARY\n\n     Financial results for the three and nine months ended September 30,\n2021 and 2020 are summarized in the table below:\n\n//st\n\n                       Three months ended         Nine months ended\n                       September 30,              September 30,\n\n                       2021               2020    2021              2020\n\n(unaudited;\nmillions of\nCanadian dollars,\nexcept per share\namounts; number of\nshares in millions)\n\nGAAP Earnings          682                990     3,976             1,208\nattributable to\ncommon shareholders\n\nGAAP Earnings per      0.34               0.49    1.97              0.60\ncommon share\n\nCash provided by       2,163              2,302   6,954             7,527\noperating activities\n\nAdjusted EBITDA1       3,269              2,997   10,314            10,072\n\nAdjusted Earnings1     1,184              961     4,175             3,762\n\nAdjusted Earnings      0.59               0.48    2.06              1.86\nper common share1\n\nDistributable Cash     2,290              2,088   7,554             7,231\nFlow1\n\nWeighted average       2,024              2,021   2,023             2,020\ncommon shares\noutstanding\n\n//et\n\n//st\n\n1   Non-GAAP financial measures. Schedules reconciling adjusted EBITDA,\n    adjusted earnings, adjusted earnings per common share and\n    distributable cash flow are available as Appendices to this news\n    release.\n\n//et\n\n     GAAP earnings attributable to common shareholders for the third\nquarter of 2021 decreased by $308 million or $0.15 per share compared with\nthe same period in 2020.\n\n     The period-over-period comparability of GAAP earnings attributable to\ncommon shareholders is impacted by certain unusual, infrequent factors or\nother non-operating factors, which are noted in the reconciliation schedule\nincluded in Appendix A of this news release. Refer to the third quarter\nManagement Discussion &amp; Analysis filed as part of the third quarter\nfinancial statements for a detailed discussion of GAAP financial results.\n\n     Adjusted earnings in the third quarter of 2021 increased by $223\nmillion, or $0.11 per share and was driven largely by the net impact of the\noperating factors discussed below, along with lower interest rates on\nshort-term borrowings and the positive impact of a weaker USD on the\ntranslation of USD denominated interest expense.\n\n     Adjusted EBITDA in the third quarter of 2021 increased by $272 million\ncompared with the same period in 2020. This is primarily driven by\nrebounding demand for energy as economies continue to recover from the\nimpacts of the COVID-19 pandemic offset by the impacts of a weaker USD\nwhich negatively impacts the translation of the Company's USD denominated\nEBITDA. The average CAD to USD exchange rate in the third quarter fell\napproximately 5% in 2021 to $1.26, compared with $1.33 in the third quarter\nof 2020. Enbridge's enterprise-wide financial risk management program has\npartially mitigated the impact of a weaker USD currency through its foreign\nexchange hedging program.\n\n     DCF for the third quarter was $2.3 billion, an increase of $202\nmillion over the third quarter of 2020, driven primarily by the impact of\nthe operating factors discussed above, along with lower utility maintenance\ncapital expenditures in 2021 and lower interest expense as discussed above.\n\n     These factors are discussed in detail under Distributable Cash Flow.\nDetailed segmented financial information and analysis can be found below\nunder Adjusted EBITDA by Segments.\n\n     FINANCIAL POSITION\n\n     The Company expects to maintain a strong financial position for the\nremainder of 2021, consistent with its target Debt/EBITDA range of 4.5x to\n5.0x. Further strengthening is anticipated in 2022 as annualized EBITDA\ncontributions from the approximately $14 billion of capital projects and\nasset acquisitions executed in 2021 are realized, along with the closing of\nthe $1.1 billion sale of Noverco expected in late 2021 or early 2022.\n\n     As of today, Enbridge has completed its financing plan issuing\napproximately $4.8 billion at attractive rates in the U.S. and Canadian\ndebt markets since July 1, 2021. These issuances complete the Company's\n2021 financing plan requirements, which includes funding for the Moda\nMidstream Operating LLC acquisition consisting of the Ingleside Energy\nCenter and related pipeline and logistics assets, which closed subsequent\nto the quarter.\n\n     Included in the third quarter financings was a $1.1 billion Canadian\nmarket issuance of 12-year Sustainability-Linked senior notes which links\ndirectly to the Company's ESG goals. Together with the US$1.0 billion of\nsenior notes and $1.0 billion credit facility issued earlier in 2021, this\nbrings Enbridge's total sustainability-linked financings to approximately\n$3.3 billion demonstrating the Company's ongoing commitment to ESG\nleadership.\n\n     Proceeds from these offerings were primarily used to repay existing\nindebtedness, partially fund capital projects, and for other general\ncorporate purposes.\n\n     FINANCIAL OUTLOOK\n\n     The Company expects full year 2021 EBITDA and DCF to remain within its\npreviously provided guidance range of $13.9 billion to $14.3 billion and\n$4.70 to $5.00 per share, respectively.\n\n     EBITDA across each of the Company's four businesses benefited from\nstrong operating performance in the first nine months of 2021, which is\nexpected to continue in the fourth quarter. In addition, the completion of\nthe Line 3 Replacement Project, the T-South Reliability and Expansion\nProgram, the Spruce Ridge Project, the Moda acquisition discussed in detail\nbelow, and several smaller capital projects within the third quarter, are\nexpected to provide incremental EBITDA contributions in the fourth quarter\nand in 2022. However, these positive operating factors have been, and are\nexpected to continue to be, impacted by a weaker USD currency (net of\nforeign exchange hedges), warmer than normal weather in Ontario impacting\nGas Distribution and Storage and negative contributions from Energy\nServices, which remains challenged by narrow location and quality\ndifferentials, as well as backwardation in commodity prices.\n\n     DCF is expected to benefit from lower overall financing costs\nresulting from favorable short-term interest rates and USD denominated\ninterest expense which benefits from a weaker USD currency, lower cash\ntaxes primarily due to increased utilization of existing tax pools to\noffset U.S. taxable income, and slightly lower than planned Gas\nDistribution and Storage maintenance spending.\n\n     SECURED GROWTH PROJECT EXECUTION UPDATE\n\n     The Company's approximately $17 billion secured growth capital program\nis well-diversified across its four businesses and contractually\nunderpinned by commercial frameworks consistent with its low-risk\npipeline-utility model. Capital expenditures to date across the secured\ncapital program are approximately $10 billion, with $7 billion remaining to\nbe spent.\n\n     Enbridge is on track to place approximately $10 billion of capital\ninto service in 2021, which is expected to generate significant EBITDA and\nfree cash flow growth in 2022. Since July 1, 2021, Enbridge has placed\napproximately $8 billion of capital projects into service, including:\n\n//st\n\n* the US$4.0 billion U.S. portion of the Line 3 Replacement Project and\n  associated US$0.5 billion Southern Access Expansion to 1.2 million\n  barrels per day (mmbpd);\n* the $1.0 billion T-South Reliability and Expansion Program and the $0.5\n  billion Spruce Ridge Project, which increase capacity on the B.C.\n  Pipeline; and,\n* the combined US$0.1 billion Appalachia to Market and Middlesex Extension\n  projects, which support reliable natural gas supply into the U.S.\n  Northeast.\n\n//et\n\n     In addition, Enbridge continues to advance execution of its multi-year\nUS$2.1 billion Gas Transmission and Midstream modernization program, and is\non track to add an estimated 45 thousand Gas Distribution and Storage\ncustomers in 2021, including related capital expenditures.\n\n     In Renewable Power Generation, construction of the three previously\nannounced French offshore wind projects, Saint-Nazaire, Fecamp, and\nCalvados, is advancing on schedule for the targeted in-service dates\nranging between late 2022 and 2024. Combined, these projects will provide\n1.4 GW (0.3 GW net) of generation capacity in France, enough to power over\n1 million homes with renewable energy.\n\n     Line 3 Replacement Project and Southern Access Expansion\n\n     The U.S. portion of the Line 3 Replacement Project was placed into\nservice on October 1, 2021. This completes the final step of the full\nreplacement project from Hardisty, AB to Superior, WI, restoring its\ncapacity to 760 kbpd. This project enhances the continued safe and reliable\noperations of Enbridge's Mainline System, which provides essential\nfeedstock to meet U.S. and Canadian refinery demand.\n\n     For the first nine months of 2021, Enbridge has been collecting a\npartial surcharge of US$0.20 per barrel on the Canadian portion of Line 3\nReplacement Project, which commenced operations in late 2019. As of October\n1, 2021, the full Line 3 Replacement surcharge of US$0.935 per barrel,\ninclusive of a US$0.04 per barrel receipt terminalling surcharge, is in\neffect. Inclusive of the surcharge increase and restored capacity, the\nproject is expected to contribute approximately $200 million of incremental\nEBITDA in the fourth quarter of 2021, and support significant cash flow\ngrowth in 2022 and beyond.\n\n     In addition, the Company has placed into service the expansion of\nSouthern Access (Line 61) originating at Enbridge's Superior, Wisconsin\nTerminal and flowing to the Flanagan, Illinois Terminal. The expansion\nincreases Southern Access's capacity by approximately 200 thousand barrels\nper day (kbpd) to 1.2 mmbpd and ensures market access for additional\nbarrels flowing on the Mainline with the completion of the Line 3\nReplacement Project.\n\n     Upon completion of the Line 3 Replacement Project and Southern Access\nExpansion, and net of system optimizations already in operation, the\nCompany anticipates average annual ex-Gretna Mainline capacity of\napproximately 3.1 mmbpd and average throughput for the fourth quarter of\napproximately 2.95 mmbpd.\n\n     OTHER BUSINESS UPDATES\n\n     Changes to Board of Directors\n\n     Today, Enbridge announced that its Board of Directors has appointed\nGaurdie Banister and Jane Rowe as directors of Enbridge, effective November\n4, 2021.\n\n     Also, on November 1, 2021, Mr. Marcel R. Coutu and Ms. V. Maureen\nKempston Darkes each notified Enbridge of their intention to resign from\nthe Board of Directors of the Company, effective November 1, 2021. Neither\nMr. Coutu's nor Ms. Kempston Darkes' decision to resign from the Board of\nDirectors was the result of any disagreement relating to the Company's\noperations, policies or practices.\n\n     \"On behalf of the Board of Directors of Enbridge, we are very pleased\nto welcome Gaurdie and Jane to the Enbridge Board. They each have extensive\nbusiness experience and will be excellent additions to our Board. We look\nforward to their contributions. At the same time, we would like to thank\nMarcel and Maureen for their valuable service and contributions to Enbridge\nover the years,\" stated Greg Ebel, the Chair of the Board of Directors of\nEnbridge.\n\n     Liquids Pipelines\n\n     Mainline Contracting The Mainline Contracting hearing before the\nCanada Energy Regulator (CER) concluded during the quarter. The CER is now\nreviewing the record developed throughout the regulatory process and has\nindicated that it anticipates it will release its decision in November of\nthis year.\n\n     The current Competitive Toll Settlement (CTS) expired on June 30, 2021\nand, consistent with the terms of the CTS agreement, the tolls in effect at\nthat time remained in effect on July 1, 2021 on an interim basis subject to\nfinalization and refund, if any. With the U.S. portion of the Line 3\nReplacement Project entering service, these interim tolls have been updated\neffective October 1, 2021 to include the full Line 3 Replacement surcharge\nof US$0.935 per barrel inclusive of a US$0.04 receipt terminalling\nsurcharge.\n\n     Moda Acquisition On October 12, 2021, Enbridge closed the previously\nannounced acquisition of Moda Midstream Operating LLC for US$3.0 billion.\nThe acquisition included a 100 percent operating interest in the Ingleside\nEnergy Center, North America's largest crude oil export terminal, located\nnear Corpus Christi, Texas. This state-of-the-art terminal consists of 15.3\nmillion barrels of storage, fully contracted under long-term take-or-pay\nstorage contracts, and 1.6 mmbpd of export capacity underpinned by 925 kbpd\nof long-term take-or-pay vessel loading contracts.\n\n     In addition, Enbridge acquired a 20 percent interest in the 670-kbpd\nCactus II Pipeline, a 100 percent operating interest in the 300-kbpd Viola\npipeline, and a 100 percent interest in the 350-thousand-barrel Taft\nTerminal. Together with the Ingleside Energy Center, these pipelines and\nstorage assets provide a fully integrated light crude export platform.\n\n     This acquisition significantly advances Enbridge's U.S. Gulf Coast\nexport strategy and provides connectivity to low-cost and long-lived\nreserves in the Permian and Eagle Ford basins. The acquired assets are\nexpected to be immediately and strongly accretive to DCF and earnings per\nshare and provide further organic growth opportunities supporting\nEnbridge's post-2023 growth outlook.\n\n     Gas Transmission and Midstream\n\n     Regulatory Update The Company's regulatory strategy requires periodic\nrate case filings to ensure just and reasonable returns on and of the\ncapital invested into its critical energy delivery systems.\n\n     On September 10, 2021, the Federal Energy Regulatory Commission (FERC)\napproved a Stipulation and Agreement filed with regards to the Section 4\nEast Tennessee rate case filed on June 30, 2020. On an annualized basis,\nthis settlement is expected to provide an incremental EBITDA contribution\nof approximately US$10 million.\n\n     During the quarter, Enbridge filed a Section 4 rate case on the Texas\nEastern system to reflect growth in the system's rate base and an increase\nin cost of service, primarily as a result of system modernization, and\nsafety and reliability investments. The FERC has accepted the filing,\nallowing filed rate increases to take effect after a 5 month suspension\nperiod, subject to refund. Negotiations with shippers are expected to begin\nin early 2022.\n\n     Gas Distribution and Storage\n\n     Hydrogen Blending On October 1, 2021, Enbridge's first large scale\ngreen hydrogen blending facility located in Markham, Ontario was\ncommissioned, adding up to 2% hydrogen by volume into the gas stream for\n3,600 customers. This project has the potential to contribute to the\navoidance of up to 120 tCO2e annually, and could pave the way for blending\ninto the entire Ontario gas distribution system.\n\n     In addition, Enbridge continues to develop a second green hydrogen\nblending facility in Gatineau, Quebec, in partnership with Evolugen. This\nfacility could blend up to 15% hydrogen by volume for 43,000 customers and\nhas the potential to contribute to the avoidance of up to 15,000 tCO2e\nannually.\n\n     RNG Development The Company announced its seventh RNG project located\nat the City of Toronto's Disco Road Solid Waste Management Facility. This\nfacility will produce RNG from biodegradable waste collected as part of the\nCity of Toronto's Green Bin program and inject it into Enbridge Gas Inc.'s\nnatural gas distribution system lowering natural gas related CO2 emissions.\nThe project is expected to be in service in 2023.\n\n     Enbridge is developing a further 10 to 15 projects independently\nwithin its franchise, and across Canada in partnership with Comcor\nTechnologies and Walker Industries.\n\n     Renewable Power Generation\n\n     Formation of New Energies Team and Additional Partnerships During the\nthird quarter, Enbridge announced the creation of a dedicated team focused\non advancing low-carbon energy infrastructure opportunities across the\nCompany's energy delivery businesses. The team will leverage and build on\nEnbridge's early investments in RNG, hydrogen and carbon capture,\nutilization and storage (CCUS), as well as other low-carbon technologies.\n\n     The Company announced a MoU with Shell to develop low-carbon energy\nsolutions across North America leveraging both companies' extensive\nexperience, complimentary assets and commitment to ESG leadership. Enbridge\nand Shell will explore opportunities to collaborate on potential green and\nblue hydrogen production, renewable power generation where the parties\nbring unique strengths, and CCUS opportunities, which at present excludes\nthe Alberta market given various opportunities already under development.\n\n     Enbridge also announced a partnership with Vanguard Renewables, a\nleading U.S. developer of RNG infrastructure. Under the partnership,\nVanguard Renewables will initially build and operate up to 8 digesters in\nthe U.S. Northeast and Midwest capable of producing approximately 2\nBcf/year of RNG from food and farm waste, with Enbridge investing up to\n$100 million in RNG upgrading and transportation assets, and providing\nmarketing services that leverage its extensive energy infrastructure assets\nand capabilities. This partnership positions Enbridge as the partner of\nchoice for future mixed-waste RNG development projects.\n\n     THIRD QUARTER 2021 FINANCIAL RESULTS\n\n     The following table summarizes the Company's GAAP reported results for\nsegment EBITDA, earnings attributable to common shareholders and cash\nprovided by operating activities for the third quarter of 2021.\n\n     GAAP SEGMENT EBITDA AND CASH FLOW FROM OPERATIONS\n\n//st\n\n                       Three months ended         Nine months ended\n                       September 30,              September 30,\n\n                       2021               2020    2021               2020\n\n(unaudited;\nmillions of\nCanadian dollars)\n\nLiquids Pipelines      1,673              2,090   5,756              5,280\n\nGas Transmission       884                334     2,725              230\nand Midstream\n\nGas Distribution       282                298     1,374              1,285\nand Storage\n\nRenewable Power        91                 93      362                376\nGeneration\n\nEnergy Services        (204)              (34)    (379)              (12)\n\nEliminations and       (121)              207     191                (498)\nOther\n\nEBITDA                 2,605              2,988   10,029             6,661\n\nEarnings               682                990     3,976              1,208\nattributable to\ncommon shareholders\n\nCash provided by       2,163              2,302   6,954              7,527\noperating activities\n\n//et\n\n   For purposes of evaluating performance, the Company makes adjustments to\nGAAP reported earnings, segment EBITDA and cash flow provided by operating\nactivities for unusual, infrequent or other non-operating factors, which\nallow Management and investors to more accurately compare the Company's\nperformance across periods, normalizing for factors that are not indicative\nof underlying business performance. Tables incorporating these adjustments\nfollow below. Schedules reconciling EBITDA, adjusted EBITDA, adjusted\nEBITDA by segment, adjusted earnings, adjusted earnings per share and DCF\nto their closest GAAP equivalent are provided in the Appendices to this\nnews release.\n\n   DISTRIBUTABLE CASH FLOW\n\n//st\n\n                       Three months ended        Nine months ended\n                       September 30,             September 30,\n\n                       2021              2020    2021              2020\n\n(unaudited;\nmillions of\nCanadian dollars,\nexcept per share\namounts)\n\nLiquids Pipelines      1,898             1,732   5,623             5,395\n\nGas Transmission       986               945     2,928             3,017\nand Midstream\n\nGas Distribution       296               315     1,403             1,330\nand Storage\n\nRenewable Power        89                93      356               361\nGeneration\n\nEnergy Services        (116)             (110)   (277)             (37)\n\nEliminations and       116               22      281               6\nOther\n\nAdjusted EBITDA1,3     3,269             2,997   10,314            10,072\n\nMaintenance capital    (142)             (256)   (412)             (595)\n\nInterest expense1      (665)             (721)   (1,977)           (2,141)\n\nCurrent income tax1    (89)              (83)    (210)             (325)\n\nDistributions to       (66)              (68)    (207)             (232)\nnoncontrolling\ninterests1\n\nCash distributions     52                197     248               479\nin excess of equity\nearnings1\n\nPreference share       (92)              (94)    (274)             (284)\ndividends\n\nOther receipts of      23                118     74                250\ncash not recognized\nin revenue2\n\nOther non-cash         --                (2)     (2)               7\nadjustments\n\nDCF3                   2,290             2,088   7,554             7,231\n\nWeighted average       2,024             2,021   2,023             2,020\ncommon shares\noutstanding\n\n//et\n\n//st\n\n1   Presented net of adjusting items.\n\n2   Consists of cash received net of revenue recognized for contracts\n    under make-up rights and similar deferred revenue arrangements.\n\n3   Schedules reconciling adjusted EBITDA and DCF are available as\n    Appendices to this news release.\n\n//et\n\n   Third quarter 2021 DCF increased $202 million compared with the same\nperiod of 2020 primarily due to operational factors discussed below in\nAdjusted EBITDA by Segments as well as:\n\n//st\n\n* lower Gas Distribution and Storage maintenance capital due to timing of\n  spend; and\n* lower interest expense due to favorable interest rates on short-term\n  borrowings as well as the impact of a weaker USD currency that positively\n  impacts the translation of interest payments on USD denominated debt;\n  partially offset by\n* lower cash distributions in excess of equity earnings primarily as a\n  result of higher equity earnings (reflected in Adjusted EBITDA) at\n  certain equity investments that have not experienced higher corresponding\n  cash distributions in the quarter; and\n* lower receipts of cash not recognized in revenue primarily due to\n  shippers utilizing take-or-pay commitments on contracted assets that\n  contain make-up right provisions in the third quarter of 2021 when\n  compared with the third quarter of 2020, which allows for the recognition\n  of the revenue in Adjusted EBITDA.\n\n//et\n\n   ADJUSTED EARNINGS\n\n//st\n\n                       Three months ended        Nine months ended\n                       September 30,             September 30,\n\n                       2021              2020    2021              2020\n\n(unaudited;\nmillions of\nCanadian dollars,\nexcept per share\namounts)\n\nAdjusted EBITDA1       3,269             2,997   10,314            10,072\n\nDepreciation and       (944)             (935)   (2,805)           (2,766)\namortization\n\nInterest expense2      (654)             (708)   (1,941)           (2,099)\n\nIncome taxes2          (355)             (278)   (1,023)           (1,133)\n\nNoncontrolling         (34)              (21)    (90)              (28)\ninterests2\n\nPreference share       (98)              (94)    (280)             (284)\ndividends\n\nAdjusted earnings1     1,184             961     4,175             3,762\n\nAdjusted earnings      0.59              0.48    2.06              1.86\nper common share\n\n//et\n\n//st\n\n1   Schedules reconciling adjusted EBITDA and adjusted earnings are\n    available as Appendices to this news release.\n\n2   Presented net of adjusting items.\n\n//et\n\n     Adjusted earnings increased $223 million and adjusted earnings per\nshare increased $0.11 compared with the third quarter in 2020. The increase\nin adjusted earnings was driven by the same factors impacting business\nperformance and adjusted EBITDA as discussed under Adjusted EBITDA by\nSegments below, as well as lower interest expense due to favorable interest\nrates on short-term borrowings as well as the impact of a weaker USD\ncurrency that positively impacts the translation of interest payments on\nUSD denominated debt.\n\n     ADJUSTED EBITDA BY SEGMENTS\n\n     Adjusted EBITDA by segment is reported on a Canadian dollar basis.\nAdjusted EBITDA generated from U.S. dollar denominated businesses,\nprimarily within Liquids Pipelines and Gas Transmission and Midstream, were\ntranslated at a lower average Canadian dollar exchange rate in the third\nquarter of 2021 (C$1.26/US$) when compared with the corresponding 2020\nperiod (C$1.33/US$).\n\n     A portion of U.S. dollar earnings is hedged under the Company's\nenterprise-wide financial risk management program. The offsetting hedge\nsettlements are reported within Eliminations and Other.\n\n     LIQUIDS PIPELINES\n\n//st\n\n                       Three months ended         Nine months ended\n                       September 30,              September 30,\n\n                       2021               2020    2021               2020\n\n(unaudited;\nmillions of\nCanadian dollars)\n\nMainline System        1,083              994     3,264              3,070\n\nRegional Oil Sands     225                195     693                605\nSystem\n\nGulf Coast and         252                213     702                714\nMid-Continent System\n\nOther1                 338                330     964                1,006\n\nAdjusted EBITDA2       1,898              1,732   5,623              5,395\n\nOperating Data\n(average deliveries\n- thousands of bpd)\n\nMainline System -      2,673              2,555   2,680              2,612\nex-Gretna volume3\n\nRegional Oil Sands     1,899              1,399   1,911              1,549\nSystem4\n\nInternational Joint    $4.27              $4.27   $4.27              $4.23\nTariff (IJT)5\n\nCompetitive Tolling    $0.26              $0.26   $0.26              $0.19\nSettlement\nSurcharges5\n\nLine 3 Canada          $0.20              $0.20   $0.20              $0.20\nInterim Surcharge5,6\n\n//et\n\n//st\n\n1   Other consists of Southern Lights Pipeline, Express-Platte System,\n    Bakken System, and Feeder Pipelines &amp; Other.\n\n2   Schedules reconciling adjusted EBITDA are available as Appendices to\n    this news release.\n\n3   Mainline System throughput volume represents mainline system\n    deliveries ex-Gretna, Manitoba which is made up of U.S. and Eastern\n    Canada deliveries originating from Western Canada.\n\n4   Volumes are for the Athabasca Pipeline, Waupisoo Pipeline, Woodland\n    Pipeline and Wood Buffalo system and exclude laterals on the Regional\n    Oil Sands System.\n\n5   The IJT benchmark toll and its components are set in U.S. dollars and\n    the majority of the Company's foreign exchange risk on the Canadian\n    portion of the Mainline is hedged. The Canadian portion of the\n    Mainline represents approximately 55% of total Mainline System\n    revenue and the average effective FX rate for the Canadian portion of\n    the Mainline during the third quarter of 2021 was C$1.26/US$ (Q3\n    2020: C$1.20/US$).\n\n    The U.S. portion of the Mainline System is subject to FX translation\n    similar to the Company's other U.S. based businesses, which are\n    translated at the average spot rate for a given period. A portion of\n    this U.S. dollar translation exposure is hedged under the Company's\n    enterprise-wide financial risk management program. The offsetting\n    hedge settlements are reported within Eliminations and Other.\n\n6   Interim surcharge for the Canadian portion of the Line 3 Replacement\n    Project, which was placed into service on December 1, 2019. The\n    interim surcharge was replaced by the full Line 3 Replacement\n    surcharge beginning on October 1, 2021 with the completion of the\n    U.S. portion of the Line 3 Replacement Project.\n\n//et\n\n   Liquids Pipelines adjusted EBITDA increased $166 million compared with\nthe third quarter of 2020, primarily related to:\n//st\n\n* higher Mainline System throughput compared with the third quarter of 2020\n  driven by the rebounding demand for crude oil and related products from\n  the impacts of the COVID-19 pandemic, and a higher effective foreign\n  exchange hedge rate (C$1.26 in 2021 vs. C$1.20 in 2020) on hedges used to\n  manage foreign exchange risk of the U.S. dollar denominated Canadian\n  Mainline revenue;\n* higher throughput within the Regional Oil Sands System due to recovery\n  from the impacts of the COVID-19 pandemic and completion of the Woodland\n  Pipeline expansion in June 2021; and\n* higher contributions from the Gulf Coast and Mid-Continent System due\n  primarily to higher throughput on the Seaway Crude Pipeline System;\n  partially offset by\n* lower throughput on the Flanagan South Pipeline reflected in Gulf Coast\n  and Mid-Continent System driven by robust PADD II refinery demand\n  resulting in less volumes available to move towards the U.S. Gulf Coast;\n  and\n* the negative effect of translating U.S. dollar denominated EBITDA at a\n  lower Canadian to U.S. dollar average exchange rate, which is partially\n  offset by realized gains in the Eliminations and Other segment as part of\n  the Company's enterprise-wide financial risk management program.\n\n//et\n\n   GAS TRANSMISSION AND MIDSTREAM\n\n//st\n\n                       Three months ended         Nine months ended\n                       September 30,              September 30,\n\n                       2021                2020   2021               2020\n\n(unaudited;\nmillions of\nCanadian dollars)\n\nU.S. Gas               732                 762    2,235              2,417\nTransmission\n\nCanadian Gas           130                 111    412                354\nTransmission\nU.S. Midstream         85                  36     169                116\n\nOther                  39                  36     112                130\n\nAdjusted EBITDA1       986                 945    2,928              3,017\n\n//et\n\n//st\n\n1 Schedules reconciling adjusted EBITDA are available as Appendices to\nthis news release.\n\n//et\n\n//st\n\n* Gas Transmission and Midstream adjusted EBITDA increased $41 million\n  compared with the third quarter of 2020 primarily related to:\n* higher U.S. Gas Transmission contributions from the Atlantic Bridge Phase\n  III project, with in-service notifications to FERC in January of 2021 and\n  increased revenue due to the absence of pressure restrictions that\n  existed on the Texas Eastern system in 2020;\n* higher Canadian Gas Transmission contributions due timing of operating\n  and administrative expenses; and\n* higher U.S. midstream contributions as a result of higher commodity\n  prices benefiting Enbridge's Aux Sable and DCP joint ventures; partially\n  offset by\n* the negative effect of translating U.S. dollar denominated EBITDA at a\n  weaker U.S dollar average exchange rate primarily impacting U.S. Gas\n  Transmission and U.S. Midstream results, which is partially offset by\n  realized gains in the Eliminations and Other segment as part of the\n  Company's enterprise-wide financial risk management program.\n\n//et\n\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130800075.MNPRE2130800397-07434020211105</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}