{"date": "2021-11-17 14:15:02.608000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">The Connect Kit by OnLogic includes a rugged industrial PC preloaded with Inductive Automation's Ignition Software, along with accessories to rapidly connect legacy equipment at the edge to AWS cloud services.</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">SOUTH BURLINGTON, Vt., Nov. 17, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">SOUTH BURLINGTON, Vt</span>., <span class=\"xn-chron\">Nov. 17, 2021</span> /PRNewswire/ -- Industrial IoT solution provider, OnLogic (<u><a href=\"http://www.onlogic.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.onlogic.com</a></u>), unveiled the \"Connect Kit by OnLogic\" during a live event on <span class=\"xn-chron\">November 11th</span>. Designed as a bundled kit of hardware and software, the Connect Kit allows facilities to easily connect their equipment to the cloud in one hour. Consultation from Cirrus Link Solutions, experts in SCADA and Industrial IoT implementation, is included with the kit to provide guidance. OnLogic indicated that users of the connect kit will be able to begin data collection via Inductive Automation's Ignition Trial software and transfer to AWS cloud services without writing a single line of code.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/1611195/OnLogic_Logo_Logo.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"(PRNewsfoto/OnLogic)\" src=\"https://mma.prnewswire.com/media/1611195/OnLogic_Logo_Logo.jpg\" title=\"(PRNewsfoto/OnLogic)\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTYxMTE5NS9PbkxvZ2ljX0xvZ29fTG9nby5qcGc=&amp;key=98d998ef56faa3bf44ea7d7d774c675aa1aea013616d4912e07a41c9d9763274dd08b4b984140f806eb4a810c3aee7a8cb887619056b11779c32190fb5664bd0\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>The kit is available for purchase now by visiting <u><a href=\"https://www.onlogic.com/ckt110/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">onlogic.com/ckt110</a></u> or contacting an OnLogic solutions expert at 802-862-7478.</p>\n<p>\"Digital transformation, Industrial IoT, Industry 4.0, call it what you will; essentially it's about connecting the most valuable assets of your business to gain insights into your day to day operations. To meet evolving standards and production goals, facilities need to connect legacy devices, whether on-premise or in the cloud, to minimize operating costs, asset downtime, and increase efficiency,\" said <span class=\"xn-person\">Carolyn Swan</span>, OnLogic Partnerships Lead. \"However, the first step of digital transformation can seem complex and daunting. The Connect Kit is designed to cut through the complexity and offer a simple solution to leverage business intelligence for cost savings.\"</p>\n<p><b>The Connect Kit by OnLogic includes:</b></p>\n<ul type=\"disc\" class=\"bulleted-list arrowlist\"><li>A custom-configured OnLogic Karbon 300 Rugged PC w/ Ignition Trial Edition software pre-installed </li><li>An hour of expert consultation from Cirrus Link Solutions </li><li>2 x 6ft. Premium Shielded Ethernet Cables </li><li>1 x DisplayPort to HDMI Cable </li><li>1 x Computer Port and Dust Blocking Kit </li><li>1 x Terminal Block Kit </li><li>1 x DIN Mounting Clip </li><li>1 x Power Supply</li></ul><p>The custom configuration of the AWS IoT Qualified Karbon 300 Rugged PC encompasses both the hardware specifications and the software image applied to the system.</p>\n<p>The Connect Kit by OnLogic was inspired by a recent digital transformation project with a prominent Fortune 500 company. <span class=\"xn-person\">Arlen Nipper</span>, President and CTO of Cirrus Link, was able to connect the company's production hardware to AWS cloud services in less than an hour utilizing the same combination of OnLogic hardware and Inductive Automation's Ignition software found in the Connect Kit.</p>\n<p>\"You don't need to build a rocketship to go to the grocery store,\" said <span class=\"xn-person\">Arlen Nipper</span>, President and CTO of Cirrus Link. \"Often businesses believe they need an overly complicated plan and needlessly complex systems to start their modernization. More often than not, starting by quickly connecting a part of their process to the cloud is the best thing a company can do. By connecting those first devices, you're able to realize immediate value for the business and become familiar with the process. The business will then be better informed regarding what they will need to scale their transformation project, whether small or large in scope.\"</p>\n<p>The Connect Kit by OnLogic is expected to be utilized as a \"one box\" solution for systems integrators to prove the value of digital transformation to prospective customers. The Karbon 300 Rugged PC was chosen for the Kit due to its ability to operate reliably in the wide-range of conditions presented by industries ranging from manufacturing to energy production. The fanless and ventless system is compact to fit into a variety of spaces and enclosures. It offers a wide operating temperature range, variable power input capabilities, and has been tested against MIL-<span class=\"xn-money\">STD-810</span> standards for shock and vibration.</p>\n<p>\"I envision system integrators stocking up on our Connect Kit, ready to grab off the shelf and deploy with customers,\" said <span class=\"xn-person\">Anders Nielsen</span>, OnLogic Business Development Executive. \"The ability to show rapid and reliable value is a requirement of a modern business model. What better way to win an integration than to prove the real-world value of connecting the customer's facility in a rapid fashion? While others are still quoting, you can be connecting to the cloud.\"</p>\n<p>The pre-imaged Ignition Trial Edition has the same functionality as a fully licenced Ignition installation. Customers are able to build and test their deployment without needing to invest in a full license. The trial can be used as long as the customer wishes, with a simple refresh of the trial software every two hours. There is no need to transfer to a full version of the software or rebuild a project when a license is purchased. </p>\n<p>For more information about the Connect Kit by OnLogic, visit <u><a href=\"https://www.onlogic.com/connect\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.onlogic.com/connect</a></u>.</p>\n<p><b>About OnLogic:<br/></b>OnLogic is a global industrial computer manufacturer who designs highly-configurable, solution-focused computers engineered for reliability at the IoT edge. Their systems operate in the world's harshest environments, empowering customers to solve their most complex computing challenges. Founded in 2003 as Logic Supply, the company has offices in the U.S., <span class=\"xn-location\">the Netherlands</span>, <span class=\"xn-location\">Taiwan</span> and <span class=\"xn-location\">Malaysia</span>. OnLogic has helped more than 70,000 customers worldwide advance their ideas with computers that are designed to last, built to order and delivered in days. Learn more at <u><a href=\"http://www.onlogic.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.onlogic.com</a></u> or on YouTube at <u><a href=\"http://www.youtube.com/onlogic\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.youtube.com/onlogic</a></u>.</p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=NE78788&amp;sd=2021-11-17\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1ORTc4Nzg4JnNkPTIwMjEtMTEtMTc=&amp;key=682a0557e41d0273c1f536e39074b2acafc19e2ff00b1cbdb107aa8886e66691ccd3bcf1aa3fe51a0ad73ac33fce1ebfaeeb872fe855f91429930b0c2fe9eb33\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/onlogic-unveils-iot-connect-kit-designed-to-connect-facilities-to-the-cloud-in-one-hour-301426168.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/onlogic-unveils-iot-connect-kit-designed-to-connect-facilities-to-the-cloud-in-one-hour-301426168.html</a><p></p>\n<p>SOURCE  OnLogic</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: VT-OnLogic-IoTconnect</p></div>"}