{"date": "2021-11-18 05:12:44.423000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">SHENZHEN, China, Nov. 18, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">SHENZHEN, China</span>, <span class=\"xn-chron\">Nov. 18, 2021</span> /PRNewswire/ -- A FAMREE, a brand that prides itself in offering the newest generations of smart cleaning appliances, launches its newest product, the FA-500 air purifier for large rooms with HEPA filter. These can be bought today on <u><a href=\"https://www.amazon.com/dp/B097323RVG?th=1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a></u>. This new product addresses the issue of how to safely reduce allergens like pet dandruff, smoke, odors, and pollen. It's especially suited for pet owners, individuals or families of individuals with asthma, and those with allergies or underlying health conditions. </p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/1690433/pic.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://mma.prnewswire.com/media/1690433/pic.jpg\" title=\"title\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTY5MDQzMy9waWMuanBn&amp;key=0e4a76151950b89a1c668f913f34e23c69178859b75cae5802aa695a4255aa185717a53d29985adbe68404f4aead327379dc1f5c4cd5518c5a8172312788b771\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>The FA-500 air purifier has several features that provide buyers with a variety of benefits. Notable features include its large area of coverage in a short period of time, different levels of wind speed, Ture H13 HEPA filter, ability to monitor air quality with light strips, and app &amp; voice control.</p>\n<p>The air purifier is suitable for those looking to cover large areas and rooms, as it can cover 57W &amp; 538 sq foot wide space in just thirty minutes. It's a great fit for offices, bedrooms, living rooms, and kitchens. The air purifier can be set anywhere and work while you work as well. No need to worry about safety either due to the child-lock safety feature!</p>\n<p>This portable product allows for easy manual accessibility through an app. Product purchasers can direct the purifier through both Alexa and Google Assistant. For those who don't use either, there is also a remote control. The remote control is effective up to 2 meters in distance from the purifier. </p>\n<p>The Ture H13 HEPA filter makes this product unique and exceptional. It captures 99.97% of all environmental pollutants, such as dust, pollen, dog fur, etc. This creates a healthier environment for the home's occupants. It also absorbs odors, like pet odors, cigarette odors, fumes, and more. Individuals with asthma, stuffy noses, or frequently cough and sneeze will especially benefit from using this A FAMREE purifier. </p>\n<p>Additionally, the device comes with various functions that indicate when it is time to change the filter as well as when there's a change in air quality in the room. A simple change in color will reflect the change in air quality - green for excellent, yellow for normal, and red for poor. Every 4-6 months, a replacement prompt will flash on the front reminding the owner to change the filter to ensure the best air quality. </p>\n<p>Customers don't have to be skeptical about the safety standards of this air purifier. It has passed the CARB certification, a Californian certification known for its stringent quality control. It also passes the FCC and ETL certification requirements. Any doubts about how well this product works or how safe it truly is can be laid to rest. </p>\n<p>In order to achieve CARB certification, the product must first pass a series of tests. All air purifiers are tested for electrical safety, ozone emissions, and must meet a concentration limit of ozone emissions. The safety and health of A FAMREE's clients is their number one priority, which is why this optional certification was sought. Therefore, customers in <span class=\"xn-location\">California</span> can also have access to this amazing purifier. </p>\n<p>Regardless of the reason, it's undeniable that the <a href=\"https://www.amazon.com/dp/B097323RVG?maas=maas_adg_AF4405271D506690AE9428A77EBD4EB7_afap_abs&amp;ref_=aa_maas&amp;th=1\"><span id=\"spanHghlt7317\">A FAMREE</span></a> air purification system is superior in nature and of high quality. It allows for families and individuals to create the healthiest environment with the cleanest air quality for themselves, their children, and their pets. Its high-tech features make this product a must in everybody's home! </p>\n<p>The A FAMREE brand is an indoor cleaning product brand that puts in the time and effort to conduct product research and demands surveys to ensure the highest caliber of the product. The company ensures that the end product is a polished picture of perfection. A FAMREE's motto is offering solutions in \"technology to simplify life.\"  What makes the brand stand apart is its excellent customer service and attitude to meet the cleaning needs of every family. </p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=CN75618&amp;sd=2021-11-18\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1DTjc1NjE4JnNkPTIwMjEtMTEtMTg=&amp;key=77474a3eb3c9b83080636121df928e9682db8ab9f2f7d022a7c83dd171bf400b3987c5715de80c17b2567143c13759430c3d42b0de5d1c7e8366b2952a9bff0c\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/a-famree-launches-new-air-purifier-on-amazon-301427594.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/a-famree-launches-new-air-purifier-on-amazon-301427594.html</a><p></p>\n<p>SOURCE  A FAMREE</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: A-FAMREE</p></div>"}