{"date": "2021-11-02 19:42:17.265000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Klarna has set itself on a collision course with Amazon, Google and Facebook by acquiring PriceRunner in a deal that could be valued north of $1bn.</p><p>Given the buy-now-pay-later (BNPL) quadradecacorn's ambition to become \"a viable and competitive alternative for retail partners vs Amazon, Google and Facebook\", it's hardly surprising that it has reportedly splurged almost SEK 9bn ($1.05bn) to buy the price comparison company.PriceRunner was founded in 1999 and is today operating across the Nordics and in the UK. Following a successful close of the deal, it will continue to operate in those markets and Klarna customers in other markets can eventually expect to tap into the price-comparison services.The acquisition is pending regulatory approval and Klarna expects to conclude the deal by the end of the first quarter in 2022.Klarna has motivated the acquisition of PriceRunner by saying the deal will bring new features like product reviews, product discovery and price comparisons to the Klarna shopping app, boosting both customers' payment and digital banking experience.Klarna said its retail partners will benefit from the deal by adding improved behaviour insight, a boost in their website traffic and that they'll access better marketing opportunities.\"The acquisition will serve to strengthen our bank, card and payment services and support a competitive global landscape,\" said David Fock, Klarna's chief product officer. \"It also further cements that Klarna will not be a marketplace but a viable and competitive alternative for retail partners vs Amazon, Google and Facebook. The PriceRunner team is a talented, passionate group, which will be a perfect fit and we are excited about what we can achieve together.\"This is not the first swing Klarna has taken against Google: this summer Klarna launched a price-comparison service that saw it muscle into the Alphabet-owned company's ads-listing business.While Klarna and PriceRunner haven't officially provided a valuation of the deal, one could extrapolate some information from Creades. The VC firm acquired 12% of PriceRunner's shares in April this year.Now the company has said that it has sold its shares to the value of SEK 1.06bn ($124.2m). That would put the value of the entire PriceRunner company at roughly SEK 8.83bn ($1.03bn)The news comes at a time of explosive growth for the BNPL industry. The sector is expected to keep growing to be worth $166bn by 2023, according to GlobalData's thematic research.Klarna's initiative is the latest in a series of strategic deals and investment the fintech has made to position itself in the growing market, expanding past its initial instalments offering.Last week the $45.6bn fintech inked a deal with US-based payment processing giant Stripe. The deal would see Klarna being listed as a payment option for companies using Stripe's platform.Additionally, Klarna invested in B2B BNPL startup Billie and acquired travel planning thanks to its Inspirock acquisition in October. The quadradecacorn had previously bought loyalty card startup Stocard for ?110m in July.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}