{"date": "2022-01-24 14:53:15.721000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PLAYMAKER CAPITAL INC (\"PMKR-V;PMKRF-0\")\n- Hires Head of Monetization to Enhance Revenue Generating\n- Capabilities Across Its Portfolio of Digital Sports Media Assets\n\n    Playmaker Capital Inc. (\"Playmaker\"), the digital sports media company\nthat delivers authentic content experiences through its portfolio of sports\nmedia and technology brands, is pleased to announce that it has hired\nFelipe Cortelezzi as its new Head of Monetization. Mr. Cortelezzi will\nmaximize revenue generating capabilities across Playmaker's portfolio of\ndigital sports media assets, and his efforts will bring immense value to\ncorporate advertisers and sports betting operators looking to access\nPlaymaker's vast ecosystem of highly engaged sports fans.\n\n    Mr. Cortelezzi brings to this role a deep understanding of\nmultiplatform advertising sales, publisher Ad operations and performance,\naffiliate partnership generation, and video-based media distribution. Most\nrecently, Mr. Cortelezzi served as Director, AVOD Monetization &amp; Operations\nat ViacomCBS where he led the process for the sale and placement of a\nvariety of advertising campaigns on ViacomCBS video-based content,\nincluding some of the most-watched video and television content throughout\nthe Americas. Prior to his role at ViacomCBS, Mr. Cortelezzi held various\nleadership positions in sales and advertising throughout Argentina, South\nAfrica, and the U.S.\n\n    In his new role as Head of Monetization at Playmaker, Mr. Cortelezzi\nwill have direct oversight for monetization efforts across Playmaker's\nportfolio of sports media brands throughout North America and Latin\nAmerica. Playmaker's brands in the aggregate generated over 210 million web\nsessions from 85 million unique users in December 2021, and its owned and\noperated social media presence is in excess of 100 million followers across\nFacebook, Instagram, Twitter, YouTube, Twitch, and TikTok.\n\n    Playmaker's monetization capabilities are powered by Bench, an in-house\ntech stack that includes best-in-class technology tools integrated into a\nsoftware platform that is designed to enhance user engagement and\nsupercharge monetization. Bench is currently operational for Playmaker\nbrands, Futbol Sites (Latin America) and Yardbarker (U.S.) and the\nmigration of monetization of The Nation Network (Canada) is in process.\nOnce fully implemented, Bench, along with the expertise of Mr. Cortelezzi\nand Playmaker's ad operations team, will provide industry-leading\nmonetization capabilities for Playmaker.\n\n    \"We are very happy to add Felipe to the Playmaker team. I have known\nFelipe for more than 15 years and I deeply believe in his professional and\npersonal skills and everything he can contribute to Playmaker,\" commented\nFederico Grinberg, EVP of Playmaker and CEO of Futbol Sites, a Playmaker\nbrand. \"In his role, Felipe will help to quickly unify and scale the\nmonetization capabilities of Playmaker Bench across all of Playmaker's\nassets.\"\n\n    \"To succeed we need to have the best team and we are fortunate to have\nthe opportunity to add someone with Felipe's capability and experience,\"\nsaid Jordan Gnat, CEO of Playmaker. \"We will continue to add the best and\nbrightest to the Playmaker family.\"\n\n    As regulated sports betting continues to become more widely adopted\nthroughout the Americas, Playmaker will monetize its web-based and social\nmedia platforms through more affiliate revenue partnerships, for which Mr.\nCortelezzi will be instrumental in executing on. Mr. Cortelezzi will report\nto Federico Grinberg, and he will be based in Miami, FL.\n\n    ABOUT PLAYMAKER\n\n    Playmaker is a digital sports media company that lives at the intersection\nof sports, betting, media and technology. Playmaker is building a\ncollection of premier sports media brands, curated to deliver highly\nengaged audiences of sports fans to sports betting companies, leagues,\nteams and advertisers.\n    For more information, visit: playmaker.fans or contact Playmaker Chief\nExecutive Officer Jordan Gnat via email jgnat@playmaker.fans. To sign up\nfor Playmaker's Investor Alerts, visit: playmaker.fans/investors.\n\nMEDIA\n\nMauricio Villarreal E: mauricio@redknotcomms.com | T: (+1) 919 808 8898\nTom Webb - E: tom@redknotcomms.com | T: (+1) 512 952 9369\nRomilly Evans - E: rom@redknotcomms.com | T: (+44) 7766 752 274\n\nWWW   : <a href=\"https://www.playmaker.fans\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.playmaker.fans</a>    PLAYMAKER CAPITAL INC\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202300345.MNPRE2202301048-05352120220124</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}