{"date": "2022-02-24 05:26:45.964000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_ez9e75o6&amp;referenceId=6298526124001_B35&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_ez9e75o6&amp;referenceId=6298526124001_B35&amp;pageId=RefinitivNewscasts</a></pre>Source: Real Vision<br/><br/>Description: One of the world’s most successful NFT art-drops to date, Yam Karkai’s 10,000 images of diverse and powerful women has drawn global attention to female-led projects. The company she co-founded, World of Women, now includes celebrity collectors and investors like Reese Witherspoon, Shonda Rhimes, Eva Longoria, and Liam Payne. Yam and co-founder Raphael Malavieille talk to Real Vision’s Elaine Ly about where they plan to go after such a resounding debut for a company that’s rapidly evolving into a power brand. One thing is sure: They’re already well on their way there. As Raphael notes, the momentum from the WoW community “is great fuel.” Check out the earth-shaking first collection from Yam and World of Women here: <a href=\"https://opensea.io/collection/world-of-women-nft\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://opensea.io/collection/world-of-women-nft</a>.<br/>Short Link: <a href=\"https://refini.tv/3haPBiU\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3haPBiU</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Raphael Malavieille, and Yam Karkai, welcome to Real Vision. &gt;&gt; Thank you. Thank you for having us. &gt;&gt; Thank you. &gt;&gt; You both are founders of World of Women. I would say it's one of the biggest, and most successful collections in the world right now. So I think I just want to say thank you for launching such an astronomical project for recognizing women in the NFT space. But also, you guys are known as the biggest regret of my life. Look you were the very first NFT project I actually ever heard about. I was told to get a world of women back in July 2021 and I said, I'm not paying 500 bucks for a JPEG, hashtag, not going to make it. But I just want to have this conversation with you to touch base with you both because I think this is a great opportunity to celebrate your collection as an absolute pioneer trailblazer, and true leaders in the space. I just want to start by asking you, I guess, how are you doing because it's been nonstop. I mean, Ralph, you want to take it first? &gt;&gt; Of course. Thank you Elaine for the nice words. Well, we're doing it because we have a whole team actually it's not just the two of us. We are actually four co-founders, Yam, myself and two dear friends of us, that we all know each other in real life , and very quickly, we actually tried to staff because we had so much going on, so much inbound requests, and we also had a lot of ideas, and realized we had to staff, and we actually staffed within the community as fast as possible. And I believe that's what helps us keep this non-stop place that you mentioned. But it's still very crazy, on a personal level, it is. &gt;&gt; Yeah it's been really crazy, a lot of pressure, a lot of excitement, a lot of mixed emotions, but thankfully, we are a full team of people to handle all of this, we're not alone, that feels good. Every day I'm thankful for this. &gt;&gt; That's good. I feel like definitely the whole community, everyone on Twitter is definitely running with you, so that's really nice. But I just want to take a little step back because Real Vision, we haven't had you before. Obviously, I know you guys in and out, but what were you doing say like a few years ago, or give me a little bit about your journey, your first taste of cryptocurrency. &gt;&gt; So actually neither me nor Ralph, were like crypto people before we discovered the NFT space. We each had our own jobs, he had a cool job, I had a very boring job that I didn't like, and then at one point I started doing digital art because I found this very interesting, and it became really my passion. So as all freelancers are out there, I was on Fiverr, and all of those things trying to make it, and then NFTs came along, and I just thought it was incredible, and really an exciting opportunity as an artist. So that's a little bit about me, unfortunately, no incredible job before NFTs. &gt;&gt; Nice. Look, how boring was the old job? &gt;&gt; Very, very boring. I was doing these jobs that like 200 other people do exactly the same thing as you for a big company and then you're just like an ant in the hive, basically. &gt;&gt; Look, as we move into where technology, exponential age growing like crazy, the dull, dangerous, and dirty work has to go. Ralph how about you man, is it the first like, let me download the Coinbase app situation? &gt;&gt; A 100 percent. At the same time as Yam, I believe it was probably March early last year. I was also getting interested into crypto and NFTs on a professional level, because I was working in tech before, but I wanted to find the next new tech trend that I could jump on, and be passionate about because I like working in something I'm passionate about. So then yeah, it was definitely, downloading Coinbase, with my case, I think it was Binance at the time, and then I moved to Coinbase, and understanding how this works, and it's super user-friendly in the first place, like these KYC stuff, and putting your money in Coinbase then transforming it into [inaudible 00:04:24], and then sending it to a wallet, and then connecting your wallet. Now I'm used to it, Yam is very used to it too. But I was doing it as we were learning about NFT, she was learning how to promote, how to sell our art, and I was trying to figure out how maybe it can make money in the end for us. &gt;&gt; I love hearing the fact that it was only early last year where we're figuring out how to purchase cryptos, and now we really are talking to the two leaders in the NFT space. All right, so I'm going to ask you, I'll little go deep down a little bit NFT connection. What was that, Amazon in the garage moment where you're like, you know what, we're going to launch an NFT collection of 10,000 women. &gt;&gt; An Amazon garage moment, okay, that's really funny. You know, the thing is that, I was already in this space selling single edition art pieces, so I was trying to make it as a individual artist. Ralph was actually starting to collect collectibles simultaneously, he had gotten an ape, okay, you were collecting a little bit. &gt;&gt; Wow did I just hear Ralph is a ape owner? &gt;&gt; Yeah he got himself an ape, and yeah, and at one point, it was a collective effort, to actually taking the decision of doing this, but for me, my motivation was just that I saw that none of these collectible projects were really something that I could relate to, or that I didn't feel represented by basically I wouldn't wear them as my identity in my profile pic, because I was already drawing women, because that's the thing that I do, I'm all about celebrating women from my art pieces, and putting them in the spot light , especially diverse women. Then the idea of creating a collectible project where it's all diverse, inspiring women instead of animals, came to be, because I thought it was necessary in this space, and I felt like there's probably a lot of women in this space that maybe we were not aware of, that we're still looking for the thing for them. So that's really how it began out of this motivation. &gt;&gt; And really this Amazon in the garage moment actually, also came to fruition because we were super lucky, we didn't have to look on Twitter to find partners to do it. &gt;&gt; Yeah. &gt;&gt; Because I mean, this is a big barrier to launch yourself, if you have to find devs, people to generate your art, to do the website, and we had friends in real life that we're also in NFT at the same time. So when we were brainstorming, what helped us from the get go, and they became the co-founders of the project, and they are still today, it's BBA, and Toomaie our cofounders. BBA is the one who got me my ape in the first place, who told me you have to buy an ape now. &gt;&gt; That's a strong Alpha friend. Yeah. That's a strong Alpha friend. &gt;&gt; I was like if floor was 0.6, I was like, boy, that's a lot of money. &gt;&gt; That's the World of Women. See, everyone has that kind of moment. I knew it, that makes me feel a little bit better. &gt;&gt; Of course. Then I got two, one at 0.8 and one at 1.1 and then okay. It was a good call. Thank you again, BBA. &gt;&gt; There you go. Call me. Yam, you must see Ralph collecting all these apes and seeing that momentum. I guess something in you was looking at these apes of 10,000, which one relates to me most? Well, kudos to you for drawing a collection of 10,000 women. Female celebrities invest into the World of Women collection. I think looking at the Twitter space it's like female celebrities, it's their first hit of NFT when they get that first hit. Can you name me a few? I see Eva Longoria has done something with you guys. Who are the big female celebrities where a year ago you were doing whatever you were doing, now you're like \"Hey, Eva, how you doing?\" Who are the famous women that you're working with now? &gt;&gt; That is exactly what I do. I just call up Eva and I'm like, Hey girl, how are you doing? No. Some of the incredible women that have supported us are Reese Witherspoon. She was one of the first ones. Shonda Rhimes, we've had Huda from Huda Beauty support us big time. She's a massive fan of the project. Of course, Eva Longoria and when things like that happen, it's quite mind-blowing because half of those people you grow up watching the movies with them. It's very impressive to suddenly see them be part of your life in this way. It's been very exciting and surreal. &gt;&gt; Ralph, how about you? Fan of Eva Longoria? &gt;&gt; Of course, I am. I'm a big fan of Gabrielle Solis in the first place, but that's why I met her, obviously. Yeah. I like that it's just surreal, just like Yam says, and even more so when we get to meet them, if we ever do. Hopefully we do. &gt;&gt; Okay, Excellent. It's a female power brand, the World of Women. One at the moment you would say, it's a bit on sale today, it's currently at 9.3 on floor price. That's a good, healthy couple of Louis Vuitton bags and a couple of red bottoms I like to say. So for people who are in the investment space completely and new to you. Go ahead and tell us about your wonderful collection. Go into the art for me and just the intricate details of why this resonates with so many women. &gt;&gt; I think that the biggest reason why the collection resonates with women and why it probably succeeded is by the simple fact that the art is very diverse. The face of the women are very flexible as well. They could be almost any ethnicity. That was the purpose when I was drawing them. I feel like a lot of women in this space, as I mentioned before, didn't feel represented or included in anything and in any project that was happening in this space. When they saw World of Women, they were like that's me, I see myself, she has my skin color or my eyes or my face or whatever. It was like this because we are very much enjoying the whole community sense of web3 and of NFTs and being part of something and interacting with these online families. I feel like this was a really important moment for women to find that for themselves and to see that there is someone that sees them and that acknowledges them in this space. I feel that was the main reason of why World of Women happened and it's still here. I hope this is a good reason to be interested in it. We're also continuously working in empowering and helping women and girls, not only in web3 but also in the real world which is why charities have been a huge part of our projects from the start. We knew that we wanted to do that. This is also why we have a head of philanthropy in our company which indeed is a position that usually you don't get, so early on when you're just 10 people in the company, but we just didn't want to wait because this is really a big core of what we are and what we stand for. So I don't know if you like what we're doing and what we're trying to change and achieving in the NFT stage in the world and I guess this is for you. &gt;&gt; Yeah, I think even beyond this aspect of the values of the company, there's also the fact that we would like to show that it's possible to invest in something that's made by a woman and the topicality is completely women and make money out of it, I mean those sold at 0.07 six and a half months ago, now they sell for 10 ETH. There was a sale for 200 ETH like $700,000. So we were trying to show that it's possible to invest in women artists and women projects, and make money out of it. You don't just do it for charity, you just don't do it to be nice. No. This is the goal. This is why we work with the best people in the world as well to make this global brand a good investment, and somewhere you can make money. I think this is really one of the success in insight after sometime, thinking about it, we've had is that the floor price rose very steadily throughout the six months, we have a huge peak to 11 and then down to two because we always made sure we didn't over promise and under-delivered, we'd never hide something too much, and when people were disappointed. I think this steady growth is quite reassuring from an investor's point of view. So we'll look at our growth over time, at our figures, our data and you'll see that it's quite a good investment. &gt;&gt; So, yeah, I just wanted to ask you , Ralph, if you know, what's the biggest figure that you've contributed to charity so far, do you have a figure for that? &gt;&gt; In total, we've given for charity around $300,000. A little bit more since the auction that we did on SuperRare. &gt;&gt; We've had 260,000 and we had this beautiful auction for women in climate in SuperRare like three weeks ago, Yam, like you said, which raised 250,000 more. &gt;&gt; Just hearing you throw figures out like that, I literally have hairs crawling up on my arm because the fact that you can throw out figures like that, it's incroyable. Yam, I'm not going to let you go without asking you what the inspiration is for your art. What makes World of Women so unique? I think we touched on a little bit, but who inspired you to draw women, I guess? &gt;&gt; Even before I got into the NFT space, all I would draw were women. I've never drawn a man. I don't know. I only draw women. &gt;&gt; Women are just prettier. &gt;&gt; I think that this really comes probably from personal experiences, from cultural experiences, from family things. Something inside of me just wanted to celebrate women and put them out there just because I felt this need. I've never really sat down and psychoanalyzed why I only draw women. But it's just this thing that comes out of me. I would never draw a man. I don't think I would be capable of doing it. &gt;&gt; I think basically when you are just naturally an expert in that field all your life, it was just natural for you to put out a collection for this. We've got to talk about the fact that the pair of you, your journey is so authentic. It's been empowering to do what you love and it's no better time to put a true value in an artist's work. Just seeing your collection onboarding power women after power women, I definitely want you guys to talk about this Christie's auction because I remember the Bored Ape Yacht Club, the journey is very light on a path the same. Again, I think the Bored Yacht Club went to Sotheby's. One of the big auction houses and this is what you guys are doing next. So can you guys tell me a little bit about that? What's happening there? &gt;&gt; Well, yeah. So the obvious thing is that indeed we're going to Christie's. There's going to be a World of Women auction in one of their evening sales and their evening sales are the most prestigious events that Christie's holds. Like how many times a year? Two or three? &gt;&gt; Three times a year. &gt;&gt; Yes, So basically what's really fun about this story, in my opinion, is that we didn't just choose this World of Women and said to Christie's, okay, this is the one. We actually narrowed it down to several World of Women. Then we had our community vote for the one that they wanted to have represent them at Christie's. We did that through our DAO and we put them out for vote and thousands of people voted. It was really cool and really beautiful to see everyone discussing and getting to this final decision. So now we're going to have a beautiful tuxedo night goddess auctioned in this evening sale. Yes. Some really big names like Picasso and Basquiat. It's really mind blowing for us especially for me because I'm the artist, it's something really so real once again, and it's very historical for us. What else can we say. I feel like I'm mumbling because I'm too excited about it. &gt;&gt; Look, every time I have these conversations, I bet you've repeated this 10 million times, so I'm just grateful for your time here. What I saw on Twitter for me as someone just looking from the outside is I saw suits on for Christie's, the time as wow. But the thing is, I think from a bigger picture, I saw a movement in female lead projects and this is what the World of Women is doing, so basically I saw people changing their profile pictures with a pink blazer, for example, I've got a couple of items and I saw just people reaching out and extending that momentum with you and putting pink blazes on. Is that what being part of World of Women is? Its movement, its leadership? So is this what your collection is about going forward? &gt;&gt; I definitely feel like we're a movement just because of what we stand for but it's mostly for the people that have decided to stand for those things with us and be this big family and community of people that want the same things. Actually that pink tuxedo thing was not even something that we made up, it was a community initiative. There was this one community member that created pink tuxedo and then everyone started to ask for a pink tuxedo and this community member just spent like three days making pink tuxedo for people, it was amazing. Then all the other colleges we're also supporting us by wearing pink tuxedos as well. I think that this is really the beauty of community in this space truly. &gt;&gt; Dude, even you guys make me do research. Ralph, hearing all of this, does this make you work order? &gt;&gt; That's a good point [inaudible 00:18:58] I mean every time you flow rises or people have expectations in you, you have an obligation to deliver even if you didn't promise anything, which is some say that community makes us feel and this is a great Show, this is a great Show indeed. I had to get back on the little story about the pink tuxedo. One of the initial artists that came up with them actually, they got several bids from World of Women human community members on their own artworks on foundation, because they were also NFT artist and photographer. This is really nice to see. Young was mentioning as well using collections. I mean, they don't have to do it, but it's so cool to see them do it and we're super grateful for that as well because they don't have to do it and it's their own piece of real estate that they use for our benefit, which is really amazing to see, to be honest and it's very selfless. &gt;&gt; That's really nice. Literally I've been watching you, there's like stuff after stuff after stuff. Do you still get that holy **** where is this going to go moment? &gt;&gt; Actually in January when we announced we were working with this guy and it went quite fast, quite high, the full price and all the trend behind us and all the other projects also benefited Homer, arising from the announcement, a lot of collection that I hadn't sold out before, sold out within a day or two of our announcement, a lot of sales were made on all the collection that we're women centric and it was like, wow, we really have an impact on their own meta of this space. That was completely crazy. And of course we see the apes that are at 100 and literally this is not impossible, this is also possible for us considering the historical significance of the project, the team that's behind it and as you said, the partners and the people we talked to and we have access to, we can't talk about anything that we haven't announced yet, but we were pretty confident with the context we have. &gt;&gt; I completely agree with you, Ralph. That was the biggest pressuring moment for me as well. &gt;&gt; And we met Justin Bieber last week so that's why it was cool. &gt;&gt; Excellent. That's awesome. Look man, it's no secret that you guys are a couple, Young, you're an absolute queen. Ralph, I do want to ask you, what do you get the queen of NFT for Valentine's since it was just yesterday? &gt;&gt; We weren't together. &gt;&gt; Nothing. &gt;&gt; I was in France, she was at home, so no. &gt;&gt; He got me nothing people, not even flowers. I got nothing. &gt;&gt; I got you ******. &gt;&gt; Yeah, I would. &gt;&gt; [inaudible 00:21:33] ****** my mom gave me. &gt;&gt; I am going to break it up and obviously it is very easy to go from Peer-to-peer transaction with a board eight going from one wallet to another. I am just throwing it out there. &gt;&gt; She didn't get me anything. I'm just going to say, it's the lovers, it's the day of the lovers. So you should have have gotten me something too. &gt;&gt; I got to ask you, in the world of NFTs, I feel like there's three strands that your brain just all of a sudden has to function, which is the culture yes, this tech, yes, but then all of a sudden you find yourself just haven't become to be so vast in the world of finance. So how is the journey been to grow your team? Because I think a lot of setup collections are in the same space as you guys. We don't really know where all this is going, but you constantly have to grow your team. As you keep growing, how do you find these people? How do you get the talent? Is it discord for infinity hours? How are you guys doing it? Because like I said, you guys aren't leaders in the space, a lot of people are like, my God, how much control do you give up, how much people do you bring on? How do you grow your team? &gt;&gt; Well, for us it's been a mix of two things. Ralph, you can add to it after because I'm sure you have stuff to say about this but basically we hired people from the community just because we saw they were super motivated, very engaged, and they actually had a lot of different talents. Some of the people that we have in the team are from the community actually, others are people that we knew from our real life, that we loved and that we knew were really great at their job. Right now it's a new stage and I think we're starting to source people in different more professional ways, I guess. But this is how we really started. &gt;&gt; We took the approach of choosing people who had knowledge of the space and specifically World of Women first and then their job came second. If you look for community manager, auditor of communication or copywriter, even designer. We all think it's important that they have the culture of NFTs before being the best, potentially they adapt specific skill set. I'm a jack of all trade, I do a bit of everything but I don't have any expertise in particular. It was really, as you said, community on discord and a lot of people wanted to work with us. Now, we look for more specific talents and functions. We are going to use more platforms, and there are lots of platforms out there that make the job easy, that you don't have to hire a head of Human Resources adds up so we can still do that ourselves like platforms to hire, contractors are all around the world or even have people on pay role all around the world, even if it costs a bit of money, it makes your life so much simpler. So we're going through those tools and then we use the tools actually makes it simpler. &gt;&gt; Look, I think it's just fascinating how work and NFT collection is also able to onboard and elevate people into Web three. So that's something that we have to watch as the NFT space is growing. So Young and Ralph, I know you guys are both quite the collectors yourself and you're investors, so I just read up a tiny little bit about the World of Women fund. Can you tell me a little bit more about that? &gt;&gt; Well, basically we started with I think it was [inaudible 00:25:00] inside a phone since Day 1, there was a wizard give back to the ecosystem competence and seeing where Young was coming from, AKA due to art world and not those collectible project world, because NFTs there are really two different worlds like artist and digital art and collectable. Now there mixing up a little bit, we hope, and we think we have in that sense. But basically at the beginning it was like we have this founder and he's going to collect every day from up-and-coming artists. Not only women and minorities, but a bit of everyone but tied to lift up all people that need more visibility. So we've spotlighted hundreds, maybe two hundreds and more artists so far, just by purchasing their art, investing in their art and we also hope this found can pull that again. You can invest in small artists that don't have a spotlight on them and also make money out of them. Of course, a lot of them, we will not make money out of it, we're just supporting them, but a lot of them, they're going to have become the next stars of tomorrow. And even some art that we collected from, they have launched their own collectible projects and then they've become super big. And it's so rewarding to be like, well, we helped you before. So we completed a tiny little bit to the success you have today. That's should be cool. And I'm sure that's what business and journals and investors feel as well when they invest in the right campaign horses and we're sure we can say that that's French. &gt;&gt; Anything to add to that or I can move on to the next question? &gt;&gt; No, I'm good. I just wanted to say that once again, I mentioned that charity was something that we've always wanted to do and supporting artists was also something that we knew we wanted to do even before we finished completing the project. So yeah, we are lovers. &gt;&gt; Yeah. No. I think you're coming from an artist background, I think investing back into fellow artist is just exactly putting price and culture. It's something that we've never moved at this speed of being able to do. I also read that you guys are doing something with Davos or have done with Davos. Davos is somewhere where power players look at global trends. And I think the World of Women was there. So should I just put two and two together and ask you, how is World of Women essentially changing the world as well? &gt;&gt; Wow, thank you. &gt;&gt; You know what? I think you guys do this so much so often and I read something that it had to do with women and climate and charitable NFT drop. Let's just take this video trying to celebrate what did you guys do at Davos with the World of Women. You want to go first, Yam, and tell us a little bit about that? &gt;&gt; So basically as I said, we have a head of philanthropy and she is the co-founder of CodeGreen. And so we did a drop on superior for Davos that was women and climate. And so we collaborated with 12 amazing female artists from this space and they all created beautiful art pieces that reflected something about womanhood or the environment, or a mix of both. And so we did an auction in order to raise money for the projects that CodeGreen is focusing on, especially the Great Green Wall. We've raised a lot of money, 84 ETH went directly to them and it was a beautiful thing. Basically, what was very special about it is just the way that CodeGreen works as well because they're able to choose specific projects that are local. And that they know exactly what's going to happen in each project and where their money is going to go and what things are going to be done with it. So for us, it's really beautiful because we're able to follow it step-by-step and we're also able to show that to the community and really involve them in what is happening, and what we're able to achieve outside in the real world with World of Women. So this was our activation for Davos. It was really great. It was really beautiful. I'm still super, super happy about it. It happened in January. &gt;&gt; We were supposed to be physically in Davos at the World Economic Forum to actually launch this auction publicly on the stage. It was out of press and in the faculty it ended up being a digital Davos, because of COVID so we were a bit hard woken about that. But it's really a collaboration between the World Economic Forum, CodeGreen super, and World Of Women, so four entities. We having being backed towards formally I think who could gain by the World Economic Forum. Hopefully by the UN at one point as well for those initiatives that we're making. &gt;&gt; And can I just confirm that number, that total collection that you guys were part of doing. Did you say you raised 88 Ethereum? &gt;&gt; Eighty-four. &gt;&gt; Yeah, I think everything sold for 84 and 70% of the purse of the artist was away for charity. So the artist got 30% of all the profits. Yam sold a piece for 23 or something. &gt;&gt; You've got to show me that piece. I don't actually know what it looks like. But just for context, 84 ETH is over $260,000 currently. I'm not letting YouTube go without telling me any collections that you've got your eye on, so I could jump on the next alpha. We want actionable stuff here on Real Vision. What's on your radar? Tell me the next ape. Tell me the next Word of Women. What's going on? What do you put in your wallet? &gt;&gt; Oh my goodness. Literally, we've been working in our cave for so long. I feel like we're not really updated and what are the new things that are coming out every day. I have some projects that I love and that I have collected in the past. But I mean, it's a lot of pressure to tell you which one is going to be the next ape or something like that. But I also, I mean, I could drop several names right now, but I just feel like it would be so unfair to drop like foreign names and not say the names of everybody. I would just say check out the other women-led projects. There's a lot of different projects going on. Some of them are bigger, some of them are just a few hundred art pieces and many of them are very interesting. So I would just say dig in there. Find what you like. &gt;&gt; I'm not going to say any name except one that I will say at the end. Out of Discord quite often we have a lot of projects and requests to partner with us to do some other things. Hey, let's do some stuff, I will offer you some free NFT then you promote it. We almost do nothing. We almost do none of that because we don't have time. We want to focus on our brand. But every now and then our community says, we really want some of those so we're going to push them to the community. I think we are doing so right now at this point so have a look at Discord, you'll have some alleles there. Ourselves, Yam is working on the collection, we're working on a second collection in the world to expand the world community. Because as you said right now, 10 is a lot of money to get in the community at the highest premium level. So we're working on the secondary. &gt;&gt; Yeah, my DMs are open for the second collection. &gt;&gt; We're working on a second collection called World of Woman Galaxy. That's World of Woman Galaxy coming [inaudible 00:32:28] &gt;&gt; Okay. There you go. This is excellent. Dera even pushed this question further. When is it going to come out? &gt;&gt; Soon. &gt;&gt; Soon, fine. &gt;&gt; Sooner than you think. &gt;&gt; Thank you so much for your time. Look how can people keep up with you and what can they expect for 2022? We have to do these videos again and again because we want to reach the community who are completely new to you, despite you guys being one of the biggest NFT collections. How can people keep it with you and what can they expect for 2022? Yam, do you want to kick it off? &gt;&gt; Twitter, Discord, Instagram, those are the three places we're at. Discord is more connecting one-on-one with our community and with us. You get to chat with a lot of people. You had access to a lot of different channels, especially if you're a wall holder, Twitter because that's where everything happens. Our website is in our Twitter profile if you want to learn more about us. It's also new, so it's very pretty. And Instagram, if you're an Instagram person. &gt;&gt; I think the website worldofwomen.art, which is quite a simple URL to know. Worldofwomen.art is a great way to start. We've built it so that it could be done easily if you are a collector already or if you're a community member or if the press or if you are completely new and wanted to understand. Or if you're somebody that wants to share it to your friend and explain to them what are NFTs. And we think it's a great place to start to understand the collection. You have all the information on the website. I loved the homepage we're working on making it even better and we keep all the news there as well. &gt;&gt; Lovely. It is a beautiful website and just clicking on your Twitter page now, look how fun at the Billboard. That's what I've just got from there. And thank you so much and you let me know what happens in the future and I'm going to swipe that floor clean because we're very bullish on Real Vision. So thank you both for joining us. &gt;&gt; Thank you so much, Elaine. &gt;&gt; Thank you so much. It was so fun. Thank you.<br/></span></div></div></div></div>"}