{"date": "2021-12-10 20:34:29+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3483.42, "close": 3391.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Alexandra Valencia</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">QUITO, Dec 10 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Ecuador's state-owned oil company Petroecuador said on Friday it had suspended pumping on its SOTE pipeline as a preventative measure due to land erosion, which has repeatedly affected pipelines in the country's Amazon region.</p><p>The suspension is the latest in a series of stoppages caused by erosion along rivers in the Amazon province of Napo, which has also affected the privately-owned OCP pipeline, water collection for the Coca Codo Sinclair hydroelectric project and a major highway which connects the region to capital Quito.</p><p>The OCP pipeline suspended pumping on Wednesday but said its exports will not be affected. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2ST21F\" data-type=\"storyId\" data-story-id=\"nL1N2ST21F\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>\"From 10:30 (a.m.) ... The SOTE and Shushufindi-Quito polyduct suspended the pumping of crude and fuel derivatives respectively, and have begun the drainage of hydrocarbons as a preventative measure,\" Petroecuador said in a statement.</p><p>\"The measure is meant to protect the integrity of the tubing which transports hydrocarbons from the Amazon,\" it said, adding that the suspension will not affect exports.</p><p>Petroecuador has already constructed six detours for the SOTE, which can transport up to 360,000 barrels per day, and is working on a seventh.</p><p>Both Ecuador's pipelines suffered ruptured tubing in April 2020 because of a sinkhole in the same area, causing the country to declare force majeure over its exports and lower its production levels.</p><p>A nearby road connecting the region with the capital Quito remains closed because of cracks caused by the erosion.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Alexandra Valencia<br/>Writing by Julia Symmes Cobb<br/>Editing by Paul Simao)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:julia.cobb@thomsonreuters.com\" data-type=\"email\" translate=\"no\">julia.cobb@thomsonreuters.com</a> ; +57-316-389-7187) )</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: ECUADOR-PIPELINE/</p></div>"}