{"date": "2021-11-29 21:40:52.509000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>OPTEC INTERNATIONAL INC (\"OPTI-0\")\n- Corporate Update OPTEC Cancels 30,000 Preferred Shares\n\n   OPTEC International, Inc. announced the cancellation of 30,000 Preferred\nshares previously issued to Amazon Management LLC for the Z2O proprietary\n\"Uber of Cleaning\" technology acquisition in August 2020.\n\n   The cancellation of the shares still leaves areas for settlement\ndiscussions from the original contract for payment of the 72% acquisition\nportion of Amazon Management LLC , (the developer of the Z2O app). This\ncancellation does not constitute a full and final settlement between Amazon\nand OPTEC but it does pave the way for discussions to an amicable\nsettlement agreement.\n\n   The cancellation represents a 31.5 % reduction of the Issued and\noutstanding Preferred shares of Optec International, Inc.\n\n   The company will continue corporate updates as to the status of\nnegotiations and discussions.\n\n   About OPTEC International, Inc.\n\n   With Locations in Carlsbad and Vista, California, OPTEC International is\na developer and manufacturer of the OPTEC Fuel Maximizer products along\nwith electronic LED, Ultraviolet (U.V.) &amp; UV-C safety products and related\nadvanced technologies and PPE (Personal Protection Equipment) products. The\ncompany's Temperature Scanning product line is being launched at a time\nwhen H.R. directors and facilities managers are experiencing extreme\nconcern with respect to keeping environments safe during the global\npandemic crisis and the safe reopening of the U.S. economy. For more\ninformation, visit: www.optecintl.com\n\n   Safe Harbor Statement: Safe harbor from liability established by the\nPrivate Securities Litigation Reform Act of 1995. These forward-looking\nstatements generally can be identified by phrases such as Opti, OPTEC or\nits management \"believes,\" \"expects,\" \"anticipates,\" \"foresees,\"\n\"forecasts,\" \"estimates\" or other words or phrases of similar import.\nSimilarly, statements herein that describe the Company's business strategy,\noutlook, objectives, plans, intentions, or goals also are forward-looking\nstatements. All such forward-looking statements are subject to certain\nrisks and uncertainties that could cause actual results to differ\nmaterially from those in forward-looking statements. OPTEC International\nInc.\n\nMichael Iorlano\n(760) 621-0062 / Mike@MountaintopMedia.net\n\nTel   : 760-444-5556    OPTEC INTERNATIONAL INC\nWWW   : <a href=\"https://www.optecintl.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.optecintl.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133200253.MNPRE2133201376-06380320211129</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}