{"date": "2022-02-20 08:48:26+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3052.03, "close": 2896.54}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Amlan Chakraborty</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Feb 20 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Media rights for the Indian Premier League (IPL) will capture value worthy of the league's rapid rise, especially after the addition of two new teams and strong digital growth, secretary of the Indian cricket board (BCCI) Jay Shah told Reuters.</p><p>\"The aspirational value of Brand IPL has surpassed anyone and everyone's expectations,\" Shah said in an interview.</p><p>He declined to discuss any dollar figures, but said: \"The valuation will mirror the rise and growth of the league.\"</p><p>    The BCCI will float tenders for the expanded league's media rights for the 2023-27 cycle as early as the coming week and complete the e-auction in two months, Shah said.</p><p>Industry sources expect it will fetch as much as 500 billion rupees ($6.7 billion).</p><p>Shah added that the board had studied various models and proposals, amid expectations that separate TV and digital bids would be considered.</p><p>That would mean a bid from Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, with only a digital platform, might be accepted this time after the BCCI in 2017 selected a consolidated TV and digital bid.</p><p>Star India, owned by Walt Disney Co <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DIS.N\" data-type=\"ric\" data-ric=\"DIS.N\" translate=\"no\" dir=\"ltr\">DIS.N</a>, paid 163.48 billion rupees for the 2018-22 cycle.</p><p>The league will welcome two new franchises this season after Lucknow and Ahmedabad paid a combined $1.7 billion to gain their entry into the world's richest cricket league.</p><p>\"Two new teams mean more opportunities to the entire cricketing ecosystem. You can gauge the level of interest with the valuation for two new teams,\" Shah said. </p><p>The league counts Bollywood stars and billionaires among franchise owners and draws the best players globally.</p><p>\"In just 14 seasons, we have recorded unprecedented figures that other popular leagues reached after decades,\" Shah said. \"Not just television but look at the numbers on digital.\"</p><p>The 10-team league will begin play in the last week of March.</p><p> ($1 = 74.6701 Indian rupees)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Amlan Chakraborty in New Delhi; Editing by Edmund Klamann)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:amlan.chakraborty@thomsonreuters.com\" data-type=\"email\" translate=\"no\">amlan.chakraborty@thomsonreuters.com</a> ; Twitter: <a href=\"https://twitter.com/Amlan_Reuters\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/Amlan_Reuters</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CRICKET-INDIA/IPL (PIX)</p></div>"}