{"date": "2022-01-11 22:12:03+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds union and NLRB comments</p><p class=\"tr-by\">By Julia Love and Jeffrey Dastin</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">SAN FRANCISCO, Jan 11 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The U.S. National Labor Relations Board said on Tuesday that it will send unionization ballots to workers at an Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> warehouse in Bessemer, Alabama, on Feb. 4, setting the stage for the next labor contest facing the online retailer.</p><p>Votes in the mail-ballot election, which is a re-run after the NLRB found Amazon interfered last year, will be counted starting on March 28, according to a notice published by the NLRB. The Retail, Wholesale and Department Store Union (RWDSU) has been seeking to represent the workers.</p><p>Scrutiny of working conditions at Amazon has intensified in recent months, with some employees seeking to organize at facilities in New York and Canada. A victory at even one warehouse would be a milestone that labor experts say could invigorate the U.S. labor movement.</p><p>In a statement, Amazon spokeswoman Barbara Agrait said: “Our employees have always had the choice of whether or not to join a union, and they overwhelmingly chose not to join the RWDSU last year. We look forward to our team in (the warehouse) having their voices heard again.”</p><p>In last year's count, workers at the Bessemer warehouse rejected forming a union by a more than 2-to-1 margin. The organizing drive had garnered support from U.S. lawmakers and President Joe Biden.</p><p>    Then in August, an NLRB hearing officer determined the company had interfered with the vote. As examples, the officer said workers may have felt they were being surveilled when dropping ballots in a mailbox on Amazon's property that the company encouraged them to use. Amazon also put a campaign slogan around the mailbox. An NLRB regional director, Lisa Henderson, officially called for a re-run in November.</p><p>In an order accompanying Tuesday's election notice from the NLRB, Henderson said that same mailbox would be in a \"neutral location\" on Amazon's property for the forthcoming vote and that no party could put a banner around it or issue a directive on its use.</p><p>The RWDSU said it was still worried about Amazon \"continuing its objectionable behavior in a new election\". It said it was especially concerned that same mailbox will remain on Amazon’s property for voting, which it believes will create an impression of surveillance that undermines a free and fair election.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Julia Love and Jeffrey Dastin; Editing by David Gregorio, Emelia Sithole-Matarise and Howard Goller)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Julia.Love@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Julia.Love@thomsonreuters.com</a> , @byJuliaLove; 52 (55) 5282-7131; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON-LABOR/ (UPDATE 3, PIX)</p></div>"}