{"date": "2021-12-10 12:40:16.515000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ALTAIR ENGINEERING INC (\"ALTR-Q\")\n- Sandy Carter Joins Altair Board of Directors\n\n     Altair the global leader converging simulation, HPC, and AI, announced\nthat Sandy Carter, senior vice president and channel chief of Unstoppable\nDomains, Inc., a software company building domains on blockchains, has\njoined Altair's board of directors.\n\n     \"Sandy brings a broad range of experience to our board of directors.\nFrom management, sales, and marketing to technical expertise and the\nability to manage multi-disciplinary projects, she can navigate complex\nsituations with focus and discipline,\" said James R. Scapa, founder and\nchief executive officer, Altair. \"Her energy combined with her fluency\nacross all technology business disciplines is shown in her strong executive\nand inclusive management style.\"\n\n     With more than 20 years of experience and demonstrated successful\nleadership, Carter was most recently the vice president of Public Sector\nPartners and Programs at Amazon Web Services (AWS). In this role, she\ngenerated and implemented business strategies to increase partner\nparticipation by an average of 54 percent year-over-year, closed AWS Public\nSector's largest partnerships, and innovated new revenue streams, which\ndrove most of AWS Public Sector's business. Carter also made significant\ncontributions to the company's diversity and inclusion efforts, having\ncreated the Women of EC2 group, the Women of the C-Suite for the AWS Re:\ninvent conference, and drove events for underrepresented minorities and\nwomen in more than 10 countries. Additionally, she and her team created an\nAWS program, Think Big for Small Business, for diverse companies globally.\n\n     One of the leading pioneers in the digital business revolution, Carter\nis chairman of the board for Girls in Tech, which aims to accelerate the\ngrowth of innovative women entering the high-tech industry and building\nstartups by creating proprietary, innovative programming, and strategic\nglobal partnerships. She is also an adjunct professor at Carnegie Mellon\nSilicon Valley, an author of five books about business, marketing, and\nsocial media, and was named to Forbes' Global Top 40 Marketing Masters\nlist, and CNN's 10 Most Powerful Women in Tech and Women of M2M (IoT). She\nis an international speaker and influencer who has presented on topics\nincluding artificial intelligence, machine learning, Internet of Things,\nand cloud computing in more than 80 countries.\n\n     \"I am proud to join the Altair board of directors and bring my\nmultidisciplinary experience to help the organization accelerate its global\npartnership, sales, and marketing efforts,\" said Carter. \"Altair is making\ngreat strides in helping forward-thinking companies accelerate their\ndigital transformation efforts.\"\n\n     Previously, Carter was vice president of AWS enterprise workloads, CEO\nand founder of Silicon Blitz, and held several leadership positions at IBM\nCorporation, including serving as channel chief and chief sales officer.\nEarlier in her career Carter held management positions at WebSphere, Tivoli\nPartners, and eCommerce.\n\n     Carter earned a Master of Business Administration degree in\nmarketing/technology management from Harvard Business School and a Bachelor\nof Science degree in computer science from Duke University.\n\n     About Altair (Nasdaq: ALTR) Altair is a global technology company\nproviding software and cloud solutions in the areas of simulation,\nhigh-performance computing (HPC), and artificial intelligence (AI). Altair\nenables organizations across broad industry segments to compete more\neffectively in a connected world while creating a more sustainable future.\nTo learn more, please visit www.altair.com.\n\n//st\n\n  Media contact:\n\n  Altair Corporate                       Altair Investor Relations\n\n  Jennifer Ristic                        The Blueshirt Group\n\n  +1.216.849.3109                        Monica Gould +1 212.871.3927\n\n  Altair Europe/The Middle East/Africa\n\n  Evelyn Gebhardt\n\n  +49 7031 6208 0\n\n//et\n\nTel   : 248-614-2400    ALTAIR ENGINEERING INC\nFax   : 248-614-2411\nEmail : ir@altair.com\nWWW   : <a href=\"https://www.altair.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.altair.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134300042.MNPRE2134300261-04385920211210</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}