{"date": "2021-12-23 00:03:45.194000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z;NEXCF-0\")\n- CEO Evan Gappelberg Buys Company Stock in the Open Market and\n- Provides Corporate Update\n\n    Nextech AR Solutions Corp. (\"Nextech\" or the \"Company\"), a diversified\nleading provider of augmented reality (\"AR\") experience technologies today\nannounced that CEO Evan Gappelberg has purchased a total of 50,310 shares\nthrough open market buys 12/17/2021 to 12/20/2021 with an average purchase\nprice of $1.00 USD or $1.29 CAD per share. This purchase increases\nCEO/Founder Evan Gappelberg's ownership to 10,099,589 common shares. The\nCompany is also providing an update with respect to various corporate\nmatters as set forth below.\n\n    Corporate Update &amp; Miscellaneous Disclosures\n\n    The Company has filed a preliminary base shelf prospectus dated October\n12, 2021 (the \"Base Shelf Prospectus\") with the securities commissions in\neach of the Provinces of Canada other than Quebec providing for aggregate\ngross proceeds of up to $75,000,000 during the 25-month period that the\nfinal Base Shelf Prospectus remains in effect. In connection with this\nfiling, the Company has also refiled its Management's Discussion and\nAnalysis for the fiscal year ended December 31, 2020 to clarify certain\ndisclosure as follows\n\n//st\n\n  * The Company's e-Commerce business is currently its main revenue source\n    and while Nextech expects it to contribute meaningful revenue to the\n    Company for the foreseeable future, at some point in the future AR and\n    technology services revenue is expected to eclipse that of e-Commerce;\n  * The Company's future business plans in respect of its AR products and\n    service offerings, as well as its e-Commerce business; and the\nsegmenting\n    of Nextech's financial results by operating segment, including with\n    respect to gross profit, cost of sales and other relevant factors.\n  * The Company is of the view that this enhanced disclosure will assist\n    readers in better understanding Nextech's financial results and future\n    plans as it transitions to focus more on its AR and technology services\n    division.\n\n//et\n\n    The Company also wishes to provide an update with respect to its\nprojected revenues for fiscal 2021. Nextech previously disclosed its goal\nof generating between $50-$60 million in revenue during fiscal 2021 , as\nset forth in its press releases dated January 12, 2021, January 15, 2021\nand February 16, 2021, each of which is available on SEDAR at\nwww.sedar.com. The Company has since updated these initial estimates based\non its revenue for the nine months ended September 30, 2021 which was\napproximately $20 million. Accordingly, the Company has revised its revenue\nestimates for fiscal 2021 to be approximately $26,000,000 in the aggregate,\nwhich varies from the original estimate principally as a result of the\neconomy opening up some contracts being delayed and are now expected in\n2022.\n\n    The foregoing updated 2021 revenue estimates and summary of the revised\nManagement's Discussion and Analysis of the Company for the fiscal year\nended December 31, 2020 have been provided at the request of Staff of the\nOntario Securities Commission in connection with its review of the Base\nShelf Prospectus.\n\n    Shareholder Update from CEO, Evan Gappelberg\n\n    As we near the end of Q4 and are moving into planning for 2022, we are\nfocused on the development and release of multiple first to market SaaS\nplatforms for Augmented Reality and the Metaverse to capture market share\nwith our entire suite of interconnected products. As mentioned in the\nprevious shareholder letter, SaaS integration with our product line has\nsignificant implications for the scalability of our products, and Nextech's\nrevenue growth. With the continued rollout of our SaaS platforms, Nextech\nwill move away from managed solutions and toward monthly recurring revenue\n(MRR), business scalability, and low to no touch. We are now signing up new\naccounts to ARtize 3D and are seeing a big jump in demand for our 3D model\nmaking solutions. I see this as a validation of our efforts to disrupt the\nemerging multi-billion dollar 3D model market with the highest quality,\nlowest cost, most scalable 3D model solutions anywhere. All signs point to\nthe fact that 2022 will be a breakout year for everything 3D.\n\n    We are hard at work converting ALL our product offerings from managed\nservices to industry leading SaaS solutions, and below is an outline of our\nQ4 launches and soon to be launched SaaS offerings.\n\n    Q4 SaaS Products Releases\n\n//st\n\n  * ARitize Labs - AR Lab Builder for Higher Education (Q4-2021) LAUNCHED\n  * ARitize 3D - 3D Models &amp; webAR for Ecommerce (Q4-2021) LAUNCHED\n  * ARitize Decorator - Virtual preview of home furnishing as 3D models in\n    desired location using just a simple 2D photo of a room (Q4-2021)\n    LAUNCHED\n//et\n\n    Current Managed Service Solutions to become SaaS Solutions\n\n//st\n\n  * CAD to POLY SaaS - 3D Model creation from CAD files (Q2-2022)\n  * ARitize Metaverse Studio SaaS - (Q1-2022)\n  * ARitize Maps SaaS - Spatial Mapping for the Metaverse (Q1-2022)\n  * ARitize Holograms - Human Hologram Creator App (Q1-2022)\n  * ARtize Ads SaaS - 3D/AR Advertisements (Q1-2022)\n  * ARoom SaaS - Integration with Teams/WebX for AR Product Visualization\n(Q1\n    - 2022)\n  * ARitize Events 3D Saas - Virtual/Hybrid Events (Q1-2022)\n\n//et\n\n    Nextech has undergone transformative growth in 2021, ultimately\nrebranding as a Metaverse company to better align with our vision and\ntechnology stack.\n\n    Since our last shareholder update in September, Nextech has made\nseveral advancements and announcements which have positioned us with a\nunique end-to-end Augmented Reality and Metaverse offering. These have been\nsignificant to the strategic direction of the company, and are highlighted\nbelow.\n\n    Q4 - 2021 Highlights\n\n//st\n\n  * Dec 21: Nextech AR Signs Multi-year Deal with Restaurants Canada; This\n    deal utilizes the company's virtual events and Metaverse Studio as a\n    managed service, which includes 3D AR booths, human holograms, 3D AR\n    product experiences, and augmented reality ads.\n  * Dec 15: Integration with Stripe for our 3D mapping and events platform,\n    Map D. This integration will provide an additional, no-touch annual\n    revenue stream of up to $760K or more through a platform percentage\nfee.\n  * Dec 9: Augmented Reality lab builder for the Metaverse is now available\n    in the Microsoft Azure Marketplace, allowing it to be discovered by\n    millions of customers across 141 geographies and provides access to\n    Microsoft's existing procurement relationships.\n  * Dec 8: Integration with Coinbase Commerce to accept cryptocurrency as a\n    payment method.\n  * Nov 30: The launch of our ARitize 3D SaaS offering for Ecommerce\n  * Nov 18: The launch of a major 3D Metaverse upgrade to our ARitize\nEvents\n    3D platform.\n  * Nov 16: The rebranding of Nextech AR Solutions as a Metaverse Company,\n    and the renaming of our product suite with the ARitize naming\nconvention.\n  * Nov 10: In partnership with Singtel, Nextech AR was chosen by Apple Inc\n    to showcase augmented reality on its devices through a 5G network.\n  * Nov 9: The announcement of our plans to launch our ARitize Metaverse\n    Studio as an SDK SaaS Offering.\n  * Nov 1: Closing of a CAD $5 Million private placement with institutional\n    investors.\n  * Oct 26: Signing multiple deals with Asian ecommerce aggregators, which\n    will act as a major catalyst in expanding its 3D AR model creation in\nthe\n    region.\n  * Oct 19: Finalization of the change of our Auditors to Marcum LLP, to\n    better align with our U.S. exchange uplisting goal.\n  * Oct 13: Nextech AR was chosen by The City of London for their Metaverse\n    Launch.\n  * Oct 7: The launch of ARitize Decorator SaaS product for ecommerce, to\n    enable customers to virtually preview home furnishing and decor in a\n    desired location, using just a simple 2D photo of a room.\n\n//et\n\n    Today, I have the utmost belief in Nextech AR Solutions company\ndirection, our executive leadership team, and in everyone behind the scenes\nworking to achieve our vision of becoming the lowest cost, highest quality\n3D model factory in the world. As mentioned previously, I don't believe\nthat our current share price accurately reflects the upside potential of\nour businesses, which is why I continue to increase my ownership position.\n\n//st\n\n  * In May I purchased 262,744 shares,\n  * In early December I purchased 72,656\n  * Now, again in mid December 2021, I purchased an additional 50,310\nshares\n    in the open market, increasing my ownership to 10,099,589 common\nshares,\n\n//et\n\n    I'm putting my money where my mouth is. I hope that investors will take\nnote of how much management believes in Nextech's future potential. I've\nnever been more excited about Nextech, our business prospects, and I've\nnever been more confident in my technology and team. For the past 3 years\nwe have been working hard on bringing 3D and holographic solutions to\nmarket and as seen above we have succeeded at just that. Now I believe it\nprovides us with a first mover advantage in the burgeoning Metaverse and 3D\nindustry, which represents an $800 Billion market opportunity by 2024,\naccording to Bloomberg Intelligence which is why I continue to invest for\nthe future.\n\n    On behalf of the Board of Nextech AR Solutions Corp.Evan GappelbergCEO\nand Director\n\n    To learn more, please follow us on Twitter, YouTube, Instagram,\nLinkedIn, and Facebook, or visit our website: <a href=\"https://www.Nextechar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.Nextechar.com</a>.\n\n    About Nextech ARNextech AR Solutions is a Metaverse company that\ndevelops and operates augmented reality (\"AR\") platforms, transporting\nthree-dimensional (\"3D\") product visualizations, human holograms and 360\nportals to its audiences altering e-commerce, digital advertising, hybrid\nvirtual events (events held in a digital format blended with in-person\nattendance) and learning and training experiences.\n\n    Nextech focuses on developing AR solutions for the Metaverse, however\nmost of the Company's revenues are derived from three e-Commerce platforms:\nvacuumcleanermarket.com (\"VCM\"), infinitepetlife.com (\"IPL\") and\nTrulyfesupplements.com (\"TruLyfe\"). VCM and product sales of residential\nvacuums, supplies and parts, and small home appliances sold on Amazon.\n\n    Forward-looking StatementsThe CSE and the NEO have not reviewed and do\nnot accept responsibility for the adequacy or accuracy of this release.\n\n    Certain information contained herein may constitute \"forward-looking\ninformation\" under Canadian securities legislation. Generally,\nforward-looking information can be identified by the use of forward-looking\nterminology such as, \"will be\" or variations of such words and phrases or\nstatements that certain actions, events or results \"will\" occur.\nForward-looking statements regarding the completion of the transaction are\nsubject to known and unknown risks, uncertainties and other factors. There\ncan be no assurance that such statements will prove to be accurate, as\nfuture events could differ materially from those anticipated in such\nstatements. Accordingly, readers should not place undue reliance on\nforward-looking statements and forward-looking information. Nextech will\nnot update any forward-looking statements or forward-looking information\nthat are incorporated by reference herein, except as required by applicable\nsecurities laws.\n\n Contact Information:\n\nInvestor Relations\nLindsay Betts\ninvestor.relations@Nextechar.com\n866-ARITIZE (274-8493) Ext 7201\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135501099.MNPRE2135502551-15544820211222</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}