{"date": "2021-12-16 17:55:38.812000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>OTONOMO TECHNOLOGIES LTD (\"OTMO-Q\")\n- Attending CES 2022\n\n     Otonomo Technologies Ltd. a leading mobility intelligence platform\nprovider, announced its plans to participate in the upcoming 2022 Consumer\nElectronics Show (\"CES) in Las Vegas from January 5 to January 8, 2022.\n\n     Otonomo will join a host of Vehicle, IoT, Smart Cities and\nSustainability technology companies attending CES. Otonomo intends to\nleverage CES 2022 to expand its growing network of automotive\nmanufacturers, smart cities and mobility service providers.\n\n     \"As CES is one of the biggest and most anticipated events in the tech\nspace, we are excited to discuss our recent strategic partnerships with\nAWS, NXP and Salesforce and provide additional information on our newly\nlaunched mobility intelligence solutions,\" said Ben Volkow, CEO and\nCo-Founder of Otonomo. \"Being part of CES is a great opportunity to\nstrengthen current partnerships and increase our brand recognition among a\nvariety of innovators in the transportation, smart city and mobility space.\nWe will be highlighting how our application-ready connected vehicle data\nand mobility intelligence can assist them in optimizing the services they\nprovide and the enterprises they run.\"\n\n     Ben Volkow, Otonomo CEO and Co-Founder, and members of Otonomo's\nexecutive team will be present at #CES2022 and available for investor and\nbusiness meetings. To schedule a meeting please contact jodija@otonomo.io.\n\n     About Otonomo\n\n     Otonomo (Nasdaq: OTMO) fuels a data ecosystem of OEMs, fleets and more\nthan 100 service providers spanning the transportation, mobility, and\nautomotive industries. Our platform securely ingests more than 4 billion\ndata points per day globally from over 40 million vehicles licensed on the\nplatform and massive amounts of mobility demand data from multimodal\nsources, then reshapes and enriches it, to accelerate time to market for\nnew services that improve the mobility and transportation experience. We\nprovide deeper visibility and actionable insights to empower strategic\ndata-driven decisions - taking the guesswork out of mobility and\ntransportation planning, deployment, and operations. Privacy by design and\nneutrality are at the core of our platform, which enables GDPR, CCPA, and\nother privacy-regulation-compliant solutions using both personal and\naggregate data. Use cases include emergency services, mapping, traffic\nmanagement, EV management, subscription-based services, micro-mobility,\nparking, predictive maintenance, insurance, media, in-vehicle services and\ndozens of smart city solutions.\n\n     More information is available at otonomo.io\n\n     Otonomo on Social Media\n\n     ?   Follow Otonomo on LinkedIn\n?   Like Otonomo on Facebook\n?   Follow Otonomo on Twitter\n\n     Forward Looking Statements\n\n     This announcement contains certain forward-looking statements within\nthe meaning of the federal securities laws, including statements regarding\nthe services offered by Otonomo, the anticipated technological capability\nof Otonomo, the markets in which Otonomo operates and Otonomo's projected\nfuture financial and operational results. These forward-looking statements\ngenerally are identified by the words \"believe,\" \"project,\" \"expect,\"\n\"anticipate,\" \"estimate,\" \"intend,\" \"strategy,\" \"future,\" \"opportunity,\"\n\"plan,\" \"may,\" \"should,\" \"will,\" \"would,\" \"will be,\" \"will continue,\" \"will\nlikely result,\" and similar expressions. Forward-looking statements are\npredictions, projections and other statements about future events that are\nbased on current expectations and assumptions and, as a result, are subject\nto risks and uncertainties. Many factors could cause actual future events\nto differ materially from the forward-looking statements in this\nannouncement, including but not limited to, the ability to implement\nbusiness plans, forecasts, and other expectations, the ability to identify\nand realize additional opportunities, and potential changes and\ndevelopments in the highly competitive data marketplace. The foregoing list\nof factors is not exhaustive. You should carefully consider the foregoing\nfactors and the other risks and uncertainties described in Otonomo's final\nprospectus filed with the SEC on November 3, 2021, and other documents\nfiled by Otonomo from time to time with the SEC. These filings identify and\naddress other important risks and uncertainties that could cause actual\nevents and results to differ materially from those contained in the\nforward-looking statements. Forward-looking statements speak only as of the\ndate they are made. Readers are cautioned not to put undue reliance on\nforward-looking statements, and Otonomo assumes no obligation and does not\nintend to update or revise these forward-looking statements, whether as a\nresult of new information, future events, or otherwise. Otonomo gives no\nassurance that it will achieve its expectations.\n\n     For press inquiries, please\n\n Contact Information:\n\ncontact:\nOtonomo\nJodi Joseph Asiag\nHead of Content and Communications\njodija@otonomo.io\n\n     For investment inquiries, please contact:\nMS- IR for Otonomo\nMiri Segal\nmsegal@ms-ir.com\n\nWWW   : <a href=\"https://www.otonomo.io\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.otonomo.io</a>    OTONOMO TECHNOLOGIES LTD\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134900469.MNPRE2134902459-09074420211216</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}