{"date": "2021-11-22 18:11:38.208000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON (\"AMZN-Q\")\n- Taylor Swift Releases New Version of \"Christmas Tree Farm,\"\n- Streaming Only on Amazon Music\n\n     Amazon Music announced an exclusive new version of \"Christmas Tree\nFarm\" from 11-time Grammy winner, and only woman to ever win Album of the\nYear three times, Taylor Swift. \"Christmas Tree Farm (Old Timey Version)\"\narrives just in time for the holidays and fresh off of her #1\nrecord-breaking release of Red (Taylor's Version). Swift's reimagined\nversion of her beloved holiday hit was recorded at Abbey Road Studios in\nLondon and features a beautiful new arrangement backed by a 70-piece\norchestra. Swift's \"Christmas Tree Farm (Old Timey Version) (Amazon\nOriginal)\" is now available exclusively for all Amazon Music listeners\nglobally, including in spatial audio with Dolby Atmos here.\n\n     \"Taylor Swift is an icon who has shattered streaming records on Amazon\nMusic over the years, and this season, we're thrilled to bring this new,\ntimeless version of 'Christmas Tree Farm' to her fans as they gather with\nfriends and family for the holidays,\" said Ryan Redington, VP of music\nindustry at Amazon Music.\n\n     Inspired by her youth growing up on a Christmas tree farm in\nPennsylvania, Swift wrote \"Christmas Tree Farm\" while celebrating with\nfamily over the holidays in 2019. While fans know and love the booming,\nupbeat version of \"Christmas Tree Farm,\" Swift wanted to capture the cozy\nand calming holiday atmosphere for her Amazon Original song. Joined by a\n70-piece orchestra at Abbey Road Studios, Swift's new recording features\nstrings, horns, and sleigh bells, reminiscent of classic, big band\nChristmas songs by the greats before her.\n\n     Earlier this month, Amazon Music announced its biggest season of\nholiday programming yet, with a variety of new Amazon Original songs,\nincluding Camila Cabello's cover of \"I'll Be Home for Christmas,\" a fresh\noriginal song from Dan + Shay called \"Pick Out a Christmas Tree,\" Leon\nBridges' reimagined version of Marvin Gaye's \"Purple Snowflakes,\" Sech's\nnew original song, \"Carta Navidena,\" George Ezra's \"Come on Home for\nChristmas,\" and much more. Today, Swift's \"Christmas Tree Farm (Old Timey\nVersion) (Amazon Original)\" arrives on the global playlist \"Merry Mix,\"\nwhich features all new Amazon Original songs for the season, in addition to\niconic holiday classics. For a limited time, customers who haven't yet\ntried Amazon Music Unlimited can get three months free--with unlimited\naccess to millions of songs, ad-free, in the highest-quality streaming\naudio and millions of podcast episodes.\n\n     About Amazon MusicAmazon Music reimagines music listening by enabling\ncustomers to unlock millions of songs and thousands of curated playlists\nand stations with their voice. Amazon Music provides unlimited access to\nnew releases and classic hits across iOS and Android mobile devices, PC,\nMac, Echo, and Alexa-enabled devices including Fire TV and more. With\nAmazon Music, Prime members have access to ad-free listening of 2 million\nsongs at no additional cost to their membership. Listeners can also enjoy\nthe premium subscription service, Amazon Music Unlimited, which provides\naccess to millions of songs and the latest new releases. Amazon Music\nUnlimited customers also now have access to the highest-quality listening\nexperience available, with millions of songs available in High Definition\n(HD), more than 7 million songs in Ultra HD, and a growing catalog of\nspatial audio. Customers also have free access to an ad-supported selection\nof top playlists and stations on Amazon Music. All Amazon Music tiers now\noffer a wide selection of podcasts at no additional cost, and live\nstreaming in partnership with Twitch. Engaging with music and culture has\nnever been more natural, simple, and fun. For more information, visit\namazonmusic.com or download the Amazon Music app.\n\n     About AmazonAmazon is guided by four principles: customer obsession\nrather than competitor focus, passion for invention, commitment to\noperational excellence, and long-term thinking. Amazon strives to be\nEarth's Most Customer-Centric Company, Earth's Best Employer, and Earth's\nSafest Place to Work. Customer reviews, 1-Click shopping, personalized\nrecommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct\nPublishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo,\nAlexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are\nsome of the things pioneered by Amazon. For more information, visit\namazon.com/about and follow @AmazonNews.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132500448.MNPRE2132502416-09550220211122</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}