{"date": "2021-11-26 01:18:15.801000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.41, "close": 3561.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced four initiatives to empower learners and make it even easier for anyone with a desire to learn to access free cloud computing skills training and unlock new career possibilities in the cloud. The initiatives announced today include the launch of AWS Skill Builder?a new digital learning experience, the addition of AWS courses to the Amazon.com website, the expansion of the AWS re/Start global reskilling program, and the opening of the AWS Skills Center?Amazon?s first dedicated, in-person cloud learning space. In December 2020, Amazon committed to investing hundreds of millions of dollars to provide free cloud computing skills training to 29 million people by 2025?reaching people from all walks of life and all levels of knowledge, in more than 200 countries and territories. On this mission, Amazon has already helped over 6 million people gain cloud skills, and the latest efforts build on the existing commitment by putting skills training into the hands of millions of people.</p><p>These initiatives come as newly released research shows that the need for digital skills training is greater than ever. The AWS Global Digital Skills Study surveyed employers and workers on their perceptions of digital skills training across 12 countries. The study found that 85% of workers feel that they now need more technical knowledge to do their jobs as a result of pandemic-related changes in their work. Additionally, workers who take the time to learn new skills are seeing significant benefits, with 86% reporting greater efficiency in doing their jobs, 85% experiencing greater personal satisfaction, and 80% reporting improved employability. Employers who support workforce education programs also see benefits, with 87% reporting that investments in digital skills training have allowed their organizations to achieve their digital transformation goals more quickly and 84% noting improved worker retention. The full findings of the AWS Global Digital Skills Study can be found at aboutamazon.com/29million.</p></div><div class=\"tr-npp-body\"><p>?Our goal is to empower anyone with a desire to learn by giving them access to the tools necessary to excel in cloud computing careers. Over the next decade, we expect the adoption of cloud computing across every industry will fuel a vast number of new jobs, which is why we are investing hundreds of millions of dollars to develop online courses, local in-person reskilling programs, and new ways to make it easy for anyone to learn cloud skills,? said Maureen Lonergan, Vice President of Training and Certification at AWS. ?Lowering barriers to accessing technical skills training is critical to power a thriving, diverse workforce of the future. The programs that are part of this commitment are free and designed to meet a range of learner needs, whether they are totally new to the cloud computing industry?or even to technology?or experienced professionals looking to advance their skills.?</p><p>Providing engaging, accessible training with AWS Skill Builder and Amazon.com</p><p>To boost the availability of the latest technology skills curriculum to millions of people around the world, Amazon is launching AWS Skill Builder. AWS Skill Builder is a new digital learning experience available in more than 200 countries and territories, allowing learners to quickly and easily access over 500 free, on-demand courses?including nearly 60 new cloud computing classes added this year. AWS Skill Builder offers engaging content to meet different learning goals and styles in 16 languages. Individuals can also get course recommendations for learning plans aligned to job roles and technology areas, helping people access the most relevant content for their skill level.</p><p>To make finding skills training content even more convenient, free AWS courses are now available on Amazon.com. U.S. shoppers on the Amazon.com site can access AWS training courses with a single click. Using the same intuitive, easy-to-use Amazon.com shopping experience, people looking to advance their cloud computing knowledge and technology skills can browse for free courses, from cloud computing basics to advanced cloud architecture, as easily as finding a new pair of shoes. The content is available via the new ?AWS Courses? section of the Amazon.com site, where consumers can find and select skills training courses and pick up their learning wherever they left off. The AWS courses on Amazon.com can also be found through AWS Training Partners, including additional free offerings.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}