{"date": "2022-01-06 10:53:21.581000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Three people have been arrested in connection with theft in which investigators found a home filled to the brim with thousands of <a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> delivery packages.</p><p>The <a href=\"https://www.independent.co.uk/topic/oklahoma\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Oklahoma</a> county sheriff's office, in a statement on Facebook on Wednesday, identified the suspects as Cesar Yasnier Cerqueira Rojas, Dinneris Matos Delgado, and Maikel Perez Laurencio.</p></div><div class=\"tr-npp-body\"><p>The three face 15 felony counts of possession of stolen property and embezzlement. Ms Delgado has also been charged with Possession of a Controlled Dangerous Substance (Meth).</p><p>The theft was discovered after officials responded to an illegal dumping complaint in the area on 30 December last year.</p><p>\"When they arrived, deputies found about 600 empty Amazon packages dumped on the ground. Deputies also found a garbage bag containing an envelope with an address and a receipt from a local store,\" the statement said.</p><p>Officers then visited the address after obtaining a warrant and found thousands of undelivered Amazon packages inside.</p><p>\"Packages were stored throughout the home in almost every room and filled the storm shelter,\" the statement said.</p><p>\"It would have been easy to write this off as an illegal dumping case; but our deputies recognised this was much more serious and contacted investigators,\" said sheriff Tommie Johnson III.</p><p>\"Our investigators quickly identified a suspect and followed through to bring this case to a successful conclusion.\"</p><p>Investigators said two of the three suspects were illegal immigrants, even as the authenticity of their identity proofs was still being determined.</p><p>\"Investigators believe Cesar Yasnier Cerqueira Rojas, an illegal immigrant from Cuba, was working as a third party driver for Amazon; delivering packages using a truck owned by 37-year-old Dinneris Matos Delgado, a legal immigrant from Cuba,\" the sheriff's statement said.</p><p>\"Investigators believe Rojas may have loaded extra pallets on to the truck and brought them to the South Birch address where they were opened,\" it added.</p><p>Mr Laurencio, also termed an illegal immigrant by investigators, was another third-party driver involved in the theft.</p><p>\"It's important to note, we are working to verify the identities of Rojas and Laurencio. They provided us with identification from Cuba, but we question whether the ID's are authentic (sic),\" the sheriff's office said.</p><p>The packages have been returned to Amazon, the sheriff's office said.</p><p>\"Every one of these packages was supposed to be delivered by Christmas Day,\" sheriff's spokesperson Aaron Brilbeck told KFOR-TV.</p><p>\"So, 600 people didn't get their Christmas gifts as a result of this,\" he added.</p><p>\"We are thankful for the quick investigative work of the Oklahoma County Sheriff's Office and are committed to taking care of any customers who may have been impacted by this criminal activity,\" said Kelly Nantel, a spokesperson for Amazon.</p><p>\"Customers missing packages are encouraged to report any delays to Amazon customer service so we can work quickly to make it right,\" she added.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}