{"date": "2022-02-01 15:47:11.373000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON.COM INC (\"AMZN-Q\")\n- TRAYVON: TEN YEARS LATER -- A Mother's Essay from Sybrina Fulton\n- Now Available from Amazon Original Stories\n\n    Amazon Original Stories, an imprint of Amazon Publishing, announced\ntoday the release of the powerful essay Trayvon: Ten Years Later by Sybrina\nFulton, the mother of Trayvon Martin. Providing a deeply personal account\nof a family tragedy that unfolded on the world stage, Fulton imparts wisdom\nand shares the lessons she's learned over these past ten years. Her essay\nis about life, love, and loss; about bad faith; about what changes have and\nhave not occurred; and about the power of finding and using her voice.\n\n    \"We all have an obligation to help children and create communities that\nlead with safety, love, and equity. I hope that with my new essay and the\nwork I have done over the last ten years, readers, watchers, and supporters\nwill feel inspired to create something positive for the world we live in,\nand our children's futures,\" said Fulton. \"From small good deeds to large\nscale cultural change, these transformations can honor Trayvon and others\nwho senselessly lost their lives.\"\n\n    \"We are privileged to publish Sybrina Fulton's powerful essay and thank\nher for her vulnerability, honesty, and inspiration,\" said Selena James,\neditor at Amazon Original Stories. \"Sybrina has become one of the most\nimportant activists of our time, and we are proud to work with her to share\nher essay with readers at this crucial moment in history.\"\n\n    Available at no additional cost to Prime and Kindle Unlimited\ncustomers, Trayvon: Ten Years Later can be downloaded as a Kindle eBook and\nwill also be available on Audible at www.amazon.com/trayvon.\n\n    Fulton joins other notable authors in the Amazon Original Stories\nlibrary sharing their stories and experiences with readers. In 2021, Kareem\nAbdul-Jabbar explored racial conflict through the prism of his childhood\nand the influence of his father in Black Cop's Kid, and in 2020, Mindy\nKaling shared a relatable take on love and relationships in her Amazon\nCharts bestselling essay collection Nothing Like I Imagined (Except for\nSometimes). Amazon Original Stories nonfiction also includes works from\nDavid Sedaris, Susan Orlean, and Jessica Simpson.\n\n    To read Trayvon: Ten Years Later and other singular creative works of\nshort nonfiction and fiction, visit www.amazon.com/amazonoriginalstories.\n\n    About Sybrina FultonSybrina Fulton is the author of Rest in Power: The\nEnduring Life of Trayvon Martin, which was adapted into an Emmy-nominated\nseries for the Paramount Network. Sybrina cofounded the Trayvon Martin\nFoundation with Tracy Martin; founded the Circle of Mothers, a group\ndedicated to bringing together mothers who have lost children or other\nfamily members due to gun violence; and participated in Tony Robbins's \"A\nHistoric Conversation for Healing and Unity.\" She advocates for families\nand concerned citizens across the globe, supports grieving mothers, mentors\nyoung people, and has become a leading voice on the need to end senseless\ngun violence. A Miami Gardens, Florida, native and lifelong resident,\nSybrina has dedicated her adult life to public service, empowering women,\nand fighting for positive social change.\n\n    About Amazon PublishingAmazon Publishing is a leading trade publisher\nof fiction, nonfiction, and children's books with a mission to empower\noutstanding storytellers and connect them with readers worldwide. We\npublish emerging, bestselling, and critically acclaimed authors in digital,\nprint, and audio formats.\n\n    Amazon Original Stories, an imprint of Amazon Publishing, is known for\nits single-sitting reads from bestselling authors, acclaimed storytellers,\nand new voices. Launched in 2017, Amazon Original Stories brings\nunforgettable short fiction and nonfiction to Kindle--including stories and\nessays from Mindy Kaling, Dean Koontz, Chimamanda Ngozi Adichie, Kiley\nReid, David Sedaris, N.K. Jemisin, Ruth Ware, Jess Walter, Cheryl Strayed,\nRoxane Gay, Rainbow Rowell, Alice Hoffman, Jacqueline Woodson, and more.\n\n    About AmazonAmazon is guided by four principles: customer obsession\nrather than competitor focus, passion for invention, commitment to\noperational excellence, and long-term thinking. Customer reviews, 1-Click\nshopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS,\nKindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and\nAlexa are some of the products and services pioneered by Amazon. For more\ninformation, visit www.amazon.com/about and follow @AmazonNews.\n\n     Contact Information:\n\n     Amazon.com, Inc.\n     Media Hotline\n     Amazon-pr@amazon.com\n     www.amazon.com/pr\n\n                            ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203100326.MNPRE2203102213-07300220220201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}