{"date": "2022-02-23 07:01:08.426000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">BENGALURU, India, Feb. 23, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span><b>~UST &amp; AWS collaborate to accelerate enterprise digital and modernization journey with AWS cloud services~</b></span></p>\n  <p>BENGALURU, <span class=\"xn-location\">India</span>, <span class=\"xn-chron\">Feb. 23, 2022</span> /PRNewswire/ -- <u><a href=\"https://ust.com/\"><b>UST</b></a></u>, a leading digital transformation solutions company, announced a multi-year Strategic Collaboration Agreement (SCA) with <b>Amazon Web Services, Inc. (AWS)</b>. Under the agreement, UST will invest in extending its deep AWS and enterprise digital transformation expertise to build industry/domain-centric solutions for healthcare, financial services, and telecom. These solutions will catalyze the modernization of organizations with AWS services. Customers will benefit from decades of UST enterprise experience in legacy modernization from mainframe to AWS, microservices and reimagining UI (User Interface) experience, DevSecOps (development, security, and operations) transformation, cloud migration and modernization, and cloud optimization.</p>\n<div id=\"prni_dvprnejpge57bleft\" style=\"WIDTH:100%;TEXT-ALIGN:left\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img align=\"middle\" alt=\"UST_Logo\" border=\"0\" id=\"prnejpge57bleft\" src=\"https://mma.prnewswire.com/media/1422658/UST_Logo.jpg\" title=\"UST_Logo\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTQyMjY1OC9VU1RfTG9nby5qcGc=&amp;key=4f54d383589725b1f2f8f60bec2040bc5dfbad0c322073941b477c4b4e1aa3807c5f002e6b47fdf0c3281982e3c5c117f628c33b6a2a7e7444cdb22608c7a2cf\"/></div></div></div><p>\"UST's spectrum of digital solutions for the cloud combined with the power of AWS's architecture will allow organizations greater opportunities to develop solutions that solve their unique challenges,\" said <b><span class=\"xn-person\">Chris Sullivan</span>, Global Director, WW System Integrators &amp; Strategic Alliances at AWS</b>. \"We look forward to working together to support the clients on their digital journey and accelerating their business transformation goals.\"</p>\n<p>UST will expand its digital accelerator services to help the organization transition to AWS services. UST's catalog of services include UST Forensics - Cloud readiness and auditing framework, Cloud Velocity - cloud migration service, UST-PACE for developer accelaration &amp; UST SmartStart™ which provides the blueprint for automation adoption.</p>\n<p>\"UST is at the forefront of meaningful use of technology - always thinking ahead on how we can help our clients get assured value in their transformation journeys,\" said <b><span class=\"xn-person\">Niranjan Ramsunder</span>, Chief Technology Officer at UST</b>. \"This collaboration enhances the combination of UST's strong technical focus and AWS's deep breadth of edge and cloud expertise and services to bring our customers committed business outcomes with minimized risk.\"</p>\n<p>\"Our modern and secured platform that's born in the cloud and built for scale provides exceptional member experience combined with operational efficiency that reduces overall TCO and helps healthcare payors realize the full value of their investments. We are excited for the strengthened relationship between our two primary partners AWS and UST, that provide us with cloud technology services leadership and digital transformation expertise,\" added <b><span class=\"xn-person\">Balaji Narayana</span>, Senior Vice President – Technology &amp; Innovation at CarynHealth.</b></p>\n<p>UST will make a number of its <b>digital accelerators and platforms </b>available in AWS Marketplace, a digital catalog with thousands of software listings from independent software vendors that make it easy to find, test, buy, and deploy software that runs on AWS. These include:<br/></p>\n<ul type=\"disc\" class=\"bulleted-list arrowlist\"><li><b>UST-PACE<sup>TM</sup></b> - The Platform for Accelerated Cloud Engineering or UST PACE is the future of work platform that unites foundational tools and cloud capabilities into a seamless service. </li><li><b>UST IQ™</b> - One cloud data platform that manages every aspect of the data engineering pipeline from ingestion to insight. </li><li><b>SmartOps<sup>TM</sup></b><sup> </sup>- AI-powered cognitive automation platform that holistically learns and reimagines business processes. </li><li><b>Cyberproof </b>- Offers comprehensive solutions &amp; services to help enterprises consume and operate at scale in public cloud.</li></ul><p>\"We are excited to deepen our collaboration with AWS that brings next-generation solutions to our customers, ensuring they get business differentiating value at speed, agility, quality, and efficiency,\" added <b><span class=\"xn-person\">Manu Gopinath</span>, Chief Operating Officer at UST</b>. \"UST's platforms and the native capabilities of AWS technologies improve our customers' time-to-market by upwards of 30% and provide a competitive edge.\"</p>\n<p>UST is also investing significantly to address the industry talent shortage by training and certifying over 2000 professionals annually across technical and business pathways through its GA Menon Academy (GAMA).</p>\n<p><b>About CarynHealth</b></p>\n<p>CarynHealth (<a href=\"https://carynhealth.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://carynhealth.com</a>)  is a leading-edge health tech company offering advanced cloud-based technology, end-to-end managed services, business process optimization and outsourcing, and operations management solutions. CarynHealth's new generation platform is designed for health plan payors, and for employers who offer self-funded health insurance, third-party administrators and health care sharing programs. </p>\n<p><b>About UST </b></p>\n<p>For more than 22 years, UST has worked side by side with the world's best companies to make a real impact through transformation. Powered by technology, inspired by people, and led by our purpose, we partner with our clients from design to operation. We identify their core challenges and craft disruptive solutions that bring their vision to life through our agile approach. With deep domain expertise and a future-proof philosophy, we embed innovation and agility into our clients' organizations—delivering measurable value and lasting change across industries and worldwide. Together, with over 29,000 employees in 30 countries, we build for boundless impact—touching billions of lives in the process. Visit us at <a href=\"http://ust.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ust.com</a>.</p>\n<p><b>Media Contacts, UST:</b></p>\n<p><span class=\"xn-person\">Tinu Cherian Abraham</span><br/>+1 (949) 415-9857</p>\n<p><span class=\"xn-person\">Neha Misri</span><br/>+91-9972631264<br/><a href=\"mailto:media.relations@ust.com\" data-type=\"email\" translate=\"no\">media.relations@ust.com</a></p>\n<p><b>Media Contacts, U.S.:</b></p>\n<p>S&amp;C PR<br/>+1-646.941.9139<br/><a href=\"mailto:media@scprgroup.com\" data-type=\"email\" translate=\"no\">media@scprgroup.com</a></p>\n<p><b>Media Contacts, U.K.:</b></p>\n<p>FTI Consulting<br/><u><a href=\"mailto:UST@fticonsulting.com\" data-type=\"email\" translate=\"no\">UST@fticonsulting.com</a></u></p>\n<p>Logo: <a href=\"https://mma.prnewswire.com/media/1422658/UST_Logo.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://mma.prnewswire.com/media/1422658/UST_Logo.jpg</a> </p>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p></div>"}