{"date": "2021-11-26 14:50:06.025000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.41, "close": 3561.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Several groups of protesters, led by members of Goringhaicona Khoi Khoi Indigenous Traditional Council and the Liesbeek Action Campaign, will on Friday afternoon descend on the site of the River Club redevelopment in Observatory to show their opposition to the building project.</p><p>Cape Town - Environmental and indigenous groups are using the Black Friday shopping rush to put a spotlight on Amazon, the world's biggest online retailer, and the building of its African headquarters on the banks of the Liesbeeck River, regarded by many as \"sacred\" ground.</p></div><div class=\"tr-npp-body\"><p>World-wide, protesters from more than 70 trade unions, civil society organisations and tax watchdogs across 26 countries will highlight the company's employee practices and working conditions.</p><p>Several groups of protesters, led by members of Goringhaicona Khoi Khoin Traditional Indigenous Council and the Liesbeek Action Campaign, will tomorrow afternoon descend on the site of the River Club redevelopment in Observatory to show their opposition to the building project.</p><p>In a campaign titled #MakeAmazonPay, the groups will be taking action on Amazon's Black Friday sales to demand the online shopping giant treats its employees better and to address the concerns of communities impacted by the international conglomerate.</p><p>Goringhaicona Khoi Khoin Indigenous Traditional Council High Commissioner Tauriq Jenkins said one of the reasons for their protest was to show the hypocrisy of Amazon founder Jeff Bezos, one of the richest men in the world.</p><p>In September, Bezos's Earth Fund pledged $1 billion (about R15.92bn) towards conserving nature and indigenous peoples and cultures, and three weeks ago during the COP26 climate talks in Glasgow, Bezos pledged to spend $2bn on restoring natural habitats.</p><p>\"There is a grading process happening right now by the South African Heritage Resources Agency to make the Two Rivers Urban Park area a national heritage site, and part of this precinct has been slated to become a World Heritage Site.</p><p>\"With Amazon now wanting to put its headquarters there, they will be desecrating this sacred flood plain since part of the development wants to redirect the manner in which the Liesbeeck River meets the Black River,\" Jenkins said.</p><p>The Cape Argus reached out to Amazon's public relations arm in the US, but by the time of writing they had not responded to queries about how, if at all, the protest would impact their decision to base their Amazon Web Services offices at the development.</p><p>Another of the groups taking part in tomorrow's protest is the Liesbeek Action Campaign.</p><p>Co-ordinator Nadine Dirks said they were going to remind the world that \"the struggle against the River Club development was a global struggle because Amazon did not appear to care what impact it had on workers, communities and the environment in whatever country it operated.</p><p>The developers of the project, Liesbeek Leisure Properties Trust (LLPT), said in a statement that the protest action was \"based on misinformation and falsehoods\".</p><p>LLPT said that as part of the redevelopment it would allocate R38 million to rehabilitate the riverine corridor, including replacing the concrete canal in which the river flowed along the property with a naturalised riverine environment.</p><p>Chief! Garu Zenzile Khoisan, leader of the Western Cape First Nations Collective, a group in favour of the development, said: \"The collective remains resolute and undeterred by the actions and antics of the Observatory elite and the fifth columns and mercenaries who are allied with their lost cause.</p><p>\"We maintain our position that we are the structures and leaders that have led the Khoi and San resurgence from its inception.</p><p>\"We have secured our right of return to the land from which our ancestors were unjustly removed by the ancestors of the Observatory elite that want to usurp our voice.\"</p><p>mwangi.githahu@inl.co.za</p><p><a href=\"https://www.iol.co.za/capeargus\"><span>Cape Argus</span> </a> </p><p>Cape Argus © 1999 - 2021 Independent Newspapers (Pty) Limited. All rights strictly reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}