{"date": "2021-12-01 02:04:16.450000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The regional office of the US labour board has ordered a new election at an <a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> warehouse in <a href=\"https://www.independent.co.uk/topic/alabama\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alabama</a> , where workers waged a high-profile campaign to organise the first union in the retail giant's history.</p><p>Following a failed bid to unionise roughly 6,000 workers at a warehouse in Bessemer, Alabama earlier this year, union organisers and workers vowed to challenge the results, alleging an aggressive and illegal anti-union campaign that had drawn international scrutiny.</p></div><div class=\"tr-npp-body\"><p>Workers <a href=\"https://www.independent.co.uk/news/world/americas/us-politics/amazon-union-jennifer-bates-bernie-sanders-b1818586.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">testified to Congress</a> about working conditions, union campaigners <a href=\"https://www.independent.co.uk/news/world/americas/us-politics/amazon-union-cori-bush-jamaal-bowman-b1813291.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">gained support from progressive lawmakers</a> and President Joe Biden, as well as Senator Bernie Sanders, <a href=\"https://www.independent.co.uk/news/world/americas/us-politics/bernie-sanders-amazon-alabama-bezos-b1823219.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">held rallies with workers</a> as voting was underway.</p><p>Their efforts were met with an anti-union effort that included text messages, one-on-one meetings and mandatory meetings on the warehouse floor and a social media PR blitz, among other tactics reported by workers and organisers.</p><p>Warehouse management also coordinated with the US Postal Service and Amazon headquarters to stage a ballot dropbox in front of the warehouse under a tent provided by the company, which union organisers allege was used to intimidate workers.</p><p>The Retail, Wholesale and Department Store Union argued that Amazon interfered with employers' rights to vote in the union election, and created an \"atmosphere of confusion, coercion and/or fear of reprisals and thus interfered with the employees' freedom of choice\".</p><p>In August, a labour board hearing officer suggested that results from that election be tossed out and that a new election take place.</p><p>A decision from the National Labor Relations Board's regional director on 29 November determined that Amazon showed a \"flagrant disregard\" for the mail-in ballot election, arguing that Amazon \"essentially highjacked the process and gave a strong impression that it controlled the process.\"</p><p>\"This dangerous and improper message to employees destroys trust in the [labour board's] processes and in the credibility of the election results,\" regional director Lisa Henderson wrote in a filing on Monday.</p><p>Union president Stuart Appelbaum said in a statement that the decision on Monday \"confirms what we were saying all along – that Amazon's intimidation and interference prevented workers from having a fair say in whether they wanted a union in their workplace,\" which union leaders and the labour board's regional director have called \"unacceptable and illegal\".</p><p>Amazon spokesperson Kelly Nantel said in a statement that \"it's disappointing that the NLRB has now decided that those votes shouldn't count.\"</p><p>Following the election, the labour board <a href=\"https://www.nlrb.gov/news-outreach/news-story/nlrb-announces-results-in-amazon-election\" data-type=\"url\" class=\"tr-link\" translate=\"no\">tallied</a> 1,798 votes against unionising the warehouse and 738 votes in support. Seventy-six ballots were voided, and 505 ballots were challenged. The number of those remaining ballots not included in the count were not sufficient to affect the outcome, the board said.</p><p>The 3,117 ballots among the 5,876 voting-eligible workers marked a 53 per cent turnout for the election.</p><p>A push to organise Amazon workers signalled a wave of labour organising with some of the world's largest brands – including <a href=\"https://www.independent.co.uk/news/world/americas/frito-lay-strike-factory-doritos-b1885068.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Frito Lay</a> , <a href=\"https://www.independent.co.uk/news/world/americas/john-deere-strike-contract-b1960148.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">John Deere</a> , <a href=\"https://www.independent.co.uk/news/world/americas/kelloggs-cereal-plant-workers-strike-b1933594.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kelloggs</a> , <a href=\"https://www.independent.co.uk/news/world/americas/nabisco-strike-boycott-union-contract-b1921580.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Nabisco</a> and <a href=\"https://www.independent.co.uk/news/world/americas/howard-schultz-starbucks-holocaust-union-b1954541.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Starbucks</a> – calling for better conditions and wages, or pushing for union representation.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/independentpremium/us/amazon-alabama-union-busting-vote-b1829340.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">How Amazon busted a historic union effort in Alabama</a> </p><p><a href=\"https://www.independent.co.uk/news/lsu-notre-dame-oklahoma-southeastern-conference-irish-b1966559.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LSU hires Kelly away from Notre Dame to be Tigers next coach</a> </p><p><a href=\"https://www.independent.co.uk/news/amazon-alabama-new-york-b1966452.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon workers in Alabama get a do-over in union election</a> </p><p><a href=\"https://www.independent.co.uk/news/university-of-alabama-alabama-ncaa-b1966350.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Former Alabama track star, Olympian killed in shootout</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}