{"date": "2022-02-15 09:30:38.634000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>In the last 4 years, millions of Indian customers have used the Alexa voice service in English, Hindi and Hinglish on Echo range of devices.</p><p>The interaction of Indians with Alexa devices grew by 68 per cent in 2021 as compared to 2020, with 50 per cent customers coming from non-metro cities. Amazon India is celebrating the fourth anniversary of Alexa in India, and the company has revealed some stats on the usage of its voice assistant. Interestingly, during March-April 2021 which saw the deadly second wave of Covid-19 in India, customers asked 11,500 questions every day about COVID, health and wellness related topics.</p></div><div class=\"tr-npp-body\"><p>According to Amazon, 1.7 lakh questions were answered by Alexa daily related to sports, movie dialogues, word definitions, tough math problems, weather, and the latest stock market updates.  Indian customers played more than 21.6 lakh songs every day, genre such as kids, devotional and regional language were prominent in the top 20 songs.</p><p>Further, Alexa responded to over 2.6 lakh requests for controlling smart home appliances every day. The Alexa smart home selection increased by 72 per cent Year-on Year (YoY) with new products from brands like Xiaomi, OnePlus, Hindware, and Atomberg.</p><p>Customers also loved starting and concluding their days with Alexa, they wished \"Alexa, good morning\" and \"Alexa, good night\" 11,520 times every day. Amazon also claims that Alexa became more accurate in understanding user queries and reduced Automatic Speech Recognition errors by 25 per cent.</p><p>Copyright 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}