{"date": "2022-01-21 16:06:14.903000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3033.35, "close": 2890.88}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>It is by no means the first coming-of-age series on autism, but the new show from the maker of Friday Night Lights is eye-opening, warm and well worth your time</p><p>Star Rating: 4 stars</p></div><div class=\"tr-npp-body\"><p>The first few minutes of As We See It (Amazon Prime) show a remarkable demonstration of how auditory processing can be difficult for some people on the autism spectrum. Harrison, a man in his 20s, is carefully coaxed out of his Los Angeles apartment by his live-in aide, Mandy. She calls him on his phone, so that she can talk him through his walk around the block, and slowly, carefully, he begins. Traffic might be a little loud, she warns him. He worries that a woman with a crying baby is looking at him. With each step, Mandy reassures him that it's fine. And then a dog appears, starts barking, and chaos ensues. Harrison flees back indoors. Each noise and potential trigger is cleverly pushed in the mix, to give viewers who may not understand Harrison's fears a chance to experience them.</p><p>This new drama follows three roommates on the spectrum, all played by actors who are on the spectrum themselves. Their families pay Mandy (Sosie Bacon, last seen as the mother of <a href=\"https://www.theguardian.com/tv-and-radio/2021/dec/23/kate-winslet-i-feel-way-cooler-as-a-fortysomething-actress-than-i-ever-imagined\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kate Winslet</a> 's grandson in <a href=\"https://www.theguardian.com/tv-and-radio/2021/apr/19/mare-of-easttown-review-kate-winslet-hbo-murder-mystery\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Mare of Easttown</a> ) a salary to live in as their support worker. Harrison barely leaves the flat, while Jack has a job as a programmer, and Violet works at a fast-food restaurant (it's a real chain, and it gets a lot of mentions). All three are living with Mandy in order to work towards greater independence, and all have goals they are supposed to achieve each week, whether that is making new friends, or asking how a relative is feeling about a difficult emotional situation.</p><p>This is a well-done, soapy drama that has its heart fully on display. Based on an Israeli series, On the Spectrum, it was developed, produced and partly written by the writer of American football drama <a href=\"https://www.theguardian.com/tv-and-radio/tvandradioblog/2012/feb/13/friday-night-lights\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Friday Night Lights</a> , Jason Katims, whose son is autistic, and the passion behind the project is evident. It is very sweet. Mandy loves her roommates, so much so that her re-application to medical school is forcing her to question her priorities. Should she pursue her dreams, or is she happier where she is? Will she follow her boyfriend to university, or will she find love in closer quarters? There's certainly a spark between her and Violet's harried brother Van.</p><p>But its warmth is part of a far more complex picture, and this is careful to strike a balance between its more saccharine instincts and what its three leads have to navigate on a daily basis. Harrison begins to make friends with a young boy living upstairs; the boy's mother sees this in an understandable, but inaccurate, light. Jack is anxious and blunt with his assessments of certain situations, telling his boss that he believes him to be of inferior intelligence when asked to redo his work. And Violet wants a boyfriend, as she tells Van, in great detail, but her literal-minded approach to finding love leads her into scrape after scrape. The only solace in one episode comes from a robotic vacuum cleaner.</p><p>It makes the point, again and again, that the world is not always built for people on the autism spectrum, and that sometimes life will be tough. People are often cruel, both deliberately and inadvertently. One of its most important scenes, I think, shows Van losing his patience with his sister, whom he loves very much, berating her for not being \"normal\". He immediately regrets it, of course, but it shows that this is not just pushing a simple idea of what it would take for that situation to change.</p><p>Netflix's comedy <a href=\"https://www.theguardian.com/tv-and-radio/2017/aug/14/atypical-netflix-autism-spectrum-depiction-cliches\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Atypical</a> recently came to an end after a charming run, <a href=\"https://www.theguardian.com/tv-and-radio/2020/jul/22/love-on-the-spectrum-review-a-dating-show-that-celebrates-autism\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Love on the Spectrum</a> was a lovely look at dating with autism, but it feels like the perfect time for a drama like this to come along. (It appears to be billed as a comedy on Amazon, but, based on the first three episodes, I'm not sure that sets a fair expectation.) Yes, it can be a little sweet at times, but it is so generous and genuine that it is hard to judge it for that. As fans of Friday Night Lights may well already know: clear eyes, full heart, can't lose.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 theguardian.com-NonSyndicated</p></div>"}