{"date": "2022-01-18 14:50:10.824000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BERGIO INTERNATIONAL INC (\"BRGO-0\")\n- Highlights 2021 Achievements\n\n Bergio International, Inc. (\"Bergio,\" or the \"Company\"), an American\nholding corporation and global leader in fine and fashion jewelry has\nachieved a stellar year in 2021. It achieved hyper-growth with new\nproducts, new promotions, new eCommerce platforms, and a tightened supply\nchain. This will be a perfect springboard to propel Bergio into a momentous\n2022.\n\n(figure class=\"image image_resized\" style=\"width:396px;\")(/figure)\nBerge Abajian, CEO, Bergio International stated, \"Aphrodite's was acquired\nin Feb 2021 and since then we have worked diligently on improving the\nbalance sheet, lowering our costs, integrating vertical supply-chain\nmanagement, and pivoting the marketing spend strategy. These stellar\ninitiatives positively impacted the bottom line in the fourth quarter.\nWithin 9 months, we were able to minimize all our losses and pushed through\nduring our last month where we showed a final turnaround of the company.\n\n \"We achieved our core goals of 2021 by expanding our core sales channels\nfrom Facebook into key eCommerce marketplaces including Amazon, Etsy, and\nWalmart, which, in return, lowered our ad spend to 41.5% in 2021 compared\nto 54% during the same period of the previous year. We were able to turn\nthe company vertically integrated in 2021 in a very short period which\npositively impacted the gross margins of both Aphrodite's and Gearbubble. I\ncan proudly say that in 9 months we achieved the unachievable and these 2\ncompanies became the B2C and B2B leaders in the space of custom\npersonalized jewelry design\", he added.\n\n Berge continued, \"2022 will be a huge stepping stone in owning the space\neven further. At this time, we are looking at other companies that will\nenhance our strategic acquisitions of 2021 to further improve the bottom\nline and to streamline logistics efficiencies. Gearbuble came in very\npositive at the end of 2021 but could have been better as the new jewelry\nline wasn't launched as fast as we expected but the brand is definitely\nready to explosively launch this key line in 2022. We expect a very bright\n2022 with transformed Bergio international which will be the company to be\nreckoned within the eCommerce fashion silver and gold jewelry space\".\n\n He emphasized, \"We are working diligently to launch our Bergio fine\njewelry website which includes fine and bridal jewelry this year to compete\nwith the major players in the space and to leverage Bergio from a\nbrick-and-mortar storefront to a fully digital company where the future\nis\".\n\n 2021 Achievements\n\n*  February 2021 acquired Aphrodite's\n*  July 2021 acquired Gearbubble\n*  June 2021 opened Etsy Store*  Almost 90% of all Etsy sales were from Q4,\nthe Golden Quarter.\n*  Sales increased tenfold from Q3 to Q4.\n\n*  August 2021 entered into Walmart marketplace*  Walmart increased sales\nby almost 8000% from Q2 to Q4.\n\n*  August 2021 launched Amazon store*  On Amazon, the first $100,000 in\nsales took 3.5 months\n*  2nd $100,000 in sales took 3.5 weeks\n*  3rd $100,000 only took 9 days\n*  4th $100,000 just took 1 week.\n*  It increased sales by almost 8-fold from Q3 to Q4.\n\n*  December 2021 finalized the negotiations of owning 50% of an existing\nfactory in Armenia\n\n About Bergio International, Inc.\n\n The Bergio brand, the primary portfolio asset, is associated with\nhigh-quality, handcrafted, and individually designed pieces with a European\nsensibility, Italian craftsmanship, and a bold flair for the unexpected.\nEstablished in 1995, Bergio's signature innovative design, coupled with\nextraordinary diamonds and precious stones, earned the company recognition\nas a highly sought-after purveyor of rare and exquisite treasures from\naround the globe. With family jewelry roots reaching back to the 1930s,\nfounder, CEO, and designer Berge Abajian is a third-generation jeweler,\nblending superior knowledge in design and manufacturing to create\nunparalleled collections in craftsmanship and style. The Bergio brand\nfeatures fine jewelry, silver fashion jewelry, bridal, couture, and leather\naccessories, ranging in price from $50 to $250,000. For further\ninformation, please visit www.bergio.com.\n\n This press release includes forward-looking statements regarding our\nbusiness strategy and plans as well as expectations of future growth, all\nof which are subject to the safe harbor provisions of the Private\nSecurities Litigation Reform Act of 1995. These forward-looking statements\nare not historical in nature and include those related to future financial\nand operating results, benefits, and synergies of the combined companies,\nstatements concerning the Company's outlook, pricing trends, and forces\nwithin the industry, the completion dates of capital projects, expected\nsales growth, cost reduction strategies, and their results, long-term goals\nof the Company and other statements of expectations, beliefs, future plans\nand strategies, anticipated events or trends, and similar expressions\nconcerning matters that are not historical facts. These forward-looking\nstatements are only predictions and may differ materially from actual\nresults due to a variety of factors, including changes in the general\neconomy; changes in demand for the Company's products or in the cost and\navailability of its raw materials; the actions of its competitors; the\nsuccess of our customers; technological change; changes in employee\nrelations; government regulations; litigation, including its inherent\nuncertainty; difficulties in plant operations and materials;\ntransportation, environmental matters; and other unforeseen circumstances.\nA number of these factors are discussed in the Company's previous filings\nwith the U.S. Securities and Exchange Commission, including those detailed\nunder the caption \"Risk Factors\" in our Annual Report for the year ended\nDecember 31, 2019 filed with the SEC. The Company disclaims any intention\nor obligation to update any forward-looking statements as a result of\ndevelopments occurring after the date of this press release. The safe\nharbor for forward-looking statements contained in the Securities\nLitigation Reform Act of 1995 (the \"Act\") protects companies from liability\nfor their forward-looking statements if they comply with the requirements\nof the Act.\n\nMedia Contact\nAlina Keo\nalina@aphrodites.com\n(952) 681-0406\n\nInvestor Relations\nJohn Guercio\njpguercio@aol.com\n(845) 216-3100\n\nTel   : 973-227-3230    BERGIO INTERNATIONAL INC\nWWW   : <a href=\"https://www.bergio.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.bergio.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201700218.MNPRE2201701861-06485220220118</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}