{"date": "2021-11-10 19:56:35.910000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3576.23, "close": 3472.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_7tg6hzrf&amp;referenceId=tag:reuters.com,2021:newsml_OVF30TI17_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_7tg6hzrf&amp;referenceId=tag:reuters.com,2021:newsml_OVF30TI17_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Amazon-backed EV maker Rivian Automotive made its stock market debut with a $93 billion valuation on Wednesday, as its shares jumped nearly 40% above their offer price in a sign of Wall Street's love affair with electric vehicles.  Conway G. Gittens has more.<br/>Short Link: <a href=\"https://refini.tv/3n160dw\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3n160dw</a><br/><br/>Video Transcript:<br/><br/>A blockbuster IPO marked the entry of a new contender in the growing electric vehicle market. Rivian, a start-up backed by Amazon, focusing on electric-powered vans and pick-up trucks, speed past investor expectations on Wednesday, following one of the biggest US stock market IPOs ever. The stock surged 37% right out of the gate, immediately giving it a market valuation of roughly $93 billion. That means the EV truck maker is already worth more on the stock market than legacy automakers such as Ford and General Motors. The stock is surging as investors bet Rivian will follow in Tesla's footsteps. Founded in 2009, Rivian has been investing heavily to ramp up production, doubling down on its upscale all-electric R1T pickup truck, which was launched in September. Rivian aims to build at least one million vehicles a year by the end of the decade, its chief executive revealed Tuesday. The electric truck maker enters the market at an opportune time. The EV market is witnessing a surge in global demand, with consumers growing more environmentally conscious and betting on eco-friendly vehicles. At the just wrapped-up UN Climate Summit in Glasgow, governments and industries unveiled a raft of pledges to cut greenhouse gas emissions from global transport. Ford was an early backer in Rivian and stands to make a big payday on that investment. E-commerce giant Amazon is also an early investor and a customer. It ordered 100,000 Rivian electric delivery vans as part of a plan to reduce its carbon footprint. Rivian's blockbuster IPO priced at $78 a share and surged to more than $100 by mid-day Wednesday trading, even though it is still a money-losing company.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}