{"date": "2021-11-17 16:41:13+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Stephen Eisenhammer</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">SAO PAULO, Nov 17 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Brazilian military police clashed with an indigenous group in the northern Amazon state of Roraima during an operation to remove a roadblock, the state government said on Wednesday, as tensions mounted on the reserve over illegal gold mining and land invasions.</p><p>The Raposa Serra do Sol reserve, site of the incident which occurred on Tuesday, has become a <a href=\"https://www.reuters.com/business/environment/brazil-an-indigenous-woman-joins-bolsonaro-fight-mining-2021-02-24\" data-type=\"url\" class=\"tr-link\" translate=\"no\">flashpoint for rival indigenous movements</a> in Brazil. President Jair Bolsonaro recently visited <span class=\"tr-strong\">one faction that shares his support for mining on tribal land.</span></p><p>The Indigenous Council of Roraima (CIR) said six people were injured in a confrontation it called an \"invasion.\" On Facebook, it shared photos of the aftermath including an image <span class=\"tr-strong\">of indigenous men with bleeding wounds to the head and chest.</span></p><p>CIR has said the barricades are designed to stop illegal gold miners from entering the territory. </p><p>In a statement released by the Roraima state government, police said they were following a judicial order to remove roadblocks from highways. </p><p>They said the organizers of the roadblock had initially dispersed when the police arrived, but later returned with a group of some 100 people, armed with bows, arrows and machetes.    </p><p>One police woman was hit by an arrow in the leg, the statement said, adding she was recovering well.</p><p>\"At no point were lethal weapons or ammunition used,\" the police said. </p><p>Tensions have been mounting between the two main indigenous groups on Raposa Serra do Sol, which <a href=\"https://www.reuters.com/business/environment/brazil-an-indigenous-woman-joins-bolsonaro-fight-mining-2021-02-24\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Reuters reported</a> earlier this year.</p><p>CIR have vowed to protect the land against illegal gold miners who are increasingly digging on the reserve. </p><p>A rival group, the Society for the Defence of the United Indians of Roraima (Sodiurr), supports gold mining and argues they have the right to exploit resources beneath the land. </p><p>Sodiurr went to the courts requesting roadblocks be removed. </p><p>In a statement, Sodiurr said it supported the police operation and that the barricade had been \"inspiring violence between indigenous people.\"</p><p>Bolsonaro has thrown his support behind Sodiurr, meeting several times with its leadership, visiting one of their communities on the reserve last month and endorsing their vision for mining on indigenous land.</p><p>The president has encouraged mining and commercial agriculture on indigenous reservations and has sent a bill to Congress in an attempt to legalize the activities. </p><p>\"If you want to plant, plant! If you want to mine, then mine!\" he said during the visit to Raposa Serra do Sol. </p><p>Indigenous rights activists say Bolsonaro is exacerbating tensions within tribes through divide-and-conquer methods that historically helped destroy native lands worldwide.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Stephen Eisenhammer<br/>Editing by Brad Haynes and David Gregorio)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:stephen.eisenhammer@thomsonreuters.com\" data-type=\"email\" translate=\"no\">stephen.eisenhammer@thomsonreuters.com</a> ; +55 11 5644 7726; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: BRAZIL-INDIGENOUS/VIOLENCE</p></div>"}