{"date": "2021-12-09 14:12:11.608000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>RESAAS SERVICES INC (\"RSS-V;RSASF-0\")\n- Wins 'Best Online Real Estate Platform 2021' Award from\n- Capital Finance International\n\n     RESAAS Services Inc. (\"RESAAS\" or the \"Company\"), a technology\nplatform for the real estate industry, has won this year's Best Online Real\nEstate Platform Award from Capital Finance International (\"CFI\").\n\n     The internationally recognized award highlights the unprecedented\nreferral business facilitated by RESAAS' global platform, cementing its\nposition as the real estate industry's leading solution for Agents and\nBrokers.\n\n     \"We are honored to have RESAAS showcased alongside industry titans, as\nleaders within our respective categories,\" said Tom Rossiter, CEO of\nRESAAS. \"RESAAS provides Real Estate Agents with the very latest in\nPropTech solutions. Maintaining focus on our unique ecosystem of real\nestate data, RESAAS delivers unrivaled business value to the global real\nestate industry.\"\n\n     The 2021 CFI awards nominees were put forward and voted for by\nindependent readers and subscribers of CFI along with employees from\norganizations such as World Bank Group and various UN and EU bodies.\nPrevious winners include Amazon (NASDAQ: AMZN), Deloitte, IBM (NYSE: IBM),\nMercedes-Benz (ETR: DAI), Santander (BME: SAN), and The London Stock\nExchange, among other leading organizations.\n\n     Each year, CFI seeks out individuals and organizations that contribute\nsignificantly to the convergence of economies and truly add value for all\nstakeholders. Reporting from frontlines of economic convergence, CFI\nrealizes that best practice is to be found throughout the world and the\nAwards Programme aims to identify and reward excellence wherever it is\nfound in the hope to inspire others to further improve their own\nperformance.\n\n     About RESAAS Services Inc.\n\n     RESAAS is a technology platform that enables real estate brokerages,\nfranchises and associations to bring real-time communication, new business\nopportunities and unique data to their agents on a global basis. Visit\nwww.resaas.com for more information.\n\n     The TSX Venture Exchange has neither approved nor disapproved the\ncontents of this news release. Neither the TSX Venture Exchange nor its\nRegulation Services Provider (as that term defined in the policies of the\nTSX Venture Exchange) accepts responsibility for the adequacy or accuracy\nof this release.\n\n     The statements made in this news release may contain forward-looking\nstatements that may involve a number of risks and uncertainties. Actual\nevents or results could differ materially from RESAAS Services Inc.'s\nexpectations and projections.\n\nContact Information:\n\nDon Mosher, +1 (604) 617-5448\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134200208.MNPRE2134201199-05564120211209</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}