{"date": "2022-02-08 19:40:16.701000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Network International has announced a collaboration with Amazon Payment Services to enhance digital payment solutions to UAE merchants.</p><p>The two companies plan to offer a variety of online payment solutions across a range of product verticals for businesses across the country.Furthermore, the partnership will offer Network merchants access to Amazon Payment Services' gateway and payment solutions, including its EPP and fraud monitoring solutions.It will also extend Network International's acquiring and settlement solutions to Amazon Payment Services merchants.Network International Acquiring Partnerships group head Pankaj Kundra said: \"As the largest acquirer in the UAE and the leading enabler of digital commerce in the Middle East and Africa (MEA), we remain committed to enhancing the UAE's payment ecosystem by enhancing the security and acceptance rates of digital payments.\"We are happy to partner with a reputable Amazon brand such as Amazon Payment Services in the UAE. We look forward to working together with Amazon Payment Services to expand the fast-growing online market and support merchants looking to transition to e-commerce.\"Amazon Payment Services managing director Peter George added: \"The partnership is in line with Amazon Payment Services' customer-oriented philosophy, as we are dedicated to offering convenient, seamless and secure digital payments to merchants and customers across as many platforms as possible, in as many markets as possible.\"Last month, Network International teamed up with payment giant Mastercard to introduce Tap on Phone technology across the Middle East and Africa.In November last year, the firm signed a memorandum of understanding with India's NPCI International Payments to facilitate Unified Payments Interface payments in the UAE.Last August, it joined forces with Dutch payments infrastructure company TerraPay to boost mobile wallet acceptance across the UAE.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}