{"date": "2022-02-15 22:52:16.719000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_4gvsahz8&amp;referenceId=1_4gvsahz8&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_4gvsahz8&amp;referenceId=1_4gvsahz8&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: Mednow Inc CEO Karim Nassar joined Steve Darling from Proactive to provide some insight into what the company calls a Digital Pharmacy.&amp;#xD;&amp;#xD;Nassar telling Proactive what a Digital Pharmacy is and why he feels it is so important. He also talks about how the company has positioned itself to be a leader in the market.<br/>Short Link: <a href=\"https://refini.tv/3rQiPK2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3rQiPK2</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Welcome back inside our Proactive news room, and joining me now is Karim Nassar, he is the CEO of Mednow. Karim, it's good to have you along. How are you? &gt;&gt; I'm doing very well Steve. Thanks for having me. &gt;&gt; Yeah, super interesting company that we want to learn a little bit more about. Specifically because it's almost as if you've created the next wave of what it is when we talked about pharmacies. And you really call that the digital pharmacy. Maybe you can explain to the audience a little bit about what the digital pharmacy is. &gt;&gt; Absolutely. So when you think about a digital pharmacy, you think about a pharmacy that no one really needs to visit. It's at the core that it's aligning with what is already been a very strong consumer trend, which is to go digital for all of their needs. If you think about what companies like Amazon, Uber, OpenTable, and all these companies ever disrupted , very traditional industries, large traditional industries using technology because it is a better way to serve as a consumer. A pharmacy is very much, and healthcare in general is very much ripe for that. In fact, we've already seen the trends and how well a digital health platform can service a market in the way digital health care has grown over the past few years. COVID only helped catalyze and really speed up the adoption of digital health. And we believe that today pharmacy, and a digital pharmacy is exactly what a consumer is looking for to get better care and to get better pharmacy. &gt;&gt; If I'm someone who would use a traditional pharmacy lets say, and drop my prescription off, whatever it is. How do you differ from that process? What would the process look like? &gt;&gt; Right there, right off the top you don't need to go to the pharmacy to drop off anything. We have an app, we have a marketing website that allows you to connect with directly our pharmacy. The key thing that our virtual channel permits, is extremely accessible pharmacy and extremely accessible pharmacist. If you think about the same scenario described, you have a prescription in hand, now instead of having to go to this pharmacy, use your app, upload the prescription there, and a pharmacy team right in that moment we'd start working away on it. And still from the comfortable your own home, that medication is going to get dispensed, filled in, delivered to your house the same day, or to your office wherever you might be. The convenience of now going into this totally virtual channel means that as a consumer you've gone a much better experience, you didn't have to go wait in line, you didn't have to be told here is a buzzer hold on to it until it buzzes and you come back and pick up your medication and go home. And it could be that you don't get in touch with the pharmacy or the pharmacy doesn't get in touch with you until the next time you need a prescription. Another thing our model will have is a virtual pharmacy today, that pharmacists once they've delivered your prescription, our staff deliver the prescription to you, that pharmacists now understands you are somebody who is taking that medication for that specific disease and they understand how to manage that on an ongoing basis. And it's a lot easier to do that through a message to our app, rather than again, waiting to find the time for you to connect over a phone call or come into the pharmacy you need to talk about this medication. In today's world we're also busy. It's very difficult to see how that model can just continue at that basis. &gt;&gt; There's always been talk of something like this making it more easier for people and there was always that thought that for a certain demographic but if you look at seniors let's say, they may not be wanting to do that because of the technology involved in that. But one thing the pandemic taught us is seniors are a lot more resilient than I think people give them credit for because they were able to do online appointments for doctors and all that. So that's sort of old way thinking is really not there anymore. Are you hearing that as well, that it's almost all demographics that can move to a model like this? &gt;&gt; Absolutely. I mean, the old adage necessity is the mother of all invention. They really came out of that, there was a need for a digital channel when it came to seeing your doctor, and as I said, the need really just got amplified with COVID and the social distancing requirements that came out of that. And just for their own well-being of the senior didn't want to take a chance and risk being on a walk and planning as an example, and pick up a bug at the process. So the same exact thing happened in pharmacy. Somebody who is a senior is most likely taking multiple meds. In fact it's a well-known fact that two-thirds of Canadians that are above the age of 65 are on at least three medications. They have a high need for a pharmacy and not just take medication but to be able to have that [inaudible 00:04:48] pharmacist that really understands how that medication works, how to deal with any side effects they might have, and how to be certain that this person is empowered to be adherent to their medication because that is a very basis of that therapy working. All of these reasons is why accessibility is really key. And what better way to do that to your exact point but to get it in front of them in a form that's digital they've already demonstrated they can do it. There's the burden of getting on an app if that is really that complex, we do have a national call center here Mednow it's a simple 1800 number and you get the same exact level of service that you would if you were using our app. So, if it truly was a concern around being able to use the tech, we've solved for that by having that national call center. So, really it is a necessity that's causing all this innovation and disruption. &gt;&gt; So obviously, the market is growing. I think you've seen that in the uptake in people that are using Mednow. We talked to investors and I'm sure they're looking at lots of different opportunities. So can you talk a little bit about an investor in this sort of space and where you see the growth potential there. &gt;&gt; Absolutely. So the accessibility factor that I've referred to is the same reason why somebody's going to more likely to want to use this on an ongoing basis. From an investor's point of view, that translates into a sticky customer and therefore recurring revenue. When we make the pharmacy the easiest pharmacy to use in Canada, the simplest one to use in Canada, we're also creating a possibility of to your point an optic and getting customers on our platform. But those customers stay for a long time. That leads to a higher lifetime value for them in a higher on average lifetime of a customer in general. Collectively, for an investor they see that it's an easier pharmacy to use. So therefore, from a switching cost point of view it's easier for somebody to go from a brick and mortar channel to that digital. And once you're in that digital channel, now they can really experience the service on an ongoing basis, the simplicity of a touch of an app on their phone. So that's the opportunity from a revenue point of view, from a growth point of view. And that's why we're really excited about that, disruption that Mednow can cause. &gt;&gt; Yeah, absolutely makes a lot of sense and it's only going to grow for sure. Karim thank you so much great to get it updated on this are very interesting and we look forward to continuing to follow the story. So thanks very much. &gt;&gt; Thank you Steve. &gt;&gt; All right, there's Karim Nassar he is the CEO of Mednow.<br/></span></div></div></div></div>"}