{"date": "2021-07-02 12:38:45.927000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3708.0, "close": 3894.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ENPNEWSWIRE-(C)2021 ENPUBLISHING</p><p>Release date- 01072021 - Enhanced project execution offering drives construction assurance, efficiency and sustainability.</p></div><div class=\"tr-npp-body\"><p>AVEVA, a global leader in industrial software, driving digital transformation and sustainability, announced today that it has signed a partnership agreement with RIB Software (RIB), a global leader in digital technologies for construction, to enhance AVEVA's Project Execution portfolio offering for process and plant industries. The integration will extend the AVEVA Unified Project Execution solution to include new capabilities from the RIB MTWO platform such as enhanced estimation and project cost controls, more powerful dashboards and KPI monitoring, and optimized construction management with full Connected Worker capabilities in the Cloud.</p><p>Together with RIB, AVEVA will connect project teams and allow them to collaborate more effectively by bringing together the engineering, procurement and construction functions to deliver a true design to delivery solution. AVEVA and RIB have committed to further integration and expansion of the new platform that will bring together AVEVA Enterprise Resource Management and AVEVA Contract Risk Management with RIB's iTWO and MTWO solutions that create a world leading end-to-end integrated, platform solution for multi-dimensional digital construction.</p><p>Benefits include advanced estimation and cost controls for more accurate bidding, enhanced project monitoring through 4D and 5D simulations, tighter project management, improved cash flow control, as well as a reduction of waste and optimized use of scarce resources for enhanced sustainability. The joint offering will help the industry further align to emerging best practices that rely on collaboration, such as advanced work packaging (AWP), integrated project delivery, strategic procurement and collaborative contracting.</p><p>Peter Herweck, CEO, AVEVA, said, 'Data-led project intelligence drives real-time transparency and elevates enterprise-wide business performance by connecting teams with data and boosting collaboration. We are excited about the potential of incorporating RIB Software's and AVEVA's portfolio capabilities into a leading-edge digital project execution solution.'</p><p>The enhanced AVEVA Unified Project Execution platform will help capital project customers to connect teams, visualize data and reduce project execution risk by using artificial intelligence (AI) and the Cloud to boost safety, efficiency, and sustainability.</p><p>Tom Wolf, Global Chairman and CEO, RIB Software, said, 'We are excited to be working with AVEVA and helping them to extend their leadership in capital project execution for the process plant industries.'</p><p>Amish Sabharwal, Executive Vice President, Engineering Business, AVEVA, added, 'AVEVA and RIB Software are building on our successes in our respective domains to come together and offer a joint solution that will digitally transform how capital projects are executed. The next stage of our platform approach will accelerate existing gains from digital transformation to drive sustainable results for our customers.'</p><p>About RIB Group</p><p>RIB Software SE is a pioneer in the digitalization of the construction industry. The company develops and offers cutting-edge digital technologies for construction enterprises and projects across various industries worldwide. iTWO 4.0, RIB's flagship cloud-based platform, provides the world's first enterprise cloud technology based on 6D BIM with AI integration for construction companies, industrial companies, developers and project owners, etc. RIB Software SE is a member of Schneider Electric and headquartered in Stuttgart, Germany and Hong Kong, China. With over 2,700 talents in more than 25 countries worldwide, RIB is targeting to transform the construction industry into the most sustainable and digitalized industry in the 21st century. For more details, visit: www.rib-software.com</p><p>About AVEVA</p><p>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence. AVEVA's comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at www.aveva.com.</p><p>Copyright 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</p><p>Enquiries:</p><p>AVEVA Media Contacts</p><p>Rose Bambi</p><p>Senior Director Global PR and External Communications</p><p>Tel: +44 (0) 208 323 2789</p><p>rose.bambi@aveva.com</p><p>Caroline Stephens</p><p>Senior Global PR Manager</p><p>caroline.stephens@aveva.com</p><p>Catherine Singh</p><p>Global PR/Social Media Coordinator</p><p>catherine.singh@aveva.com</p><p>External Communications Alias</p><p>external.communications@aveva.com</p><p>[Editorial queries for this story should be sent to newswire@enpublishing.co.uk]</p><p>((Comments on this story may be sent to info@enpublishing.co.uk))</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 M2 Communications Ltd.</p></div>"}