{"date": "2022-02-22 20:47:06.076000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>It's rare for Apple products to go on significant sale, so when they do, it's worth snapping up. Amazon has an amazing deal right now for a 14-inch 2021 edition Apple MacBook Pro down to the lowest price we've seen.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Right now, you can get the MacBook Pro for $1,799, a $200 drop from the $1,999 list price. Our tester loved the powerful GPU performance and the M1 Pro chip on the MacBook Pro, which she called \"the best we've ever seen out of an integrated graphics card.\" She also loves that it has tons of useful ports like HDMI (for connecting to a TV), SDXC memory card slot, Thunderbolt 4 and headphone jack, along with convenient MagSafe charging. With a rated up to 17-hour battery life (we got about 10.5 hours), it will last through your work or school day—and at just 3.5 pounds, it's super lightweight as well. We named this MacBook Pro model among the best laptops you can buy for the way it handle the most demanding tasks, like high-action and graphics-intensive video games. We'd recommend it best for someone who does occasional photo or video editing, or plays a lot of games.</p><p>► <span>Presidents Day 2022:</span>  Several sales are still live, shop the best discounts from Solo Stove, Thermoworks, and Cocoon by Sealy</p><p>► <span>National Margarita Day:</span>  Where to find deals on margaritas, Burger King and more </p><p>The model Amazon has on sale right now has an 8-core CPU for ultra-fast performance and 14-core GPU, Apple's M1 Pro chip, 16GB RAM and an ample 512GB SSD for storing all your personal files, downloading tons of software, apps and programs, and handling all of your day-to-day productivity needs. If you want to go even higher with a massive 1TB drive, you can get that one on sale, too, down from $2,499 to $2,229, saving you save $270. </p><p>If you're looking to upgrade an older-model computer, the 2021 Apple MacBook Pro is a solid laptop worth considering—and this deal is a steal. </p><p class=\"tr-npp-section-title\">Get the 14-Inch Apple MacBook Pro (2021 edition) with M1 Pro chip from Amazon for $1,799 (save $200).</p><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: The best MacBook Pro we've ever tested is $200 off right now</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}