{"date": "2022-01-20 01:16:12+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Nandita Bose</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Jan 19 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>White House officials met on Wednesday with small and mid-sized companies to discuss competition issues in the tech sector, as momentum grows in the U.S. Congress to rein in large technology companies.</p><p>The meeting was attended by Bruce Reed, president Joe Biden’s top tech advisor and deputy chief of staff; Brian Deese, director of the National Economic Council and executives of smaller tech firms such as Sonos and Yelp Inc, the White House said.</p><p>\"The meeting focused on the challenges entrepreneurs, brick-and-mortar retailers, and other businesses face competing in sectors dominated by a few large platforms,\" the White House said in a statement.</p><p>Concerns discussed at the meeting included fees charged by large technology companies, how large tech firms operate an online marketplace for third-party sellers and also sell their own products on such platforms, and how businesses are ranked on those platforms.</p><p>Last year President Joe Biden signed an executive order to promote more competition in the U.S. economy, urging agencies to crack down on anti-competitive practices in sectors from agriculture to drugs and labor. He has since taken several steps to promote competition in the U.S. meat industry.</p><p>The meeting to discuss competition issues in the tech sector occurred ahead of a vote in the U.S. Senate on Thursday where the Senate Judiciary Committee will mark up a bipartisan bill from Senators Amy Klobuchar, a Democrat, and Republican Chuck Grassley that would bar companies such as Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Alphabet’s Google <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> from favoring their products and services.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Nandita Bose in Mumbai; editing by Grant McCool)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:nandita.bose@thomsonreuters.com\" data-type=\"email\" translate=\"no\">nandita.bose@thomsonreuters.com</a> ; +12023545868; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://nandita.bose.reuters.com@reuters.net\">nandita.bose.reuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-BIDEN/TECH</p></div>"}