{"date": "2021-11-03 17:25:45.007000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_fnyswjil&amp;referenceId=1_fnyswjil&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_fnyswjil&amp;referenceId=1_fnyswjil&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: Kidoz Co-CEOs Eldad Ben Tora and Jason Williams joined Proactive to discuss the group's third quarter network growth metrics, including 345 million monetized impressions, a 35% increase from its second quarter. &amp;#xD;&amp;#xD;The Co-CEOs say growth is being driven by prior announcements including its entry into the teens and parents segment, as well as its partnerships with Chinese publishers.<br/>Short Link: <a href=\"https://refini.tv/2ZMAhUS\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/2ZMAhUS</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Hello and welcome back to Proactive, New York. Joining me this morning is CoCEOs Jason Williams and Eldad Ben Torah both from Kidoz. Good to see you both. How are you today? &gt;&gt; Doing well. &gt;&gt; Nice to see you as well. &gt;&gt; Nice to see you &gt;&gt; Jason, We're going to kick it off with you today. The group released a Q3 network growth and corporate update. What can you share with us in terms of growth that you've achieved here? &gt;&gt; Well, what we can share is that we continue on this great growth path that we've been seeing for the past few quarters for kidoz, one of our key metrics is the total number of monetized impressions that we see on the network. Those jumped up well above the 300 million. We're now recording about a 35 percent increase, quarter over quarter in those monetized impressions. What are the most exciting areas? If we look a little deeper, is on the monetization of rich media impressions, which is something that's growing really quickly and is a type of unit. It's an engaging unit that users on their mobile phones can touch and feel and really get a sense of products or a brand. We're seeing just fantastic growth there and it's something quite unique to mobile. We're super excited about that one continuing. &gt;&gt; Thanks, Jason. That's very interesting to hear. Eldad onto you. What is driving this growth and isn't related to prior announcements? &gt;&gt; Yeah, I think it is. Definitely worthwhile and staying tunes are announcements. Above the organic growth, I think there are two factors that are contributing to the growth; first one at least is what we announced a few months ago, is our entry to the teens and parents segment. We're already booking new campaigns for teens brands and parents. This is definitely already kicking in. The second subject that is contributing to the growth is what we announced probably earlier, which is our partnership with the Chinese platforms that are bringing publishers to Kidoz. This opened the new territory for us and publishers that had some issues monetizing their worldwide traffic are now using Kidoz and this also contributed to the phenomenal growth. &gt;&gt; You mentioned the Chinese platforms, how is that related to this upcoming webinar that you'll be hosting? &gt;&gt; It is related to the webinar that we're planning. Again, with our partners, we are translating all of our materials to make sure that they fully understand how to connect with us and then ads to their apps in a way that will do well for them and we'll open them to the global market. We are putting a lot of effort to educate them and to have them trusting us and spend and grow with us. This is what we're planning for the Ninth and hoping to grow this territory for us even more than now. &gt;&gt; For those who do want to watch on the Ninth, how can they? &gt;&gt; There's a link from our website so they can watch us. It will be in Chinese and English in parallel. I guess this is more interesting for the people who are speaking Chinese. &gt;&gt; I just wanted to add maybe Christine also like. Obviously, we're excited about these new areas and we've released the Q3 update and our Q3 numbers are appending, which we're super-excited about. But right now we're in the heart of Q4. Just from our side of the fence, what we can see is phenomenal. The amount of orders that we have coming in, the entire team is literally off their feet. We've had to bring in extra help. I actually used a reference to the way Amazon brings in Christmas employees to help get packages out the door. We've had to bring in extra help and extra hands in a number of areas just to get through the heavy load of orders that is coming through. It's super exciting for all of us and we're excited to be on this growth path. &gt;&gt; Gentlemen, thanks so much for joining me today. &gt;&gt; Thank you. &gt;&gt; Thank you so much.<br/></span></div></div></div></div>"}