{"date": "2022-02-01 19:21:46.018000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>EAT WELL INVESTMENT GROUP INC. (\"EWG-Z\")\n- Expanded Distribution of Amara Organic Foods to Heb Stores\n- in the United States\n\n     Two new flavours of Amara's organic plant-based baby food is now\navailable at H-E-B, one of the largest independently owned food retailers\nin the United States\n\n     Eat Well Investment Group Inc. (the 'Company' or 'Eat Well Group' or\n'EWG') is pleased to announce that it's majority-owned portfolio company,\nAmara Organic Foods ('Amara'), one of the fastest-growing baby food brands\nin America, is now available in approximately 200 HEB Grocery Company, LP\n('H-E-B') locations in the United States.\n\n     This press release features multimedia. View the full release here:\n<a href=\"https://www.businesswire.com/news/home/20220201005526/en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220201005526/en</a>/\n\n\n     Amara Organic Foods \n     H-E-B is one of the largest independently owned food retailers in the\nUnited States. The company has been operational for more than 100 years and\nserves families across Texas and Mexico in 155 communities with over 420\nstores. Additionally, H-E-B recently ranked second, behind only Amazon, in\ndunnhumby's Retailer Preference Index, which provides data on top retailer\nrankings according to consumers for the United States.1\n\n     Amara launched in H-E-B in June, 2021 and has since increased the\nCompany's product line to include two new 100% Veggie flavours; Peas Corn &amp;\nCarrots and Tropical Mango.\n\n     'We're thrilled to be expanding our retail shelf footprint with one of\nour key retailers, H-E-B. It's a true testament to Amara's strong growth in\nthe category and the changing customer. Customers are increasingly thinking\nabout the food they eat and Amara's truly the only baby food that can bring\nall the benefits of fresh with the convenience of shelf stable,' commented\nJessica Sturzenegger, Founder &amp; CEO of Amara.\n\n     Distribution to H-E-B in the United States adds to Amara's strong\nretail footprint with distribution to many of North America's leading\nbig-box retailers, including: Walmart Canada, Whole Foods, Sprouts Farmer's\nMarket, Loblaws and more. Amara is focused on developing a blend of natural\nand traditional-big box retailers in order to become a household brand for\nevery family. With strong demand in both natural and conventional channels,\nAmara continues to accelerate its omnichannel sales distribution strategy\nand strengthen its ecommerce platform.\n\n     To learn more, join Eat Well Group's mailing list for important\nupdates.\n\n     ABOUT EAT WELL GROUP\n\n     Eat Well Group is a publicly-traded investment Company primarily\nfocused on high-growth companies in the agribusiness, food tech,\nplant-based and ESG (environmental, social and governance) sectors. Eat\nWell Group's management team has an extensive record of sourcing, financing\nand building successful companies across a broad range of industries and\nmaintains a current investment mandate on the health/wellness industry. The\nteam has financed and invested in early-stage venture companies for greater\nthan 25 years, resulting in unparalleled access to deal flow and the\nability to construct a portfolio of opportunistic investments intended to\ngenerate superior risk-adjusted returns.\n\n     The Canadian Securities Exchange has neither approved nor disapproved\nthe information contained herein and does not accept responsibility for the\nadequacy or accuracy of this news release.\n\n1https://www.businesswire.com/news/home/20220111005421/en/Amazon-H-E-B-and-\nMarket-Basket-are-the-Top-U.S.-Grocery-Retailers-dunnhumby-Retailer-Prefere\nnce-Index-Finds\n\n     Contacts:\n\n     Eat Well Investment Group Inc.\n\n     Marc Aneed, CEO\n\n     ir@eatwellgroup.com\n\n     www.eatwellgroup.com\n\n     Source: Eat Well Investment Group Inc.\n\n\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203100473.MNPRE2203102567-08320020220201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}