{"date": "2021-11-30 16:38:20+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n                  <div>\n          Michael Segal\n        </div>\n                  <div>\n          November 30th, 2021\n        </div>\n                  <p>\n                    <a href=\"https://www.netscout.com/rss.xml\" data-type=\"url\" class=\"tr-link\" translate=\"no\">RSS Feed</a>\n                  </p>\n                </div>\n                <p>\n        In most cases, it's not a matter of if you will migrate to the cloud, it's a question of when. According to an IDC Futurescape prediction: by 2024, 75% of enterprises will prioritize infrastructure agility and operational efficiency; leading to a five-fold increase in the adoption of cloud native architectures for core business applications. This poses new challenges as enterprises grapple with an increasingly complex infrastructure.\n      </p>\n                <p>\n        Migrating applications to the cloud creates new visibility borders across private cloud, hybrid cloud and multi-cloud environments, increasing the challenges of delivering high-quality services. Assuring the performance and security requirements of workloads pre- and post-migration means having Visibility Without Borders for end-thru-end insights necessary for migrating applications to the cloud with confidence.\n      </p>\n                <p>\n        NETSCOUT Visibility Without Borders delivers actionable intelligence to enterprises, which helps secure and optimize service performance while assuring a delightful user experience across a hybrid-cloud environment from a single pane of glass.\n      </p>\n                <p>\n        Beyond the technological capabilities to achieve end-thru-end visibility, Enterprise IT organizations want to rely on vendors who can demonstrate strong collaboration with AWS. As such, NETSCOUT has worked with AWS to provide first-of-its-kind network traffic visibility through interoperability with a variety of AWS services and technologies, such as VPC Traffic Mirroring, VPC Ingress Routing and Gateway Load Balancer (GWLB). The benefits to customers from this powerful alliance include faster technological innovation, reduced capital and operational expenses, and the ability to accelerate their application modernization and cloud migration journey, while retaining a pleasing customer and end-user experience.\n      </p>\n                <p>\n        Furthermore, NETSCOUT has achieved both Networking and AWS Migration and Modernization Competencies, which demonstrates unique skills in areas across industries, use cases, and workloads. To achieve these Competency designations, NETSCOUT was vetted, validated, and verified by AWS against a high bar of requirements. More specifically, to achieve the designation of <a href=\"https://aws.amazon.com/migration/partner-solutions/?blog-posts-cards.sort-by=item.additionalFields.modifiedDate&amp;blog-posts-cards.sort-order=desc&amp;partner-solutions-cards.sort-by=item.additionalFields.partnerNameLower&amp;partner-solutions-cards.sort-order=asc&amp;awsf.partner-solutions-filter-partner-type-finserv=*all&amp;awsf.partner-solutions-filter-partner-usecase-finserv=*all&amp;awsf.partner-solutions-filter-partner-location-finserv=*all&amp;partner-case-studies-cards.sort-by=item.additionalFields.sortDate&amp;partner-case-studies-cards.sort-order=desc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Migration and Modernization Competency,</a> AWS validated that NETSCOUT offers unique capabilities in helping enterprise customers migrate applications and legacy infrastructure to AWS. In order to attain <a href=\"https://aws.amazon.com/networking/partner-solutions/?partner-solutions-cards.sort-by=item.additionalFields.partnerNameLower&amp;partner-solutions-cards.sort-order=asc&amp;awsf.partner-solutions-filter-partner-type=*all&amp;awsf.Filter%20Name%3A%20partner-solutions-filter-partner-location=*all&amp;awsf.partner-solutions-filter-partner-location=*all&amp;partner-case-studies-cards.sort-by=item.additionalFields.sortDate&amp;partner-case-studies-cards.sort-order=desc&amp;blog-posts-cards.sort-by=item.additionalFields.createdDate&amp;blog-posts-cards.sort-order=desc&amp;partner-solutions-cards.q=netscout&amp;partner-solutions-cards.q_operator=AND\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Networking Competency</a> , NETSCOUT demonstrated that it offers a set of specialized application, service and network management solutions that auto-scale, are aligned with cloud design principles, and make it easier to use networking features in native or hybrid cloud environments.\n      </p>\n                <p>\n        For additional information please refer to the following press release, \" <a href=\"https://www.netscout.com/press-releases/netscout-announces-aws-competency\" data-type=\"url\" class=\"tr-link\" translate=\"no\">NETSCOUT Achieves AWS Migration &amp; Modernization Competency Status</a> .\"\n      </p>\n                <p>\n        Please <a href=\"https://www.netscout.com/contact-us\" data-type=\"url\" class=\"tr-link\" translate=\"no\">contact NETSCOUT</a> to discuss how we can help you secure services and assure their performance throughout your cloud migration journey.\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.netscout.com/blog/netscout-achieves-aws-migration-and-modernization-competency\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>NetScout Systems Inc.</strong> published this content on <strong>30 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>30 November 2021 16:38:20 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - NetScout Systems Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NetScout-Systems-Inc.</p></div>"}