{"date": "2021-11-12 00:10:17.965000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3482.05, "close": 3525.15}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>I USUALLY shop at the Whole Foods supermarket in my Chevy Chase, Maryland, neighbourhood. It is part of a company that caters to consumers who reside in urban areas, whose earnings are above the national average, who are conscious of the environment, and who like to be treated like high-value customers.</p><p>Which explains why the supermarket is known for its products that are free of fats, artificial colourings, flavours and preservatives, for its organic selections and great customer service.</p></div><div class=\"tr-npp-body\"><p>Indeed, it would have typically taken me between 5 and 10 minutes to wait in the check-out line at Whole Foods, and even less than that in the express line for those purchasing fewer than 10 items.</p><p>But last week I noticed that the express line had disappeared, and that some of the cash registers were closed, and I ended up spending close to 40 minutes waiting in the aisle to pay for my purchases. That of course did not make me feel like, well, a high-value customer.</p><p>After talking with the manager at Whole Foods, I found out that the main reason for the absence of customer service was that the supermarket was facing a shortage of labour. She pointed to a placard advertising vacancies in the store, and added that she was hoping to hire more workers by raising salaries and increasing the benefits.</p><p>Which made me think the following: Like many Americans, I have been complaining about the country's economic problems during and in the aftermath of the pandemic, not least the rising rate of inflation, including the prices of petrol to fill the tank of my car, and of the food I buy at Whole Foods. And I have been blaming all of that on the Biden administration and Congress that have yet to reach a deal on their spending bills, and on the Fed that seems to be spooked by the changing monetary conditions.</p><p>But then it was like \"let's look at the bright side of life\", for example, considering the Whole Foods workers who have quit their jobs and who are now expecting to be hired by a retail store that would pay them more money and provide them with better working conditions.</p><p><span>IMPROVED PROSPECTS</span> </p><p>In fact, according to reports, the retail store Macy's is now offering up to US$500 for each friend or family member that employees recruit to join the company, while other retailers have begun offering free college tuition to their workers.</p><p>Like them, there are perhaps millions of Americans whose income and job prospects have improved in a tight labour market that provides workers with the opportunity to demand the largest pay raises in decades.</p><p>It is true that prices are rising and inflation is up, which translates into higher prices for consumer goods, but at the same time also higher wages. That means that if your wages have increased by more than 10 per cent, your spending power is now higher despite the increase in inflation.</p><p>In a way, after decades during which American workers found themselves on the losing side of the economy, as many manufacturing jobs were shipped abroad and the labour unions were losing their membership and power, the ongoing changes in the economy come as good news for many employees.</p><p>Hence, the American economy added 531,000 jobs in October, with the unemployment rate falling to 4.6 per cent from 4.8 a month earlier and down significantly from January when it was at 6.3 per cent, and with nearly 200,000 women joining the labour force.</p><p>Together with the news that major US stock indices have climbed to new levels and the number of new coronavirus cases are continuing to fall, the new surge in hiring suggests that the economy is finally rebounding.</p><p>All of that explains why the wages are rising. That should produce a sense of optimism in American households which have also benefited from the huge fiscal programmes that the federal government adopted during the pandemic, including stimulus payments of US$2,000 per person as well as an additional childcare credit.</p><p>But the most interesting economic development has been the rising wages and hours for workers, amid a labour shortage with businesses competing for new workers.</p><p>The average hourly wage for private-sector workers rose 0.4 per cent in October from a month ago, and 4.9 per cent from a year ago. That is quite impressive if you consider that in the last 15 years before the pandemic, wages had grown by an average 2.5 per cent. Actually if you consider that the inflation rate remained around 2 per cent in those years, the average wage of most workers remained frozen all that time.</p><p><span>BUT SOME ARE NERVOUS</span> </p><p>And more good news: The surge in hiring means that the American economy could soon reach the Federal Reserve's goal of maximum employment. That would allow the Fed to raise interest rates, perhaps after the central bank finally shuts down its asset-purchase programme, if the inflation rate continues to remain high.</p><p>It is not clear if and when the job market would stabilise. While the American economy has now a near record number of job openings, businesses are still finding it difficult to fill them with qualified applicants, which means that millions of workers could end up remaining on the sidelines.</p><p>Yet, the rebounding of the economy could certainly come as good news for President Joe Biden who has seen his public approval rating falling in recent weeks.</p><p>And now that Biden's infrastructure plan is about to become law and the chances of at least parts of his \"Build Back Better\" spending programmes being approved are rising, the prospects for an energised economy would be growing.</p><p>Indeed, the notion of about US$3 trillion in spending over the next decade could mean that in addition to significant investment in roads, bridges, ports and pipes, there would be a sweeping overhaul of the economy. That, in turn, would also require raising taxes and nationalising some sectors of the economy.</p><p>All of that makes Republicans and some moderate Democrats, as well as many Americans, very nervous, since the proposed programmes would increase the national debt in the long run, and have an upward pressure on inflation in the short run, which demonstrates once again that when it comes to economic policy, there are always trade-offs to be considered.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SPH</p></div>"}