{"date": "2022-01-20 13:41:57.196000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SIMPLY BETTER BRANDS CORP (\"SBBC-V;PKANF-0\")\n- Accelerates its U.S.-Based distribution of TRUBAR(TM) with an\n- Expanded footprint at Costco\n\n     Simply Better Brands Corp. (the \"Company\" or Simply Better Brands\") is\npleased to announce their continued regional expansion at Costco. After a\nsuccessful rotation in the Southeast region late last year, TRUBAR will now\nbe back in distribution in the Southeast region of the U.S., including the\nplanned states of FL, GA, NC, TN, AL, SC, MS and Puerto Rico), as well as\nselect buildings in the Northwest region in WA, OR, AK, and ID.\n\n     Their plant-based protein bar, TRUBAR, introduces a first-of-its-kind\nfood category, where delicious, dessert-inspired flavor meets clean and\nsimple ingredients. Depending on the building, Costco will be carrying a\ndual pack of \"Oh Oh Cookie Dough\" and \"Daydreaming About Donuts\" flavors or\na dual pack of \"Oh Oh Cookie Dough\" and \"Smother Fudger Peanut Butter\".\n\n     A photo accompanying this announcement is available at\n<a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/5a83aecd-f81f-4b26-ae0d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globenewswire.com/NewsRoom/AttachmentNg/5a83aecd-f81f-4b26-ae0d</a>\n-d7526fe00dc9\n\n     \"The expanded buildings in Costco complement our broad distribution at\nother U.S.-based strategic retailers like Amazon, Whole Foods, Fresh Thyme\nand Walgreens,\" said CEO at Simply Better Brands, Kathy Casey. \"As Costco\nis a shopper destination for snack bars, we are thrilled to see our offer\noutperforming the category.\"\n\n     Obsessed with blurring the lines between healthy and delicious,\nTRUBARs have tapped into an entirely new space, which they're coining as\nIndulgent Nutrition(TM). \"For so long consumers endured the reality that\nmost snacks either taste good, yet use unrecognizable ingredients, or they\nuse clean ingredients--and taste like cardboard,\" said Co-Founder and CEO\nat TRUBRANDS, Erica Groussman. \"One of my big goals when bringing TRUBARs\ninto emerging markets is to simplify the shopping experience, making it\neasier for those who aim to eat better but aren't willing to sacrifice\ntaste in the rapidly growing plant-based, natural, and active lifestyle\nspace.\"\n\n     Building upon the success of the initial TRUBAR offering, TRUBRANDS\nplans to extend its flavor options and enter other consumer-centric\nsubcategories.\n\n     About Simply Better Brands Corp.\n\n     Simply Better Brands Corp. leads an international omni-channel\nplatform with diversified assets in the emerging plant-based and holistic\nwellness consumer product categories. The Company's mission is focused on\nleading innovation for the informed Millennial and Generation Z generations\nin the rapidly growing plant-based, natural, and clean ingredient space.\nThe Company continues to focus on expansion into high-growth consumer\nproduct categories including CBD products, plant-based food and beverage,\nand the global pet care and skin care industries. For more information on\nSimply Better Brands Corp., please visit:\n<a href=\"https://www.simplybetterbrands.com/investor-relations\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.simplybetterbrands.com/investor-relations</a>.\n\n     Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n\nContact:\nSimply Better Brands Corp.\nBrian Meadows\nChief Financial Officer\n+1 (855) 553-7441\nir@simplybetterbrands.com\n\n     Forward-Looking Information\n\n     Certain statements contained in this news release constitute\n\"forward-looking information\" and \"forward looking statements\" as such\nterms are used in applicable Canadian securities laws. Forward-looking\nstatements and information are based on plans, expectations and estimates\nof management at the date the information is provided and are subject to\ncertain factors and assumptions, including, among others, that the\nCompany's financial condition and development plans do not change as a\nresult of unforeseen events, the impact of the COVID-19 pandemic, the\nregulatory climate in which the Company operates, and the Company's ability\nto execute on its business plans. Specifically, this news release contains\nforward-looking statements relating to, but not limited to: TRUBAR\nexpansion into additional Costco stores; and TRUBRANDS plan to extend its\nproduct offerings.\n\n     Forward-looking statements and information are subject to a variety of\nrisks and uncertainties and other factors that could cause plans, estimates\nand actual results to vary materially from those projected in such\nforward-looking statements and information. Factors that could cause the\nforward-looking statements and information in this news release to change\nor to be inaccurate include, but are not limited to, changing consumer\npreferences, the impacts of COVID-19, that the Company's financial\ncondition and development plans change, ability to obtain necessary\nregulatory approvals and product viability and risk, as well as the other\nrisks and uncertainties applicable to the Company and the industries in\nwhich it operates, and as set forth in the Company's annual information\nform available under the Company's profile at www.sedar.com.\n\n     There is no representation by the Company that actual results achieved\nwill be the same in whole or in part as those referenced in the\nforward-looking statements and the Company does not undertake any\nobligation to update publicly or to revise any of the included\nforward-looking statements, whether as a result of new information, future\nevents or otherwise, except as may be required by applicable securities\nlaw.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201900143.MNPRE2201900863-05125420220120</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}