{"date": "2022-02-15 15:14:06+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Refiles to fix title of FedEx executive in paragraph 25</p><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Major automakers racing to mass produce electric vans</li><li class=\"tr-summaryitem\">Smaller commercial EV startups risk being squeezed out</li></ul><p class=\"tr-by\">By Nick Carey and Ben Klayman</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">FARNHAM, England, Feb 15 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>As traditional automakers prepare to churn out electric vans and trucks, startups are focused more than ever on finding a competitive or technological edge to stay on the road once their bigger rivals start moving through the gears.</p><p>Spurred on by looming bans on combustion engines in China and Europe, major automakers are striving to bring their commercial electric vehicles (EV) to market fast and ensure they don't get caught out again by another Tesla <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a>.</p><p>To survive in a world where the likes of General Motors <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GM.N\" data-type=\"ric\" data-ric=\"GM.N\" translate=\"no\" dir=\"ltr\">GM.N</a>, Ford <a href=\"reuters://REALTIME/Verb=FullQuote/ric=F.N\" data-type=\"ric\" data-ric=\"F.N\" translate=\"no\" dir=\"ltr\">F.N</a>, Renault <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RENA.PA\" data-type=\"ric\" data-ric=\"RENA.PA\" translate=\"no\" dir=\"ltr\">RENA.PA</a> or Stellantis <a href=\"reuters://REALTIME/Verb=FullQuote/ric=STLA.MI\" data-type=\"ric\" data-ric=\"STLA.MI\" translate=\"no\" dir=\"ltr\">STLA.MI</a> can make hundreds of thousands of vans a year, superior software or technology could make all the difference for newer entrants.</p><p>\"The startups all bring something to the party,\" says Jean-Michel Renaudie, senior vice president for industrial and commercial transportation at auto supplier TE Connectivity <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TEL.N\" data-type=\"ric\" data-ric=\"TEL.N\" translate=\"no\" dir=\"ltr\">TEL.N</a>. \"The question is, what's your unique selling point?\" </p><p>For British EV startup Bedeo, the answer changed last year due to an unexpected turn of events.</p><p>When property developer China Evergrande Group <a href=\"reuters://REALTIME/Verb=FullQuote/ric=3333.HK\" data-type=\"ric\" data-ric=\"3333.HK\" translate=\"no\" dir=\"ltr\">3333.HK</a> ran into debt trouble, its National Electric Vehicle Sweden (NEVS) subsidiary put in-wheel electric motor startup Protean Electric on the block - and Bedeo bought it.</p><p>Up until then, Bedeo had been turning vans such as Peugeot's Boxer and Opel's Movano into EVs for Stellantis by adding electric motors, batteries and operating system at a factory in Turkey. It was also selling its own electric vans to customers such as FedEx's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FDX.N\" data-type=\"ric\" data-ric=\"FDX.N\" translate=\"no\" dir=\"ltr\">FDX.N</a> TNT and Deutsche Post's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DPWGn.DE\" data-type=\"ric\" data-ric=\"DPWGn.DE\" translate=\"no\" dir=\"ltr\">DPWGn.DE</a> DHL. </p><p>Now, Bedeo and Protean plan to develop new EV platforms for commercial vehicles and passenger cars using in-wheel motors, Bedeo Chief Executive Osman Boyner told Reuters. </p><p>In-wheel motors - stand-alone electric motors that can be housed in all or some the wheels of an EV - don't need axles and powertrains so they free up more space inside vans and trucks, as well as extend battery range by reducing vehicle weights. </p><p>At Protean's headquarters in Farnham outside London, Chief Executive Andrew Whitehead shows off a production-ready sports car developed under NEVS with in-wheel motors that has a range of 1,000 km (620 miles), far greater than EVs available now. </p><p>\"Every vehicle some day will have in-wheel motors because it's a no-brainer,\" Boyner said. \"We already have this technology on the road and now we just have to market it.\"</p><p><br/></p><p>'GORILLA IN THE MARKETPLACE'</p><p>The stakes are high. About 9 million delivery vans are sold worldwide each year and with global distribution and retail companies under increasing pressure to go green, bumper commercial EV orders are set to come thick and fast.</p><p>Boyner said Bedeo was talking to major vehicle manufacturers about building commercial EV platforms for them under contract, but also to its own investors about whether to go it alone, with a decision expected by the end of June. </p><p>\"Should we invest half a billion and compete with the manufacturers, or should we just provide components?\" he said. \"These manufacturers are so big, they're like governments.\"</p><p>Major automakers such as GM and Ford <a href=\"reuters://REALTIME/Verb=FullQuote/ric=F.N\" data-type=\"ric\" data-ric=\"F.N\" translate=\"no\" dir=\"ltr\">F.N</a> are a massive challenge for startups because they can leverage their large factories, global sales, service and distribution networks, and long-standing customer relationships. </p><p>\"Knowing how to do supply chain at scale is a huge, huge advantage,\" said Travis Katz, chief executive of BrightDrop, GM's commercial EV business, which has announced major orders from FedEx and Walmart <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> for its mass-produced EV600 van.</p><p>Ford is a leading brand in the United States and European van markets and Sam Fiorani, vice president of global vehicle forecasting at AutoForecast Solutions, said its Transit van is \"the gorilla in the marketplace\".</p><p>\"They're ready to cater to any commercial buyer,\" Fiorani said. \"That's a lot to overcome.\"        </p><p>U.S. startup Rivian Automotive <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RIVN.O\" data-type=\"ric\" data-ric=\"RIVN.O\" translate=\"no\" dir=\"ltr\">RIVN.O</a>, which makes electric pickups<span class=\"tr-strong\">,</span> SUVs and commercial vans, has been touted as the next Tesla and its valuation leapt 53% to surge past $100 billion the day it listed shares in November.</p><p>Rivian has landed a 100,000 van order from Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> but its shares took a hit after the online retailer said last month it was teaming up with Stellantis in a host of areas, from software to cloud computing - to electric vans.</p><p>Ross Rachey, Amazon's director of global fleet and products, said the company partners with established players such as Stellantis and Rivian because there \"isn't a one-size-fits-all approach, there's room for many players\".</p><p><div class=\"tr-resource-ref\" id=\"adcb7896-77d2-48d6-be16-f287dcef8ad8\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/AUTOS-ELECTRIC/TRUCKS-STARTUPS/egpbklbyrvq/chart.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9BVVRPUy1FTEVDVFJJQy9UUlVDS1MtU1RBUlRVUFMvZWdwYmtsYnlydnEvY2hhcnQucG5n&amp;storyId=urn:newsml:reuters.com:20220215:nL1N2U40IG:1&amp;key=f3ee58c737e4998bf5b4959ae527015a0bb789d9385c09f3b22a58468fc637b514a65bf21966d4746e27549cf93adea2607ed1ebc2d7040e1624f631d14d559d\"/></div></div></div></p><p>KNOW-HOW AND NETWORK</p><p>Some investors, however, say startups are a riskier bet because they might fail.</p><p>\"What happens if five years from now these startups just disappear?\" said Scott Schermerhorn, managing director at Mariner Wealth Advisors, which owns GM shares.</p><p>FedEx was burned last year when EV startup Chanje, which had promised it 1,000 vans, subsequently went out of business. </p><p>The package delivery company has ordered thousands of electric vans from GM's BrightDrop because it had the \"know-how, the scale, the easy access to capital\" and network to support big fleets, Richard Smith, FedEx <span class=\"tr-strong\">Express</span>' head of the Americas, said.</p><p>But he said FedEx remained open to startups with \"innovation and new technologies\". </p><p>Ed Sun, managing director and portfolio manager at investor Engine No. 1 in San Francisco, said startups may lack size, but can survive because they often have better software, range, vehicle technology, or a niche.</p><p>\"The new players are clearly going to take share,\" said Sun, whose firm owns GM and Ford shares.</p><p>For British electric van startup Arrival <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ARVL.O\" data-type=\"ric\" data-ric=\"ARVL.O\" translate=\"no\" dir=\"ltr\">ARVL.O</a>, low-cost innovation is the way forward. </p><p>It plans to develop \"microfactories\" and use a low-cost, lightweight plastic composite for van bodies. Backed by its own fleet management software, its executives say it's a better van than a diesel equivalent for the same price.</p><p>Swedish startup Volta Trucks has a head start over traditional truck makers as its 16-tonne electric truck goes into production this year. It has a low, central seat and wrap-around windshield, putting drivers at eye level with pedestrians to improve road safety in busy cities.  </p><p><br/></p><p>'FUTURE PROOF'  </p><p>British electric truck maker Tevva, meanwhile, is going for the niche.</p><p>It buys \"gliders\" - the truck frame and cab - from an established automaker to benefit from their networks. Then it adds its own electric motors, battery packs, software and in some cases hydrogen fuel cells, effectively turning those models into clean fuel double acts with a greater potential range.</p><p>\"We don't need to invest hundreds of millions on parts someone else already does well,\" Chief Executive Asher Bennett told Reuters. </p><p>Tevva, which has been testing trucks with UPS <a href=\"reuters://REALTIME/Verb=FullQuote/ric=UPS.N\" data-type=\"ric\" data-ric=\"UPS.N\" translate=\"no\" dir=\"ltr\">UPS.N</a>, will launch production this year of two versions of a 7.5-tonne (7,500 kg) vehicle at its plant in Tilbury, England.</p><p>One will be an electric model with a range of 160 miles but the other will have a reserve hydrogen fuel cell, boosting its range to 310 miles. Tevva plans to roll out 12-tonne and 19-tonne models with hydrogen boosters.    </p><p>Tevva has short-listed sites a U.S. factory and one in mainland Europe, each able to produce some 3,000 trucks a year.</p><p>Many in the trucking industry believe hydrogen cells, which only emit water, are the future because they are lighter than batteries, though the fuelling infrastructure is in its infancy.</p><p>Bennett said the combination of hydrogen technology, low-cost manufacturing and cloud-based software to optimise vehicle range will \"future proof our company\".</p><p>U.S. delivery giant UPS, meanwhile, said working with startups such as Arrival has allowed it to shape the type of EVs that will join its global fleet of 130,000 vehicles. </p><p>UPS worked with Arrival on designing a chassis, powertrain and van bodies and has now ordered up to 10,000 vans.</p><p>\"We saw that as a solution we can scale up to support our global operations,\" said Luke Wake, UPS vice president of maintenance and engineering.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Nick Carey in Farnham and Tilbury, England, and Ben Klayman in Detroit; Editing by David Clarke)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:nick.carey@thomsonreuters.com\" data-type=\"email\" translate=\"no\">nick.carey@thomsonreuters.com</a> ; +44 7385 414 954; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AUTOS-ELECTRIC/TRUCKS-STARTUPS (CORRECTED, FOCUS, PIX)</p></div>"}