{"date": "2022-01-20 05:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Victoria Klesty</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">OSLO, Jan 20 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Norway's Telenor <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TEL.OL\" data-type=\"ric\" data-ric=\"TEL.OL\" translate=\"no\" dir=\"ltr\">TEL.OL</a> said on Thursday it had partnered with Amazon Web Services (AWS) to speed up the modernisation of its telecoms systems, boosting the use of cloud technology to offer 5G and low-latency data services to professional customers.</p><p>In collaboration with the U.S. tech giant, Telenor will develop product offerings for selected industries, including manufacturing, logistics and automotive, the Norwegian firm's chief executive told Reuters.</p><p>\"We are preparing ourselves for the next growth wave,\" Sigve Brekke said in a telephone interview, calling the transformation a \"major shift\" for Telenor.</p><p>A key selling point for customers ranging from manufacturing to hospitals is the low latency that 'edge' technology, enabled by cloud computing, brings to 5G services, Brekke said.</p><p>The Oslo-based group, which serves 172 million customers with roughly half its revenue generated in Asia and half in the Nordic region, last year announced a separate partnership with Alphabet Inc's Google Cloud. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2S33C7\" data-type=\"storyId\" data-story-id=\"nL8N2S33C7\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>\"In this phase, nobody is big enough on its own and nobody has it all,\" Brekke said, adding that Amazon was strong on network components, while the Google Cloud collaboration was more focused on products and analytics.</p><p>Telenor and AWS have together already provided clients with solutions such as a prototype private 5G network for the Norwegian defense forces' material agency, and private networks for corporate customers.</p><p>They also plan add-on services in the 4G area, Brekke said.</p><p>Telenor's Swedish virtual mobile network operator Vimla, which uses many AWS services, is an example of how to \"disrupt the current business model with new type of technology,\" Brekke said.</p><p>\"In the future we will focus more on the business customers than we are currently doing,\" Brekke said, adding that while the company's position in the business segment was strong in Norway, that is not the case for the Nordics or Asia.</p><p><br/></p><p class=\"tr-signoff\"> (Editing by Toby Chopra)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:victoria.klesty@thomsonreuters.com\" data-type=\"email\" translate=\"no\">victoria.klesty@thomsonreuters.com</a> ; +47 2331 6592; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://victoria.klesty.thomsonreuters.com@reuters.net\">victoria.klesty.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TELENOR-AMAZON/</p></div>"}