{"date": "2022-01-06 14:35:08.975000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>IPOWER INC (\"IPW-Q\")\n- Delivers First Order of Hydroponic Equipment for the European Market\n\n     iPower Inc. (\"iPower\" or the \"Company\"), one of the leading online\nhydroponic equipment suppliers and retailers, is announcing its expansion\ninto the European market with the completion of its first order delivery to\nAmazon (NASDAQ:AMZN)  for consumers in the UK and Germany.\n\n     In December 2021, iPower delivered several of its own branded products\nfor customer(s) in the UK and Germany, including trimming devices, air\nfilters, grow bags, tents and other accessories. This delivery marks\niPower's official entrance into the European hydroponic market, which is in\nthe early stages of development and presents a long-term growth opportunity\nfor iPower.\n\n     \"We continue to deepen our relationships with key partners as we enter\ntwo new hydroponic markets with very limited penetration,\" said iPower CEO\nLawrence Tan. \"The UK and Germany are two of the most populous countries in\nEurope and we believe each represents a significant early-mover opportunity\nto gain market share and drive awareness of our core iPower and Simply\nDeluxe brands, as well as our recently launched Nutrient line--Flourish. We\nlook forward to partnering with Amazon to serve this new set of hydroponic\nconsumers with high quality products at an affordable price.\"\n\n     The initial sale of hydroponic equipment for Europe was recognized\nduring the Company's fiscal second quarter ended December 31, 2021.\n\n     About iPower Inc.\n     iPower Inc. is one of the leading online retailers and suppliers of\nhydroponics equipment and accessories. iPower offers thousands of stock\nkeeping units from its in-house brands as well as hundreds of other brands\nthrough its website, www.zenhydro.com, and its online platform partners.\niPower has a diverse customer base that includes both commercial businesses\nand individuals. For more information, please visit iPower's website at\n<a href=\"https://ir.meetipower.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://ir.meetipower.com</a>/.\n\n     Forward-Looking Statements\n\n     All statements other than statements of historical fact in this\nannouncement are forward-looking statements. These forward-looking\nstatements involve known and unknown risks and uncertainties and are based\non current expectations and projections about future events and financial\ntrends that iPower believes may affect its financial condition, results of\noperations, business strategy and financial needs. Investors can identify\nthese forward-looking statements by words or phrases such as \"may,\" \"will,\"\n\"expect,\" \"anticipate,\" \"aim,\" \"estimate,\" \"intend,\" \"plan,\" \"believe,\"\n\"potential,\" \"continue,\" \"is/are likely to\" or other similar expressions.\niPower undertakes no obligation to update forward-looking statements to\nreflect subsequent occurring events or circumstances, or changes in its\nexpectations, except as may be required by law. Although iPower believes\nthat the expectations expressed in these forward-looking statements are\nreasonable, it cannot assure you that such expectations will turn out to be\ncorrect, and iPower cautions investors that actual results may differ\nmaterially from the anticipated results and encourages investors to review\nother factors that may affect its future results in iPower's registration\nstatement and in its other filings with the SEC.\n\n     US &amp; Canada Investor Relations\n\n Contact Information:\n\nContact:\nSean Mansouri, CFA\nElevate IR\n(949) 200-4603\nIPW@elevate-ir.com\n\n     Asia Investor Relations Contact:\nSherry Zheng\nWeitian Group LLC\n(718) 213-7386\nshunyu.zheng@weitian-ir.com\n\nTel   : 626-863-7344    IPOWER INC\nWWW   : <a href=\"http://www.meetipower.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.meetipower.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200400299.MNPRE2200401498-06380720220105</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}