{"date": "2021-12-23 10:50:55+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Anghami, the region’s leading music streaming platform, announces the availability of its brand-new Alexa skill, providing users in KSA and UAE with a seamless innovative experience in Arabic and English. </p>\n<p>As one of Amazon Alexa’s first skill partners in the Middle East, Anghami aims to deliver a seamless localized music experience in a Khaleeji Arabic dialect, embodying the rich Arab culture by optimizing the experience for its Arabic-speaking users. The Anghami Alexa skill is also available in English.</p>\n<p>Anghami’s Alexa skill offers users in the UAE and KSA an enhanced interactive experience that allows them to play music that fits their mood, stream their favourite podcasts and control millions of songs by just using their voice. Users can also listen to Quran recitals in the voice of their favorite Qari. Customers with Alexa-enabled devices will simply need to connect their Anghami accounts to access the wide range of content available on the platform by asking Alexa to play a playlist, artist, genre or podcast. Alexa understands Arabic Khaleeji dialects, Modern Standard Arabic (Fus’ha) or English.</p>\n<p>“In recognition of the importance of our Arabic language, this cooperation will further enhance the experience for our customers and help to spread our culture worldwide.”, commented <strong>Elie Habib, Co-founder and CTO of Anghami.</strong> “As part of our continued commitment to elevating the music industry and incorporating leading technology capabilities, we are thrilled to team up with Amazon to bring an innovative experience to our customers in KSA and UAE” he added.</p>\n<p>“We are very excited to team up with Anghami, the region’s leading digital music platform, giving customers access to millions of international and Arabic songs and podcasts. Only by using their voice, customers can ask Alexa to play their favourite songs from the region’s largest music catalog in Arabic” said <strong>Eric Saarnio, Vice President, Amazon Devices International</strong>.</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}