{"date": "2022-01-11 18:13:10.145000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CORUS ENTERTAINMENT INC (\"CJR.B-T;CJREF-0\")\n- Nelvana And Time Studios To Develop New Original Animated\n- Preschool Series Leela's Island\n\n     Corus Entertainment's Nelvana, a world-leading international producer,\ndistributor, and licensor of children's animated and live-action content,\nand TIME Studios Kids and Family, the recently announced kids and family\nprogramming division of the Emmy Award(r)-winning TIME Studios, have teamed\nup to develop the new original preschool series Leela's Island. Marking the\nfirst development partnership between the two internationally renowned\ncompanies, and the first preschool content deal for TIME Studios, the\nanimated comedy-adventure series features a curious five-year-old girl\nnamed Leela who discovers she has inherited a gift that allows her to\ntransform into any animal she wishes and see the world through its eyes, in\nthe process gaining a new point of view on her own kid problem.\n\n     \"Leela's Island is a show that will help kids learn to see the world\nfrom others' perspectives. As one of the first Afro-Latina girls featured\nin an animated preschool series, Leela's Island will go far in addressing\nthe lack of representation in children's content both in front and behind\nthe camera,\" said Maria Perez-Brown, Head of Kids and Family, TIME Studios.\n\"We're so excited to collaborate with Nelvana to bring this important\npreschool property to life.\"\n\n     Leela's Island is created and written by a team of esteemed diverse\nstorytellers, including award-winning writer Fracaswell Hyman (Gullah\nGullah Island, Taina, Little Bill, and The Famous Jett Jackson) and Maria\nPerez-Brown (Gullah Gullah Island and Taina), developed in partnership with\nwriter Janice Burgess (The Backyardigans).\n\n     \"We are incredibly passionate about Leela's Island and believe Leela\nwill become an icon for kids around the world,\" said Athena Georgaklis,\nHead of Development, Nelvana. \"The caliber of talent behind this project is\nunmatched, and is evident in the series' perfect blend of heartwarming,\nmagical moments and fierce, empowered storytelling. Working with the team\nat TIME has been a true highlight.\"\n\n     For broadcast and licensing opportunities, e-mail info@nelvana.com.\n\n     About Nelvana Entertaining kids for over 50 years, Nelvana is a\nworld-leading international producer and distributor of children's animated\nand live-action content. Nelvana produces a stable of award-winning and\nglobally renowned brands that focus on comedies, preschool and action\nseries, and ancillary consumer products programs. Nelvana's content airs on\nCorus Entertainment's kids channels in Canada and in over 180 countries\naround the world. The Nelvana library has over 4,800 episodes of\nprogramming and has received over 70 major international program awards\nincluding Emmys(r) and Canadian Screen Awards. Visit the Nelvana website at\nnelvana.com.\n\n     Follow Nelvana Enterprises on Twitter @NelvanaEnt\n\n     About Corus Entertainment Inc. Corus Entertainment Inc. (TSX: CJR.B)\nis a leading media and content company that develops and delivers high\nquality brands and content across platforms for audiences around the world.\nEngaging audiences since 1999, the company's portfolio of multimedia\nofferings encompass 33 specialty television services, 39 radio stations, 15\nconventional television stations, a suite of digital and streaming assets,\nanimation software, technology and media services. Corus is an\ninternationally-renowned content creator and distributor through Nelvana, a\nworld class animation studio expert in all formats and Corus Studios, a\nglobally recognized producer of hit scripted and unscripted content. The\ncompany also owns innovative full-service social digital agency so.da,\nlifestyle entertainment company Kin Canada, leading 2D animation software\nsupplier Toon Boom and children's book publishing house, Kids Can Press.\nCorus' roster of premium brands includes Global Television, W Network, HGTV\nCanada, Food Network Canada, HISTORY(r), Showcase, Adult Swim, National\nGeographic, Disney Channel Canada, YTV, Global News, Globalnews.ca, Q107,\nCountry 105, and CFOX, along with broadly distributed Canadian streaming\nplatforms STACKTV, Nick+, the Global TV App and Curiouscast. For more\ninformation visit www.corusent.com.\n\n     About TIME Studios From one of the most globally iconic brands, TIME\nStudios is an Emmy Award(r)-winning television, film and immersive studio\nfocusing on the development, production and distribution of truth-based\npremium unscripted and scripted storytelling that moves the world. With\ntechnical innovation and a brand defining visual language that dates back\n98 years, TIME Studios aims to impact communities and the world at large\nwith ideas that forge true progress. Combining the industry's leading\ncreators with TIME, one of the most trusted brands that reaches an audience\nof over 100 million people globally, TIME Studios is uniquely positioned to\nbring massive audiences to the world's most impactful stories. Recent\nprojects include, Black Gold (Paramount+), Big Vape (Netflix), John Lewis:\nGood Trouble (CNN Films), Amazing Grace (Neon), Right to Offend (A&amp;E),\nRicky Powell: The Individualist (Showtime), Mass Effect: The Story of\nYouTube, Kid of the Year (Nickelodeon/CBS), TIME100 (ABC) and the first\nscripted project for TIME Studios, Women of the Year (Amazon).\n\n Contact Information:\n\nFor media inquiries, please contact: Kelsey MacLeod, Associate Publicist,\nCorus Entertainment, kelsey.macleod@corusent.com; Stacey Grimshaw, Senior\nPublicity Manager, Corus Entertainment, stacey.grimshaw@corusent.com;\nKiasia Truluck, Senior Manager, Communications, TIME,\nKiasia.Truluck@time.com\n\nTel   : 416-479-6100    CORUS ENTERTAINMENT INC\nFax   : 416-479-7013\nEmail : john.gossling@corusent.com\nWWW   : <a href=\"http://www.corusent.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.corusent.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201000497.MNPRE2201002691-10115720220111</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}