{"date": "2021-11-30 05:45:16.878000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_9sn9n4an&amp;referenceId=tag:reuters.com,2021:newsml_OVF5SOOZX_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_9sn9n4an&amp;referenceId=tag:reuters.com,2021:newsml_OVF5SOOZX_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: A regional director for the U.S. National Labor Relations Board on Monday called for a rerun of a union election at an Amazon.com Inc facility in Alabama, setting the stage for another high-profile organizing battle at the world's largest online retailer. Bryan Wood reports.<br/>Short Link: <a href=\"https://refini.tv/3llfXkJ\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3llfXkJ</a><br/><br/>Video Transcript:<br/><br/>A regional director for the US National Labor Relations Board on Monday called for a re-run of a union election at an Amazon facility in Alabama, setting the stage for another high-profile organizing battle at the world's largest online retailer. Workers at the warehouse in Alabama rejected forming a union by a more than two to one margin in April after an organizing drive that garnered support from US lawmakers and President Joe Biden. In August, an NLRB hearing officer said the company's conduct around the previous vote had interfered with the election. In a statement, Stuart Appelbaum, President of the Retail, Wholesale and Department Store Union, said â\u0080\u009cTodayâ\u0080\u0099s decision confirms what we were saying all along â\u0080\u0093 that Amazonâ\u0080\u0099s intimidation and interference prevented workers from having a fair say in whether they wanted a union in their workplace.\" In Monday's decision, the NLRB regional director said that Amazon engaged in objectionable conduct that warrants setting aside the election. The decision pointed to moves by the company encouraging staff to vote via a mailbox it had the Postal Service install at its warehouse, surrounding the mailbox with its campaign slogan and locating it where workers may have thought Amazon was monitoring them. The decision for a redo adds pressure on Amazon, which has recently faced union campaigns in New York and Canada. Worker groups view organizing the company as a landmark goal that would invigorate the US labor movement. An Amazon spokesperson said that the company's employees overwhelmingly voted against joining the union this year, adding that it is disappointingâ\u0080\u009d that the NLRB has now decided those votes shouldnâ\u0080\u0099t count.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}