{"date": "2022-01-21 06:31:19+00:00", "ticker": "AVV", "mrkt_info": {"open": 2974.0, "close": 2983.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dammam, Saudi Arabia:</strong> AVEVA, a global leader in industrial software, driving digital transformation and sustainability, has announced its participation at the 2022 iktva Forum &amp; Exhibition at the Dhahran Expo Center, Dammam, from January 24-26, 2022. Alongside its strategic partner Schneider Electric, AVEVA will showcase how advanced technological solutions in the fields of big data, cloud, and Artificial Intelligence (AI) can accelerate the digital transformation of Saudi Arabia’s industrial sector.</p>\n<p>The three-day event will see AVEVA and Schneider Electric engage and connect with stakeholders from Saudi Aramco and other business partners in the Kingdom. AVEVA’s participation will be led by Tobias Scheele, Senior Vice-President of Global Accounts.</p>\n<p>“AVEVA has partnered with Saudi Aramco to drive sustainability across the Kingdom and beyond using digital transformation solutions to achieve the goals of Saudi Vision 2030. Our participation at iktva underscores our commitment to driving decarbonization across Saudi Arabia’s industrial sector, while helping unlock new value, boost business competitiveness and create new job opportunities within the Kingdom and throughout the Middle East,” Tobias Scheele said.</p>\n<p>Attendees at the iktva Forum will have a first-hand opportunity to get acquainted with trademark AVEVA solutions. AVEVA Unified Operations Center  offers end-to-end operational visibility across facilities within a single window to maintain uptime, mitigate costs, and manage complexity. Digital Twin technology combines asset design and predictive analytics in order to create a fully integrated, real-time data visualization center that reveals functional insights, unlocks efficiencies, and identifies new pathways to optimize performance.</p>\n<p>AVEVA will be holding demos of its different products at stand G6 at the 2022 iktva Forum &amp; Exhibition. </p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}