{"date": "2021-11-13 02:46:15+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3472.5, "close": 3545.68}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds comments from labor organizer, Amazon</p><p class=\"tr-by\">By Julia Love and Jeffrey Dastin</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">SAN FRANCISCO, Nov 12 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A group of Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> workers in New York City's Staten Island have withdrawn a petition to hold a union election, marking a setback in a growing push by organized labor to bring the online retailer's staff into the fold.</p><p>The group, known as the Amazon Labor Union, which is not affiliated with a major U.S. union, filed its petition last month, joining union campaigns underway at Amazon facilities in Alabama and Canada.</p><p>In order to hold an election supervised by the U.S. National Labor Relations Board, unions must show that they have gathered signatures of support from at least 30% of workers who are eligible to vote.</p><p>Chris Smalls, president of the group and a former employee at the Staten Island warehouse, said Friday the group opted to withdraw its petition after the NLRB informed them they had not collected enough signatures.</p><p>\"We will resubmit as soon as we can,\" Smalls said in an interview, adding that he was signing more cards with workers \"as we speak.\"</p><p>Amazon handily beat back an effort by the Retail, Wholesale and Department Store Union (RWDSU) to organize its Bessemer, Alabama, warehouse earlier this year. But unions have continued to organize, with the RWDSU gearing up for <a href=\"https://www.reuters.com/business/retail-consumer/amazon-takes-another-swipe-union-alabama-rematch-looms-2021-11-04\" data-type=\"url\" class=\"tr-link\" translate=\"no\">a potential rematch</a> in Alabama.</p><p>Amazon spokeswoman Kelly Nantel said in a statement that the company is focused on \"listening directly to our employees and continuously improving on their behalf.\"</p><p>Amazon raised doubts last month about whether the Amazon Labor Union had gathered enough legitimate signatures to hold a union election.</p><p>Unions and companies often tangle over which employees should be eligible to vote in elections, with employers pushing for broader bargaining units to dilute support, labor experts say.</p><p>Smalls said he collected some 2,000 signatures to request an official vote through the NLRB, and has since submitted additional signatures.</p><p>Nantel told Reuters Amazon has more than 6,000 employees at the JFK8 fulfillment center and more than 9,600 across its Staten Island campus.</p><p>Unions typically try to gather signatures from 50% to 70% of workers to give themselves a cushion if some cards are challenged by employers, and to ensure they can withstand anti-union campaigns by companies before workers ultimately vote, labor experts say.</p><p>Amid a wave of labor activity at Amazon warehouses, the Staten Island campaign stands apart in that it is advancing outside the umbrella of a traditional labor union. Smalls rose to prominence last year when Amazon fired him, alleging he violated a paid pandemic-related quarantine when he showed up at his facility to protest work conditions. Smalls <a href=\"https://www.reuters.com/article/us-health-coronavirus-amazon-com-lawsuit-idCAKBN27S34E\" data-type=\"url\" class=\"tr-link\" translate=\"no\">later filed</a> a class-action suit against Amazon.</p><p>The news of Amazon Labor Union's withdrawal of its petition was previously reported by Bloomberg.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Julia Love and Jeffrey Dastin; Editing by Chris Reese, David Gregorio and Daniel Wallis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:peter.henderson@thomsonreuters.com\" data-type=\"email\" translate=\"no\">peter.henderson@thomsonreuters.com</a> ; 323 251 4827; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON-LABOR/ (UPDATE 2)</p></div>"}