{"date": "2021-12-01 19:57:19.699000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Gilead and AWS Collaborate on Development and Delivery of New Medicines for Patients</b>\n</p><p class=\"bwalignc\">\n<span>With AWS as its preferred cloud provider, Gilead uses AWS machine learning and analytics to better inform clinical trial design and advance data-driven decision making, while prioritizing patient privacy and security</span>\n</p><p class=\"bwalignc\">\n<span>Gilead also transforms its enterprise resource planning workloads on AWS to implement SAP S/4HANA across its global business</span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced that Gilead Sciences, Inc. (Nasdaq: GILD), a biopharmaceutical company advancing innovative medicines to prevent and treat life-threatening diseases, has selected AWS as its preferred cloud provider. Innovating on AWS and with the help of AWS experts and partners in healthcare and life sciences, Gilead provides its data scientists with the latest advances in machine learning and analytics. These capabilities fuel data-driven decision making across the organization—from biomarker discovery through manufacturing and clinical trial recruitment—and deliver insights that can help Gilead refine its drug pipeline. The company also relies on AWS to host all workloads for its enterprise resource planning (ERP) transformation project to implement SAP S/4HANA.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211129005047/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211129005047/en/</a></p><p>\n“With AWS as our preferred cloud provider, our researchers can use AWS’s portfolio of services to gain the insights, agility, and security needed to deliver new medicines at speed, and treat the individual according to their unique needs, not just the disease,” said Marc Berson, Senior Vice President and Chief Information Officer at Gilead. “AWS’s performance, infrastructure, and scale are the foundations on which we will complete our ERP transformation and become a more efficient, agile, secure, and data-driven business in the cloud.”\n</p><p>\nGilead is reimagining its bioinformatics compute infrastructure in the world’s leading cloud. The use of AWS’s compute, machine learning, and database capabilities will support the analysis and integration of diverse genomics, imaging, and experimental datasets to support breakthroughs in how Gilead diagnoses and treats diseases. For instance, by securely analyzing deidentified patient genomic data at scale on AWS to reveal patterns, Gilead can uncover insights on how people living with cancer respond to existing therapeutic options, potentially accelerating the discovery of new treatments.\n</p><p>\nAdditionally, in its IT organization Gilead uses AWS to host all workloads for its ERP transformation project to implement SAP S/4HANA. These systems support business-critical processes in areas such as supply chain, finance, operations, and commercial sales across all therapeutic areas and business units. Running these processes on AWS provides the foundation for Gilead’s implementation of SAP S/4HANA. It also helps the company shorten hardware refresh cycles, increase testing and deployment agility, and gain visibility to improve business planning.\n</p><p>\nThis is Gilead’s first implementation of production-scale ERP systems in the cloud, and AWS provides the company’s IT transformation team with scalable, secure, and high-performing infrastructure. Working alongside AWS, Gilead will integrate its SAP environments with a wide range of advanced AWS technologies in areas such as analytics and machine learning, uncovering business value and driving innovation. Moving forward, with AWS as the foundation of its new cloud-based SAP environment, the company will use a variety of Amazon Elastic Compute Cloud (Amazon EC2) instance types, including X1 and X1e instances built for high-performance databases, in-memory databases, and other memory-intensive enterprise applications, to run ERP workloads more efficiently.\n</p><p>\nIn addition, Gilead has moved more than 50% of its data center footprint to AWS over the past 12 months through an accelerated cloud migration program with AWS Professional Services. The company also plans to migrate hundreds of applications to AWS, which include critical applications that support industry good practices (GxP) guidelines and regulations in areas like drug manufacturing, storage, and distribution. As a result, Gilead is accelerating its plans to upgrade its IT operations with AWS, while avoiding upfront costs to refresh hardware and the sustained costs of running an “always on,” on-premises IT landscape provisioned for peak use. As an additional element of the migration, the company is building an automated disaster recovery landscape in AWS. Doing so allows Gilead IT to optimize and scale its disaster recovery processes in the cloud to enhance resiliency.\n</p><p>\nWith the help of AWS Professional Services and AWS experts in healthcare and life sciences, Gilead research and development teams are looking at ways to innovate in the cloud. They are taking an agile product development approach that uses microservices to optimize and automate operational processes throughout the company, and constructing new data architectures to uncover new insights more easily. Through the collaboration, Gilead aims to transform priority areas like clinical program and study design, patient experience, and centralized statistical adaptive monitoring, which helps Gilead quickly identify and address potential issues related to the management of clinical trials.\n</p><p>\nGilead was also one of the first users of <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fhealth%2F&amp;esheet=52539244&amp;newsitemid=20211129005047&amp;lan=en-US&amp;anchor=AWS+for+Health&amp;index=1&amp;md5=4465a81974e70c6dec4e07c99b99353c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS for Health</a>, an offering of curated AWS services and AWS Partner Network (APN) solutions now used by thousands of healthcare and life sciences customers globally. AWS for Health provides proven and easily accessible capabilities that help organizations increase the pace of innovation, unlock the potential of health data, and develop more personalized approaches to therapeutic development and care across 16 critical solution areas in healthcare, genomics, and biopharma.\n</p><p>\n“Gilead uses the proven performance of the world’s leading cloud to innovate, scale, and deliver powerful therapies for diseases like HIV and cancer, as well as advance standards for precision medicine. By streamlining their IT operations with AWS and taking advantage of our AWS for Health offerings, Gilead has the ability to continuously refine its approach to clinical trials, drug development, manufacturing, and distribution,” said Matt Garman, Senior Vice President of Sales and Marketing at Amazon Web Services, Inc. “AWS provides the security and privacy that healthcare and life sciences companies need, as well as the expertise and breadth and depth of services they can rely on to build transformative healthcare solutions that enhance health and wellbeing.”\n</p><p>\n<b>About Amazon Web Services\n<br/></b>For over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2F&amp;esheet=52539244&amp;newsitemid=20211129005047&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=2&amp;md5=b724f15109f0e05564a80a63dd26a030\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon\n<br/></b>Amazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2F&amp;esheet=52539244&amp;newsitemid=20211129005047&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=3&amp;md5=67086e5b5affe8425607e14c25ac674f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p>\n<b>About Gilead Sciences, Inc.\n<br/></b>Gilead Sciences, Inc. is a biopharmaceutical company that has pursued and achieved breakthroughs in medicine for more than three decades, with the goal of creating a healthier world for all people. The company is committed to advancing innovative medicines to prevent and treat life-threatening diseases, including HIV, viral hepatitis and cancer.\n</p><p>\nFor more than 30 years, Gilead has been a leading innovator in the field of HIV, driving advances in treatment, prevention and cure research. Gilead researchers have developed eleven HIV medications, including the first single tablet regimen to treat HIV and the first once-daily oral antiretroviral tablet for pre-exposure prophylaxis (PrEP) to reduce the risk of acquiring HIV infection. These advances in medical research have helped to transform HIV into a preventable, chronic condition for millions of people. Gilead is committed to continued scientific innovation to provide solutions for the evolving needs of people affected by HIV around the world. Through partnerships and collaborations, the company also aims to improve education, expand access and address barriers to care, with the goal of ending the HIV epidemic for everyone, everywhere.\n</p><p>\nGilead operates in more than 35 countries worldwide, with headquarters in Foster City, California.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211129005047/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211129005047/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52539244&amp;newsitemid=20211129005047&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=4&amp;md5=4eb8ed9b2c5b4ee3900c41646074c4e2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}