{"date": "2021-12-18 05:12:33.880000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3377.42, "close": 3341.58}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The federal Occupational Health and Safety Administration said Monday it has opened an investigation into the collapse of an <a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> warehouse in Edwardsville, <a href=\"https://www.independent.co.uk/topic/illinois\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Illinois</a> after it was struck by a tornado on Friday, leaving six people dead and another hospitalized.</p><p>OSHA inspectors, who have been at the site since Saturday, will look into whether workplace safety rules were followed and will have six months to complete the investigation, said spokesperson Scott Allen.</p></div><div class=\"tr-npp-body\"><p>Amazon, meanwhile, said workers at the warehouse had little time to prepare when the <a href=\"https://www.independent.co.uk/topic/national-weather-service\" data-type=\"url\" class=\"tr-link\" translate=\"no\">National Weather Service</a> declared a tornado warning on Friday night. The tornado arrived soon after, collapsing both sides of the warehouse and caving in its roof.</p><p>\"There was a tremendous effort that happened that night to keep everybody safe,\" said John Felton, Amazon's senior vice president of global delivery services, speaking alongside Illinois Gov. J.B. Pritzker in Edwardsville on Monday and pledging a review of all the events that took place Friday.</p><p>Amazon spokesperson Kelly Nantel said the warehouse received tornado warnings between 8:06 p.m. and 8:16 p.m. Friday, and site leaders directed workers to immediately take shelter. At 8:27 p.m., the tornado struck the building.</p><p>Felton said most of the 46 people in the warehouse known as a \"delivery station\" headed to a shelter on the north side, which ended up \"nearly undamaged,\" and a smaller group to the harder-hit south end. The company said those are not separate safe rooms, but generally places away from windows considered safer than other parts of the plant.</p><p>Amazon has pledged to assist workers and their families affected by the tragedy, including donating $1 million to the Edwardsville Community Foundation. The company declined to answer questions Monday about its disaster plans at the plant, including whether employees were required to perform drills.</p><p>John Gasper, associate professor of economics at Carnegie Mellon University's Tepper School of Business, cautioned that he didn't know the particulars of what happened at Amazon. But he said for companies like Amazon that have high turnover in labor, it likely is harder to conduct regular emergency training schedules, particularly during the busy holiday season when there are many seasonal workers.</p><p>\"The cost of the time to do the drills is also time they are not (moving) the packages,\" he said. \"They have to think about these tradeoffs. But I don't think any company wants to harm its employees.\"</p><p>The tornado that hit Amazon's facility was part of a swarm of twisters across the Midwest and South that leveled entire communities. Another tornado destroyed a candle factory in Mayfield, Kentucky, killing multiple workers on an overnight shift. OSHA, which is part of the U.S. Department of Labor, said federal investigators are not investigating the Kentucky factory collapse because the state has its own workplace safety agency.</p><p>The Edwardsville warehouse is part of a vast patchwork of concrete-and-steel structures that have popped up in the St. Louis region over the past decade, drawn by its confluence of major highways and railroads, cheap costs and Americans' expectations for getting packages delivered soon after they click a link to order them.</p><p>A researcher who studies the warehouse industry and the pressure put on Amazon workers to meet strict productivity quotas said even if Amazon's team did everything right in responding to a devastating tornado, it raises the question about the structure of enormous warehouses popping up across the Midwest as some climate experts warn of more frequent severe storms.</p><p>\"We don't think of warehousing as one of the industries that's going to be severely impacted by climate change but then you have a case like this,\" said Beth Gutelius, research director at the Center for Urban Economic Development at the University of Illinois-Chicago. \"How do we make sure the facilities are built in a way to best protect the workers inside?\"</p><p>Gutelius said its central location and cheaper costs has led the warehouse industry to triple over the past decade in the greater St. Louis area, of which Edwardsville is a part, growing faster than the industry nationwide. She said the pressure on warehouse and delivery workers is particularly high in the holiday period, especially at Amazon because of its promise of rapid deliveries and its artificial intelligence technology for moving goods and monitoring workers' performance.</p><p>At the governor's press conference Monday, Nantel emphasized that the 1.1-million square foot building was \"constructed consistent with code.\"</p><p>But Pritzker raised the possibility that current codes aren't enough to meet the dangers of increasingly devastating storms. He said there will be an investigation into updating code \"given serious change in climate that we are seeing across the country.\"</p><p>Amazon announced plans in June 2016 to build two warehouses in Edwardsville, saying they would create 1,000 full-time jobs. One was meant to handle large items such as big-screen TVs and sports equipment, according to a June 2016 article in the Edwardsville Intelligencer. The other was for smaller items such as books, toys and handheld electronics.</p><p>Marc Wulfraat, a supply chain consultant who has studied Amazon's warehouses and distribution centers, says the one in Edwardsville appeared standard for the industry with 40-foot concrete walls, not unlike many others popping up around the country as consumers shift from stores to online buying.</p><p>\"It was basically a warehouse, with nothing particularly distinctive to Amazon,\" said Wulfratt, president of MWPVL International, a consultancy in Montreal. \"They abide by code when they put these buildings up. There is no way around it.\"</p><p>Robert Hartwig, a finance professor at the Darla Moore School of Business at the University of South Carolina, said Amazon likely has property insurance with very high deductibles, policies that tend to lead to facilities better built to handle storms.</p><p>\"Amazon has a significant incentive in mitigation, making investments that reduce or avoid losses, designing the structure to withstand a variety of perils,\" said Hartwig, former president of the Insurance Information Institute, a trade group. \"They will probably assume a material share of the loss before the insurance will kick in.\"</p><p>Gutelius said she couldn't help but view the tragedy as a spillover effect of American consumer demand for getting packages shipped quickly.</p><p>\"Yes, it was a freak accident, but the facts are still that these workers were making sure my dog gets a frisbee --tomorrow --and gave their life for it,\" she said. \"It seems really kind of ridiculous when you think about what the stakes are.\"</p><p>————-</p><p>AP writers Anne D'Innocenzio in New York, John O'Connor in Springfield, Illinois, Bernard Condon in New York and Jim Salter in O'Fallon, Missouri contributed to this report.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/kentucky-andy-beshear-midwest-dad-arkansas-b1977415.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Father, mortuary workers among the dead in Midwest twisters</a> </p><p><a href=\"https://www.independent.co.uk/news/portland-maine-wayfair-amazon-people-b1977342.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Postal hike doesn't stop catalogers from stuffing mailboxes</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/us-politics/nancy-pelosi-congress-washington-justice-department-apple-b1977008.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Pelosi defends lawmaker stock trades, citing 'free market'</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/joe-biden-illinois-andy-beshear-tennessee-arkansas-b1976948.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sisters from small town, duck hunters among tornado victims</a> </p><p><a href=\"https://www.independent.co.uk/news/rivian-tesla-atlanta-amazon-kia-b1976932.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sources: Rivian to build $5B electric truck plant in Georgia</a> </p><p><a href=\"https://www.independent.co.uk/news/los-angeles-america-latinx-amazon-latinos-b1976870.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Holiday rom-com 'With Love' follows Latino family for a year</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}