{"date": "2021-12-06 17:01:23+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds quote from UBS conference</p><p class=\"tr-by\">By Sheila Dang</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Dec 6 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The global advertising industry will notch higher growth this year than previously expected <span class=\"tr-strong\">and is likely to continue its streak in 2022 as </span>brands are relying more heavily on search engine and social-media companies such as Alphabet Inc's Google <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> and Meta Platforms Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> to reach customers during the pandemic, according to two ad industry forecasts released on Monday.</p><p>Despite a year marked by worldwide supply chain disruptions that delayed products from reaching shelves and a user privacy clampdown by Apple Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a> that many feared would disrupt mobile advertising, brands have continued to advertise online <span class=\"tr-strong\">and promote ecommerce</span> as in-store shopping has been slow to return due to the ongoing pandemic, said Jonathan Barnard, director of global intelligence at advertising firm Zenith, which published an ad expenditure forecast on Monday. </p><p>New businesses formed during the pandemic needed to advertise to find customers, while others likely maintained ad spending to stay in front of consumers' minds, said Brian Wieser, global president of business intelligence at ad agency GroupM.</p><p>GroupM forecast global ad spending to grow 22.5% in 2021 from the previous year, while Zenith estimated growth of 15.6%. <span class=\"tr-strong\">B</span>oth estimates were revised up from previous expectations.</p><p>\"<span class=\"tr-strong\">This is possibly the fastest-growing year ever in terms of the advertising industry,\" Wieser said during a UBS conference on Monday.</span></p><p>Global ad spending is expected to g<span class=\"tr-strong\">row</span> by about 9% in 2022, according to the reports.</p><p>The growth has been a boon for Alphabet, Meta and Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, major sellers of digital ads and which now account for more than half of all advertising spending outside of China, an increase from closer to 40% in 2019, GroupM said.</p><p>It also comes as Alphabet and Meta, the company formerly known as Facebook, both face antitrust investigations in the United States and Europe. </p><p>The need for marketers to directly reach consumers has also led to the success of retailers like Walmart, Target and Kroger to rapidly grow their own ad sales businesses, allowing brands to use their shopper data to target more customers. This form of advertising grew 47% this year to total $77 billion and is expected to grow to $143 billion by 2024, according to Zenith. </p><p>Retail media networks have been established in China for more than a decade, but <span class=\"tr-strong\">the growth </span>in other markets has been remarkable, Barnard said.</p><p>\"In the last five years, it has grown explosively out of nowhere outside of China,\" he said.</p><p><br/></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Sheila Dang in Dallas; Editing by Louise Heavens and Mark Porter)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Sheila.Dang@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Sheila.Dang@thomsonreuters.com</a> ; +1 646-983-0894) )</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: GLOBAL-ADVERTISING/FORECAST (UPDATE 1)</p></div>"}