{"date": "2022-02-21 20:04:17.801000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>NORFOLK, Va. (AP) — A North Carolina motorcyclist who lost a leg after a collision with an Amazon delivery truck has filed a lawsuit arguing that unrealistic expectations for the tech giant's delivery drivers have led to negligence.</p><p>According to his lawsuit, filed in Norfolk Circuit Court in January, Justin Hartley was riding his motorcycle in Virginia Beach on Oct. 4 when a rented truck with an Amazon logo turned directly into his lane, The Virginian-Pilot reported.</p></div><div class=\"tr-npp-body\"><p>The truck hit Hartley, causing fractures to his left wrist and left leg. Doctors were unable to save his left leg and amputated it just below the knee, according to the lawsuit. The lawsuit alleges Amazon delivery driver Christopher Gill admitted to authorities that when the accident happened, he was looking down at GPS directions on his Amazon-supplied navigation device.</p><p>\"The unrealistic expectations that are put on the drivers are fueling these negligence cases,\" said Hartley's attorney, Kevin Biniazan. \"The driver was so entranced in making his delivery that he did not see our client.\"</p><p>Represented by Wilson Elser law firm, Amazon's response denied all allegations and stated that the lawsuit failed to \"implicate a legal or contractual responsibility owed on behalf of Amazon.\" The response denied that Amazon is \"vicariously responsible for the acts or omissions of defendant Gill,\" while also denying that Gill is guilty of \"any act of negligence\" that caused the crash.</p><p>Drivers for <a href=\"http://Amazon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com</a> and Amazon Logistics are required to use the Amazon \"Flex App,\" according to the lawsuit. The app, the lawsuit said, manages every aspect of a delivery driver's route, including what directions to take, when to take breaks, and when to return to the station.</p><p>When a driver falls behind the desired pace during a route, the lawsuit said Amazon sends text messages stating the driver is \"behind the rabbit\" and needs to be \"rescued\" to ensure that they get back on schedule. A driver's pay can be reduced if he or she falls \"behind the rabbit\" or require rescues too often, the $100 million lawsuit said.</p><p>This is not the first time Amazon has faced a lawsuit regarding its delivery drivers. Bloomberg reported in November that Amazon has been a defendant in at least 119 motor vehicle injury lawsuits across 35 states.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022</p></div>"}