{"date": "2021-11-23 13:37:00.550000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Former President Barack Obama's foundation announced Monday that it has received a $100 million donation from Amazon founder Jeff Bezos, which it says is the largest individual contribution it has received to date.</p><p>Separately on Monday, New York University's medical center said it has received a $166 million gift from Bezos and his family.</p></div><div class=\"tr-npp-body\"><p>For its part, the <a href=\"https://www.independent.co.uk/topic/obama\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Obama</a> foundation said in a statement that the gift from Bezos is intended \"to help expand the scope of programming that reaches emerging leaders\" in the United States and around the world.</p><p>The donation, it said, was also given in honor of <a href=\"https://www.independent.co.uk/topic/john-lewis\" data-type=\"url\" class=\"tr-link\" translate=\"no\">John Lewis</a> the congressman and civil rights icon who died last year. As part of the gift, the foundation said Bezos has asked for the plaza at the Obama Presidential Center, under construction in Chicago's South Side, to be named after Lewis. <a href=\"https://www.independent.co.uk/topic/valerie-jarrett\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Valerie Jarrett</a> a former senior adviser to Obama who serves as the foundation's <a href=\"https://www.independent.co.uk/topic/ceo\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CEO</a> said in a statement that the foundation was \"thrilled\" by that idea.</p><p>Construction on Obama's legacy project is expected to cost about $830 million and to be completed by 2025. In the meantime, the foundation said it's giving donors the opportunity to \"honor and the names of those who have fought for a more just and equitable world\" by naming public spaces in the future presidential center.</p><p>\"Freedom fighters deserve a special place in the pantheon of heroes, and I can't think of a more fitting person to honor with this gift than John Lewis, a great American leader and a man of extraordinary decency and courage,\" Jeff Bezos said in the statement released by the foundation. \"I'm thrilled to support President and Mrs. Obama and their Foundation in its mission to train and inspire tomorrow's leaders.\"</p><p>Since stepping down as CEO of Amazon this year, Bezos has begun to focus more of his attention on philanthropy. NYU, which received the other Bezos gift announced Monday, said in a statement the donation will be used to aid \"with the health and wellness of diverse populations\" across NYU Langone Hospital—Brooklyn community, one of the school's teaching hospitals and trauma centers in Brooklyn.</p><p>Last year, Bezos committed to spend $10 billion by 2030 to enhance climate change efforts through his Bezos Earth Fund. In recent months, he has released some details on how he plans to spend that money.</p><p>Bezos, whose personal wealth is estimated by Forbes at roughly $212 billion, had long been questioned about the relatively modest level of his charitable giving and reluctance to sign The Giving Pledge. The pledge, developed by Bill Gates and Warren Buffett, is intended to persuade the world's wealthiest to donate more than half their worth to philanthropic organizations.</p><p>MacKenzie Scott, Bezos' former wife, whose fortune is estimated at $61 billion, has signed the pledge. Scott has made a splash in the philanthropy world over the past 17 months by donating $8.7 billion — without any strings attached — to numerous nonprofits across the country.</p><p>___</p><p>The Associated Press receives support from the Lilly Endowment for coverage of philanthropy and nonprofits. The AP is solely responsible for all content. For all of AP's philanthropy coverage, visit <a href=\"https://apnews.com/hub/philanthropy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://apnews.com/hub/philanthropy</a> .</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/world/americas/us-politics/joe-biden-trump-senate-mitch-mcconnell-general-services-administration-b1960987.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Biden to nominate 2 for US Postal board, oust DeJoy allies</a> </p><p><a href=\"https://www.independent.co.uk/news/ethiopia-nairobi-kenya-joe-biden-abiy-ahmed-b1960824.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ethiopia's economy hit as major clothing maker closes shop</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/us-politics/trump-biden-environmental-protection-agency-washington-united-states-b1960497.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Biden administration acts to restore clean-water safeguards</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}