{"date": "2021-11-18 12:19:58.337000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Nov. 18 -- Amazon has today announced 'Headset Days' bringing together a host of offers and deals on your favourite headphone brands until November 20. Customers can choose from a wide selection from top brands like OnePlus, Samsung, Jabra and much more. These include some true wireless headsets and others with neckband style. There are plenty on offer but choose according to your needs and budget. Headsets have become an integral part of mobile ecosystem.</p><p>Here are some of the products for all headset lovers with offers and deals from sellers.</p></div><div class=\"tr-npp-body\"><p>Jabra Elite Active 75t</p><p>The Jabra Elite Active 75t is a true wireless headset from Jabra which is designed for secure fit and amazing durability. It comes with Active Noise Cancellation, IP57 rating which makes it sweat and waterproof. With up to 24 hours of battery time (ANC on) and with the pocket-friendly charging case, the Elite Active 75t earphones let you take calls and play music while staying connected. This TWS headset is available at Rs.7,999 with HDFC and ICICI bank offers.</p><p>OnePlus Buds Pro</p><p>The OnePlus Buds Pro is a premium TWS from OnePlus which comes with features like Smart Adaptive Noise Cancellation, OnePlus Audio ID, and 38 hours of battery life. It is known for its powerful, punchy bass and is IP55 Water, Dust and Sweat resistant. This TWS is available for Rs.9,990.</p><p>Samsung Galaxy Buds Pro</p><p>The Samsung Galaxy Buds Pro is a true wireless earbud with Intelligent Active Noise Cancelling (ANC) which can seamlessly switch between noise cancelling and fully adjustable ambient sound. It has 2-way speakers with sound by AKG for balanced sound and wide frequency response. It supports noise-free calls with three built-in microphones and the voice pickup unit and is IPX7 water resistant. This TWS is available for Rs.9,990.</p><p>OnePlus Bullets Wireless Z Bass Edition</p><p>The OnePlus Bullets Wireless Z Bass Edition is a neckband headset which comes equipped with Bluetooth v5.0 and is fully compatible with all smartphones. It is one of bestselling neckbands on Amazon.in. A single 10-minute charge gives you 10 hours of music and movies. A full charge provides up to 20 hours of battery life, so you can keep the music going. This Bluetooth neckband is available for Rs.1,999.</p><p>Realme Buds Wireless 2 Neo</p><p>The Realme Buds Wireless 2 Neo is a Bluetooth neckband from Realme which supports USB Type-C Fast Charging (10mins Charge for 120mins Playback) and up to 17 hours total Playback. It also has features like multi device switching, IPX4 water resistance and Environment Noise Cancellation. This neckband is available for Rs.1,499.</p><p>pTron Bassbuds Duo</p><p>The pTron Bassbuds Duo is a budget TWS which has features like Bluetooth 5.1, stereo audio, dual HD mic and type-C fast charging. It is also IPX4 water resistant and has Passive Noise Cancellation. This budget TWS is available for Rs.799. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}