{"date": "2022-01-24 14:56:27.487000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>R1 RCM INC (\"RCM-Q\")\n- Growth Momentum Accelerates Investment in Technology\n\n     R1 RCM Inc. (\"R1\"), a leading provider of technology-driven solutions\nthat transform the patient experience and financial performance of\nhealthcare providers, announced it is hosting a virtual career open house\non January 25, 2022, to fill more than 80 new technology roles in support\nof R1's mission to simplify healthcare.\n\n     As an industry leader in revenue cycle management, R1 brings depth and\nbreadth in improving the patient experience and increasing financial\nperformance for some of the largest and most progressive health systems in\nthe U.S. R1's innovative products leverage intelligent workflows and\nautomation to efficiently process over $40B in net patient revenue annually\nfor its clients.\n\n     With its rapid growth and continued drive to enable health systems to\nbe more effective, R1 is expanding its technology team. The company is\nhosting a virtual career open house for software engineers and product\nmanagers on January 25, 2022, from 4:00 - 6:00pm CST. It will offer\nparticipants the chance to speak directly with hiring managers and meet\nwith key members of the team to learn about R1's technology tools and see\nfirsthand the type of work that needs to be accomplished. Managers will\nshare R1's core values in action and help technology candidates gain an\nunderstanding of the personal and professional growth they can achieve and\nthe impact they can have. Participants also will have the opportunity to\nattend valuable learning sessions focused on:\n\n     *  Disrupting the current paradigm through the automation of tasks,\nprocesses and workflows\n     *  Developing technology that improves outcomes, reduces costs and\nsimplifies healthcare\n     *  Building healthcare's \"digital front door\" to engage patients and\nimprove satisfaction.\n\n     \"Our technology brings efficiencies that address top concerns for\nhealthcare providers, including revenue optimization, staff shortages, and\nskyrocketing labor and operational costs that have been exacerbated in the\nwake of COVID-19,\" said Jay Sreedharan, R1's chief technology and digital\nofficer. \"This additional investment in tech talent is yet another\ndemonstration of our long-term commitment to solving these challenges and\nreshaping the way healthcare organizations manage their operations.\"\n\n     R1's commitment to technology is bolstered by its track record of\nstrategic acquisitions including VisitPay, a leader in digital payment\nsolutions and SCI Solutions, a SaaS-based scheduling and patient access\nsolutions provider. To learn more about R1's acquisitions, visit\nr1rcm.com/news.\n\n     \"It's exciting to be part of the solution - to use automation and\ndigitization to create efficiencies and standardization that will benefit\ncustomers, patients and communities at large,\" said Katie Patel, R1's\nsenior vice president of digital programs. \"We are offering fulfilling work\nin a dynamic, high growth environment where individuals not only get to\nwork with leaders with deep domain expertise but also have a chance to make\na substantial impact in an evolving industry that affects us all.\"\n\n     R1 is headquartered in Salt Lake City, with offices in the Chicagoland\narea, Southfield and Kalamazoo, Michigan, and Boise, Idaho. In-person,\nhybrid and remote roles are available for those skilled in a variety of\ntechnologies, including HTML5, jQuery, JavaScript, Angular JS, Angular12,\nC++, SQL, PAAS, IAAS, Java, Ruby, Git, C#, .NET Core, MongoDB, Python,\nSpark, Azure and AWS. Interested individuals are encouraged to attend the\nvirtual open house.\n\n     About R1 RCM\n\n    R1 is a leading provider of technology-driven solutions that transform the\npatient experience and financial performance of hospitals, health systems,\nand medical groups. R1's proven and scalable operating models seamlessly\ncomplement a healthcare organization's infrastructure, quickly driving\nsustainable improvements to net patient revenue and cash flows while\nreducing operating costs and enhancing the patient experience. To learn\nmore, visit: r1rcm.com.\n\n     Forward Looking Statement\n\n    This press release includes statements that may constitute\n\"forward-looking statements\" made pursuant to the safe harbor provisions of\nthe Private Securities Litigation Reform Act of 1995. In particular,\nstatements about future events and relationships, plans, future growth and\nfuture performance are forward-looking statements. These statements are\noften identified by the use of words such as \"anticipate,\" \"believe,\"\n\"estimate,\" \"expect,\" \"intend,\" \"designed,\" \"may,\" \"plan,\" \"predict,\"\n\"project,\" \"will,\" \"would,\" and similar expressions or variations, although\nnot all forward-looking statements contain these identifying words. We have\nbased these forward-looking statements on our current expectations and\nprojections about future events as of the date hereof and any\nforward-looking statements contained herein should not be relied upon as\nrepresenting our views as of any subsequent date. Subsequent events and\ndevelopments, including actual results or changes in our assumptions, may\ncause our views to change. While we may elect to update these\nforward-looking statements at some point in the future, we have no current\nintention of doing so except to the extent required by applicable law.\nAlthough we believe that the expectations reflected in such forward-looking\nstatements are based on reasonable assumptions, such statements are subject\nto risks and uncertainties that could cause actual results to differ\nmaterially from those projected. Should one or more of these risks and\nuncertainties materialize, or should underlying assumptions, projections,\nor expectations prove incorrect, actual results, performance, financial\ncondition, or events may vary materially and adversely from those\nanticipated, estimated, or expected. Our actual results and outcomes could\ndiffer materially from those included in these forward-looking statements\nas a result of various factors, such as the factors discussed under the\nheading \"Risk Factors\" in our annual report on Form 10-K for the year ended\nDecember 31, 2020, our quarterly reports on Form 10-Q, and any other\nperiodic reports we file with the Securities and Exchange Commission.\n\nContact:Laura Kelly\n312.719.3257\nmedia@r1rcm.com\n\nTel   : 312-324-7820    R1 RCM INC\nEmail : arahim@r1rcm.com\nWWW   : <a href=\"https://www.r1rcm.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.r1rcm.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202300540.MNPRE2202301604-06352520220124</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}