{"date": "2021-11-30 00:00:00.085000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p align=\"left\">LAS VEGAS, Nov.  29, 2021  (GLOBE NEWSWIRE) -- <a href=\"https://www.globenewswire.com/Tracker?data=LY_pBLXKzBVQCrW6FiSA9-p95xuIM_miZZ-5F7TR_n5UzZGzEk0lEQAxWDsBgzTIN9sHwFUfgFMHkbRaVTPGiw==\"><u>Docker, Inc.®</u></a> today announced the availability of Docker Official Images directly from Amazon Web Services, Inc (AWS). The <a href=\"https://www.globenewswire.com/Tracker?data=4LPsFaxcIMLN6aLdEFSuuyPxMddHSggaDmaHb8Oq8KCLDXdopKR6E_1NVIKnDoMoTqaCjhagUmoRlH7AXHM_GR35YS-0C7cDZ9xeqGvhD1tnkcwC8YKJvSSmXW8uAtDV\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Elastic Container Registry Public</a> (Amazon ECR Public), a registry service provided by Amazon to manage container images, extends a long-standing collaboration between Docker and AWS to publish Docker Official Images from Docker Hub into Amazon ECR public. This announcement gives developers and development teams the flexibility to download verified, curated container images from their choice of registry, providing them with familiar building blocks to build, ship and run secure applications more quickly.<br/></p><p>“Docker Official Images are the single-most popular category of container images because they serve as the starting point for the majority of users and provide drop-in solutions for popular programming language runtimes, data stores, and services all while ensuring that security updates are applied in a timely manner,” said Docker CEO Scott Johnston. “Today we are making these images available to developers using AWS ECR, joining registry partners JFrog and Mirantis to provide trusted content from Docker wherever developers need them.”<br/><br/>With 15.8 billion container image pulls per month from nearly 12.5 million repositories and used by millions of developers, Docker Hub is the industry’s leading container registry. Docker Hub delivers developers the largest breadth and depth of container images and plays a central role in building and sharing cloud-native applications. Docker Official Images are a curated set of images of 160 open source projects popular with developers, including Ubuntu, Mongo, Neo4J, Spring, Python, Kafka, and many others, and now extended for the first time on Amazon ECR Public.</p><p>“Customers tell us that they love the simplicity and discoverability that Amazon ECR Public provides, and they want us to continue to expand the content to make it even more useful for building and running containerized applications,” said Deepak Singh, vice president, Compute Services, AWS. “For that reason, we are excited that Docker is bringing the Docker Official Images to Amazon ECR Public. Now, AWS customers can use these images while taking advantage of the unlimited free downloads from ECR Public within AWS regions and 5 TB of free downloads per month outside of AWS regions.”</p><p>“At TableCheck, a global restaurant technology platform designed to help restaurants manage their diner experience in-house, we rely on AWS ECR Public’s excellent uptime and robust network to pull images quickly and reliably as a core part of our infrastructure,\" said Alexander Nicholson, Lead SRE at TableCheck. “With the inclusion of Docker Official Images on ECR Public, that reliability is now extended to images pulled by our developers because they can continue to build with images they already have confidence in - whether it's on Docker Hub or AWS ECR Public.”<br/><br/>Docker also announced today that it has achieved the AWS Graviton Ready designation, part of the Amazon Web Services, Inc. (AWS) Service Ready Program. This designation recognizes that Docker delivers comprehensive support for Graviton/Arm64 across our product line and for Docker Official Images. With this designation, developers can use the exact same development, build, and production workflows regardless of the processor architecture, enabling them to take advantage of the AWS Graviton best-in-class price performance.</p><p>Achieving the AWS Graviton Ready designation differentiates Docker as an AWS Partner Network (APN) member with a product integrating with AWS Graviton and is generally available and fully supported for AWS customers. AWS Service Ready Partners have demonstrated success building products integrated with AWS services, helping AWS customers evaluate and use their technology productively, at scale, and with varying levels of complexity. AWS Graviton support rounds out the end-to-end support for Arm development. Docker support for Arm development includes support for Apple M1 processors, to hundreds of thousands of Arm native images on Docker Hub with the ability to compile for multiple architectures from the same code base.</p><p><strong>Join the Docker Verified Publisher program </strong><br/>Software publishers and ISVs interested in joining the Docker Verified Publisher program can get more information by visiting <a href=\"https://www.globenewswire.com/Tracker?data=tufd0nOHaCaf4lgLTPopL3gNgrWNOw-KFKC-n0aQXL0-WnHPGjQbFAF3WBwI3FssKPTRcnjm-5zCR3K519VnJxdEEKNJMiwllReh59PhWJKkAG4pvwm0iGbcC0Yi5mAQ\"><u>https://www.docker.com/partners</u></a>.</p><p><strong>Resources</strong></p><ul type=\"disc\" class=\"bulleted-list arrowlist\"><li>Docker Blog: <a href=\"https://www.docker.com/blog/news-from-aws-reinvent-docker-official-images-on-amazon-ecr-public/\"><u>News from AWS re:Invent - Docker Official Images on Amazon ECR Public</u></a></li><li>AWS Blog: <a href=\"https://aws.amazon.com/blogs/containers/docker-official-images-now-available-on-amazon-elastic-container-registry-public/\"><u>Docker Official Images now available on Amazon Elastic Container Registry Public</u></a></li><li>AWS Blog: <a href=\"https://aws.amazon.com/blogs/aws/announcing-pull-through-cache-repositories-for-amazon-elastic-container-registry/\"><u>Announcing Pull Through Cache Repositories for Amazon Elastic Container Registry</u></a></li><li>Press Release: <a href=\"https://www.docker.com/press-release/docker-expands-trusted-content-offerings\"><u>Docker Expands Trusted Content Offerings for Developers</u></a></li></ul><p><strong>DockerCon Live 2022 </strong><br/>Join us for DockerCon Live 2022 on Tuesday, May 10. DockerCon Live is a free, one day virtual event that is a unique experience for developers and development teams who are building the next generation of modern applications. If you want to learn about how to go from code to cloud fast and how to solve your development challenges, DockerCon Live 2022 offers engaging live content to help you build, share and run your applications. Register today at <a href=\"https://www.globenewswire.com/Tracker?data=tufd0nOHaCaf4lgLTPopL3gNgrWNOw-KFKC-n0aQXL1PlfUhClLX6_lYvN3sullTzixKGD1fmKCDiW0FJcYCsUb3eHTDt0kI2gjcHkYwbpWvX_zCKyVWpmOqoQi8L1mm\"><u>https://www.docker.com/dockercon/</u></a></p><p><strong>About Docker</strong><br/>Docker helps millions of developers efficiently and collaboratively build, share and run applications. The Docker collaborative application development platform provides developers with an unmatched experience for an integrated, reliable and secure workflow that accelerates app delivery from code to the cloud. Through a combination of the world’s largest marketplace of trusted content and integrations with leading tools, Docker allows teams to rapidly create modern applications. For more information, visit <a href=\"https://www.globenewswire.com/Tracker?data=MMl2cIVXhdSX6nOVlg37O_ZGnmOwMQQefDao8D4hzsxMxSClVFZtborZAN734rbt_UoIyA09_uEClKfuP7OFhA==\"><u>www.docker.com</u></a></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQwMjQxMCM0NTg3MDc2IzIxNzk0ODA=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RRd01qUXhNQ00wTlRnM01EYzJJekl4TnprME9EQT0=&amp;key=f3a73ab64431f0074d4cd71b24fb1900337ff21d7cc96cc488caec3c210ac1ed540c5c1ef6342f98f695d1b9296237113efa8fcf792fab7fa7f0646bbab21ad3\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/NjkzODlmZDAtMTM4My00NGNmLThhZjktZTY1ZmRkNDk2OWI3LTExOTEwNDk=/tiny/Docker-Inc-.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9Oamt6T0RsbVpEQXRNVE00TXkwME5HTm1MVGhoWmprdFpUWTFabVJrTkRrMk9XSTNMVEV4T1RFd05Eaz0vdGlueS9Eb2NrZXItSW5jLS5wbmc=&amp;key=30e19e8ef184085c86ccc678a0100307715d7734a33f255b53b31b01f5c38f58c0caec244395c03e262b411439f8b90f5b6bb45a67fb4169aef0451dc7c9be93\"/></div></div><pre>Contact\nDavid Oro\npress@docker.com </pre><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/c83c4886-b215-4cf0-a973-64b8f65e7003\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/c83c4886-b215-4cf0-a973-64b8f65e7003/small/horizontal-logo-monochromatic-white-png.png\" style=\"max-height:39px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9jODNjNDg4Ni1iMjE1LTRjZjAtYTk3My02NGI4ZjY1ZTcwMDMvc21hbGwvaG9yaXpvbnRhbC1sb2dvLW1vbm9jaHJvbWF0aWMtd2hpdGUtcG5nLnBuZw==&amp;key=fafb311cd90f5050eaa9469ba6b2f7b411d4196b344007a15bcb10f049aad71df9fa9a7a22446d342adf8b0a04a836d7b69799d9cfbadec962466f064508e3fa\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}