{"date": "2021-11-08 16:00:00.475000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Boosted Commerce Announces Hiring of Steve Oliver, Former CEO of Hollar and Amazon Veteran, as New President</b>\n</p><p class=\"bwalignc\">\n<span>Oliver brings decades of proven success in building and scaling eCommerce companies to benefit Boosted’s portfolio of 35+ eCommerce brands</span>\n</p><p>\nToday, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fboostedcommerce.com%2F&amp;esheet=52524558&amp;newsitemid=20211108005449&amp;lan=en-US&amp;anchor=Boosted+Commerce&amp;index=1&amp;md5=d1c8fbb531e3a1c09c2a0476800a859a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Boosted Commerce</a>, the leading consumer eCommerce platform that acquires and grows third-party businesses on Amazon and Shopify, has announced the hiring of new President Steve Oliver, who will be responsible for managing the company’s portfolio of acquired brands.\n</p><p>\nOliver joins the Boosted team having optimized and scaled business operations for many leading eCommerce companies. Most recently, he was CEO of eCommerce startup Hollar, where he revitalized product merchandising, product development, consumer marketing, and more, leading to accelerated growth and eventual sale to Five Below in 2020. Prior to Hollar, Oliver was COO of Ticketfly, where he directly oversaw the product, engineering, marketing, client &amp; customer support, and HR teams, leading to the company’s sale to Pandora in 2015 and subsequent sale to Eventbrite in 2017. Oliver is also a nine-year veteran of Amazon, where he was instrumental in the rapid growth of the company’s Canadian presence as well as in the evolution of Amazon Video.\n</p><p>\n“Charlie and Keith have built and fostered an environment at Boosted that is committed to optimizing our portfolio of brands for long-term, sustainable growth,” said Oliver. “I’ve already been inspired by the team’s desire to integrate modern, forward-thinking solutions that enable us to better navigate the operational complexities of building a business.”\n</p><p>\nThe breadth and depth of Oliver’s experiences in his more than 17 years in the industry have made him uniquely suited to play a fundamental role in Boosted’s increasingly rapid growth. His hire, on the heels of the recent hiring of Chief Technology Officer Juan Paul Ramirez, further accelerates Boosted’s ability to build world-class brands. In 2021 alone, Boosted has seen explosive expansion, having grown its team nearly 4x and revenue more than 100x. Oliver intends to harness this momentum by continuing to build out the team and further position Boosted as an industry leader in supply chain management, product marketing, and data.\n</p><p>\n“Steve couldn’t be a better fit for the Boosted team,” said Boosted’s CEO and Co-founder, Keith Richman. “Not only is he fluent in Amazon’s operations, but his diverse background within the industry -- from growing an eCommerce startup like Hollar to leading Amazon Canada to becoming the number one eCommerce store in the country -- has equipped him with an incredible mastery of the eCommerce ecosystem. Steve has proven that he is always thinking 10 steps ahead, preparing, innovating, and optimizing companies for whatever is coming next. His strategic vision will be an incredible asset to us and our brands.”\n</p><p>\nIf you’re interested in joining the team, or want to learn more, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fboostedcommerce.com%2F&amp;esheet=52524558&amp;newsitemid=20211108005449&amp;lan=en-US&amp;anchor=boostedcommerce.com&amp;index=2&amp;md5=dcc354d6ffc01555f895492423326954\" data-type=\"url\" class=\"tr-link\" translate=\"no\">boostedcommerce.com</a>.\n</p><p>\n<b>About Boosted Commerce</b>\n</p><p>\nBoosted Commerce buys and grows high quality commerce brands. Through its use of proprietary data and technology, Boosted identifies market opportunities, product trends, and emerging brands. Boosted then fuels rapid growth of its portfolio using its “Boosted Brain” playbook that contains more than 750 eCommerce operating procedures. Boosted has acquired nearly 40 brands, which boast category-leading products distributed across Amazon, Walmart, and other retail channels along with a competitive D2C presence. Successful entrepreneurs in their own right, Boosted’s founders, Keith Richman and Charlie Chanaratsopon, not only bring strong retail and digital marketing experience to the organization, but are also passionate about helping founders achieve their vision. With the end customer top-of-mind, the Boosted team prides itself on a product-first approach to the growth and development of its portfolio. Boosted Commerce has raised $380M in capital, and its portfolio of brands includes <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2Fs%3Fi%3Dmerchant-items%26me%3DA3QL3QY8MM549O&amp;esheet=52524558&amp;newsitemid=20211108005449&amp;lan=en-US&amp;anchor=Simplified+Skin&amp;index=3&amp;md5=a689c880431d9a40fb6c7cb081d1bb69\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Simplified Skin</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2Ftubcubby&amp;esheet=52524558&amp;newsitemid=20211108005449&amp;lan=en-US&amp;anchor=Tub+Cubby&amp;index=4&amp;md5=b566091f9a32899a1157ebad4c498505\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Tub Cubby</a>, and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2FAsterwood-Naturals%2Fs%3Fk%3DAsterwood%2BNaturals&amp;esheet=52524558&amp;newsitemid=20211108005449&amp;lan=en-US&amp;anchor=Asterwood+Naturals&amp;index=5&amp;md5=d877506e22140df900e3929a5e29eb93\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Asterwood Naturals</a>. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fboostedcommerce.com%2F&amp;esheet=52524558&amp;newsitemid=20211108005449&amp;lan=en-US&amp;anchor=https%3A%2F%2Fboostedcommerce.com%2F&amp;index=6&amp;md5=9d62a505015e1f6343c1f9ab0fb8f2c2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://boostedcommerce.com/</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211108005449r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTA4MDA1NDQ5cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=c5d047e36f83785df6e90efdd0abd318e8260106ba5e93ba319ec229135623ac88ef0450c93fa8580081c8b292b480572f9323f89f865798b9d6b3db7c625f75\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211108005449/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211108005449/en/</a></span></p><p>\n<b>Press\n<br/></b>Ali Griffiths\n<br/>Bevel\n<br/><a href=\"mailto:Ali@bevelpr.com\" data-type=\"email\" translate=\"no\">Ali@bevelpr.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CA-BOOSTED-COMMERCE</p></div>"}