{"date": "2021-11-30 17:11:34.288000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NASDAQ INC (\"NDAQ-Q\")\nAMAZON (\"AMZN-Q\")\n- And AWS Partner to Transform Capital Markets\n\n     Today, at AWS re:Invent, Nasdaq and Amazon Web Services, Inc. (AWS),\nan Amazon.com Inc. company announced a multi-year partnership to build the\nnext generation of cloud-enabled infrastructure for the world's capital\nmarkets.\n\n     Beginning in 2022, Nasdaq plans to migrate its North American markets\nto AWS in a phased approach, starting with Nasdaq MRX, a U.S. options\nmarket. Nasdaq will use a new edge computing solution that is co-designed\nby Nasdaq and AWS and specifically developed for market infrastructure.\nThis solution may also be used by other market infrastructure operators and\nmarket participants to move their trading systems to the cloud. In\naddition, the partnership will include opportunities to explore new ways to\nleverage AWS's cloud capabilities across Nasdaq's anti-financial crime,\ndata and analytics, and market infrastructure software solutions.\n\n     \"This landmark partnership with AWS seeks to power a truly cloud-based\nmarket infrastructure that is more resilient, scalable, and accessible for\nall market participants,\" said Adena Friedman, President and CEO, Nasdaq.\n\"For over a decade, Nasdaq has used the elasticity and high security of AWS\nto deliver client-driven solutions. Our innovative, new collaboration with\nAWS creates a bridge to the future for our markets and represents the next\nmajor step forward in Nasdaq's cloud journey.\"\n\n     \"Together, Nasdaq and AWS will change what's possible for capital\nmarkets organizations, helping them to speed up innovation and improve\nbusiness processes,\" said Adam Selipsky, CEO of Amazon Web Services, Inc.\n\"Combining Nasdaq's 50 years of expertise in pioneering technology for\ncapital markets with the proven security, reliability, and resilience of\nthe world's leading cloud will help our joint customers and Nasdaq to\ncontinue to grow their businesses and seamlessly transact billions of\ndollars in trades per day. Our partnership will give Nasdaq a way to more\neasily move their core infrastructure to the cloud and innovate new\nservices as they continue their second decade of cloud adoption.\"\n\n     Building the Capital Markets Infrastructure of the Future\n\n     Core to Nasdaq's move to AWS will be AWS Outposts, which extend AWS\ninfrastructure, services, APIs, and tools to virtually any datacenter,\nco-location space, or on-premises facility. Nasdaq plans to incorporate AWS\nOutposts directly into its core network to deliver ultra-low-latency edge\ncompute capabilities from its primary data center in Carteret, New Jersey.\nThis co-designed edge computing solution would effectively establish\nNasdaq's data center as the first-ever private AWS Local Zone for the\ncapital markets industry.\n\n     Over time, Nasdaq plans to move additional North American markets to\nthe cloud with AWS. This hybrid infrastructure would provide Nasdaq with\nlow-latency access to its on-premises systems to deliver high-frequency\ntrading capabilities, as well as give its clients access to cloud-based\ncapabilities, including virtual connectivity services, market analytics and\nmachine learning, at a lower cost. Nasdaq expects this migration to the\ncloud to enable the adoption of new services and products in a manner that\nunlocks value and provides its clients with added flexibility.\n\n     Advancing Cloud-enabled Market Technology Solutions for the Global\nEconomy\n\n     For the 130+ market infrastructure clients - spanning exchanges,\nbanks, clearing houses, central securities depositories and regulators -\nthat rely upon Nasdaq for their core trading, clearing, settlement, and\nsurveillance technology today, Nasdaq plans to partner with AWS to develop\nviable cloud choices that include public-cloud and hybrid models.\n\n     Nasdaq also intends to leverage its cloud journey for its own markets,\ncoupled with the growing number of AWS Local Zones around the world, and\nthe collective technology portfolios of the partnership, to create a\nmigration blueprint for its market technology clients using a combination\nof public cloud and edge compute options.\n\n     Nasdaq expects that migrating to the cloud will give its market\ninfrastructure clients added agility and help them rapidly adjust to\never-changing industry dynamics in their countries and regions.\n\n     Nasdaq's Cloud Strategy: A Decades-long Journey for an Interconnected\nFuture\n\n     For 50 years, Nasdaq has reimagined markets to realize the potential\nof tomorrow. After pioneering electronic markets half a century ago, Nasdaq\ndeveloped the highest performance messaging protocols in the early 2000s,\nwhich now serve as the de-facto industry standard for ultra-low latency\ntrading. In addition, Nasdaq was one of the first exchange operators to\ncommercialize its technology, and started using AWS technology in 2008.\nToday, Nasdaq's technology solutions drive high performance, transparency,\nefficiency, and integrity across the transaction lifecycle at market\ninfrastructure operators--exchanges, central counterparty clearing houses,\ncentral securities depositories, and regulators--in over 50 countries.\n\n     As Nasdaq looks to redefine the market technology of the future and\ntackle the transformation of its core infrastructure for the decades ahead,\nit is committed to creating an interconnected future - one that is safer\nand stronger for everyone, in the cloud.\n\n     To learn more, visit www.nasdaq.com/cloud.\n\n     NOTE TO EDITORS\n\n     Carteret Data Center: Nasdaq's primary data center for its U.S.\nEquities and Options Markets is located in the Equinix NY11 facility in\nCarteret, NJ.\n\n     Edge Computing: Edge computing moves data storage, processing, and\nanalysis closer to endpoints where data is generated to deliver\nnear-real-time responsiveness for high-performance applications. AWS's\nmanaged edge hardware and services extend secure edge computing\ncapabilities to customer endpoints, allowing them to deploy APIs and tools\noutside of AWS data centers in metro areas, 5G networks, on-premises\nlocations, and on ruggedized devices.\n\n     Financial Terms: Nasdaq expects expenses and investments associated\nwith this partnership to be consistent with our existing capital allocation\nframework and non-GAAP operating expense guidance, while supporting growth\nopportunities over the long-term.\n\n     Nasdaq MRX: Nasdaq MRX is one of six U.S. options markets operated by\nNasdaq. Nasdaq MRX offers both a simple customer priority, pro-rata\nallocation market and a price-time complex market, complete with a full\nsuite of auction and crossing orders.\n\n     Options Markets: Nasdaq operates six options markets in the U.S.,\nincluding Nasdaq MRX, to buy and sell options on equity and ETF securities\nwith unique market models that cater to different segments of the options\nmarket.\n\n     AWS Local Zones: AWS Local Zones are a type of AWS infrastructure\ndeployment that places compute, storage, database, and other select AWS\nservices close to large population and industry centers. They allow AWS\ncustomers to use select AWS services, like compute and storage services,\ncloser to more end-users, providing them very low latency access to\napplications running locally. Nasdaq and AWS plan to establish a private\nAWS Local Zone within the Equinix NY11 data center in Carteret that is\navailable for Nasdaq's use only.\n\n     About Nasdaq\n\n     Nasdaq (Nasdaq: NDAQ) is a global technology company serving the\ncapital markets and other industries. Our diverse offering of data,\nanalytics, software, and services enables clients to optimize and execute\ntheir business vision with confidence. To learn more about the company,\ntechnology solutions and career opportunities, visit us on LinkedIn, on\nTwitter @Nasdaq, or at www.nasdaq.com.\n\n     About Amazon Web Services\n\n     For over 15 years, Amazon Web Services has been the world's most\ncomprehensive and broadly adopted cloud offering. AWS has been continually\nexpanding its services to support virtually any cloud workload, and it now\nhas more than 200 fully featured services for compute, storage, databases,\nnetworking, analytics, machine learning and artificial intelligence (AI),\nInternet of Things (IoT), mobile, security, hybrid, virtual and augmented\nreality (VR and AR), media, and application development, deployment, and\nmanagement from 81 Availability Zones within 25 geographic regions, with\nannounced plans for 27 more Availability Zones and nine more AWS Regions in\nAustralia, Canada, India, Indonesia, Israel, New Zealand, Spain,\nSwitzerland, and the United Arab Emirates. Millions of customers--including\nthe fastest-growing startups, largest enterprises, and leading government\nagencies--trust AWS to power their infrastructure, become more agile, and\nlower costs. To learn more about AWS, visit aws.amazon.com.\n\n     About Amazon\n\n     Amazon is guided by four principles: customer obsession rather than\ncompetitor focus, passion for invention, commitment to operational\nexcellence, and long-term thinking. Amazon strives to be Earth's Most\nCustomer-Centric Company, Earth's Best Employer, and Earth's Safest Place\nto Work. Customer reviews, 1-Click shopping, personalized recommendations,\nPrime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career\nChoice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out\ntechnology, Amazon Studios, and The Climate Pledge are some of the things\npioneered by Amazon. For more information, visit amazon.com/about and\nfollow @AmazonNews.\n\n     Forward-Looking Statements\n\n     This communication contains forward-looking statements, within the\nmeaning of the Private Securities Litigation Reform Act of 1995, including\nstatements with respect to the formation of a partnership between Nasdaq\nand AWS and the benefits of the partnership, and statements about Nasdaq\nand AWS and their respective plans, objectives, expectations, intentions,\nproducts and offerings. When used in this communication, words such as\n\"intends\", \"plans\", \"will\", \"believes\", \"expected\", \"projected\" and similar\nexpressions and any other statements that are not historical facts are\nintended to identify forward-looking statements. We caution that these\nstatements are not guarantees of future performance. Actual results may\ndiffer materially from those expressed or implied in the forward-looking\nstatements. Forward-looking statements involve a number of risks,\nuncertainties or other factors beyond the control of Nasdaq and AWS. These\nfactors include, but are not limited to, factors detailed in each of\nNasdaq's and Amazon's respective annual report on Form 10-K and other\nperiodic reports filed with the U.S. Securities and Exchange Commission.\nThe forward-looking statements included in this communication are made only\nas of the date hereof. Nasdaq and AWS disclaim any obligation to update\nthese forward-looking statements, except as required by law.\n\n     Nasdaq Non-GAAP Information\n\n     In addition to disclosing financial information determined in\naccordance with U.S. GAAP, Nasdaq also discloses certain non-GAAP results\nof operations, including, but not limited to, non-GAAP operating expenses,\nthat include certain adjustments or exclude certain charges and gains that\nare described in the reconciliation table of U.S. GAAP to non-GAAP\ninformation provided at\nir.nasdaq.com/Income-Statement-Trend-Summary-and-GAAP-to-Non-GAAP-Reconcili\nation. U.S. GAAP operating expense guidance is not provided by Nasdaq due\nto the inherent difficulty in quantifying certain amounts due to a variety\nof factors including the unpredictability in the movement in foreign\ncurrency rates, as well as future charges or reversals outside of the\nnormal course of business. Nasdaq's management uses non-GAAP information\ninternally, along with U.S. GAAP information, in evaluating Nasdaq's\nperformance and in making financial and operational decisions. Nasdaq\nbelieves its presentation of these measures provides investors with greater\ntransparency and supplemental data relating to Nasdaq's financial condition\nand results of operations. These measures are not in accordance with, or an\nalternative to, U.S. GAAP, and may be different from non-GAAP measures used\nby other companies.\n\nNasdaq\n\nContact Information:\n\nContact:\nMarleen Geerlof\n+1 (347) 380-3520\nmarleen.geerlof@nasdaq.com\n\nWill Briganti\n+1 (646) 964-8169\nwilliam.briganti@nasdaq.com\n\nBianca Fata\n+1 (646) 895-5851\nbianca.fata@nasdaq.com\n\nYan-yan Tong\n+1 (240) 721-8066\nyan-yan.tong@nasdaq.com\n\nNasdaq Contact:\n\nEd Ditmire, CFA\n+1 (212) 401-8737\ned.ditmire@nasdaq.com\n\nAmazon/AWS Contact:\nAmazon.com, Inc. Media Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\n\nTel   : 212-401-8700    NASDAQ INC\nEmail : investor.relations@nasdaq.com\nWWW   : <a href=\"http://www.nasdaq.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.nasdaq.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300533.MNPRE2133302703-08555720211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}