{"date": "2021-11-07 19:16:31.621000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The Minister of Energy and Mines, Eduardo Gonz?lez Toro, announced yesterday that by 2026 a high percentage of electricity service coverage will be achieved in the country's border areas, through 32 projects (mainly with renewable energies), in 60 districts of the Amazon, Cajamarca, Loreto, Madre de Dios, Piura, Puno, Tacna and Ucayali regions.</p><p>During his participation in the VI Session of the National Council for Border Development and Border Integration (CONADIF), held in Puno, Eduardo Gonz?lez remarked that these electrification projects represent an investment greater than S / 670 million and specified that 13 of these works they are already in operation.</p></div><div class=\"tr-npp-body\"><p>The head of the Ministry of Energy and Mines (MINEM) participated in the event together with the Ministers of Foreign Affairs, Oscar Ma?rtua; of Development and Social Inclusion, Dina Boluarte, among other members of the Ministerial Cabinet and with authorities from different parts of the country, such as the regional governor of Puno, Agust?n Luque.</p><p>Gonz?lez Toro highlighted the importance of joint work between all levels of the Government to promote the integral development of the towns located in border areas of the country, improving their quality of life and providing them with opportunities to strengthen their capacities and productivity.</p><p>Among the projects completed by the General Directorate of Rural Electrification (DGER) of the MINEM, the supply of electricity through renewable energy resources in areas not connected to the grid stands out, which includes the installation of photovoltaic systems in 14,708 homes, 46 workstations. health and 251 schools in Amazonas, Cajamarca, Loreto, Madre De Dios, Puno, Tacna, Ucayali.</p><p>Minister Gonz?lez Toro remarked that access to electricity provides excellent development opportunities for the less favored populations of Peru. In that sense, he announced that his portfolio will continue to promote rural electrification projects throughout the country, respecting the health protocols established to prevent the spread of COVID-19.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}