{"date": "2022-01-25 05:32:17.148000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_j1b4mxuk&amp;referenceId=6292951310001_B35&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_j1b4mxuk&amp;referenceId=6292951310001_B35&amp;pageId=RefinitivNewscasts</a></pre>Source: Real Vision<br/><br/>Description: Bitcoin Satoshi’s Vision is an ambitious project that, so far, has failed to capture crypto investors’ imagination. It was founded to keep faith with the mission established by Satoshi Nakamoto’s Bitcoin White Paper while solving the “scaling” issue. The unlimited block size allowable on Bitcoin SV is a feature, not a bug, according to Zach Resnick and Jackson Laskey, co-founders of and partners at Unbounded Capital. Laskey describes the structure that allows Bitcoin SV to operate as a peer-to-peer cash system without block-size reduction. According to Resnick and Laskey, Bitcoin SV is one of the most undervalued crypto assets. That’s largely because investors don’t understand it. They make the bullish case in an interview with Ash Bennington recorded on January 18, 2022.<br/>Short Link: <a href=\"https://refini.tv/3FRrXC1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3FRrXC1</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Welcome to Real Vision Crypto. I'm Ash Bennington, excited today to talk to Zach Resnick, Founder and Managing Partner at Unbounded Capital, and his colleague Jack Laskey, Founder and CEO of Unbounded Enterprise and Partner at Unbounded Capital. We're going to clear up what that means in just a few minutes. We're also going to talk about BSV, that's the Bitcoin Satoshi version, the future of micro-payments, and something about the scaling debates and the history of Bitcoin and why that remains to be a relevant conversation right now in this space. Welcome, to both of you. &gt;&gt; Thanks for having us on, Ash. &gt;&gt; Thank you. &gt;&gt; So Zach, let's start with you. Give us a little bit of context, give us a little bit of the backstory. &gt;&gt; So, today Unbounded Capital is an investment firm that's focused on scalable blockchain infrastructure. So these are the companies that are using scalable blockchains to transform the world in a variety of ways. As you hinted at, we're really excited about micro-payments today, and we're also really excited about the BSV version of Bitcoin, which from our perspective today is really the only blockchain that's serious about global scale. But we didn't always think that. So when the fun first started, we were investing broadly and opportunistically in the crypto-on-blockchain space, everything from the similar deals that we're doing now in early-stage venture capital to arbitraging, Bitcoin, trading, and everything in-between, because the opportunistic approach worked really well for me and the other founding GP for about a year-and-a-half before the fund even started. But then once we took an outside capital, I brought on a couple of folks including Jack, a dear friend of mine, and we've been working together for about 10 years, together now. We started to get more and more bearish on the crypto and blockchain space as a whole. The more that we learned, the more we narrowed the bucket of ecosystems company's assets that we felt comfortable investing in. And the signal-noise ratio was not good for probably every project that we had a good meeting for, there were maybe 10-20. Either, meetings were looking over misconstrued white papers and we're just like, what is happening in this space and how are we passing on this and they're raising $70 million the next day? This was 2018, 2019. And then a lot changed when me and another one of our partners, who is not on the call today, did more and more, attended the Bitcoin SV meetup in San Francisco. So this was at the co-working space node in North Beach, and David and I had a meeting that day where we were just meeting entrepreneurs at the space, and then we saw on the calendar, oh there's this BSE meet up later. And at the time like most folks in the crypto space today, we didn't do any meaningful diligence or put thought into the question of Bitcoin scaling or the Bitcoin SV and Bitcoin cash ecosystems. We fell victim to a lot of the misinformation around Bitcoin Cash, Bitcoin SV, and a lot of the prominent people in those ecosystems. So we thought this space was a joke. There wasn't really much to be learned, but we at least identified as contrarian and diligent investors. So despite not really doing our homework, we're like, let's attend this meetup and see what these jokes just have to say. And it was mind-blowing. So my experience up to that point was that every meetup, every conference that I went to did not feel like this. It felt like that scene in the big shot where they go to Vegas, the height of the real estate bubble, but just to add in some colorful suits and psychedelics. And entrepreneurs were typically more than happy to tell you about the trades they were doing from their PA or even worse from the treasury of their funds rather than the product that they were building. And it had this very speculative, just sleazy atmosphere. The BSE meetup did not feel like that. Not once did a single person mention the price of any crypto asset while we were there, and David and I felt like the dumbest guys in the room. It was a lot of really technical entrepreneurs and developers and engineers that wanted to be entrepreneurs, some of which actually became quite successful ones that we are now close with today. &gt;&gt; Well, Zach, my job is always to be the dumbest guy in the room. So let's talk about this. Let's unpack some of these ideas. Obviously, there's a lot to discuss, there are some of it controversial. Tell us a little bit about what BSV is and why it's so significant, in your view, at Unbounded Capital? &gt;&gt; So I think this gets to the history of Bitcoin. So there's a lot of misinformation on what the history of Bitcoin is. Most people think that the popular version, BTC, is what Bitcoin has always been. Well, really, I think it's an unfortunate accident of history that today that's the most popular version of Bitcoin. When Bitcoin was created, when the white paper came out, the idea was for a pure to pure cash system and a version that scaled. Satoshi wrote that at the time that Bitcoin came out with existing hardware and software, it could scale beyond the Visa network, and that was true. And today on BSV we're actually seeing it, and some of the metrics we think matter most, is scaling beyond Visa. But we'll get to that a little bit later. So what happened was, as Bitcoin kept growing, there became more and more people within the Bitcoin community, especially the Bitcoin developer community that didn't want Bitcoin to scale for political reasons of the anarchist and libertarian persuasion. &gt;&gt; So this is a very key and very controversial assertion. Talk to us a little bit about what that means. We're going back now, I guess to 2017 and before, with the Bitcoin scaling debate. Obviously, this is still something that's controversial in some quarters today. Explain what you mean by that assertion that there were libertarian reasons that prevented scaling on Bitcoin? &gt;&gt; I don't think it's that controversial. These are public statements. This is the argument, but if Bitcoin scaled, and I'm not talking about putting layer twos and threes on top of Bitcoin and calling that Bitcoin scaling, I'm talking about the network actually scaling through more transactions and bigger blocks. If the network scales the problem that are more anarchist or libertarian-oriented, is that then the network becomes too big to run the notes software on your phone. And if the network is too big to run the notes software on your phone, that means if governments ever tried to amend the ledger or sensor transactions, then you couldn't illegally resist that easily using your phone at home. So that's the main motivation behind capping the size of blocks at one megabyte, which is true for the BTC version today, and why the Bitcoin Cash community, which then branched off into Bitcoin Cash and Bitcoin SV, wanted it to keep growing and scaling. So the primary difference between the two versions, Bitcoin SV and Bitcoin core, the popular version, is that BTC has a one-megabyte cap on the size of blocks, and Bitcoin SV has no limit. So today we've seen it get to two gigabytes on-chain, four gigabytes on the test snack, and we think that we're going to get to a world where there are petabytes on-chain, and this is the largest and most important database in the world. &gt;&gt; We've already covered a great deal on the ground here in the first five minutes. But I want to pull in Jack Laskey. Jack, obviously a lot of key concepts that we've just been discussing here, particularly around the trilemma, give us a little bit of a context on the difference between Unbounded Enterprise and Unbounded Capital, and your sense of some of the conversation you've heard so far today. &gt;&gt; Sure thing. Briefly, on the distinction between Unbounded Enterprise and Unbounded Capital, Unbounded Enterprise is a company that builds software. We're both an infrastructure provider and also a game publisher. And our macro thesis as a company is that micro-payments and the type of commercial systems that are possible through micro-payments can really transform the way that we build applications. And our initial focus today is on games. &gt;&gt; So just to break that down for people who are trying to get their heads around this. Basically, Unbounded Capital is focused on investment, Unbounded Enterprise is focused on software development and solutions development, both of which are focused on the BSV Bitcoins Satoshi version ecosystem as the primary focus of what you guys are doing on both sides of the house? &gt;&gt; Yeah, exactly. And a lot of the convictions that I had developed through my work in Unbounded Capital around how blockchain could be used in extremely valuable ways, just weren't really being implemented. Even on BSV we all have our own individual conceptions of what are the right strategies and pass to take. And I just felt extremely compelled to take what I've learned and then apply it in an operational setting. So the company's that we're linked through branding and some shared personnel, but with very different types of day-to-day activities. &gt;&gt; And, Jack, your background is in traditional software development. Tell us a little bit about that and how you got into this space. &gt;&gt; Well, I think traditional software development might be an overstatement. I went to school and I studied computer science and jazz piano. My passion was music and computer science and software engineering was a means for me to support the nascent stages of a jazz career. I had heard that jazz was not necessarily the most lucrative career, and so that I might need some income supplementation. &gt;&gt; I worked in software for a while and I ended up discovering that I can make a lot more money playing poker. So I was really focused on playing poker until Zach pulled me into embedded capital, where really the types of skill sets that you develop playing poker combined with my background in computer science, Zach felt I had a lot of potential to have a good understanding of what was happening in the space. He was right. Those skill sets in conjunction feel really what is Bitcoin it's this union of technology and information bit with money in economics coin. That combines skillset was really valuable for me and being able to make headway in understanding what this technology was but also how it interacted with business in an economic sense. &gt;&gt; So as you begin to understand this technology, what did you see in terms of its potential applications? Why were you so excited about it and what did you see the future beginning to look like based on your view of what was happening in the present? &gt;&gt; The main value prop ascribed to blockchain today is decentralization and the types of benefits that are attributed to decentralization. What really got me excited though, was seeing another path for blockchain which was scalability. Zach referenced the white paper which in my early days of trying to learn about crypto. Of course, I read the white paper but I didn't give it that much attention because we were getting so much deal flow. There were so many investment decisions that had to be made, companies that had to be analyzed that really immersed in the day-to-day of trying to always evaluate the next thing, the next opportunity. What's asserted in the white paper is basically that blockchain is a scaling technology because what the white paper lays out in the introduction is that the problem that Bitcoin solves is the inability to make small casual payments on internet. And small implies that the current transactions are too expensive, which is the case. And being able to surpass those transactions from a price standpoint implies greater scale and so essentially Bitcoin is presented as this payments scaling technology. And so really the intellectual journey of getting from this point where we have these assumptions that are baked into regular crypto discourse. Assumptions like blockchains don't scale, the proof of work is somehow if the root of this lack of scalability and that because it doesn't scale there must be some other important value prop, that is at the heart of crypto in the debt value prop is decentralization. Being able to sort of compare these two worldviews and especially explore the very rich, history of looking at Bitcoin as a scaling solution and how that has manifested today in lots of different companies who are pursuing that vision in different ways. That ladder and I would say original vision for Bitcoin, just ended up being extremely exciting and captivating not only because of its enormous potential but also because it is very much underserved from both an investor and entrepreneurial standpoint. There's a lot of resources, both human capital and investor capital that pour into the decentralization value prop, which is best articulated by the theorem in the various Ethereum competitors who are trying to copy that model. In contrast there's very little human and investor capital that's going into this blockchain as a scaling solution for payments approach, which is actually a much larger opportunity. &gt;&gt; Well Jack perhaps what you said was true when we first started focusing on the BSV ecosystem after Dave and I went to the meeting in March of 2019, but I don't think the human capital pieces is accurate any longer. As right now for some context we're working on and probably by the time this comes out, we'll have our first comprehensive list of all BSV companies and projects finished. And from our count right now we have over 800 companies and projects that are built on BSV. Recently we saw Solana Labs release something to the effect of there's about 500 companies and projects built on Solana. So I definitely don't think they'll venture dollars in the Solana ecosystem is less than the BSV system but in terms of human capital and entrepreneurs developers. From our understanding BSV is right now the second largest entrepreneurial and developer ecosystem in the crypto blockchain space outside of Ethereum. Most of the time when I tell this to people, they're like, wow how could that be the even, I've never heard of it? Which is why we've been embarking on this long let's track everything that's happening in BSV. As venture investors when you could find something when there's a ton of human capital and not a lot of venture capital. It's quite lucrative from the standpoint of a fund like ours, as we hear about all these skills that are oversubscribed at $100 million evaluations for just an idea with some smart developers. Were for us we get to largely set the terms of deals at 10 and some $10 million evaluations for really incredible companies being built on BSV. So just thought I'd add that in there for some color. There's a lot of misconceptions on what the BSV ecosystem is today and how it's just cavalier or create. Really there's a large amount of entrepreneurs around the world that are choosing to not just build their business but really kind of stick their livelihood and their finances on the future of micro-payments. &gt;&gt; Hey Zach I know this is something that you're very passionate about. You mentioned the comparison between BSV and Solana. I know that they're going to be a lot of cynical people in the comments who are going to say that the market capitalization of BSV is around $2 billion, the market capitalization of Solana is roughly 20 times that. How do you address that critique? &gt;&gt; So I think that comment critique of life will be if BSV so good why don't more people bet on it compared to my preferred crypto religion. Actually it really illustrates the difference in the common crypto and blockchain investor or speculator approach to what we're doing. While I do think that buying the BSV token is a great risk adjusted bet are better than matter of capital and that an enterprise is more so on the future of micro-payments and what this technology can do for companies. So the metrics that I focus on as an investor are, what allows for the fastest and cheapest and most secure payments, what allows for the most secure ways of organizing and sharing data. And on those metrics BSV is either number one or very high up there relative to not just blockchain solutions but even non blockchain solutions. So from our perspective the fact that not a lot of people are speculating on BSV the asset or speculating on early stage BSV companies is really great for our investment firm because it means a lot less competition and a lot lower prices. So what I would say to people is, if you care about the long-term adoption of technology and if you think that is going to be where the value drives then those might be better for looking indicators and the current market cap. That gets to the heart of this which is that most people don't actually really believe in crypto and blockchain they're speculating on these, largely going to be worthless tokens. They are trying to make money and they've justified to themselves and to everyone else, after the fact where they're really solving for how do I make relatively quick buck of owning some type of token in appreciating. Where they don't really believe that the long-term value come from people using it at scale. &gt;&gt; We'll check that tease it up nicely for you, to give us a little bit of background and context on micro-payments you're actually building in the ecosystem. Where do you see the use cases for this and why do you think those use cases are so significant in terms of potential disruption to the traditional way that we do payments and finance today in the legacy system. &gt;&gt; It's a great question. To understand the value of micro payments, you have to understand it in context and I think that the best context in which to understand the value is SAS, software the service. Do you think the audience would benefit from a definition of SAS or no? &gt;&gt; Yeah absolutely a definition and tell us a little bit about why SAS has being such an important idea in terms of Web 2.0 applications. &gt;&gt; So SAS is, it stands for Software at Service and basically, what SAS is delivering software through the Cloud. And you can look at things like Google Docs compared to the way that Microsoft Office was traditionally done where instead of you install the software on your computer, you'd use it locally, you have all your documents stored locally. Instead you're using a cloud-based service, all of your documents are stored in the Cloud, you didn't have to install anything, you can access your documents from any computer. And you can even share your documents with someone else, you can have multiple people working on the same document at the same time, you can make a similar comparison between a DVD and Netflix. And we've all used SAS products so this went time were at least some confidence everyone in your audience has and it has become extremely dominant because it's just a much better user experience but it brings up some really significant problems. The thing that SAS companies have to deal with the traditional software didn't, is the fact that on top of the development costs to software, they have this ongoing operational cost. Every time someone watches Netflix or uses Google Docs, Google, Netflix they have these ongoing costs related to Cloud on the data storage costs, competition cost, the networking cost that go into delivering that product. And that's why companies like AWS, are bringing in such huge revenue numbers it's because all of these companies are shifting to SAS they need these Cloud services they're using companies like AWS. Now because these companies have recurring costs, they've adopted different types of payment models. So instead of something like I pay a $100 upfront and I get my Microsoft Office 2007 license. &gt;&gt; You'll have something like Netflix with a subscription model or very often ad based monetization methods when a subscription is not really possible or practical. These types of monetization models, they pose a lot of very significant problems both to businesses and to users. What micro payments allow us to do is really transcend the problems posed by ads, the problems posed by subscriptions. I'm happy to talk about what those problems are. Instead pay for software in a totally different way by paying as you go for what you use. Where often that marginal unit of software usage is a very small value type of service or product not something that can justify a credit card payment with the payment minimums, which are typically around $0.30 and also the payment friction that's required to make a credit card payment. We think that micropayments, being able to make payments economically well below a dollar all the way down to one one thousandth of a cent. Instantly securely without putting in any personal information that this is going to allow this transformation where software is now Cloud oriented to really take the next step in moving past some of the problems posed by ad and subscriptions. &gt;&gt; Jack, that's a very elegant description of this bridge between Web 2.0 SAS and then the necessity of micropayments to begin to continue, I should say, to fuel and power that ecosystem of software where perhaps the value transferred is very small and currently the friction and costs are relatively high compared to perhaps the value that might be extracted in those transactions. A very elegant frame for that. Zach back over to you as you think about the investment side of micropayments, give us a little bit more contexts or some of the use cases you see. &gt;&gt; Yeah. So a company that we'd like to talk about is a company called Twitch which is like Twitter on Bitcoin. With Twitter and with pretty much all existing popular social media platforms, the users are the product and it's free to use. And your trading your time and attention to be able to use this product. Twitch puts it a little bit differently, where every comment, every like, every post, you get charged something and you get charged an amount that is much less than what credit card companies charge you as a minimum payment. So you need like a scalable micropayment system like Bitcoin on VSV to be able to operate this. I don't think our expertise isn't picking the next big social media companies. Twitch they use three core infrastructure companies as part of their stack. And we were the first or one of the first investors into those companies. &gt;&gt; Well let's take a little bit of time and dive into that. So what are some of the reasons you see why it makes sense to switch from Ethereum ecosystem to the VSV ecosystem. Give us a little bit of a context, a framework to understand why those who were making this switch have made that switch. &gt;&gt; A lot of it is around being longer-term oriented thinkers and builders. Where today if you're trying to figure out a way to turn an idea and smarts into millions of dollars for yourself in the next year or two, building on VSV is probably not your best choice. Probably building on a theory or Solana is because you can start a token, raise venture capital easier probably than ever before in history, and justify taking a little bit of liquidity or secondary for you soon after that. And fixed gaming previously called coronaverse, they didn't they raised millions of dollars from the Ethereum community. But the problem is because Ethereum is just really a network that can't scale by design, similar to something like BTC. As you hit some degree of adoption, it gets even harder to work. And I think crypto kitties is the best example of this. Where dapper labs they built crypto kitties, got a lot of adoption and then it made the Ethereum network so slow and expensive to run that the ability to really play and use that game went down the tubes and they created their own blockchain and now it's viewed as a success story. But you have this unfortunate dynamic where the more people that use your application or your company on Ethereum, the more expensive and slower the entire network is to operate. And that dynamic is really true for all account based proof of stake systems. So Solana, Avalanche all these ethereum killers, or maybe there are 500, 1,000, 2,000 times more scalable than Ethereum. That's still peanuts to where we think Bitcoin in the form of VSV is going. And can really just good for these like high dollar amount De-Fi things and not really for the global model of applications and accompanies that we're seeing on Bitcoin today. So with something like VSV, the median transaction fee is actually gone down over time and it's become cheaper to operate. If I'm someone that's trying to build my business and have it lasts for 5,10,20 years, do I want to build on a system that's getting cheaper for me to use overtime or one that whenever I get a little bit of adoption, it becomes much more expensive? And if another competitor build something completely different, say like an open sea, and they drive the gas fees up 5X on a day that they put out a lot of NFTs now really materially affects my business. &gt;&gt; This is really interesting because we're breaking down these different use cases between the micropayments use case and some of the larger transaction value use cases. I'm sure if there was someone here from Ethereum, I'm sure if Vitalik were here, he would probably say we know that these scaling issues have been a problem on Ethereum. Things have not stayed still since the crypto kitty days in 2017. Obviously Bitcoin is continuing to move. Ethereum is continuing to move. We see development across the space, but give us a sense and both of you guys just jump in and talk a little bit about what some of those technological drivers are that make in your view VSV the superior technology for micropayments? &gt;&gt; That's a great question there. I think it has to do with benchmarking in a sense. If you return to the white paper, the assertion in the white paper is that Bitcoin is actually more scalable than traditional payments. But I think that what we've seen over the last decade and crypto is that assertion has been replaced with the assumption that Bitcoin is not scalable, crypto is not scalable. And therefore the goal is that traditional payments are really the standard when it comes to how efficient a payment can be. And the goal for cryptosystems is to try and approach that standard of let's say a venmo type experience and that level of scalability. &gt;&gt; I think what a lot of companies who use a theorem very well. And when I say very well, I really mean it. I think that they have harnessed a platform that is extremely not scalable and managed to make do with it. You can look at businesses like Axiom infinity with their Ronin side chain. And I think that what these companies have been able to start doing is basically use something like a theorem just enough to be able to claim some of the benefits that come from using a theorem and then return to an architecture more similar to a traditional payment system. But I think that what people have missed is that it's actually the architecture of Bitcoin that allows you to transcend the traditional payment system. And the best way to describe what that architecture is is UTXO. It's a UTXO system as opposed to what the standard is for payment systems worldwide, which would be account-based systems. &gt;&gt; But let's just break in and talk about these unspent transaction systems because I think this is an important point for people who may not be as familiar with the technology to understand. &gt;&gt; Big point when it's a peer-to-peer electronic cash system. So it's a weird name. It's not a peer-to-peer electronic payment system , is a cash system. So what does that what does that actually mean? What is cash? Cash comes in these specific units and when you make a payment in cash, you have to sometimes do things like I give you $10 for something that costs $5 and you give me back $5 in change. So this is really different than how you would pay with a credit card, where I pay and my account gets debited at your account gets credited. And we never have to deal with that problem of making change. Bitcoin is actually designed much more like cash than it is these accounts systems. What a UTXO is, is basically you can think of it like an envelope that requires a certain key to open. And once you open that envelope, you take out a certain amount of tokens which are contained in that UTXO, that envelope. And then your job is you'd have to assign each of those tokens to a new envelope. So if I want to pay you $5 and I opened a $10 envelope, I'm sending you $5 worth and I'm sending myself into a new envelope that I control, a new UTXO, another $5. And maybe I have a 1,000 envelopes that each have $0.01. In order to pay you $5, I pay you 500 of those envelopes that open them up and I send you all the $0.01. So it's wonky in a sense. I think it's intuitive because you would look at the account based system and say, well, this makes lot more sense. You just have an amount of money associated with your account. And you have a system of debiting and crediting where when I make a payment, I get debited and you get credited. Very simple. Why introduced the complexity of cash to an online payment system to make it more efficient? And the answer comes from it, it's based on transaction ordering, and the ability to parallelize the system. And the key concept is that with cash, you can evaluate each one of those envelopes independently. You make sure that the key opens the correct envelope and that the value of the envelopes you're now feeling is less than the envelopes you just opened. With something like an account-based blockchain like Ethereum or even traditional payment methods, it can become very complex to order the transactions to make sure that they actually work. So here's just a very easy to understand toy example. Let's say I have an account with $1 of Ethereum and you Ash have an account with $0 with Ethereum. I send you $1 in a transaction, then you send me $1 back, and then I send you $1 again. Well, if those transactions are evaluated in the correct order, they're going to work. My dollar can be sent to you, I get debited, you get credited. You send it back to me, you get debited, I get credited, and I send it back to you again. But what if those come out of order? What if the first transaction that's read is, you send me a dollar worth of Ethereum. It fails. Then I send you a dollar that works, then I send you another dollar, and that fails. In this hypothetical example, we still ended up in the right situation because it was a stupid thing to do. But the point is that when you're dealing with a system of credits and debits, there is not an implied ordering whereas with this UTXO of data structure, there is always a very explicit ordering of the way each of these tokens is moving from one envelope to the other. And that is really the key to scaling past where traditional payment systems were able to get to. &gt;&gt; It's so interesting for people who are listening to this, who are traditional financial backgrounds. Undoubtedly they will be thinking about the distinction between gross and net settlement systems here in the United States between, basically the ability to do things out like Fedwire, which settles on a gross basis, and then the less expensive systems that you would be transferring money, for example, to a trusted party with it can be reversed that would settle on a net basis. So these are our concepts that we should already be familiar with. People who have these traditional financial backgrounds. So it makes you think that perhaps we do have a number of ecosystems out there with different applications, different purposes, and potentially different technologies underneath them. &gt;&gt; Yeah, I'd say our assertion is that like a count-based Ethereum like blockchain, of which I think Solana is definitely one of the better implementations of doing that quickly. Not necessarily doing it securely or in a robust way, but doing it securely getting a lot of adoption. It's quite good for De-Fi. And I think a lot of people within crypto and blockchain utify is the future of finance and of the most exciting opportunities here where we viewed that as maybe a tiny sliver of what the future of payments and finance is going to be and that a scalable cash-like system is much better for that. &gt;&gt; So as we talked about all these metaphors, like the difference between Fedwire and ACH, we talked about the future. Let's also talk a little bit about the past, the context for how BSV has risen. Obviously, I think in passing you mentioned Zach, Craig Wright, who was obviously a very well-known and controversial person in the digital assets space. But for people who are relatively new to the space, who are investors, they may have never heard of Craig Wright, and they've probably not heard of the scaling debate. Give us a little bit of the context, a little bit of the history their, Zach. And also talk about why that's still such an important part in forms where we are today right now in this conversation. &gt;&gt; Sounds good. I'll start with the scaling debate then go into history of Craig Wright. So Bitcoin was always scaling when it came out. But then after the Silk Road, it attracted this more like anarchist, libertarian oriented developer community as that was the first killer app or how the coin was used in a broader way outside of the small developer and cryptography focused community. And then this debate started in a nascent way and then became really got quite heated. &gt;&gt; '15, 2016 and then you saw the fork in 2017 as a result, where the question was just, should bitcoin scale and should we take advantage of the economies of scale of mining? Or should we not allow it to scale so that we could potentially more easily or legally resist government intervention in the future? And that latter view is what went out and what is embodied in the BTC version of bitcoin today, where the blocks are kept at one megabyte so everyone can run the note software on the phones. And the idea is that by being \"decentralized\" where you have many people running the notes software, if governments were to try to sensor or amend the bitcoin ledger and say with a court order to miner or say, hey, you need to take this money that's in the wallet of a Chinese fentanyl dealer and put it to our account or take it away from them. The miners and the vast majority of hash power today on BTC, these are regulated businesses, and the Western world and non-Western world doesn't matter. There's still, you know where these companies are and they'll have to either ignore that order illegally, shut down their business or comply. Where the loan anarchist individual can have a raspberry pi or an unregistered phone and continue mining or running the notes software, and that's why a lot of people think that BTC network is very secure. I think our point of view is that that's a bit naive, and that if governments are going to want to amend or sensor transactions, they are likely going to be able to. So try to take advantage of economies of scale by Bitcoin scaling and not limiting the block size. It makes a lot more sense and in practice you have quite similar degrees of miner centralization or decentralization on BTC and BSV, because ultimately the bigger you are as a miner, for the most part you're able to more cheaply manufacture or discover a bitcoin. So if you're going to make more money by being a bigger minor and putting infrastructure investment, that's typically what's going to happen. &gt;&gt; Yeah I mean obviously these are very loaded, contentious, occasionally controversial topics because of this political philosophical disputes that undergird them, but talk a little bit about how BSV arose, the scaling wars of 2017 and the forking because I think this is an important thing for people to understand who we're trying to get their head around where BSV came from and what it's relationship to BTC is. &gt;&gt; Yeah and what I say that these more anarchist libertarian point of view I don't say that with derision I'm a libertarian. I just think instead of openly being antagonistic to all governments financial regulators central banks around the world, there are much better ways of achieving freedom and prosperity for everyone. So just wanted to put that out there that I think is the combination of those more extreme views plus lot of naivete around how things are going to play out, but you know that if you ultimately went out where there's a space should we capitalize a block? Should we allow it to keep scaling? And then ultimately, the Bitcoin core, many of the Bitcoin core developers, they were able to convince a slight majority of miners that, hey, we need to implement something called Segwit. We need to really not allow block size to go beyond one megabyte. &gt;&gt; This Segwit you're talking about is segregated witness. This was a mechanism for removing the Bitcoin signatures from the core of the chain and segregating them out into a different component. &gt;&gt; Yes. So this view on changing Bitcoin really limiting how much it can grow. They were able to convince a slight majority of miners in 2017 to change the software and do this, and because they were able to convince that slight majority when the network forked or went into two different directions, one that kept scaling and one that didn't, the one that didn't was able to keep the BTC ticker because they had that slight majority of support from miners. &gt;&gt; Any idea behind BSV is that this is the original Satoshi version meaning segregated witness was never implemented in the block size then more traditional in terms of what was seen in the original white paper. &gt;&gt; Yeah the main difference between the different versions is that BTC is a one megabyte limit, Bitcoin cash is a 32 megabyte limit and BSV has no limits. So in practice we've seen two gigabyte blocks and we think it's going to get much bigger and that's what we're hoping for. The other two things are you have robust smart contracting on BSV so originally on Bitcoin you had turned complete smart contracts. Probably most people don't know about this because they're just familiar with the BTC version that removes smart contracting before the fork, and we think that the ability to write scripts to do smart contracts is really essential for the future of Bitcoin scaling and gaining adoption. And then also it's just how the developer communities treat the protocols. So with BTC and with most blockchains, it's treated more like a software company where you're always iterating and changing it rather than something like the Internet, which you take a core group of protocols and you haven't really changed them for over 20 years. &gt;&gt; TCP/IP basically. &gt;&gt; That's one of the different protocols that we're using right now to communicate. We haven't seen any changes to those protocols in many years because that's the type of stability that's needed for governments and large enterprises to take advantage of this technology, and there's a similar ethos within the BSV community where this is Bitcoin. The innovation is going to happen at the hardware and software level on top of it, it's not going to happen by continuing to change the rules and augment or change the protocol. And from our perspective, when you look at the metrics that we think matter a lot like speed of transactions, costs of transactions, we think that approach has empirically shown itself to be a better approach for the vast majority of use cases for taking advantage of public databases. &gt;&gt; And let's talk a little bit here also about Craig Wright. Again assuming that our audience may not have heard of Craig, obviously he is probably the best-known person associated with BSV. Tell us a little bit about Craig Wright, his claims at being Satoshi and his relationship to the BSV protocol. &gt;&gt; So Craig Wright is an Australian computer scientist, doctor, lawyer, lots of different titles and work experience, and he was also early cryptographer while before Bitcoin, and he is someone that in 2016 was outed by wired magazine. So wired magazine likely got a tip on, hey, here's why this guy is Satoshi Nakamoto and they ran a story being like, hey, this guy is Satoshi, and the day that that happened, the Australian tax office also raided Craig's house. So for the first maybe nine months of that, Craig denied this publicly and then felt that there was too much evidence out there to basically deny that he was Satoshi and said, \"You know what actually I am Satoshi. Here's why I was denying it. I was worried about my risk after the silk road started on my invention, so I went dark after that and didn't want to be associated with a network. There are also a lot of personal tax and financial reasons for doing so\". Then he said he was going to publicly sign keys in a way of cryptographically proving that he was Satoshi Nakamoto, and for a number of reasons that the last moment when he was about to be on British TV and do so, he pulled out of doing that. Basically since then, he lost. &gt;&gt; We should say for people who are still relatively new to the technology, signing these transactions would have been the gold standard mechanism to prove that he was in fact Satoshi, basically proving based on the early transactions that were in the Bitcoin blockchain that he was in fact in control of those keys, and because he has not done so for whatever his reasons may be, there is that question around that assertion of claim of ownership of being Satoshi. &gt;&gt; I would just put back a little bit on that being the gold standard the same way that if I mug you on the street and take the keys to your apartment, I don't own your apartment. I think for a number of reasons, Craig signing keys would be the thing that convinces the crypto and blockchain, and then as a second order effect, the larger global community that he is Satoshi. But a point that he has been quite consistent on, that we largely agree with is that ownership is not just a cryptographic thing, and the value of blockchain isn't changing our system of laws and ownership and making it where it's not your keys, not your wallet. We view that as largely a step back rather than a step forward in terms of how people think about ownership, and that the ability to own something even after you maybe get robbed or mugged or stolen is a feature and not above. &gt;&gt; Yeah. Craig has always been even before he was outed as Satoshi Nakamoto on the side of, hey, we should scale bitcoin. Here's what bitcoin can do when it doesn't have this limit on block size, when it has trained complete smart contracts, and written, published quite extensively and consistently on that from before as Satoshi Nakamoto and through the present day now. And as a result, his company called [inaudible 00:46:15], which I think employs around 1000 people around the world doing massive infrastructure projects with world governments and large corporations. So as a result of his Satoshi Nakamoto question and the coverage on that. And his company being definitely the largest BSB company by most metrics. He is the primary person associated with BSB. And as a result, because most people don't think that Craig is Satoshi and most actually in crypto would go a lot farther and say, this guy is a fraudster and a scammer. For a lot of people in crypto, that BSB ecosystem has quite a negative first reaction. And most of you will act like a very layman's negative understanding of this ecosystem almost solely due to a lot of misinformation on Craig Wright and Jack and I were personally guilty of that up until I attended this Bitcoin SV meetup in San Francisco. Despite trying to be a smart, diligent investor, managing other people's money. I missed it. The vast majority investors fiduciaries today are missing it today as well. &gt;&gt; And the interesting thing about Craig is that while there is some dispute around that claim, I don't think anyone disputes that he was involved very early in the Bitcoin space. He's obviously a brilliant computer scientist, engineer, statistician, mathematician who has a very extensive background in this technology. So obviously a really interesting personal story for people who are just hearing about it for the first time. It goes much deeper than that. Jack, I wanted to bring you in. I knew you had something to say. &gt;&gt; I think that Craig is a really important instead of central character to this whole story. I do want to mention that even though there was not a public signing, Craig did sign privately for a number of people, including Gavin Andresen, who was the lead developer for Bitcoin at the time. Interestingly, when Gavin came out and said that he saw this signature from Craig and that he believed Craig was Satoshi, he was removed from the GitHub where different code is developed and managed the following day, I believe. And I would also say that a lot of people form their opinion about Craig back in maybe 2016 when this was really happening. And in the ensuing six years, we've just have so much more information about his story. A lot of that coming via court cases that he's been involved with. And we also have a lot more information from him about his views about Bitcoin. And I think that one of the most important roles that he's served for BSB is not necessarily because he's Satoshi, he's right about Bitcoin. But more so that I think he's one of the most sophisticated advocates for Satoshi's vision for Bitcoin. He has been able to explain a lot of things about Bitcoin that were previously unexplained. And I think a lot of the information that people who have listened to Craig, regardless of whether they believe that he's Satoshi or not, they've been able to use that information to, I think, act with Bitcoin with a much higher level of conviction than what was possible without some of these explanations for Bitcoin and its features that were not necessarily available to people who were developing Bitcoin in the early days, where I think that part of the reason that BTC, for example, aired so far from the original vision laid out by Satoshi is because the explanation of Bitcoin was really incomplete at that point in a conviction of, can this actually be a globally-scalable micro-payment system? People did not necessarily have that conviction the way I think that people who are building on BSB do now, in large part based on the explanations and arguments provided by Craig Wright about Bitcoin. &gt;&gt; So obviously a lot of divergent points of view on this topic, but it's inside baseball. And I want to make sure that people who are getting to the conclusion of this conversation come away with some of the big points here that we don't miss. So Jack first to you, final thoughts, key takeaways about the importance of micro-payments and your view of the future of the digital asset ecosystem. &gt;&gt; Yeah, I think that a lot of the investor attention in the crypto space has been given to the value proposition of decentralization. That a lot of the blockchains, they really focus on a certain view of what decentralization means as the primary objective. And I would say that the big takeaway from my opinion from this conversation should be two. If we're right, in that Bitcoin is a scalable technology that can bring micro-payments. And I think it's worth it for investors to give serious thought to what would the value of that type of technology be? And how would businesses capture that value? And I think that what many will find is that this is potentially a much bigger opportunity in part based on the way that it allows for this evolution, beyond the current limitations on SAS, it's a much larger opportunity than what is presented by the decentralization thesis of Bitcoin and blockchains value. &gt;&gt; Same question over to you. I know we've had a lot of detailed conversations here, some of which are probably a little bit in the weeds for people who are relatively new to this space. Give us the 50,000-foot overview on micro-payments and where you see this space going. &gt;&gt; Yes, we had to add to what Jack said there, but I'll just put on my investor hat, which is really simply whether you agree with us about the BSB ecosystem, about Craig Wright. I think it's really hard to disagree that micro-payments are going to usher in lots of new businesses and business models that were never before possible. And I think trying to focus on those ecosystems is going to yield outsize returns. And we don't really see largely due to the technical limitations and ideological dispositions of the different other crypto unblocking communities on this focus. So today is what I see as a golden era for those that are focused on ventures that are building on BSV because you're attracting some of the smartest and most diligent entrepreneurs that are trying to take advantage of this. But you have very little competition from the investment side in terms of people that I think share this thesis. And in general, I think as an investor, you want to bet on the smart entrepreneurs, not necessarily the lattice people on Twitter. And I think that's what's been really nice about us investing in this ecosystem where the signal-to-noise ratio is almost flipped on its head once we started focusing on BSV, where of course we still want to invest in the majority of projects that we come across now. But the quality of each meeting is largely high. And that to me is the most bullish thing for this ecosystem, which is, don't, I just say for everyone as always do your own diligence. And especially when it comes to this topic, look at what the entrepreneurs are doing. Don't look at what the different crypto, new sites or influencers are saying. &gt;&gt; I think many of those points very well said. We tried to focus on spreading light and not heat here at Real Vision, obviously some controversial topics, but I think we did a great job here in unpacking some of the big concepts. Zach, Jack, thank you both so much for joining us. &gt;&gt; Thank you, Ash. &gt;&gt; It was a pleasure. &gt;&gt; Thanks for watching, everyone. &gt;&gt; Welcome to the end of the video. We know that on average, 85% of you who started with the real vision finish it. That's extraordinary. On Facebook, it would just be 4%. And that's because real vision creates the most engaging content in the entire media world. Let us help you grow your business by making video content that really engages your customers. Email us at customvideo@realvission.com.<br/></span></div></div></div></div>"}