{"date": "2022-02-09 04:12:39+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n                  <p>\n          Common Elemental Technology Development Project adopted as NEDO Green Innovation\n        </p>\n                  <p>\n          Fund Project for Reducing the Cost of Offshore Wind Power Generation\n        </p>\n                  <p>\n          ~Joint Development between Electric Companies and Technology Development\n        </p>\n                  <p>\n          Manufacturers for Solving Technical Issues Common to Floating Offshore Wind Turbines~\n        </p>\n                  <p>\n          February 9, 2022\n        </p>\n                  <p>\n          TEPCO Renewable Power, Inc.\n        </p>\n                  <p>\n          Tohoku Electric Power Co., Inc.\n        </p>\n                  <p>\n          Hokuriku Electric Power Company\n        </p>\n                  <p>\n          Electric Power Development Co., Ltd.\n        </p>\n                  <p>\n          Chubu Electric Power Co., Inc.\n        </p>\n                  <p>\n          The Kansai Electric Power Co., Inc.\n        </p>\n                  <p>\n          Shikoku Electric Power Co., Inc.\n        </p>\n                  <p>\n          Kyuden Mirai Energy Co.,INC.\n        </p>\n                  <p>\n          Sumitomo Electric Industries, Ltd.\n        </p>\n                  <p>\n          Furukawa Electric Co., Ltd.\n        </p>\n                  <p>\n          Toshiba Energy Systems &amp; Solutions Corporation\n        </p>\n                  <p>\n          Mitsubishi Electric Corporation\n        </p>\n                  <p>\n          The Common Elemental Technology Development for Low-Cost Offshore Wind Power Generation Systems Project (hereinafter referred to as, \"the project\") jointly proposed by TEPCO Renewable Power (Managing Company), Inc., Tohoku Electric Power Co., Inc., Hokuriku Electric Power Company, Electric Power Development Co., Ltd., Chubu Electric Power Co., Inc., The Kansai Electric Power Co., Inc., Shikoku Electric Power Co., Inc., Kyuden Mirai Energy Co.,INC, Sumitomo Electric Industries, Ltd., Furukawa Electric Co., Ltd., Toshiba Energy Systems &amp; Solutions Corporation, and Mitsubishi Electric Corporation was adopted today as an offshore wind farm electrical system technology development project; a part of the New Energy and Industrial Technology Development Organization (NEDO) Green Innovation Fund project for reducing the cost of offshore wind power generation.\n        </p>\n                  <p>\n          There are great expectations for offshore wind power as a baseload power source in order to achieve carbon neutrality by 2050. While the cost of development of offshore wind farms in Japan is higher compared to other countries, the waters around Japan, which are not very shallow, are better suited for floating foundations compared to Europe where bottom-fixed wind turbines are more common.\n        </p>\n                </div>\n                <div>\n                  <p>\n          The joint council<span>*1</span> established by technology development manufacturers and electric companies as part of this project seeks to reduce the cost of equipment and installation/operation costs associated with high-voltage dynamic cables<span>*2</span> and floating offshore substations/power converter stations, etc.<span>*3</span>, which are common issues faced when developing floating offshore wind power generation systems. In particular, technology development manufacturers shall develop technologies in anticipation of future market needs, while electric companies shall deliberate/assess technologies that are anticipated to be needed for floating offshore wind farms, thereby enabling the development of technologies required for the actual use of offshore wind power by society.\n        </p>\n                  <p>\n          The joint council shall promote technological development aimed at quickly reducing the cost, and expanding development of offshore wind power farms in Japan, and contribute to achieving carbon neutrality by 2050.\n        </p>\n                </div>\n                <div>\n                  <p>\n          [Common Elemental Technology Development for Low-Cost Offshore Wind Power Generation Systems Project Overview]\n        </p>\n                  <p>\n          Period: March 2022~March 2025 (tentative)\n        </p>\n                  <p>\n          Details: The following diagram shows the fields of elemental technology to be developed and the development focus of each company\n        </p>\n                  <p>\n          Elemental Technology Field Focuses of the Project\n        </p>\n                  <p>\n          Project Development Structure\n        </p>\n                </div>\n                <div>\n                  <p>\n          *1 Joint Council\n        </p>\n                  <p>\n          Aims to form a supply chain while strategically promoting the development of next-generation technology needed to acquire markets in the future by gathering expert skills and knowledge from within Japan and overseas, and sharing supply chains and information.\n        </p>\n                  <p>\n          *2 High-voltage dynamic cable\n        </p>\n                  <p>\n          Power cables that track with floating objects that pitch and roll with waves and the wind. By attaching midline buoys to part of the cable under the water, the cable bends in the shape of a mountain thereby allowing slack to accommodate the pitch and roll of the floating object, and mitigate the impact on the cable from such motion.\n        </p>\n                  <p>\n          *3 Floating offshore substations/power converter stations\n        </p>\n                  <p>\n          Electric facilities for converting the power generated by offshore wind power farms to high- voltage/direct-current when it is sent to land. When constructing floating offshore wind power generation facilities, these power transmission facilities will be needed to efficiently send the power to land.\n        </p>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://docs.publicnow.com/10C145A5360A14307F8997C4881C78DFF2F7D5D5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Sumitomo Electric Industries Ltd.</strong> published this content on <strong>09 February 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>09 February 2022 04:12:39 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Sumitomo Electric Industries Ltd.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Sumitomo-Electric-Industries-Ltd.</p></div>"}