{"date": "2021-11-15 07:08:08+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><br/>\nBy Staff Writer<br/>\n<p><span class=\"round articleImage\" id=\"span\"></span></p>\n<p>IBM and Amazon Web Services (AWS) will combine the benefits of IBM Open Data for Industries for IBM Cloud Pak for Data and the AWS Cloud to serve energy customers.</p>\n<div>The collaboration between IBM and AWS aims to accelerate reduction of data barriers in the oil and gas industry.</div>\n<div> </div>\n<div>This comprehensive solution is built on Red Hat OpenShift and will run on the AWS Cloud, simplifying the ability for customers to run workloads in the AWS cloud and on-premises, the two firms announced at Adipec in Abu Dhabi, from November 15 to 18.</div>\n<div>The two companies also intend to collaborate on further co-development of future functionality to provide greater flexibility and choice on where to run OSDU applications.</div>\n<div> </div>\n<div>As an IBM and Reuters whitepaper, sponsored by IBM, found, the energy industry is facing pressure to reduce greenhouse gases as demand for affordable energy continues to rise.</div>\n<div>Energy companies need solutions that help drive efficiencies to free up capital, time and resources to invest in discovering new, more sustainable energy sources for the future.</div>\n<div> </div>\n<div>Data and digital technologies can help to navigate this transition, yet an IBM survey found that less than half of oil and gas executive respondents are using data to drive that innovation. This is in part because most of the digitisation efforts have been in proprietary closed systems, hindering the potential to combine and maximise the value of data.</div>\n<div> </div>\n<div>IBM Open Data for Industries is an open-source solution using the OSDU data foundation for the oil, gas and energy industry. IBM Open Data for Industries is fully integrated with IBM Cloud Pak for Data for easy data management, and built on Red Hat OpenShift, the industry’s leading Kubernetes platform and open architecture, designed so that companies can run and operate applications universally.</div>\n<div> </div>\n<div>With this collaboration, customers will gain the flexibility to run OSDU Data Platform applications in the AWS cloud or on-premises while addressing data residency requirements. Combined with the expansive cloud infrastructure of AWS cloud services, this data platform can help energy companies reduce the cost, time and resources needed to leverage the data to derive insight, streamlining operations and transition to sustainable energy generation.</div>\n<div>“Much of the data needed to solve the complex energy challenges, such as superior subsurface decisions, already exists, yet is untapped. This is because one of the greatest values of that data is derived when it can be effectively combined, but usually this data is locked by data residency requirements, legacy applications or proprietary data formats,” said Bill Vass, vice president, engineering, AWS. “By collaborating with IBM and leveraging Red Hat OpenShift, we will be able to offer customers a global, seamless offering with the flexibility to run on virtually any IT infrastructure and drive longer-term digital innovation.”</div>\n<div> </div>\n<div>The OSDU Forum is a cross-industry collaboration that provides a vendor-neutral framework for companies to develop data platforms against common energy industry standards. By working together, IBM and AWS will accelerate the value of this platform for global customers. The goal is that this combined effort will help serve the needs of energy companies today with flexibility to adapt to change amid energy transition.</div>\n<div>“Data is a critical asset to help fuel energy transition, yet too often energy companies must choose between running applications on-premises or in the cloud, and often each deployment uses a proprietary data format,” said Manish Chawla, global managing director, energy, resources and manufacturing, IBM.</div>\n<div> </div>\n<div>“This means that rather than using all of that collective data to gather insights, augment operations and inform innovation, some of it was going unused. Our collaboration with Amazon Web Services is addressing the need to make it easier for energy customers to access their data and provides the industry with a flexible solution to meet the challenges of today, as well as more easily adapt as the industry evolves.”</div>\n<div>This collaboration underscores the value of IBM and Red Hat to provide flexibility and unlock greater business value for operational data across industries.-- <strong>TradeArabia News Service</strong></div>\n<p> </p>\n<p class=\"syndigate_disclaimer\">Copyright 2021 Al Hilal Publishing and Marketing Group Provided by SyndiGate Media Inc. (<a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a>).</p>\n<div class=\"footnote-disclaimer\">Disclaimer: The content of this article is syndicated or provided to this website from an external third party provider. We are not responsible for, and do not control, such external websites, entities, applications or media publishers. The body of the text is provided on an “as is” and “as available” basis and has not been edited in any way. Neither we nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this article. <a href=\"https://d3a0oa8cittb3t.cloudfront.net/researchreports/Disclaimers/TR%20Disclaimer.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read our full disclaimer policy here</a>.</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© TradeArabia</p></div>"}