{"date": "2021-12-01 19:48:10.795000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Goldman Sachs and Amazon Web Services (AWS) have launched a new suite of cloud-based data and analytics solutions for financial institutions.</p><p>Dubbed as Goldman Sachs Financial Cloud for Data, the new solution will expand access to Goldman's financial data resources and analytics for third-party institutions.It will also help the bank's hedge fund and asset management clients to 'discover, organise, and analyse' data in the cloud.Additionally, the solution will help financial institutions reduce the need for developing and maintaining foundational data-integration technology while expanding the access to advanced quantitative analytics across global markets.Goldman Sachs chairman and CEO David Solomon said: \"Today, we are redefining the future of cloud for financial services as we enable developers to focus on building financial solutions for their customers.\"We are excited to bring together the two leading firms in financial services and cloud computing to deliver an unparalleled solution for financial data management and analytics on the cloud, revolutionising how our clients extract value from the increasing wealth of information in our industry.\"Amazon Web Services CEO Adam Selipsky said: \"With Goldman Sachs Financial Cloud for Data, we are lowering the barrier to entry so more financial services institutions can leverage advanced, near-real time analytics in the cloud.\"Combining Goldman Sachs' data and over a century of financial services knowledge with the reliability, security, and industry expertise of AWS will reimagine financial services technology and put developer-focused, cost-efficient technologies in the hands of all organisations.\"In 2017, Singapore's DBS Bank partnered with AWS to train its technology professionals in cloud engineering skills.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}