{"date": "2021-12-07 06:30:00.139000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n<b>RBEI Joins AWS Independent Software Vendor (ISV) Accelerate Program</b>\n</p><p>\nRobert Bosch Engineering and Business Solutions (RBEI) announced today that it has joined the Amazon Web Services (AWS) Independent Software Vendor (ISV) Accelerate Program, a co-sell program for AWS Partners who provide software solutions that run on or integrate with AWS. With it, RBEI will drive new business, accelerate sales cycles, and further strengthen customer outcomes working with the AWS Sales organization.\n</p><p>\nRBEI uses AWS to power its software-led solutions that connect sensors, software, and services. Participation in the AWS ISV Accelerate program showcases RBEI’s technical expertise on AWS as well as proven customer success.\n</p><p>\nBusinesses can now purchase RBEI's solutions in the domains of building technologies, energy, Industry 4.0, manufacturing, mobility, internet of things (IoT), and retail, among others, directly through the AWS Marketplace, a curated digital catalog that makes it easy for organizations to discover, procure, entitle, provision, and govern third-party software, to accelerate their digital transformation journey.\n</p><p>\n“The ISV Accelerate Program enables us to solidify our collaboration with AWS and strategically engage with AWS customers and sellers. Our goal is to provide our customers with advanced solutions that leverage the power and benefits of cloud with optimized costs,” said <b>Digant Shah, Vice President, Bosch Software and Digital Solutions.</b>\n</p><p>\nRBEI’s connected technologies enable businesses to grow, nurture and accelerate their digital strategies. The company’s solutions enable easy and swift transformation from traditional to digital products and processes for customers. Through this collaboration, RBEI aims to drive business growth and unlock opportunities for technology innovation to build smarter and enhanced products and solutions.\n</p><p>\n<b><span>About RBEI</span></b><span>: Robert Bosch Engineering and Business Solutions is a 100% owned subsidiary of Robert Bosch GmbH, one of the world’s leading global supplier of technology and services, offering end-to-end Engineering, IT and Business Solutions. With over 20,500 associates, it’s the largest software development center of Bosch, outside Germany, indicating that it’s the Technology Powerhouse of Bosch in India with a global footprint and presence in US, Europe and the Asia Pacific region. With our unique ability to offer end-to-end solutions that connect sensors, software, and services, we enable businesses to move from the traditional to digital or improve businesses by introducing a digital element in their products and processes.</span>\n</p><p>\n<b>About Bosch in India</b>\n</p><p>\n<span>In India, Bosch is a leading supplier of technology and services in the areas of Mobility Solutions, Industrial Technology, Consumer Goods, and Energy and Building Technology. Additionally, Bosch has in India the largest development center outside Germany, for end to end engineering and technology solutions. The Bosch Group operates in India through fifteen companies, viz, Bosch Limited, Bosch Chassis Systems India Private Limited, Bosch Rexroth (India) Private Limited, Robert Bosch Engineering and Business Solutions Private Limited, Bosch Automotive Electronics India Private Limited, Bosch Electrical Drives India Private Limited, BSH Home Appliances Private Limited, ETAS Automotive India Private Limited, Robert Bosch Automotive Steering Private Limited, Automobility Services and Solutions Private Limited, Newtech Filter India Private Limited, Mivin Engg. Technologies Private Limited, Robert Bosch India Manufacturing and Technology Private Limited, PreBo Automotive Private Limited and Precision Seals. In India, Bosch set-up its manufacturing operation in 1951, which has grown over the years to include 16 manufacturing sites, and seven development and application centers. Bosch Group in India employs over 31,530 associates and generated consolidated revenue of about </span>Rs<span>.17,354 crores* (2.05 billion euros) in 2020 of which </span>Rs<span>. 10,942 crores* (1.29 billion euros) from third party. The Bosch Group in India has close to 15,650 research and development associates. In India, Bosch Limited is the flagship company of the Bosch Group. It earned revenue of over </span>Rs<span>. 8,386 crores (0.99 billion euros) in 2020. Additional information can be accessed at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.bosch.in&amp;esheet=52545344&amp;newsitemid=20211206005880&amp;lan=en-US&amp;anchor=www.bosch.in&amp;index=1&amp;md5=d8e676b478ce9afb14b1faa8f90a1c55\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.bosch.in</a></span>\n</p><p>\n<span>The Bosch Group is a leading global supplier of technology and services. It employs roughly 395,000 associates worldwide (as of December 31, 2020). The company generated sales of 71.5 billion euros in 2020. Its operations are divided into four business sectors: Mobility Solutions, Industrial Technology, Consumer Goods, and Energy and Building Technology. As a leading IoT provider, Bosch offers innovative solutions for smart homes, Industry 4.0, and connected mobility. Bosch is pursuing a vision of mobility that is sustainable, safe, and exciting. It uses its expertise in sensor technology, software, and services, as well as its own IoT cloud, to offer its customers connected, cross-domain solutions from a single source. The Bosch Group’s strategic objective is to facilitate connected living with products and solutions that either contain artificial intelligence (AI) or have been developed or manufactured with its help. Bosch improves quality of life worldwide with products and services that are innovative and spark enthusiasm. In short, Bosch creates technology that is “Invented for life.” The Bosch Group comprises Robert Bosch GmbH and its roughly 440 subsidiary and regional companies in some 60 countries. Including sales and service partners, Bosch’s global manufacturing, engineering, and sales network covers nearly every country in the world. With its more than 400 locations worldwide, the Bosch Group has been carbon neutral since the first quarter of 2020. The basis for the company’s future growth is its innovative strength. At 129 locations across the globe, Bosch employs some 73,000 associates in research and development, of which nearly 34,000 are software engineers.</span>\n</p><p>\n<span>Additional information is available online at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.bosch.com%2F&amp;esheet=52545344&amp;newsitemid=20211206005880&amp;lan=en-US&amp;anchor=www.bosch.com&amp;index=2&amp;md5=d55d9d19772fdf1f9676f6e3a22d6b1f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.bosch.com</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.bosch.com%2Finternet-of-things%2F&amp;esheet=52545344&amp;newsitemid=20211206005880&amp;lan=en-US&amp;anchor=www.iot.bosch.com&amp;index=3&amp;md5=b2703ae1f24f711ccd21fdf791c4d570\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.iot.bosch.com</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.bosch-press.com&amp;esheet=52545344&amp;newsitemid=20211206005880&amp;lan=en-US&amp;anchor=www.bosch-press.com&amp;index=4&amp;md5=102416d7f15babf873dace6e2c8a47dc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.bosch-press.com</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Ftwitter.com%2FBoschPress%2F&amp;esheet=52545344&amp;newsitemid=20211206005880&amp;lan=en-US&amp;anchor=https%3A%2F%2Ftwitter.com%2FBoschPress&amp;index=5&amp;md5=c79cedb5ce2fb1f51ed1337426dfd47b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/BoschPress</a></span>\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211206005880r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjA2MDA1ODgwcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=50bbf3d4a79b4bcc1b49759e4f4cb9c2b5fe5b63780ca958f3bd471f4a744e7029a3fd5210f0f86bf64dc99c2d2d1f82f994dc3ea459a2d27dddd1c029189144\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211206005880/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211206005880/en/</a></span></p><p>\n<b>Contact for person for press inquiries:\n<br/>Akshayita Alok Saxena\n<br/><a href=\"mailto:AkshayitaAlok.Saxena@in.bosch.com\" data-type=\"email\" translate=\"no\">AkshayitaAlok.Saxena@in.bosch.com</a></b>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: RBEI</p></div>"}