{"date": "2022-01-18 03:21:18+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        The Amazon Housing Fund has now committed more than $344.3 million in loans and grants to the Puget Sound region to create or preserve 2,870 affordable units-with more investments to come.\n      </div>\n                <div>\n                  <p>\n          Amazon has committed another $28.5 million in grants and low-rate loans to the Puget Sound region to create and preserve an additional 373 affordable homes. The new funding brings the total number of affordable units added to the area in 2021 through Amazon's support to 2,870.\n        </p>\n                  <p>\n          The investment comes from the Amazon Housing Equity Fund, a $2 billion commitment to create and preserve 20,000 affordable housing units for families with moderate or low incomes. The funding helps families in Washington state's Puget Sound region, in and around Arlington, Virginia, and in Nashville, Tennessee. All three areas are hometown communities where Amazon expects to have a growing presence in the coming years.\n        </p>\n                  <p>\n          \"The Amazon Housing Equity Fund has been addressing the inequities in housing affordability on multiple fronts, and we are so pleased with the great strides our team has made,\" said Catherine Buell, director of the Amazon Housing Equity Fund. \"Through our multiple grants and low-rate loans, we are not only increasing the affordable housing stock, but we are also fostering the professional growth of real estate developers of color to help build better, more inclusive communities.\"\n        </p>\n                  <p>\n          The most recent investment will also retain the homes' affordability for a period of 99 years. Below are details about the two Puget Sound communities being supported by the latest funding:\n        </p>\n                  <p>\n                    <strong>Sage Apartments, Everett</strong>\n                    <br/>\n           123 units in a garden-style multi-housing community in Everett, Washington. The complex is conveniently located near public transit and only four minutes from Interstate 5, providing easy access to the region's largest employers. This is the Amazon Housing Equity Fund's first collaboration in the Puget Sound region with a for-profit partner.\n        </p>\n                  <p>\n                    <strong>192 Shoreline, Shoreline</strong>\n                    <br/>\n           250 units in a mid-rise multi-housing development in Shoreline, Washington, located approximately 11 miles north of Seattle Central Business District and close to public transit options. The property offers a mix of studio, one-, two-, three-, and four-bedroom units and includes bike storage, a secure package room, laundry facilities, and a fitness center.\n        </p>\n                  <div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/news/community/amazons-2-billion-housing-equity-fund-announces-new-investments\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon's $2 billion Housing Equity Fund announces new investments</a>\n                      </span>\n                    </div>\n                    <div>\n            Fund commits $300 million to create 3,000 new affordable homes near public transit for families in the Puget Sound, Arlington, and Nashville regions.\n          </div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/news/community/amazons-2-billion-housing-equity-fund-announces-new-investments\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                      </span>\n                    </div>\n                  </div>\n                  <p>\n          In addition to the latest investments, the Amazon Housing Equity Fund has committed funding to support similar projects with Bellwether Housing, a local nonprofit, and the King County Housing Authority.\n        </p>\n                  <h4>\n          Bellwether Housing\n        </h4>\n                  <p>\n          Recent acquisitions by Bellwether Housing, King County's largest nonprofit affordable housing provider, will preserve 213 affordable homes for households earning at or below 60% to 80% of area median income for the next 99 years.\n        </p>\n                  <p>\n          Bellwether Housing, like many nonprofit housing providers, struggles to raise the capital needed to acquire and preserve affordable homes before the homes are lost to developers that convert them to luxury housing.\n        </p>\n                  <p>\n          \"The Amazon Housing Equity Fund could not have come at a better time. Public funding sources are severely constrained,\" said Bellwether Housing CEO Susan Boyd. \"We anticipate that this fund will allow us to bring hundreds of more units into permanent affordability.\"\n        </p>\n                  <p>\n          The Amazon Housing Equity Fund's investment is helping Bellwether Housing with two communities:\n        </p>\n                  <p>\n                    <strong>The BLVD, Kent</strong>\n                    <br/>\n           136 units within walking distance to a light rail station slated to open in 2024. The complex offers studio, one-, two-, and three-bedroom units with washers and dryers, air conditioning, walk-in closets, and balconies or patios.\n        </p>\n                  <div>\n          Photo by Stephen T Naylor\n        </div>\n                  <p>\n                    <strong>The Marina Club Apartments, Des Moines</strong>\n                    <br/>\n           77 units located close to the Des Moines Marina with easy access to Kent Valley, Seattle, and the Port system. The apartments feature spacious living and dining rooms, updated kitchens, and large closets. The property offers a fitness center, a resident club room, and a pool.\n        </p>\n                  <h4>\n          King County Housing Authority\n        </h4>\n                  <p>\n          Also in 2021, the Amazon Housing Equity Fund provided $185.5 million in low-interest loans and grants to the King County Housing Authority to help the agency acquire seven apartment buildings, the majority in Bellevue. The funding will help create a total of 1,084 affordable rental homes that otherwise might have gone to a private developer. The buildings will remain affordable for at least 99 years.\n        </p>\n                  <p>\n          \"Amazon's support has immediately preserved nearly 1,300 existing affordable housing units-including more than 900 right here in Bellevue-with more to come to help grow more inclusive communities for families in east and south King County,\" said Bellevue Mayor Lynne Robinson. \"I'm excited to have the public, private, and nonprofit sectors teaming up to take on one of our region's toughest challenges.\"\n        </p>\n                  <p>\n          Below are details about the communities:\n        </p>\n                  <p>\n                    <strong>Hampton Greens, Bellevue</strong>\n                    <br/>\n           326 units located on 16 acres. Public transportation is less than a half-mile away. Spacious one- and two-bedroom apartments include washers and dryers, fireplaces, and private patios. The property also offers swimming pools, a dry sauna, a 24-hour access package locker room, a fitness center, a tennis court, a playground, an electric vehicle charging station, and a resident lounge.\n        </p>\n                  <p>\n                    <strong>Pinewood Village, Bellevue</strong>\n                    <br/>\n           108 units offering spacious studio, one-, and two-bedroom apartments. All units feature electric kitchen appliances as well as a dishwasher, a refrigerator, and a personal balcony or patio. Select units also include a fireplace, granite countertops, vaulted ceilings, and washers and dryers.\n        </p>\n                  <p>\n                    <strong>Illahee Apartments, Bellevue</strong>\n                    <br/>\n           36 units in a garden-style community conveniently located in the Bel-Red/Spring District corridor across the street from Bellevue Highlands Park and less than 1 mile from a future light rail station. Units include balconies or patios, and there are on-site laundry facilities.\n        </p>\n                  <p>\n                    <strong>Sandpiper East Apartments, Bellevue</strong>\n                    <br/>\n           224 units located approximately a half-mile from the Bel-Red/130th Street Light Rail station, which is scheduled to open in 2023. The apartments are also a quick drive to restaurants, shopping centers, local parks, and several nearby lakes.\n        </p>\n                  <p>\n                    <strong>The Carrington Apartment Homes, Bellevue</strong>\n                    <br/>\n           108 units with easy access to public transportation and close to five parks, including Robinswood Community Park. The central campus of Bellevue College is a short walk away. The property is conveniently located near restaurants and a large shopping center at Eastgate Plaza.\n        </p>\n                  <p>\n                    <strong>Surrey Downs Apartments, Bellevue</strong>\n                    <br/>\n           122 units located on a public bus line and walking distance to restaurants and shopping. The apartments include updated kitchens with stainless steel appliances. The complex offers a walking trail and swimming pool.\n        </p>\n                  <p>\n                    <strong>The Argyle Apartments, Federal Way</strong>\n                    <br/>\n           160 units located on several Metro bus lines and less than a five-minute walk to the Federal Way Transit Center, which is also the planned location of the new light rail station scheduled to open in 2024. The property offers a clubhouse, a fitness center, a swimming pool, covered parking, and laundry facilities.\n        </p>\n                  <p>\n          The Amazon Housing Equity Fund also committed $100 million to developers working with Sound Transit to accelerate the creation of up to 1,200 homes near active transit corridors. Transit-oriented development has a range of benefits, including greater economic activity, reduced traffic congestion, and associated environmental benefits, and it provides access to transportation and education for low- to moderate-income households.\n        </p>\n                  <p>\n          Additionally, Amazon has granted $5.5 million to the Local Initiatives Support Corporation Puget Sound to pilot an accelerator program. The program supports emerging real estate developers of color focused on creating and preserving affordable housing for the region. The accelerator program provides professional training, mentorship, and capacity-building for real estate developers of color, as well as pre-development funding for the affordable housing projects they have planned. Upfront costs can include expensive survey and site planning fees, permitting, legal expenses, and feasibility studies.\n        </p>\n                  <p>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/community/amazon-launches-21m-program-for-real-estate-developers-of-color\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Learn more about the accelerator program</a>\n                    </span>and how Amazon has committed $21 million to help emerging real estate developers of color progress in an industry known for high barriers to entry, namely capital investment, and practical experience.\n        </p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/housing-equity\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Housing equity</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/community\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Community</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/community-involvement\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Community involvement</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/donations\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Donations</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/community/amazon-commits-another-24-8-million-for-local-affordable-homes\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>18 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>18 January 2022 03:21:18 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}