{"date": "2022-02-01 15:30:11.130000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>U BLOX HOLDING AG (\"UBLXF-0\")\n- Launches Scalable Digital Certificate Management System\n- for IoT Devices\n\n   u-blox, a leading global provider of positioning and wireless\ncommunication technologies and services, has announced the IoT certificate\nmanager, a new security service that continuously renews device credentials\nin a fully automated mode. Together with u-blox's existing zero touch\nprovisioning service, it provides out-of-the-box on-boarding to IoT cloud\nplatforms with total control of the device certificate lifecycle.\n\n   Certificate lifecycle control targets IoT devices that integrate with\nleading IoT cloud platforms including the AWS IoT Core, Azure IoT Hub, and\nDPS services. While these take charge of device management and data\naggregation, the u-blox service provides an effortless, secure, and\ncost-effective way to manage the X.509 certificates required for device\nauthentication.\n\n   X.509 certificates have become a cornerstone of IoT security. Secure\nprovisioning requires extensive experience, complex software development,\nand robust production line tools and processes.\n\n   Certificate management efforts grow exponentially with increasing fleet\nsize. While in the past issued certificates remained valid throughout a\ndevice's lifecycle, increases in infrastructure complexity and risks have\nforced regulatory authorities to demand more frequent - yearly or monthly -\nrenewals. Failure to meet renewal deadlines can expose devices to\ncyberthreats, disrupt service availability, and undermine business.\n\n   IoT certificate manager simplifies scaling...\n\n   u-blox new IoT certificate manager eliminates the task of manually\nmanaging credential renewal on thousands of devices. Designed and optimized\nfor IoT scenarios, it eliminates the errors that can occur during manual\noperation on large IoT deployments, freeing resources for other activities.\nDelivery via the intuitive Thingstream IoT service delivery platform with\nits simple and flexible price plans lets users engage more efficiently and\nreduce time to market.\n\n   ... and futureproofs protection\n\n   The IoT certificate manager futureproofs protection by increasing\nsecurity levels over the entire device lifetime. Building on the root of\ntrust included in u-blox SARA-R5 series LTE-M cellular modems, it provides\na fully integrated silicon-to-cloud security solution that is unmatched in\nthe industry.\n\n   \"IoT certificate manager is all about enabling IoT solution developers\nto easily manage device credentials for an IoT lifetime, to scale\nseamlessly from prototyping to huge fleets, and to minimize set-up costs,\ngiving companies more time and resources to grow their business,\" says\nGiovanni Solito, Senior Product Manager, Product Center Services, at\nu-blox.\n\n   Zero touch provisioning and IoT certificate manager services are\navailable immediately.\n\n   About u-blox\n\n   u-blox (SIX:UBXN) is a global technology leader in positioning and\nwireless communication in automotive, industrial, and consumer markets.\nTheir smart and reliable solutions, services and products let people,\nvehicles, and machines determine their precise position and communicate\nwirelessly over cellular and short range networks. With a broad portfolio\nof chips, modules, and secure data services and connectivity, u-blox is\nuniquely positioned to empower its customers to develop innovative and\nreliable solutions for the Internet of Things, quickly and\ncost-effectively. With headquarters in Thalwil, Switzerland, the company is\nglobally present with offices in Europe, Asia, and the USA.\n(www.u-blox.com) Find us on Facebook , LinkedIn , Twitter @ublox and\nYouTube\n\nu-blox media contact:\nNatacha Seitz\nSenior Manager PR and Content Marketing\nMobile +41 76 436 0788\nnatacha.seitz@u-blox.com\n\nTel   : +41-447227444    U BLOX HOLDING AG\nEmail : ir@u-blox.com\nWWW   : <a href=\"https://www.u-blox.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.u-blox.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203100297.MNPRE2203102164-07195920220201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}