{"date": "2021-11-15 08:01:00.274000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}.storyContent .bwuline{text-decoration:underline;text-decoration-color:inherit;}</style><p class=\"bwalignc\">\n<b>Amazon Announces More Deals Than Ever Before for Its 48-Hour Black Friday Event</b>\n</p><p class=\"bwalignc\">\n<span>Thousands of deals will be available for customers starting on Thursday, November 25, including deep discounts on select TVs from Samsung, Sony, and LG, select Alexa-enabled devices, and must-have toys from Fisher-Price, Barbie, and Disney, plus many more</span>\n</p><p class=\"bwalignc\">\n<span>Amazon’s year-round investments in people, technology, and transportation across its operations network helps ensure reliable delivery for customers this holiday season</span>\n</p><p class=\"bwalignc\">\n<span>Prime members can rely on fast, free, and convenient delivery on millions of items throughout the holiday season, including One-Day Delivery coast-to-coast, Same-Day Delivery in more than 47 cities, and delivery in as fast as five hours from click-to-doorstep in 15 U.S. cities</span>\n</p><p class=\"bwalignc\">\n<span>This Black Friday, customers can continue to support small businesses and shop thousands of deals from sellers, including women-owned, military family-owned, and Black-owned businesses</span>\n</p><p>\n(NASDAQ:AMZN) – Amazon announced today that more Black Friday deals than ever before will be available starting on Thursday, November 25. Customers will be able to shop incredible deals with deep discounts on top products and must-have items, including new gadgets and electronics from Samsung; kid-favorite toys and baby essentials from Mattel and Cybex gb Pockit; must-have home and kitchen items from Instant Pot; seasonal fashion finds, including rag &amp; bone from Shopbop; and beauty favorites from Sunday Riley, OPI, Color Wow, and many more. In addition, customers can find thousands of deals from Amazon’s independent selling partners, most of which are small and medium-sized businesses, throughout Amazon’s 48-hour Black Friday event, including deals from women-owned, military family-owned, and Black-owned businesses.\n</p><p>\nCustomers can also shop from Amazon’s biggest selection of <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fgifts&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=gift+guides&amp;index=1&amp;md5=4a3726e513fe0a101735db796530451c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">gift guides</a>, including newly launched guides and longtime customer-favorites like <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2FStockingStufferGifts&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=Stocking+Stuffers&amp;index=2&amp;md5=3b99e9de19907a1ed1017e684fe2f6f3\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Stocking Stuffers</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2Fcustomersmostlovedgifts&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=Customer%26%238217%3Bs+Most+Loved&amp;index=3&amp;md5=01c6fcdf070016b909bab4002335b5d0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Customer’s Most Loved</a>, and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fholidaytoylist&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=Holiday+Toy+List&amp;index=4&amp;md5=1ed1af97ff27ccf2ae370b2d76e05815\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Holiday Toy List</a>, along with the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Famazon.com%2Ftechgifts&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=Electronics&amp;index=5&amp;md5=5c550a15619d803ea7afb422edd45dea\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Electronics</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Ffashiongiftguide&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=Fashion&amp;index=6&amp;md5=b779a8ea2a031c33c1b8c1ce8f2610e9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Fashion</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2FHolidayBeautyGiftGuide&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=Beauty&amp;index=7&amp;md5=1aeb34fd86e44b1e6a36067deea87809\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Beauty</a> guides. Newly released gift guides include:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>Oprah’s Favorite Things: </b>Back for the seventh year, Oprah’s Favorite Things list includes a coveted assortment of Oprah’s must-have products, many from people of color and women-owned businesses, including Kiya Tomlin, Clara Sunwoo, and Saysh by Allyson Felix. Customers can visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Foprah&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=amazon.com%2Foprah&amp;index=8&amp;md5=5c52bc7571bec2666a0cd51a9a2e7a5e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/oprah</a> to shop now and receive 20% off select items in Oprah’s list through December 31.\n</li>\n<li>\n<b>Experts’ Gift Picks Gift Guide: </b>For those looking for gifting inspiration, Amazon dropped this star-studded list featuring top picks from A-list celebrities like Jessica Alba, Jojo Siwa, gold medalist Suni Lee and influencer duo Aint Afraid, and media outlets including BuzzFeed and Refinery29, among others. To view these gift guides and more, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2FExpertsGiftPicks&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=amazon.com%2Fexpertsgiftspicks&amp;index=9&amp;md5=60de1a6ced07615a6102a1e199b5e21a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/expertsgiftspicks</a>.\n</li>\n<li>\n<b>Luxury Stores Gift Guide:</b> Discover special gifts to give and get this season with curated gift guides, featuring new arrivals in Luxury Stores, from Clé de Peau Beauté and RéVive Skincare to La Perla and Missoni. Shop limited edition beauty gift sets and festive looks for dressing up this holiday season, or find the perfect gift for friends and family. To view this gift guide and shop from luxury brands, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fluxurystores&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=amazon.com%2Fluxurystores&amp;index=10&amp;md5=1638335c70ffad95eadc4be567eec807\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/luxurystores</a>.\n</li>\n</ul><p>\n<b><span class=\"bwuline\">Supporting Small and Medium-Sized Businesses</span></b>\n</p><p>\nAmazon’s U.S. independent selling partners, most of which are small and medium-sized businesses,<span> </span>selling in Amazon’s store sold more than 3.8 billion products in the 12 months ending August 31, 2021. This Black Friday, customers can continue to support small and save on gifts from <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fsmallbusinessgiftguide&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=small+businesses&amp;index=11&amp;md5=fa2c7eb5204e791b252507fd5c44e7e7\" data-type=\"url\" class=\"tr-link\" translate=\"no\">small businesses</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fhandmadeholiday21&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=Amazon+Handmade&amp;index=12&amp;md5=cba8f21b3909ef16ec247714f4448209\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Handmade</a>, and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2FLaunchpad-GiftHub&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=Amazon+Launchpad&amp;index=13&amp;md5=c7c2d82d0e0b7265634346cbfcb5a27f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Launchpad</a>, and by visiting <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fsupportsmall&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=amazon.com%2Fsupportsmall&amp;index=14&amp;md5=7d84f40dd58062ad464b516e294b0ccc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/supportsmall</a>. Handmade artisans, entrepreneurs, and emerging brand owners can all be found on Amazon—including women-owned, military family-owned, and Black-owned businesses.\n</p><p>\n<b><span class=\"bwuline\">Where and When to Shop</span></b>\n</p><p>\nThe Black Friday 48-hour deal event, from November 25 through November 26, while supplies last, is available to shop on <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fblackfriday&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=amazon.com%2Fblackfriday&amp;index=15&amp;md5=71a4fd56edd8b6ad96b2d7cac51b557a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/blackfriday</a>, on the Amazon shopping app, at Amazon 4-star stores, Amazon Books stores, or by asking “Alexa, what are my deals?” Plus, Prime members get 30-minute early access to select Lightning Deals on Amazon throughout the holiday season, and every day.\n</p><p>\nCustomers can also watch livestreams on Black Friday to discover incredible holiday deals the minute they go live, including exciting deals revealed first via Amazon Live. Shop with celebrities, influencers, and experts who will help customers discover the best deals with product demonstrations, try-on hauls, and a live chat. Viewers will also be able to easily shop the featured products and brands through a carousel that updates in real-time. To watch, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Flive&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=amazon.com%2Flive&amp;index=16&amp;md5=11720b0a6e2b4cae5f8c5c190f49215a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/live</a> or the Amazon Live shopping app on Fire TV.\n</p><p>\n<b><span class=\"bwuline\">Black Friday Deals Preview</span></b>\n</p><p>\nBelow is a sneak peek of top deals available during Amazon’s Black Friday event, from November 25 through November 26.\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>Holiday Toy List:</b> Save on dolls, toys, and accessories from L.O.L. Surprise!, PAW Patrol, Bluey, Little Tikes, Fisher-Price, Barbie, Hot Wheels, and more. Save up to 30% on party games from Cards Against Humanity and gifts from Disney, Marvel, DC, and PJ Masks.\n</li>\n<li>\n<b>Seasonal Fashion: </b>Save on a selection of footwear, apparel, accessories, and best sellers, including up to 40% on Levi’s for the family and up to 30% on adidas. Save up to 25% on select Fall Fashion styles from Shopbop, including rag &amp; bone, Frame, and Mother Denim. Save up to 25% on a Made For You custom T-shirt, and up to 30% on Staples by The Drop. Plus, shoppers save $10 when they spend $50 on their first order from Prime Try Before You Buy, and both new and existing customers save $10 when they spend $50 with Personal Shopper by Prime Try Before You Buy (terms and conditions apply).\n</li>\n<li>\n<b>Home Entertaining and Décor: </b>Save up to 40% on Instant Brands kitchen appliances. Save up to 43% on robot, cordless, and upright vacuums from Shark. Save up to 30% on air purifiers from Levoit and Coway. Save up to 15% on select furniture.\n</li>\n<li>\n<b>Electronics: </b>Save up to 30% on select TVs from Samsung, Sony, and LG. Save on select headphones from Bose, Sony, and Beats. Save up to 29% on select Garmin watches and navigation products. Save up to 30% on select desktops, laptops, monitors, and tablets. Receive a $50 Amazon promotional credit with the purchase of Oculus Quest 2. Save $40 with the purchase of FlashForge Adventurer 3 Lite 3D Printer.\n</li>\n<li>\n<b>Beauty: </b>Save $50 on Sunday Riley Mini Vault Skincare Collection, an Amazon exclusive.<b> </b>Save up to 30% on lash serums and hair sprays from Grande Cosmetics and Color Wow. Save up to 40% on grooming appliances from Braun and Panasonic. Save up to 50% on Waterpik.\n</li>\n<li>\n<b>Amazon Brands: </b>Save up to 30% on men’s and women’s fashion. Save up to 30% on tech accessories and home products. Save up to 35% on fitness and wellness essentials. Save up to 40% on pet food from Wag. Save up to 20% on baby products from Mama Bear.\n</li>\n<li>\n<b>Amazon Devices: </b>Save up to 42% on select Alexa-enabled devices including Echo Show 5 (2nd Gen) Kids, Echo Buds (2nd Gen) with wired case, and Echo Frames (2nd Gen). Save up to 30% on Amazon Fire TV 50” 4-Series. Save up to 30% on the Kindle Oasis. Save up to 50% on the Fire TV Stick 4K. Save up to 50% on select Fire HD tablets. Save up to 30% on Blink video Doorbell. Save $20 on the Luna Controller.\n</li>\n<li>\n<b>Tools, Garden, and Automotive:</b> Save up to 30% on select DEWALT tools. Save up to 31% on select generators from DuroMax. Save up to 30% on select AeroGarden indoor gardens. Save up to 30% on select auto parts and accessories.\n</li>\n<li>\n<b>Sports &amp; Outdoors: </b>Save up to 30% on select Coleman and Marmot equipment. Save up to 30% on select Team Sports products.\n</li>\n<li>\n<b>Entertainment:</b> Save<b> </b>up to 50% on <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fprimememberdeals&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=select+Prime+Video&amp;index=17&amp;md5=68c783d2350075a45d8fff51d582bc2f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">select Prime Video</a> movies to rent or buy, from new releases to classics, plus hit TV shows, seasonal content, and more. And save with Amazon Music Unlimited, free for three months for new customers, or free for six months with the purchase of select Amazon Echo devices. Readers can also <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2Fb%2F%3Fnode%3D11552285011&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=save+up+to+80%25&amp;index=18&amp;md5=e6ecc3184776a5f7ce5344198ba1c1cc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">save up to 80%</a> on 100+ best sellers on Kindle, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2Fb%3Fnode%3D13245867011%26ref%3Dapubna_da_gr_10004_hz_ml_sa_2112&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=50%25+or+more&amp;index=19&amp;md5=e7d83a2e6cf3e98981231b94e194e864\" data-type=\"url\" class=\"tr-link\" translate=\"no\">50% or more</a> on select Kindle Exclusive titles, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Farborist-na.amazon.com%2Fus%2Fstores%2F23654166011&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=up+to+50%25&amp;index=20&amp;md5=ad476c3fb4339f5c62ca13425f0defae\" data-type=\"url\" class=\"tr-link\" translate=\"no\">up to 50%</a> on Amazon exclusive print titles, and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2Fdeal%2F4b6ccf91%3FshowVariations%3Dtrue&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=up+to+30%25&amp;index=21&amp;md5=b196f736adf466a72fcf2ab09853a656\" data-type=\"url\" class=\"tr-link\" translate=\"no\">up to 30%</a> on children’s books.\n</li>\n<li>\n<b>Virtual Travel and Experiences:</b> Save up to 50% on all Amazon Explore experiences, hosted by local experts, U.S. customers have access to a wide range of livestreamed, interactive experiences across the globe—all from the comfort of their homes. Customers can shop unique items, learn how holidays are celebrated around the world, and gift experiences to their friends &amp; family.\n</li>\n</ul><p>\n<b><span class=\"bwuline\">Investing in Our Team</span></b>\n</p><p>\nAmazon’s extraordinary employees come together to deliver joyful experiences for customers year-round, and the company recently announced it’s hiring an additional 125,000 full- and part- time positions and 150,000 seasonal jobs with an average starting pay of $18 per hour, sign-on bonuses of up to $3,000, and an additional $3 per hour depending on shifts in many locations. These employees are the heart and soul of Amazon, which is why the company has spent more than $15 billion across its fulfillment network to help keep employees safe and deliver products to customers. Additionally, the company has continued to invest in technology, aircraft, ships, and buildings to ensure it has the products customers want and need available throughout the season. Plus, it’s putting more selection in fulfillment centers closer to customers, which is possible because of the sophisticated and innovative network Amazon has built over 20 years. These improvements mean customers can continue to rely on fast and efficient delivery throughout the holiday season and beyond.\n</p><p>\n<b><span class=\"bwuline\">Fast, Free, and Convenient Delivery Options</span></b>\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>Free One-Day and Same-Day Delivery: </b>Prime members in the U.S. can shop a selection of over 10 million items eligible for Prime Free One-Day Delivery with no minimum purchase, and millions of items are available for Free Same-Day Delivery in 47 major metropolitan areas. Prime members can also shop over 3 million items available for delivery in as fast as five hours with faster Same-Day Delivery—now available in 15 cities. These fast delivery options are not only convenient for customers, but they’re better for the planet. Same-Day deliveries ship from local fulfillment centers, so the items travel shorter distances and generate less carbon emissions. This is just another way Amazon is reducing the impact of climate change on future generations by building a sustainable business. Learn more at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fprimedelivery&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=amazon.com%2Fprimedelivery&amp;index=22&amp;md5=f108810b45dcd7ed9269f42f738eefd9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/primedelivery</a> or start a free 30-day trial of Prime at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fprime&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=amazon.com%2Fprime&amp;index=23&amp;md5=47a31e9ae210422dd6058cfd68ee8362\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/prime</a>.\n</li>\n<li>\n<b>Ultrafast Grocery Delivery and Pickup: </b>Prime members in more than 5,000 cities and towns have access to two-hour grocery delivery on more than 170,000 products from Whole Foods Market and Amazon Fresh. With Amazon Fresh, Prime members get free two-hour delivery, plus free grocery pickup at select Amazon Fresh stores on orders over $35. Prime members can also find toys, gifts, household products, everyday essentials, electronics, Amazon devices, and more at Amazon Fresh. Prime members get free pickup on orders over $35 from Whole Foods Market stores nationwide.\n</li>\n<li>\n<b>Delivery Where it’s Needed Most: </b>Whether customers are road-tripping to see family, staying home and need a secure delivery location, or sending a gift to a loved one or friend, Amazon provides thousands of package pickup locations for customers. These locations are conveniently located near or in offices, convenience stores, malls, apartment buildings, and grocery stores, in more than 900 cities and towns across the U.S. Tens of millions of products can be easily and conveniently delivered to an Amazon pickup point at Whole Foods Market, 7-11, Chase Bank, Rite-Aid, HealthMart, GNC, Stage Stores, and other locations. To find a location, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fhub&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=amazon.com%2Fhub&amp;index=24&amp;md5=9c03861ef8be0c8412ce823e78bca4a5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/hub</a>.\n</li>\n<li>\n<b>Extended Returns Window: </b>Most of the items purchased between October 1, 2021, and December 31, 2021, can be returned until January 31, 2022.\n</li>\n</ul><p>\nGet the latest news by visiting About Amazon, where you can find <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fretail%2Famazon-shopping-tips&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=shopping+tips+and+ways+to+save+this+season&amp;index=25&amp;md5=20562f0402567acd8da946ed1c411f88\" data-type=\"url\" class=\"tr-link\" translate=\"no\">shopping tips and ways to save this season</a> and learn more about <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fholidaydelivery&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=holiday+delivery&amp;index=26&amp;md5=e8468f41f2552a952c709385e7fa3f30\" data-type=\"url\" class=\"tr-link\" translate=\"no\">holiday delivery</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=27&amp;md5=e03287f6e04ac39f0d90d5dc8a2e74e5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211115005447r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTE1MDA1NDQ3cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=b8e9250421a49355269392b46f553f2afdc49062e91565801bd1f8207b45ba6e5b6719f47b8d4fd8caa7a1d1b67b2af7fdf8828a73eba1d4d0ae4bb4df7fa97c\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211115005447/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211115005447/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52530685&amp;newsitemid=20211115005447&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=28&amp;md5=24f9a85d474e929c16991b6ee870502b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON</p></div>"}