{"date": "2022-01-24 17:10:50.880000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">CRESTPOINT ACQUIRES 2.8 MILLION SF AMAZON DISTRIBUTION CENTRE</p>\n<p>TORONTO, Jan. 24, 2022</p>\n<p>\n<span>TORONTO</span> , <span>Jan. 24, 2022</span> /CNW/ - Crestpoint Real Estate Investments Ltd. (Crestpoint) today announced the acquisition of 222 CitiGate Drive, a 2.8 million square foot Amazon fulfillment centre located in CitiGate Corporate Business Park in Barrhaven, a suburb of <span>Ottawa</span> . It is the largest fulfillment centre ever built in <span>Canada</span> and uses the latest in smart, and automated and robotic technologies with capacity to handle over 100,000 packages a day. Constructed in 2021, the project is 100% leased to Amazon for 20 years. Crestpoint acquired a 90% interest in the property on behalf of its clients including the Crestpoint Core Plus Real Estate Strategy, Vestcor Inc., and Kiwoom Securities and Hangang Asset Management, a South Korean investment consortium.</p>\n<p>\n\n</p>\n<p>The completion of the CitiGate acquisition brings Crestpoint's assets under management to over <span>$7.5 billion</span> and caps off a very active and productive past 13 months, which saw the completion of over <span>$1.9 billion</span> of acquisitions involving office, industrial, retail and multi-family opportunities, adding over 6.5 million square feet to its portfolio. Highlights of the activity during this period include:</p>\n<p>(i) The Firm's initial foray into the multi-family residential sector, following the investment of <span>~$500 million</span> in the acquisition of over 2,000 apartment units.</p>\n<p>(ii) The completion of over <span>$950 million</span> of transactions in the industrial sector, including the acquisition of 4.25 million square feet of existing properties, along with over 260 acres of development land, which can support the future development of over 4.5 million square feet of industrial product.</p>\n<p>(iii) The investment of <span>~$400 million</span> into the office sector, most notably through the acquisition of two signature office complexes, specifically a 95% interest in SteelesTech Corporate Centre in <span>Toronto</span> and a 50% interest in Place De Ville in downtown <span>Ottawa</span> . Together, the two properties represent over 1.2 million square feet of office product that add to the quality of Crestpoint's office portfolio and are consistent with Crestpoint's continued commitment to enhancing the overall environmental profile of its entire portfolio.</p>\n<p>(iv) The consistent strong performance of the Crestpoint Core Plus Real Estate Strategy, Crestpoint's diversified, open-end investment vehicle that celebrated its 10 year anniversary in Q1 2021.</p>\n<p>(v) The addition of 14 new members to the team, bringing the total number of investment professionals at Crestpoint to 32.</p>\n<p>\"I am extremely proud of what Crestpoint has accomplished over the past 13 months. It is a testament to the skill and dedication of our entire team and our proven ability to identify opportunities and execute despite the challenges the market throws at us. We appreciate the continued support of our investors and partners and look forward to continued success in the future\" said <span>Kevin Leon</span> , President and CEO of Crestpoint.</p>\n<p>\n<span>About Crestpoint</span>\n</p>\n<p>Crestpoint Real Estate Investments Ltd. is a commercial real estate investment manager, with <span>$7.5 billion</span> of gross assets under management, dedicated to providing investors with direct access to a diversified portfolio of commercial real estate assets. Crestpoint is part of the Connor, Clark &amp; Lunn Financial Group, a multi-boutique asset management company that provides investment management products and services to institutional and high net-worth clients. With offices across <span>Canada</span> and in <span>Chicago</span> , <span>London</span> , and Gurugram, <span>India</span> , Connor, Clark &amp; Lunn Financial Group and its affiliates are collectively responsible for the management of approximately <span>$100 billion</span> in assets. For more information, please visit: <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3421783-1&amp;h=1108781046&amp;u=http%3A%2F%2Fwww.crestpoint.ca%2F&amp;a=www.crestpoint.ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.crestpoint.ca</a> .</p>\n<p>\n\n</p>\n<p>\n\n</p>\n<p>SOURCE Crestpoint Real Estate Investments Ltd.</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/January2022/24/c0767.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/January2022/24/c0767.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}