{"date": "2021-11-18 13:20:32.888000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 8578SEFG-Hermes Holdings SAE18 November 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>\n</span></p>\n<p>\n<span>EFG Hermes Holding Concludes aiBANK Acquisition</span>\n</p>\n<p>\n<span>The Firm is now a universal bank in Egypt with a market-leading investment banking platform in frontier emerging markets (FEM)</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Cairo, 18 November 2021</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>EFG Hermes Holding informed shareholders today that it has completed its transformation into an Egyptian universal bank with a market-leading frontier emerging markets (FEM) investment banking platform. The news comes as the Firm has finalized its acquisition of a 51% stake in the Arab Investment Bank (aiBANK), marking a strategic entry into the fast-growing and solid Egyptian commercial banking sector. The transaction will see EFG Hermes Holding assume control of aiBANK, with TSFE Financial Services &amp; Fintech Subfund, a subfund fully owned by the Sovereign Fund of Egypt, EFG Hermes Holding's valued partner, acquiring a 25% stake.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"The closing of this landmark transaction with our esteemed partner TSFE will drive the transformation of our Egyptian operations into a universal bank with an investment bank, a commercial bank and a fast-growing Non-Bank Financial Institutions (NBFI) platform, ensuring that we can provide a holistic set of financial products and services to both retail and corporate clients alike in our home market. In Egypt and across a dozen other frontier emerging markets, we continue to be the region's premier investment bank franchise with market leading shares of trading across most of our markets and active roles in a number of recent regional transactions like the IPO of ACWA <span> Power on Tadawul and Fertiglobe on ADX among many others,\" said <span>EFG Hermes Holding's Group CEO Karim Awad.</span>\n</span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"The completion of the acquisition of a majority stake in aiBANK should be looked at as another step towards building a business model that can withstand the cyclicality of capital markets and increase synergies creation potential across the platform,\" Awad added. \"Our efforts to geographically diversify our business means that we are now present in 13 countries with the ability to offer financial services to more than 1 billion people living and doing business in some of the world's fastest-growing markets. The addition of a commercial bank in our home market also means that EFG Hermes Holding (through its different subsidiaries and brands) can provide its Egyptian clients with a single destination for all their financial services,\" concluded Awad.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Over the past few years, EFG Hermes Holding has transformed itself from a pure play MENA investment bank into an Egyptian universal bank with a market-leading frontier emerging markets (FEM) investment banking platform that is home to super brands. Today, we can offer our corporate, retail and institutional clients across all our jurisdictions best-in-class sell-side services (securities brokerage, advisory and research) in addition to a multitude of investment solutions that include world-class management of funds that invest in renewables (Vortex Energy), MENA and frontier public equities (EFG Hermes and FIM), Education (Egypt Education Fund) and startups (EFG EV Fintech). In addition to the above, in Egypt, we offer our clients buy-now pay-later (BNPL) fintech (valU), microfinance (Tanmeyah), leasing and factoring (Corp Solutions), insurance (Kaf Takaful), e-payments (PayTabs Egypt), mortgage finance (Bedaya) and soon a comprehensive range of saving and lending products (aiBANK).</span>\n<span>In 2018, we were the first Egyptian financial services corporation to become a signatory of the United Nations Principles for Responsible Investment (PRI).</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"Our ability to cross-sell across this expanding network of financial services has only increased during the past years as we continue to grow each of our business lines and to play our role in increasing financial inclusion and job creation across FEM,\" Awad added. \"It has also cemented our firm belief that this business model will reap great benefits for our shareholders by providing greater visibility on profitability and future dividend distribution as well as potentially significant upside through contemplated partial exits of some of our growing subsidiaries,\" concluded Awad.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>EFG HERMES HOLDING BY THE NUMBERS:</span>\n</p>\n<p>\n<span>·</span>\n<span>We are present in 13 countries across 4 continents</span>\n</p>\n<p>\n<span>·</span>\n<span>We execute transactions in over 75 frontier and emerging markets and cover 95% of the MSCI Frontier and MSCI Emerging Frontier indices</span>\n</p>\n<p>\n<span>·</span>\n<span>We create investments with positive value by investing in everything from start-ups to renewable energy</span>\n</p>\n<p>\n<span>·</span>\n<span>We have a buy-side business that manages over USD 4 billion of AUMs in public and private markets under the brands of EFG Hermes such as Vortex Energy, Egypt Education Fund (EEF) and FIM</span>\n</p>\n<p>\n<span>·</span>\n<span>Our NBFI platform that focuses on Egypt with a lending portfolio of EGP 10.9 billion and leading market shares in leasing, factoring, mortgage, buy-now pay-later and microfinance among others</span>\n</p>\n<p>\n<span>·</span>\n<span>With a growing team of more than 6,000 people present on the ground in Cairo, Dubai, Abu Dhabi, Riyadh, Muscat, Kuwait City, Amman, Karachi, Dhaka, Hanoi, Nairobi, Abuja, London and New York</span>\n</p>\n<p>\n<span>·</span>\n<span>We have been in the top five of the Bloomberg and Thomson Reuters / Refinitiv equity capital market league tables since 2015</span>\n</p>\n<p>\n<span>·</span>\n<span>We are the #1 research house in frontier markets for 2021, according to Institutional Investor's poll</span>\n</p>\n<p>\n<span>·</span>\n<span>We are a market-leading NBFI platform that includes a leading leasing company in Egypt and the number-one factoring brand in the country. We also operate an award winning BNPL platform (valU) trusted by top global brands, including our partners at Amazon, IKEA, Uber and Apple. valU was ranked fifth by Forbes as one of the top Fintech companies in MENA, while Tanmeyah is the largest private microfinance provider in Egypt</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>---ENDS---</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>About EFG Hermes</span>\n<span>\n<span>Holding</span>\n</span>\n</p>\n<p>\n<span>\n<span>With a current footprint spanning thirteen countries across four continents, EFG Hermes Holding S.A.E (</span>\n<span>EGX: HRHO.CA - LSE: EFGD</span>\n</span>\n<span>) started in Egypt and has grown over 37 years of success to become a leading financial services corporation with access to emerging and frontier markets. Drawing on our proven track-record and a team of more than 6,000 talented employees, we provide a wide spectrum of financial services that include investment banking, asset management, securities brokerage, research, and private equity to the entire MENA region.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>In 2015, EFG Hermes Holding launched its Non-Bank Financial Institutions (NBFI) Platform, which overlooks activities in the Non-Banking Finance field covering microfinance, leasing, factoring, Buy-Now Pay-Later (BNPL), mortgage and insurance. This falls in line with the Firm's strategy to focus on two main pillars: product diversification and geographic expansion into non-MENA markets, which has seen the Firm establish a physical presence in Pakistan, Bangladesh, Vietnam, Kenya, Nigeria, the United Kingdom, and the United States.</span>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Learn more about us at</span>\n<span>\n<span>www.efghermes.com</span>\n</span>\n<span>&amp; stay connected with us.   </span>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Note on Forward-Looking Statements</span>\n<span>\n</span></p>\n<p>\n<span>In this press release, EFG Hermes Holding may make forward looking statements, including, for example, statements about management's expectations, strategic objectives, growth opportunities and business prospects. These forward-looking statements are not historical facts but instead represent only EFG Hermes Holding's belief regarding future events, many of which, by their nature are inherently uncertain and are beyond management's control and include among others, financial market volatility; actions and initiatives taken by current and potential competitors; general economic conditions and the effect of current, pending and future legislation, regulations and regulatory actions. Accordingly, the readers are cautioned not to place undue reliance on forward-looking statements, which speak only as of the date on which they are made</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>ACQDKFBPBBDDBDD</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}