{"date": "2022-01-18 17:42:02.774000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>VERIZON COMMUNICATIONS INC  (\"VZ-N\")\n- Verizon and AWS Expand to 30% More Metro Area Locations with Mobile\n- Edge Computing\n\n     Verizon and AWS are now offering mobile edge computing in more U.S.\nmetro areas with the addition of Charlotte, Detroit, Los Angeles and\nMinneapolis. Verizon 5G Edge with AWS Wavelength, a real-time cloud\ncomputing platform, brings AWS compute and storage services to the edge of\nVerizon's wireless network. The combination minimizes the latency and\nnetwork hops required to connect from an application hosted on the platform\nto the end user's device. Launched in August 2020, the companies currently\noffer mobile edge computing via AWS Wavelength Zones in 17 locations in the\nU.S. Using 5G Edge with AWS Wavelength allows developers and businesses to\nbuild and deploy a variety of applications such as machine learning,\nInternet of Things (IoT), and video and game streaming.\n\n     Using Verizon 5G Edge with AWS Wavelength for drone and energy\nmanagement applications\n\n     Fermata Energy, a Verizon Ventures company, and Easy Aerial are among\nthe innovators who participated in the 5G Studio, a collaboration between\nVerizon and Newlab, to develop transformative technology solutions\nleveraging Verizon's 5G Ultra Wideband network technology and Verizon 5G\nEdge with AWS Wavelength at Newlab.\n\n     Easy Aerial is a leading provider of American-made, military-grade,\nautonomous drone-in-a-box-based monitoring and inspection solutions for\ncommercial, government, and military applications. With the low end-to-end\nlatency enabled by Verizon 5G Edge with AWS Wavelength, Easy Aerial was\nable to collect and transfer live drone video for near real-time object\ndetection and telemetry data for rapid processing and analysis. 5G and\nmobile edge computing also allowed expensive compute to be removed from the\ndrone, reportedly saving about 10% in drone costs and increasing flight\ntime by approximately 40%.\n\n     \"Being able to utilize the high bandwidth for unmanned aerial vehicles\n(UAVs) that Verizon 5G Edge with AWS Wavelength provides is a game\nchanger,\" said Ivan Stamatovski, CTO of Easy Aerial. \"It shifts the\nparadigm on what is possible to achieve with airborne sensors by processing\ndata at the edge of the network in near real-time.\"\n\n     Fermata Energy's Vehicle-to-Everything (V2X) technology turns electric\nvehicles (EVs) into mini power plants by discharging energy services from\nEVs' batteries to the home, building, or energy grid. Using a bidirectional\ncharger connected both to an EV and a building's energy load, Fermata\nEnergy's cloud-based software, running on Verizon 5G Edge with AWS\nWavelength, reacted to changes in the grid and, as a result, load-balance\ndata in near real-time with very low latency, according to Fermata Energy.\nThis allows Fermata Energy to dispatch an EV as a valuable energy resource\nproviding near real-time response to the state of the grid.\n\n     Watch the Fermata video for more.\n\n     Teaming with SaaS providers to make it a breeze for developers\n\n     Verizon and AWS are also working with software as a service (SaaS)\nproviders Couchbase and Confluent to make it easier for developers who use\ntheir platforms to create applications running on Verizon 5G Edge with AWS\nWavelength. Using infrastructure templates, Verizon and AWS seamlessly\nextended the capabilities of these providers to the edge to automate the\ncomplexity of edge networking, core compute, and the software itself.\n\n     Couchbase empowers developers to build, deploy and run their most\nmission-critical applications by providing a high-performance, flexible and\nscalable modern database that runs across the data center and any cloud. By\nworking with Couchbase, Verizon and AWS are enabling native data storage\nand processing at the network edge at high performance and scale.\n\n     View the Couchbase video.\n\n     Confluent's data in motion platform enables enterprises to connect and\nprocess real-time data across multi-cloud and hybrid environments to power\nnew IoT analytics and applications.\n\n     \"Using Verizon 5G Edge with AWS Wavelength and Confluent, our joint\ncustomers are able to build real-time IoT connections with ultra-low\nlatency. This allows organizations to intelligently respond to events\nhappening essentially in real-time as they deploy more 5G-enabled devices\nacross their organizations to power next-generation digital experiences and\nbusiness processes,\" said Gerry Fierling, Sr. Director, Global AWS\nAlliance, Confluent.\n\n     To easily integrate the entire 5G Edge footprint into mobile\napplications, Verizon also offers developers the 5G Edge Discovery Service\nthat seamlessly discovers the optimal mobile edge compute location for any\nVerizon mobile client. The Edge Discovery Service, alongside a broader\nsuite of APIs, is available on the 5G Edge developer portal.\n\n     \"Through our continued collaboration with AWS, we're helping\ndevelopers and businesses in every industry create truly transformational\napplications for use cases such as immersive VR gaming, video distribution,\nand connected and autonomous vehicles,\" said Tami Erwin, CEO of Verizon\nBusiness. \"By expanding our 5G Edge locations across the U.S., we're\nenabling developers to quickly and easily build apps and services that take\nadvantage of the low latency, massive bandwidth and strong reliability of\n5G and edge computing.\"\n\n     \"Customers that want to build ultra-low latency applications need\naccess to compute, storage, and advanced cloud services at the edge of the\n5G network. They tell us that broad coverage is very important to ensure\nconsistent application experiences, wherever their end-users may be,\" said\nGeorge Elissaios, general manager of AWS Wavelength and Director of Product\nManagement, AWS. \"With the continued and rapid expansion of AWS Wavelength\nZones across the US and around the world, we are delivering on that, while\nalso broadening access to advanced 5G and edge capabilities to every AWS\ncustomer, small or large. We're excited to see the innovation that\ncustomers like Easy Aerial and Fermata Energy bring with novel applications\nthat transform consumers' experiences by leveraging AWS Wavelength on\nVerizon 5G Edge.\"\n\n     Verizon 5G Edge with AWS Wavelength is currently available in 17\nlocations including Atlanta, Boston, Charlotte, Chicago, Dallas, Denver,\nDetroit, Houston, Las Vegas, Los Angeles, Miami, Minneapolis, New York\nCity, Phoenix, the San Francisco Bay Area, Seattle and Washington DC.\n\n     Learn more information about Verizon 5G Edge and Verizon's 5G\ntechnology.\n\n     Verizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30,\n2000 and is one of the world's leading providers of technology and\ncommunications services. Headquartered in New York City and with a presence\naround the world, Verizon generated revenues of $128.3 billion in 2020. The\ncompany offers data, video and voice services and solutions on its\naward-winning networks and platforms, delivering on customers' demand for\nmobility, reliable network connectivity, security and control.\n\n     VERIZON'S ONLINE MEDIA CENTER: News releases, stories, media contacts\nand other resources are available at verizon.com/news. News releases are\nalso available through an RSS feed. To subscribe, visit\nwww.verizon.com/about/rss-feeds/.\n\n     Media\n\n     contact:\n     Chris Ashraf\n     christina.moon.ashraf@verizon.com\n     (201) 320-4259\n     @ChrisMoonPR\n                            ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201700524.MNPRE2201702750-09320220220118</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}