{"date": "2021-11-19 04:41:29.614000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3549.0, "close": 3676.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company, and Qualtrics announced they are expanding their relationship, with Qualtrics migrating its internal IT systems and customer-facing workloads to the world?s leading cloud. The migration includes Qualtrics? complete portfolio of experience management (XM) applications and its xFlow automated workflow system. Qualtrics selected AWS as its preferred cloud provider to enhance operational performance, expand globally, and develop new features that help uncover deeper insights for its customers. Qualtrics will be able to provide customers with actionable insights faster and more efficiently using AWS?s proven infrastructure and broad capabilities, including machine learning, analytics, databases, security, and compute.</p><p>Qualtrics? cloud-native technology aggregates customer and employee feedback and enables companies to analyze it and take action. Qualtrics is now moving its customer-facing workloads to AWS. For example, Qualtrics uses Amazon DynamoDB, AWS?s key-value and document database service, as the underlying infrastructure for its XM Directory, the largest human sentiment database in the world with more than 4 billion customer and employee profiles. Qualtrics also uses Amazon SageMaker, a service that helps data scientists build, train, and deploy machine learning models quickly, as the backbone for Qualtrics iQ, its machine learning-powered analytics suite that enables Qualtrics to develop its natural language processing models more efficiently and deliver actionable customer and employee insights faster.</p></div><div class=\"tr-npp-body\"><p>Amazon?s customer and employee feedback programs will also be able to rely on Qualtrics to gather and analyze stakeholder feedback. Through Qualtrics? experience management technology, Amazon will be able to quickly understand customer and employee feedback to make data-driven decisions across multiple departments.</p><p>?Qualtrics and Amazon share the same guiding principle of customer obsession, and our mutual strengths are helping both companies operate better. Using AWS?s global infrastructure and breadth of machine learning and cloud capabilities will help us surface actionable insights at the speed that our customers, including Amazon, know and expect,? said Qualtrics Chief Technology Officer John Thimsen. ?More than 13,500 organizations rely on Qualtrics to deliver incredible customer and employee experiences, and we are continuously innovating on our technology to help customers unlock new growth opportunities in the experience transformation era.?</p><p>?Data is foundational to helping enterprises understand their operating landscape and improve the overall experience for their customers,? said Matt Garman, Senior Vice President of Sales and Marketing at Amazon Web Services, Inc. ?AWS?s industry-leading cloud capabilities and our proven global infrastructure give Qualtrics the ability to deliver timely, in-depth insights to customers with the utmost security and reliability. The strength and scale of this relationship will also help global companies such as ours use Qualtrics to deliver insights that can lead to improved outcomes around the world.?</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}