{"date": "2022-02-11 12:55:12.634000+00:00", "ticker": "III", "mrkt_info": {"open": 1375.5, "close": 1360.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-T\")\n- (2/2) Strong 2021 Financial Results and Advances Strategic Priorities\n\n     Full year 2021 Gas Transmission and Midstream adjusted EBITDA\ndecreased $45 million compared with 2020, due to the factors discussed\nabove as well, as the absence of the recognition of retroactive revenues in\n2020 related to the settlement of interim rates collected from shippers on\nTexas Eastern in U.S. Gas Transmission.\n\n     GAS DISTRIBUTION AND STORAGE\n\n//st\n\n                         Three months ended         Year ended December 31,\n                         December 31,\n\n                         2021               2020    2021               2020\n\n  (unaudited;\n  millions of\n  Canadian dollars)\n\n  Enbridge Gas Inc.      427                455     1,744\n1,741\n  (EGI)\n\n  Other                  23                 37      109                81\n\n  Adjusted EBITDA1       450                492     1,853\n1,822\n\n  Operating Data\n\n  EGI\n\n  Volumes (billions      560                507     1,943\n1,793\n  of cubic feet)\n\n  Number of active                                  3.8                3.8\n  customers2\n  (millions)\n\n  Heating degree days3\n  Actual                 1,144              1,234   3,494\n3,657\n\n  Forecast based on      1,317              1,310   3,855\n3,843\n  normal weather4\n\n//et\n\n//st\n\n  1   Non-GAAP financial measure. Please refer to \"Non-GAAP Reconciliations\n      Appendices\" section of this news release.\n\n  2   Number of active customers is the number of natural gas consuming\n      customers at the end of the reported period.\n\n  3   Heating degree days is a measure of coldness that is indicative of\n      volumetric requirements for natural gas utilized for heating purposes\n      in EGI's distribution franchise areas.\n\n  4   Normal weather is the weather forecast by EGI in its legacy rate\n      zones, using the forecasting methodologies approved by the Ontario\n      Energy Board.\n\n//et\n\n     Gas Distribution and Storage adjusted EBITDA will typically follow a\nseasonal profile. It is generally highest in the first and fourth quarters\nof the year reflecting greater volumetric demand during the heating season.\nThe magnitude of the seasonal EBITDA fluctuations will vary from\nyear-to-year reflecting the impact of colder or warmer than normal weather\non distribution volumes. Results include contributions from Noverco within\nOther. The divestiture of Noverco closed on December 30, 2021.\n\n     Gas Distribution and Storage adjusted EBITDA decreased $42 million\ncompared with the fourth quarter of 2020 primarily related to:\n\n//st\n\n  * the negative impact of warmer weather in 2021 of approximately $16\n    million; and\n  * higher operating and administrative costs largely related to timing of\n    operational, pipeline integrity and safety costs between quarters;\n    partially offset by\n  * higher distribution charges resulting from increases in rates and\n    customer base.\n\n//et\n\n     When compared with the normal weather forecast embedded in rates, the\nwarmer weather in the fourth quarter of 2021 negatively impacted EBITDA by\napproximately $31 million, compared to a negative impact of approximately\n$15 million in the fourth quarter of 2020.\n\n     Full year 2021 Gas Distribution and Storage adjusted EBITDA increased\n$31 million compared with 2020 due to the same factors discussed above. On\na full year basis, when compared with the normal weather forecast embedded\nin rates, warmer weather negatively impacted EBITDA by approximately $55\nmillion and negatively impacted 2020 by approximately $33 million.\n\n     RENEWABLE POWER GENERATION\n\n//st\n\n                         Three months ended         Year ended December 31,\n                         December 31,\n\n                         2021                2020   2021\n2020\n\n  (unaudited;\n  millions of\n  Canadian dollars)\n\n  Adjusted EBITDA1       140                 146    496                 507\n\n//et\n\n//st\n\n  1   Non-GAAP financial measure. Please refer to \"Non-GAAP Reconciliations\n      Appendices\" section of this news release.\n\n//et\n\n     Renewable Power Generation adjusted EBITDA decreased $6 million\ncompared with the fourth quarter of 2020 primarily related to lower wind\nresources at the Canadian wind facilities.\n\n     Full year 2021 Renewable Power Generation adjusted EBITDA decreased\n$11 million compared with 2020 due to the factors discussed above, as well\nas:\n\n//st\n\n  * weaker wind resources at U.S. wind facilities, including effects from\nthe\n    winter storm in Texas during February 2021; and\n  * the absence of reimbursements received in 2020 at certain Canadian wind\n    facilities from a change in operator; partially offset by\n  * the promote fee received associated with the closing of the sale of 49%\n    of Enbridge's interest in three French offshore wind projects in\n    construction to CPP Investments, which closed in the first quarter of\n    2021.\n\n//et\n\n     ENERGY SERVICES\n\n//st\n\n                         Three months ended         Year ended December 31,\n                         December 31,\n\n                         2021                2020   2021               2020\n\n  (unaudited;\n  millions of\n  Canadian dollars)\n\n  Adjusted EBITDA1       (83)                (82)   (360)\n(119)\n\n//et\n\n//st\n\n  1   Non-GAAP financial measure. Please refer to \"Non-GAAP Reconciliations\n      Appendices\" section of this news release.\n\n//et\n\n     Energy Services adjusted EBITDA decreased $1 million compared with the\nfourth quarter of 2020 and $241 million with compared with full year 2020.\nThe decrease is the result of:\n\n//st\n  * significant compression of location and quality differentials in\ncertain\n    markets along with limited storage opportunities due to market price\n    backwardation; and\n  * adverse impacts from the major winter storm experienced across the U.S.\n    Midwest during February 2021.\n\n//et\n\n     These conditions lead to fewer opportunities to achieve profitable\ntransportation margins on facilities in which Energy Services holds\ncapacity obligations.\n\n     ELIMINATIONS AND OTHER\n\n//st\n\n                           Three months ended        Year ended December\n31,\n                           December 31,\n\n                           2021               2020   2021              2020\n\n  (unaudited; millions\n  of Canadian dollars)\n\n  Operating and            103                (8)    256               158\n  administrative\n  recoveries\n\n  Realized foreign         47                 (12)   175\n(172)\n  exchange hedge\n  settlement\n  gains/(losses)\n\n  Adjusted EBITDA1         150                (20)   431               (14)\n\n//et\n\n//st\n\n  1   Non-GAAP financial measure. Please refer to \"Non-GAAP Reconciliations\n      Appendices\" section of this news release.\n\n//et\n\n     Operating and administrative recoveries captured in this segment\nreflect the cost of centrally delivered services (including depreciation of\ncorporate assets) inclusive of amounts recovered from business units for\nthe provision of those services. U.S. dollar denominated earnings within\noperating segment results are translated at average foreign exchange rates\nduring the quarter, and the offsetting impact of settlements made under the\nCompany's enterprise foreign exchange hedging program are captured in this\ncorporate segment.\n\n     Eliminations and Other adjusted EBITDA increased $170 million compared\nwith the fourth quarter of 2020 due to:\n\n//st\n\n  * higher realized foreign exchange gains compared with realized foreign\n    exchange losses in 2020 as a result of a weakening U.S. dollar average\n    exchange rate of $1.26 for the fourth quarter of 2021 (Q4 2020:$1.30)\n    compared with a hedge rate of $1.30 for the fourth quarter of 2021 (Q4\n    2020:$1.29); and\n  * the annualized benefit of cost containment initiatives executed in\n2020.\n\n//et\n\n     Full year 2021 Eliminations and Other adjusted EBITDA increased $445\nmillion compared with 2020 due to the same factors discussed above. On a\nfull year basis, the average exchange rate for 2021 was $1.25 (2020:$1.34)\ncompared with the full-year 2021 hedge rate of $1.30 (2020: $1.29).\n\n     CONFERENCE CALL\n\n     Enbridge will host a conference call and webcast on February 11, 2022\nat 9:00 a.m. Eastern Time (7:00 a.m. Mountain Time) to provide an\nenterprise wide business update and review 2021 fourth quarter results.\nAnalysts, members of the media and other interested parties can access the\ncall toll free at (833) 233-4460 or within and outside North America at\n(647) 689-4543 using the conference ID of 6486063. The call will be audio\nwebcast live at\n<a href=\"https://event.on24.com/wcc/r/3574327/A306812D7E85261DFF8D8810CF6EC1E4\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://event.on24.com/wcc/r/3574327/A306812D7E85261DFF8D8810CF6EC1E4</a>. It\nis recommended that participants dial in or join the audio webcast fifteen\nminutes prior to the scheduled start time. A webcast replay will be soon\nafter the conclusion of the event and a transcript will be posted to the\nwebsite. The replay will be available for seven days after the call\ntoll-free (800) 585-8367 or within and outside North America at (416)\n621-4642 (conference ID: 6486063).\n\n     The conference call format will include prepared remarks from the\nexecutive team followed by a question and answer session for the analyst\nand investor community only. Enbridge's media and investor relations teams\nwill be available after the call for any additional questions.\n\n     DIVIDEND DECLARATION\n\n     On December 6, 2021, the Company's Board of Directors declared the\nfollowing quarterly dividends. All dividends are payable on March 1, 2022\nto shareholders of record on February 15, 2022.\n\n//st\n\n                                             Dividend per share\n\n              Common Shares1                 $0.86000\n\n              Preference Shares, Series A    $0.34375\n\n              Preference Shares, Series B    $0.21340\n\n              Preference Shares, Series C2   $0.15719\n\n              Preference Shares, Series D    $0.27875\n\n              Preference Shares, Series F    $0.29306\n\n              Preference Shares, Series H    $0.27350\n\n              Preference Shares, Series J    US$0.30540\n\n              Preference Shares, Series L    US$0.30993\n\n              Preference Shares, Series      $0.31788\n\n              Preference Shares, Series P    $0.27369\n\n              Preference Shares, Series R    $0.25456\n\n              Preference Shares, Series 1    US$0.37182\n\n              Preference Shares, Series 3    $0.23356\n\n              Preference Shares, Series 5    US$0.33596\n\n              Preference Shares, Series 7    $0.27806\n\n              Preference Shares, Series 9    $0.25606\n\n              Preference Shares, Series 11   $0.24613\n\n              Preference Shares, Series 13   $0.19019\n\n              Preference Shares, Series 15   $0.18644\n\n              Preference Shares, Series 17   $0.32188\n\n              Preference Shares, Series 19   $0.30625\n\n//et\n\n//st\n\n  1   The quarterly dividend per common share was increased 3% to $0.86\n      from $0.835, effective March 1, 2022.\n\n  2   The quarterly dividend per share paid on Series C was increased to\n      $0.15501 from $0.15349 on March 1, 2021, was increased to $0.15753\n      from $0.15501 on June 1, 2021, was increased to $0.16081 from\n      $0.15753 on September 1, 2021 and was decreased to $0.15719 from\n      $0.16081 on December 1, 2021, due to reset on a quarterly basis\n      following the date of issuance of the Series C Preference Shares.\n\n//et\n\n     FORWARD-LOOKING INFORMATION\n\n     Forward-looking information, or forward-looking statements, have been\nincluded in this news release to provide information about Enbridge and its\nsubsidiaries and affiliates, including management's assessment of Enbridge\nand its subsidiaries' future plans and operations. This information may not\nbe appropriate for other purposes. Forward looking statements are typically\nidentified by words such as \"anticipate\", \"expect\", \"project\", 'estimate\",\n\"forecast\", \"plan\", \"intend\", \"target\", \"believe\", \"likely\" and similar\nwords suggesting future outcomes or statements regarding an outlook.\nForward-looking information or statements included or incorporated by\nreference in this document include, but are not limited to, statements with\nrespect to the following: Enbridge's strategic plan, priorities and\noutlook; 2022 financial guidance, including projected DCF per share and\nadjusted EBITDA and expected growth thereof; expected dividends, dividend\ngrowth and dividend policy; expected supply of, demand for, exports of and\nprices of crude oil, natural gas, natural gas liquids (NGL), liquified\nnatural gas (LNG) and renewable energy; energy transition and low carbon\nenergy and our approach thereto; environmental, social and governance (ESG)\ngoals, targets and plans, including greenhouse gas (GHG) emissions\nintensity and reduction targets, ESG engagement and disclosure, and\ndiversity and inclusion goals; anticipated utilization of our  assets;\nexpected EBITDA and expected adjusted EBITDA; expected earnings/(loss) and\nadjusted earnings/(loss); expected DCF and DCF per share; expected future\ncash flows; expected debt-to EBITDA range; expected shareholder returns,\nasset returns and returns on equity; expected performance of the Company's\nbusinesses, including customer growth and organic growth opportunities;\nfinancial strength, capacity and flexibility; financial priorities;\nexpectations on leverage, sources of liquidity and sufficiency of financial\nresources; expected in-service dates and costs related to announced\nprojects and projects under construction and system expansion, optimization\nand modernization; capital allocation framework and priorities including\nESG factors; share repurchases under normal course issuer bid; investment\ncapacity; expected future growth and expansion opportunities, including\nsecured growth program, development opportunities and low carbon and new\nenergies opportunities and strategy; expected future actions and decisions\nof regulators and courts and the timing and impact thereof; and toll and\nrate case discussions and filings, including with respect to the Mainline,\nand anticipated timing and impact therefrom.\n\n     Although Enbridge believes these forward-looking statements are\nreasonable based on the information available on the date such statements\nare made and processes used to prepare the information, such statements are\nnot guarantees of future performance and readers are cautioned against\nplacing undue reliance on forward-looking statements. By their nature,\nthese statements involve a variety of assumptions, known and unknown risks\nand uncertainties and other factors, which may cause actual results, levels\nof activity and achievements to differ materially from those expressed or\nimplied by such statements. Material assumptions include assumptions about\nthe following: energy transition, including the drivers and pace thereof;\nthe COVID-19 pandemic and the duration and impact thereof; global economic\ngrowth and trade; the expected supply of and demand for crude oil, natural\ngas, NGL, LNG and renewable energy; prices of crude oil, natural gas, NGL,\nLNG and renewable energy; anticipated utilization of our  assets;\nanticipated cost savings; exchange rates; inflation; interest rates;\navailability and price of labour and  construction materials; operational\nreliability and performance; customer, regulatory and stakeholder support\nand approvals; anticipated construction and in-service dates; weather;\nannounced and potential acquisition, disposition and other corporate\ntransactions and projects and the timing and impact thereof; governmental\nlegislation; litigation; credit ratings; hedging program; expected EBITDA\nand expected adjusted EBITDA; expected earnings/(loss) and adjusted\nearnings/(loss); expected earnings/(loss) or adjusted earnings/(loss) per\nshare; expected future cash flows and expected future DCF and DCF per\nshare; estimated future dividends; financial strength and flexibility; debt\nand equity market conditions; and general economic and competitive\nconditions. Assumptions regarding the expected supply of and demand for\ncrude oil, natural gas, NGL, LNG and renewable energy, and the prices of\nthese commodities, are material to and underlie all forward-looking\nstatements, as they may impact current and future levels of demand for the\nCompany's services. Similarly, exchange rates, inflation, interest rates\nand the COVID-19 pandemic impact the economies and business environments in\nwhich the Company operates and may impact levels of demand for the\nCompany's services and cost of inputs, and are therefore inherent in all\nforward-looking statements. Due to the interdependencies and correlation of\nthese macroeconomic factors, the impact of any one assumption on a\nforward-looking statement cannot be determined with certainty, particularly\nwith respect to expected EBITDA, expected adjusted EBITDA, expected\nearnings/(loss), expected adjusted earnings/(loss), expected DCF and\nassociated per share amounts, and estimated future dividends. The most\nrelevant assumptions associated with forward-looking statements regarding\nannounced projects and projects under construction, including estimated\ncompletion dates and expected capital expenditures, include the following:\nthe availability and price of labour and construction materials; the\neffects of inflation and foreign exchange rates on labour and material\ncosts; the effects of interest rates on borrowing costs; the impact of\nweather; customer, government and regulatory approvals on construction and\nin-service schedules and cost recovery regimes; and the COVID-19 pandemic\nand the duration and impact thereof.\n\n     Enbridge's forward-looking statements are subject to risks and\nuncertainties pertaining to the realization of anticipated benefits and\nsynergies of projects and transactions, successful execution of our\nstrategic priorities, operating performance, the Company's dividend policy,\nregulatory parameters, changes in regulations applicable to the Company's\nbusiness, litigation, acquisitions and dispositions and other transactions,\nproject approval and support, renewals of rights-of-way, weather, economic\nand competitive conditions, public opinion, changes in tax laws and tax\nrates, changes in trade agreements, political decisions, exchange rates,\ninterest rates, commodity prices, supply of and demand for commodities and\nthe COVID-19 pandemic, including but not limited to those risks and\nuncertainties discussed in this and in the Company's other filings with\nCanadian and U.S. securities regulators. The impact of any one risk,\nuncertainty or factor on a particular forward-looking statement is not\ndeterminable with certainty as these are interdependent and Enbridge's\nfuture course of action depends on management's assessment of all\ninformation available at the relevant time. Except to the extent required\nby applicable law, Enbridge assumes no obligation to publicly update or\nrevise any forward-looking statements made in this news release or\notherwise, whether as a result of new information, future events or\notherwise. All forward-looking statements, whether written or oral,\nattributable to Enbridge or persons acting on the Company's behalf, are\nexpressly qualified in their entirety by these cautionary statements.\n\n     ABOUT ENBRIDGE INC.Enbridge Inc. is a leading North American energy\ninfrastructure company. We safely and reliably deliver the energy people\nneed and want to fuel quality of life. Our core businesses include Liquids\nPipelines, which transports approximately 30 percent of the crude oil\nproduced in North America; Gas Transmission and Midstream, which transports\napproximately 20 percent of the natural gas consumed in the U.S.; Gas\nDistribution and Storage, which serves approximately 3.9 million retail\ncustomers in Ontario and Quebec; and Renewable Power Generation, which owns\napproximately 1,766 MW (net) in renewable power generation capacity in\nNorth America and Europe. The Company's common shares trade on the Toronto\nand New York stock exchanges under the symbol ENB. For more information,\nvisit www.enbridge.com.\n\n     None of the information contained in, or connected to, Enbridge's\nwebsite is incorporated in or otherwise forms part of this news release.\n\n//st\n\n  FOR FURTHER INFORMATION PLEASE\n  CONTACT:\n\n  Enbridge Inc. - Media                  Enbridge Inc. - Investment\n                                         Community\n\n  Jesse Semko                            Jonathan Morgan\n\n  Toll Free: (888) 992-0997              Toll Free: (800) 481-2804\n\n  Email: [email protected]               Email: [email protected]\n\n//et\n\n     NON-GAAP RECONCILIATIONS APPENDICES\n\n     This news release contains references to EBITDA, adjusted EBITDA,\nadjusted earnings, adjusted earnings per common share and DCF. Management\nbelieves the presentation of these metrics gives useful information to\ninvestors and shareholders as they provide increased transparency and\ninsight into the performance of the Company.\n\n     EBITDA represents earnings before interest, tax, depreciation and\namortization.\n\n     Adjusted EBITDA represents EBITDA adjusted for unusual, infrequent or\nother non-operating factors on both a consolidated and segmented basis.\nManagement uses EBITDA and adjusted EBITDA to set targets and to assess the\nperformance of the Company and its business units.\n     Adjusted earnings represent earnings attributable to common\nshareholders adjusted for unusual, infrequent or other non-operating\nfactors included in adjusted EBITDA, as well as adjustments for unusual,\ninfrequent or other non-operating factors in respect of depreciation and\namortization expense, interest expense, income taxes and noncontrolling\ninterests on a consolidated basis. Management uses adjusted earnings as\nanother measure of the Company's ability to generate earnings.\n\n     DCF is defined as cash flow provided by operating activities before\nthe impact of changes in operating assets and liabilities (including\nchanges in environmental liabilities) less distributions to noncontrolling\ninterests, preference share dividends and maintenance capital expenditures,\nand further adjusted for unusual, infrequent or other non-operating\nfactors. Management also uses DCF to assess the performance of the Company\nand to set its dividend payout target.\n\n     This news release also contains references to Debt to EBITDA, a\nnon-GAAP ratio, which utilizes adjusted EBITDA as one of its components.\nDebt to EBITDA is used as a liquidity measure to indicate the amount of\nadjusted earnings to pay debt (as calculated on a GAAP basis) before\ncovering interest, tax, depreciation and amortization. Reconciliations of\nforward-looking non-GAAP financial measures and non-GAAP ratios to\ncomparable GAAP measures are not available due to the challenges and\nimpracticability of estimating certain items, particularly certain\ncontingent liabilities and non-cash unrealized derivative fair value losses\nand gains which are subject to market variability. Because of those\nchallenges, a reconciliation of forward-looking non-GAAP financial measures\nand non-GAAP ratios is not available without unreasonable effort.\n\n     Our non-GAAP financial measures and non-GAAP ratios described above\nare not measures that have standardized meaning prescribed by generally\naccepted accounting principles in the United States of America (U.S. GAAP)\nand are not U.S. GAAP measures. Therefore, these measures may not be\ncomparable with similar measures presented by other issuers.\n\n     The tables below provide a reconciliation of the non-GAAP measures to\ncomparable GAAP measures.\n\n     APPENDIX A NON-GAAP RECONCILIATIONS - ADJUSTED EBITDA AND ADJUSTED\nEARNINGS\n\n     CONSOLIDATED EARNINGS\n\n//st\n\n                          Three months ended        Year ended December 31,\n                          December 31,\n\n                          2021              2020    2021             2020\n\n  (unaudited; millions\n  of Canadian dollars)\n\n  Liquids Pipelines       2,141             2,403   7,897            7,683\n\n  Gas Transmission and    946               857     3,671            1,087\n  Midstream\n\n  Gas Distribution and    743               463     2,117            1,748\n  Storage\n\n  Renewable Power         146               147     508              523\n  Generation\n\n  Energy Services         66                (224)   (313)            (236)\n\n  Eliminations and        165               385     356              (113)\n  Other\n\n  EBITDA                  4,207             4,031   14,236           10,692\n\n  Depreciation and        (1,047)           (946)   (3,852)\n(3,712)\n  amortization\n\n  Interest expense        (732)             (685)   (2,655)\n(2,790)\n\n  Income tax expense      (463)             (501)   (1,415)          (774)\n\n  Earnings                (32)              (28)    (125)            (53)\n  attributable to\n  noncontrolling\n  interests\n\n  Preference share        (93)              (96)    (373)            (380)\n  dividends\n\n  Earnings                1,840             1,775   5,816            2,983\n  attributable to\n  common shareholders\n\n//et\n\n     ADJUSTED EBITDA TO ADJUSTED EARNINGS\n\n//st\n\n                          Three months ended        Year ended December 31,\n                          December 31,\n\n                          2021              2020    2021             2020\n\n  (unaudited; millions\n  of Canadian dollars,\n  except per share\n  amounts)\n\n  Liquids Pipelines       2,108             1,787   7,731            7,182\n\n  Gas Transmission and    922               878     3,850            3,895\n  Midstream\n\n  Gas Distribution and    450               492     1,853            1,822\n  Storage\n\n  Renewable Power         140               146     496              507\n  Generation\n\n  Energy Services         (83)              (82)    (360)            (119)\n\n  Eliminations and        150               (20)    431              (14)\n  Other\n\n  Adjusted EBITDA         3,687             3,201   14,001           13,273\n\n  Depreciation and        (1,047)           (946)   (3,852)\n(3,712)\n  amortization\n\n  Interest expense        (734)             (694)   (2,675)\n(2,793)\n\n  Income tax expense      (406)             (304)   (1,429)\n(1,437)\n  Earnings                (31)              (29)    (121)            (57)\n  attributable to\n  noncontrolling\n  interests\n\n  Preference share        (93)              (96)    (373)            (380)\n  dividends\n\n  Adjusted earnings       1,376             1,132   5,551            4,894\n\n  Adjusted earnings       0.68              0.56    2.74             2.42\n  per common share\n\n//et\n\n     EBITDA TO ADJUSTED EARNINGS\n\n//st\n\n                           Three months ended        Year ended December\n31,\n                           December 31,\n\n                           2021            2020      2021            2020\n\n  (unaudited; millions\n  of Canadian dollars,\n  except per share\n  amounts)\n\n  EBITDA                   4,207           4,031     14,236          10,692\n\n  Adjusting items:\n\n  Change in unrealized     (112)           (1,057)   (197)           (856)\n  derivative fair value\n  gain - Foreign\n  exchange\n\n  Change in unrealized     (155)           146       (53)            122\n  derivative fair value\n  (gain)/loss -\n  Commodity prices\n\n  Equity investment        --              --        111             2,351\n  impairment\n\n  Equity investment        --              --        --              324\n  asset and goodwill\n  impairment\n\n  Gain on sale of          (303)           --        (303)           --\n  Noverco\n\n  Texas Eastern            --              --        --              159\n  re-establishment of\n  EDIT regulated\n  liability\n\n  Employee severance,      41              34        147             339\n  transition and\n  transformation costs\n\n  Other                    9               47        60              142\n\n  Total adjusting items    (520)           (830)     (235)           2,581\n\n  Adjusted EBITDA          3,687           3,201     14,001          13,273\n\n  Depreciation and         (1,047)         (946)     (3,852)\n(3,712)\n  amortization\n\n  Interest expense         (732)           (685)     (2,655)\n(2,790)\n\n  Income tax expense       (463)           (501)     (1,415)         (774)\n\n  Earnings attributable    (32)            (28)      (125)           (53)\n  to noncontrolling\n  interests\n\n  Preference share         (93)            (96)      (373)           (380)\n  dividends\n\n  Adjusting items in\n  respect of:\n\n  Interest expense         (2)             (9)       (20)            (3)\n\n  Income tax expense       57              197       (14)            (663)\n\n  Earnings attributable    1               (1)       4               (4)\n  to noncontrolling\n  interests\n\n  Adjusted earnings        1,376           1,132     5,551           4,894\n\n  Adjusted earnings per    0.68            0.56      2.74            2.42\n  common share\n\n//et\n\n     APPENDIX BNON-GAAP RECONCILIATION - ADJUSTED EBITDA TO SEGMENTED\nEBITDA\n\n     LIQUIDS PIPELINES\n\n//st\n\n                         Three months ended         Year ended December 31,\n                         December 31,\n\n                         2021               2020    2021               2020\n\n  (unaudited;\n  millions of\n  Canadian dollars)\n\n  Adjusted EBITDA        2,108              1,787   7,731\n7,182\n\n  Change in              36                 635     120                545\n  unrealized\n  derivative fair\n  value gain\n\n  Property tax           --                 --      57                 --\n  settlement\n\n  Asset write-down       --                 (17)    --                 (30)\n  loss\n\n  Other                  (3)                (2)     (11)               (14)\n\n  Total adjustments      33                 616     166                501\n\n  EBITDA                 2,141              2,403   7,897\n7,683\n\n//et\n\n     GAS TRANSMISSION AND MIDSTREAM\n\n//st\n\n                            Three months ended      Year ended December 31,\n                            December 31,\n\n                            2021             2020   2021             2020\n\n  (unaudited; millions\n  of Canadian dollars)\n\n  Adjusted EBITDA           922              878    3,850            3,895\n\n  Equity investment         --               --     (111)\n(2,351)\n  impairment\n\n  Equity investment         --               --     --               (324)\n  asset and goodwill\n  impairment\n\n  Texas Eastern             --               --     --               (159)\n  re-establishment of\n  EDIT regulated\n  liability\n\n  Equity earnings           60               (4)    (44)             22\n  adjustment - DCP\n  Midstream, LLC\n\n  Other                     (36)             (17)   (24)             4\n\n  Total adjustments         24               (21)   (179)\n(2,808)\n\n  EBITDA                    946              857    3,671            1,087\n\n//et\n\n     GAS DISTRIBUTION AND STORAGE\n\n//st\n\n                           Three months ended        Year ended December\n31,\n                           December 31,\n\n                           2021               2020   2021              2020\n\n  (unaudited; millions\n  of Canadian dollars)\n\n  Adjusted EBITDA          450                492    1,853\n1,822\n\n  Change in unrealized     2                  (12)   14                (10)\n  derivative fair value\n  gain/(loss)\n\n  Gain on sale of          303                --     303               --\n  Noverco\n\n  Employee severance,      (11)               (16)   (49)              (51)\n  transition and\n  transformation costs\n\n  Other                    (1)                (1)    (4)               (13)\n\n  Total adjustments        293                (29)   264               (74)\n\n  EBITDA                   743                463    2,117\n1,748\n\n//et\n\n     RENEWABLE POWER GENERATION\n\n//st\n\n                          Three months ended         Year ended December\n31,\n                          December 31,\n                          2021                2020   2021\n2020\n\n  (unaudited; millions\n  of Canadian dollars)\n\n  Adjusted EBITDA         140                 146    496                507\n\n  Change in unrealized    2                   1      8                  3\n  derivative fair\n  value gain\n\n  Realized hedges         13                  --     13                 --\n\n  Equity earnings         (8)                 --     (8)                --\n  adjustment\n\n  Disposition - MATL      --                  --     --                 13\n  transmission assets\n\n  Other                   (1)                 --     (1)                --\n\n  Total adjustments       6                   1      12                 16\n\n  EBITDA                  146                 147    508                523\n\n//et\n\n     ENERGY SERVICES\n\n//st\n\n                         Three months ended         Year ended December 31,\n                         December 31,\n\n                         2021               2020    2021               2020\n\n  (unaudited;\n  millions of\n  Canadian dollars)\n\n  Adjusted EBITDA        (83)               (82)    (360)\n(119)\n\n  Change in              155                (146)   53\n(122)\n  unrealized\n  derivative fair\n  value gain/(loss)\n\n  Net inventory          (6)                4       (6)                5\n  adjustment\n\n  Total adjustments      149                (142)   47\n(117)\n\n  EBITDA                 66                 (224)   (313)\n(236)\n\n//et\n\n     ELIMINATIONS AND OTHER\n\n//st\n\n                           Three months ended        Year ended December\n31,\n                           December 31,\n\n                           2021               2020   2021              2020\n\n  (unaudited; millions\n  of Canadian dollars)\n\n  Adjusted EBITDA          150                (20)   431               (14)\n\n  Change in unrealized     72                 433    55                318\n  derivative fair value\n  gain\n\n  Change in corporate      --                 --     --                (74)\n  guarantee obligation\n\n  Investment write-down    --                 --     --                (43)\n  loss\n\n  Employee severance,      (27)               (17)   (87)\n(279)\n  transition and\n  transformation costs\n\n  Other                    (30)               (11)   (43)              (21)\n\n  Total adjustments        15                 405    (75)              (99)\n\n  EBITDA                   165                385    356\n(113)\n\n//et\n\n     APPENDIX CNON-GAAP RECONCILIATION - CASH PROVIDED BY OPERATING\nACTIVITIES TO DCF\n\n//st\n\n                           Three months ended        Year ended December\n31,\n                           December 31,\n\n                           2021              2020    2021              2020\n\n  (unaudited; millions\n  of Canadian dollars)\n\n  Cash provided by         2,302             2,254   9,256\n9,781\n  operating activities\n\n  Adjusted for changes     548               120     1,616             (93)\n  in operating assets\n  and liabilities1\n\n                           2,850             2,374   10,872\n9,688\n\n  Distributions to         (64)              (68)    (271)\n(300)\n  noncontrolling\n  interests\n\n  Preference share         (93)              (96)    (367)\n(380)\n  dividends\n\n  Maintenance capital      (274)             (320)   (686)\n(915)\n  expenditures2\n\n  Significant adjusting\n  items:\n\n  Other receipts of        53                42      127               292\n  cash not recognized\n  in revenue3\n\n  Employee severance,      39                31      147               335\n  transition and\n  transformation costs\n\n  Distributions from       121               263     418               675\n  equity investments in\n  excess of cumulative\n  earnings4\n\n  Other items              (145)             (17)    (199)             45\n\n  DCF                      2,487             2,209   10,041\n9,440\n\n  DCF per common share     1.23              1.09    4.96              4.67\n\n//et\n\n//st\n\n  1   Changes in operating assets and liabilities, net of recoveries.\n\n  2   Maintenance capital expenditures are expenditures that are required\n      for the ongoing support and maintenance of the existing pipeline\n      system or that are necessary to maintain the service capability of\n      the existing assets (including the replacement of components that are\n      worn, obsolete or completing their useful lives). For the purpose of\n      DCF, maintenance capital excludes expenditures that extend asset\n      useful lives, increase capacities from existing levels or reduce\n      costs to enhance revenues or provide enhancements to the service\n      capability of the existing assets.\n\n  3   Consists of cash received net of revenue recognized for contracts\n      under make-up rights and similar deferred revenue arrangements.\n\n  4   Presented net of adjusting items.\n\n//et\n\nTel   : 403-231-3900    ENBRIDGE INC CUM REDEEMABLE PR SHARES SERIES L\nFax   : 403-231-5929\nEmail : CorporateSecretary@enbridge.com\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204100021.MNPRE2204100361-04544220220211</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}