{"date": "2022-01-20 11:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">WASHINGTON, Jan 20 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The U.S. Senate Judiciary Committee is set to decide Thursday whether the full Senate should vote on two bills aimed at reining in tech giants like Alphabet's Google <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> and Meta's Facebook <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a>.</p><p>Lawmakers are expected to consider an amended version of a bill introduced by Senators Amy Klobuchar, a Democrat, and Chuck Grassley, a Republican, that would bar tech platforms like Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> from giving preference to their own businesses on their websites.</p><p>The amended version would expand the definition of the companies covered by the bill to include firms like the popular video app TikTok, according to sources familiar with the matter.</p><p>China's Tencent, which owns messaging app WeChat, would also be covered by the bill, according to one source.</p><p>Two sources familiar with the matter said it was unclear that the Klobuchar-Grassley measure had the votes needed to send the measure to the Senate floor for final passage. The sources asked not to be named because they were not authorized to speak about the matter on the record.</p><p>A second bill, led by U.S. Senators Richard Blumenthal and Marsha Blackburn, is also on the schedule. The Open App Markets Act would bar big app stores, like Apple, from requiring app providers to use their payment system and prohibit them from punishing apps that offer different prices through another app store or payment system.</p><p>This bill is on the schedule for the first time Thursday, which means that it is likely to be put off at least a week.</p><p>Both measures, and other bills aimed at Big Tech, have set off a firestorm of opposition from powerful business groups. The U.S. Chamber of Commerce's Chief Policy Officer Neil Bradley opposed the bill backed by Klobuchar and Grassley. \"The companies that are being targeted are the very ones that had the scale and innovation to help us through the pandemic, whether that was enabling millions to work remotely, (or getting) essentials delivered to our front door,\" he said.</p><p>The advocacy group Consumer Reports, said it would support the Klobuchar/Grassley bill to \"reset the power asymmetry between Big Tech, consumers and small businesses.\"</p><p>Both bills have a version introduced in the U.S. House of Representatives.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Diane Bartz; Editing by David Gregorio)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Diane.Bartz@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Diane.Bartz@thomsonreuters.com</a> ; 1 202 898 8313; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TECH-ANTITRUST/BILLS (PIX)</p></div>"}